{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yGOHbICOQwlJ20UjK8F2ChGJjvl.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 1089,
                "original_language": "en",
                "original_title": "Point Break",
                "overview": "In Los Angeles, a gang of bank robbers who call themselves The Ex-Presidents commit their crimes while wearing masks of Reagan, Carter, Nixon and Johnson. Believing that the members of the gang could be surfers, the F.B.I. sends young agent Johnny Utah to the beach undercover to mix with the surfers and gather information.",
                "popularity": 5.8234,
                "poster_path": "/tlbERIghrQ4oofqlbF7H0K0EYnx.jpg",
                "release_date": "1991-07-12",
                "title": "Point Break",
                "video": false,
                "vote_average": 7.159,
                "vote_count": 3762,
                "character": "Freight Train",
                "credit_id": "58d6d1de9251411f90045750",
                "order": 20
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/tupgjqhWx5oieQrdyesO3aclUX9.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 597,
                "original_language": "en",
                "original_title": "Titanic",
                "overview": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
                "popularity": 22.0265,
                "poster_path": "/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
                "release_date": "1997-11-18",
                "title": "Titanic",
                "video": false,
                "vote_average": 7.906,
                "vote_count": 26335,
                "credit_id": "652a07a5358da700e3bcec50",
                "department": "Crew",
                "job": "Stunts"
            },
            {
                "adult": false,
                "backdrop_path": "/1z4auHDSf2Kh6OqOVmwbeWc2Jrn.jpg",
                "genre_ids": [
                    12,
                    10751,
                    18,
                    35
                ],
                "id": 8326,
                "original_language": "en",
                "original_title": "Holes",
                "overview": "A wrongfully convicted boy is sent to a brutal desert detention camp where he must dig holes in order to build character. What he doesn't know is that he is digging holes in order to search for a lost treasure hidden somewhere in the camp.",
                "popularity": 3.9458,
                "poster_path": "/o2Dm2mcE1qW8vT0bpsJO5OMBbqa.jpg",
                "release_date": "2003-04-18",
                "title": "Holes",
                "video": false,
                "vote_average": 6.876,
                "vote_count": 1458,
                "credit_id": "642631f28de0ae00d5f20f16",
                "department": "Crew",
                "job": "Stunt Double"
            },
            {
                "adult": false,
                "backdrop_path": "/yGOHbICOQwlJ20UjK8F2ChGJjvl.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 1089,
                "original_language": "en",
                "original_title": "Point Break",
                "overview": "In Los Angeles, a gang of bank robbers who call themselves The Ex-Presidents commit their crimes while wearing masks of Reagan, Carter, Nixon and Johnson. Believing that the members of the gang could be surfers, the F.B.I. sends young agent Johnny Utah to the beach undercover to mix with the surfers and gather information.",
                "popularity": 5.8234,
                "poster_path": "/tlbERIghrQ4oofqlbF7H0K0EYnx.jpg",
                "release_date": "1991-07-12",
                "title": "Point Break",
                "video": false,
                "vote_average": 7.159,
                "vote_count": 3762,
                "credit_id": "648e77a8c2ff3d00c59a237e",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Julia Michaels",
            "جولی مایکلز"
        ],
        "biography": "Admittedly, the brand of the sultry, All-American bombshell has served Julie Michaels well in her acting career. Fans will agree that Julie's performance opposite Patrick Swayze in Road House (1989) was iconic and impossible to forget. Her incredibly graphic fight scene with Keanu Reeves in Kathryn Bigelow's Point Break (1991) inspired the New York Times to dub her \"The babe who nuked Keanu\". Undeniably, Julie is as beautiful as she is talented and tenacious, though the multi-nominee and Emmy Award winner broke well past the stigma of \"seductress\" to branch out into other positions in the entertainment industry, effortlessly traversing between acting, stunt coordinating and producing. While often wearing several hats at the same time.\n\nJulie Michaels killed \"Jason\" in Jason Goes to Hell: The Final Friday (1993), tangled with Dwayne Johnson in The Scorpion King (2002), and fought the \"Ultimate Fighter\" in John Herzfeld's 15 Minutes (2001). Roles which relied not only on her training as an actress but as a stunt woman. Additionally, she has been paired opposite Dean Cain, was frozen by \"The Governator\" (Arnold Schwarzenegger) in Batman & Robin (1997), and made several recent appearances on television shows such as How To Get Away With Murder, Jane The Virgin, Nashville, Southland, Seal Team, and on the soon to be released Chick Fight, opposite Malin Ackerman, also starring Alec Baldwin. Julie Michaels was awarded Best Actress for her role in the short film Last Writes on which she executive produced. She also co-executive produced After Forever, the acclaimed series which (in 2019) won several Daytime Emmy Awards. This \"Golden Girl\" seems to have the Midas touch and continues to break barriers in her own career as well as tear down walls for fellow women in the industry.\n\nIn 2016 Julie Michaels was nominated for a Prime-Time Emmy Award for Outstanding Stunt Coordination for a Comedy or Variety Show (the first woman ever to be nominated for that category) and earned herself an Action Icon Award in 2017. Additionally, between 2017-2019, Julie co-stunt coordinated the show Seal Team alongside her equally accomplished husband Peewee Piemonte, where the duo proudly sought and succeeded in hiring several hundreds of Veteran performers over their pilot and 44 episode run (the efforts of which garnered them an Emmy Nomination). The power couple has coordinated several top award-winning network shows together over the years (How To Get Away With Murder, Jane The Virgin, and Nashville to name a few fan favorites). Despite her dedication and commitment to creating action for television and film, Julie Michaels continues to find her way back in front of the camera. Exactly where loyal fans want her!\n\n- IMDb mini biography by: CatarACT, Inc.",
        "birthday": "1970-07-20",
        "deathday": null,
        "gender": 1,
        "homepage": "http://juliemichaels.com/",
        "id": 63942,
        "imdb_id": "nm0584395",
        "known_for_department": "Acting",
        "name": "Julie Michaels",
        "place_of_birth": "Northwest, Washington, USA",
        "popularity": 0.6389,
        "profile_path": "/hXYvvPhWbXNULOV2kge9EyH5OIC.jpg"
    }
}