{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFkUPqBuUnbhYbQL8VFpTrAT9za.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 686,
                "original_language": "en",
                "original_title": "Contact",
                "overview": "A radio astronomer receives the first extraterrestrial radio signal ever picked up on Earth. As the world powers scramble to decipher the message and decide upon a course of action, she must make some difficult decisions between her beliefs, the truth, and reality.",
                "popularity": 6.2788,
                "poster_path": "/bCpMIywuNZeWt3i5UMLEIc0VSwM.jpg",
                "release_date": "1997-07-11",
                "title": "Contact",
                "video": false,
                "vote_average": 7.435,
                "vote_count": 4708,
                "character": "Woman Senator",
                "credit_id": "5908ca8a925141646c0109b6",
                "order": 77
            },
            {
                "adult": false,
                "backdrop_path": "/sGEqHTylawwS6hwKultk1mKUjdB.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 114,
                "original_language": "en",
                "original_title": "Pretty Woman",
                "overview": "While on a business trip in Los Angeles, Edward Lewis, a millionaire entrepreneur who makes a living buying and breaking up companies, picks up a prostitute, Vivian, while asking for directions; after, Edward hires Vivian to stay with him for the weekend to accompany him to a few social events, and the two get closer only to discover there are significant hurdles to overcome as they try to bridge the gap between their very different worlds.",
                "popularity": 8.828,
                "poster_path": "/hVHUfT801LQATGd26VPzhorIYza.jpg",
                "release_date": "1990-03-23",
                "title": "Pretty Woman",
                "video": false,
                "vote_average": 7.46,
                "vote_count": 8618,
                "character": "Woman in Lobby",
                "credit_id": "5e4081b73dd1260018544104",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nValorie Armstrong (also credited as Valerie Armstrong) is an American actress most notably recognized from her role as Perkins family matriarch, Marisa Perkins on NBC's soap opera Santa Barbara during 1984-1985. Her other roles include various guest-starring roles on TV shows. Prior to her role as Marisa Perkins, she had a featured role as Alice McRaven, the best friend of Sandy Duncan's character, Sandy Stockton on Funny Face, in the 1970s. In 1990, the two worked together again when Ms. Armstrong had a guest role as Mrs. Gordon, in an episode of Miss Duncan's later series, The Hogan Family.\n\nDescription above from the Wikipedia article Valorie Armstrong, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1941-10-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 64033,
        "imdb_id": "nm0035930",
        "known_for_department": "Acting",
        "name": "Valorie Armstrong",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.1769,
        "profile_path": "/pJVLvI3jcerCHIx9QDsSEqIlR2p.jpg"
    }
}