{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8r9RoGfwGmn1pn0G3sbvHHemSWF.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36
                ],
                "id": 277216,
                "original_language": "en",
                "original_title": "Straight Outta Compton",
                "overview": "In 1987, five young men, using brutally honest rhymes and hardcore beats, put their frustration and anger about life in the most dangerous place in America into the most powerful weapon they had: their music.  Taking us back to where it all began, Straight Outta Compton tells the true story of how these cultural rebels—armed only with their lyrics, swagger, bravado and raw talent—stood up to the authorities that meant to keep them down and formed the world’s most dangerous group, N.W.A.  And as they spoke the truth that no one had before and exposed life in the hood, their voice ignited a social revolution that is still reverberating today.",
                "popularity": 5.6597,
                "poster_path": "/1CiLJx8Xtv3TbbFj6k7BboSmKgC.jpg",
                "release_date": "2015-08-11",
                "title": "Straight Outta Compton",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 4041,
                "character": "Capitol Records Executive",
                "credit_id": "543193d9c3a368117b00243d",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dean Eikleberry "
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nDean Cameron (born Dean Eikleberry on December 25, 1962, in Morrison, Illinois) is an American television and film actor. He is best known for his role as Francis \"Chainsaw\" Gremp in the 1987 Mark Harmon comedy Summer School.\n\nDean has starred in some short-lived television series like Spencer (1984), Fast Times (1986, a spinoff of the 1982 film Fast Times at Ridgemont High), They Came from Outer Space (1990), and Mister Sterling (2003).\n\nHe has made guest appearances on many TV series, including The Facts of Life, ALF, My Sister Sam, Will &amp; Grace, ER, and Felicity.\n\nPlayed Dave Marshak in Ski School and Ski School II.\n\nMarried to Jessie Marion, granddaughter of Elena Verdugo and lives in Los Angeles. Their son, Duncan, was born August 1, 2009. He plays bass guitar in a band called \"The Thornbirds\" and a karaoke band poking fun at Corey Haim, Corey Feldman and Corey Hart called Coreyoke.\n\nTours with a two-person show entitled The Nigerian Spam Scam Scam, in which he and actor Victor Isaac read from Cameron's 11 month correspondence with a Nigerian 419 Scammer. The show was performed at the Edinburgh Fringe Comedy Festival in 2004 and 2005, the Just For Laughs festival and the Upright Citizens Brigade theater in 2006 and ran in Los Angeles from September 2004 to December 2004.\n\nCo-wrote the 2001 feature film, Hollywood Palms, wrote and directed a short film, Glutton Falls and directed/choreographed \"Bukowsical\", a sell-out late night musical theater parody at the Sacred Fools Theater in Los Angeles, California. Cameron also directed the video \"Fat Girl\" for heavy metal band Steel Panther as well as co-wrote the song \"Girl From Oklahoma\" on their 2009 debut Feel the Steel.\n\nSince late 1999, has made a living as voice over talent for radio and television commercials.\n\nIn 2006, he originated the role of Carl in Love Tapes, a play based on video tapes sent by a fan to guitarist Steve Vai. Love Tapes was written by Steven Banks and Penn Jillette and directed by Cameron's wife, Jessie Marion.",
        "birthday": "1962-12-25",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.deancameron.com/",
        "id": 64057,
        "imdb_id": "nm0131541",
        "known_for_department": "Acting",
        "name": "Dean Cameron",
        "place_of_birth": "Morrison - Illinois - USA",
        "popularity": 0.3417,
        "profile_path": "/l5KJNacxI4qOHZwtUev9mRInmXb.jpg"
    }
}