{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1YlaU9vXlD4K5EBGZKjaCb9rJb9.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1955,
                "original_language": "en",
                "original_title": "The Elephant Man",
                "overview": "A Victorian surgeon rescues a heavily disfigured man being mistreated by his \"owner\" as a side-show freak. Behind his monstrous façade, there is revealed a person of great intelligence and sensitivity. Based on the true story of Joseph Merrick (called John Merrick in the film), a severely deformed man in 19th century London.",
                "popularity": 5.8543,
                "poster_path": "/u0wpPYjuSt8DIe1Y3Vapnh8jcKE.jpg",
                "release_date": "1980-10-09",
                "title": "The Elephant Man",
                "video": false,
                "vote_average": 8.049,
                "vote_count": 3723,
                "character": "Princess Alex",
                "credit_id": "52fe4326c3a36847f803dfbb",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Helen Ryan (born June 16, 1938, in Liverpool, Lancashire) is a British actress, who is notable for playing several royal roles.\n\nThe Liverpool native played Princess and then Queen Alexandra in the British television series Edward the Seventh, for which she received a BAFTA nomination in 1975. She also played Princess Alexandra in the 1980 movie The Elephant Man and the Sherlock Holmes story \"The Mazarin Stone\". She played another royal, Queen Wilhelmina of the Netherlands, in the 2002 television drama Bertie and Elizabeth. Her other credits include Madame Balzac in the TV series Prometheus: The Life of Balzac (1975), Mrs. McFarlane in the Sherlock Holmes story \"The Norwood Builder\", and films such as Clash of Loyalties (1983), Misunderstood (1984) and The Hawk (1993). More recently, Ryan has appeared as Peggy Roath, a personal aide to Queen Elizabeth II, in the fifth season of The Crown in 2022. In 2023, she appeared in the BBC soap opera Doctors as Thelma Scott.\n\nShe was formerly married to the theatre director Guy Slater, with whom she had a daughter, Rebecca, and a son, Daniel.",
        "birthday": "1938-06-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 643171,
        "imdb_id": "nm0752571",
        "known_for_department": "Acting",
        "name": "Helen Ryan",
        "place_of_birth": "Liverpool, England, UK",
        "popularity": 0.1298,
        "profile_path": "/ad2e0mxVGaCfiIITqMcejtRlzwe.jpg"
    }
}