{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f2Gdaux9j6FF39oNj0Cpfooje4m.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9388,
                "original_language": "en",
                "original_title": "Thank You for Smoking",
                "overview": "Nick Naylor is a charismatic spin-doctor for Big Tobacco who'll fight to protect America's right to smoke -- even if it kills him -- while still remaining a role model for his 12-year old son. When he incurs the wrath of a senator bent on snuffing out cigarettes, Nick's powers of \"filtering the truth\" will be put to the test.",
                "popularity": 3.2289,
                "poster_path": "/cJpeM7U36diFinieBWNLVi0FlQz.jpg",
                "release_date": "2005-09-09",
                "title": "Thank You for Smoking",
                "video": false,
                "vote_average": 7.19,
                "vote_count": 2275,
                "character": "Brad",
                "credit_id": "5671a30c92514143ad006888",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nDaniel Travis (born March 10, 1968) is an American actor.\n\nTravis was born and raised in Clarkston, Michigan. He received a BFA in theater from Miami University in Oxford, Ohio. He went on to receive an MFA at The Mason Gross School of the Arts at Rutgers University. His early work was on the stage, playing John Buchanan in Summer and Smoke, The Earl of Richmond in Richard III and Paul in Barefoot in the Park.\n\nIn 2001, Travis made his small-screen debut with guest appearances on the short-lived television show The Education of Max Bickford, starring Richard Dreyfuss. Without ever having appeared in a film, Travis made his big-screen debut in a starring role in Open Water (2004), about a couple who goes scuba diving and is left behind in the ocean by accident while on an organized dive.\n\nMost recently, Travis starred in the Subaru television commercial, Ricky.\n\nDescription above from the Wikipedia article Daniel Travis, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1968-03-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 646,
        "imdb_id": "nm1047403",
        "known_for_department": "Acting",
        "name": "Daniel Travis",
        "place_of_birth": "Clarkston, Michigan, USA",
        "popularity": 0.1452,
        "profile_path": "/9JJ2jFBpdp8e4BdFozaqPw5sYnH.jpg"
    }
}