{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cHIntxWWk3yZi3jM0HnLchBvwvT.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 475,
                "original_language": "en",
                "original_title": "Bonnie and Clyde",
                "overview": "In the 1930s, bored waitress Bonnie Parker falls in love with an ex-con named Clyde Barrow and together they start a violent crime spree through the country, stealing cars and robbing banks.",
                "popularity": 4.5695,
                "poster_path": "/sCSQFK9kMsprT4jgWqgw82dT6WI.jpg",
                "release_date": "1967-08-13",
                "title": "Bonnie and Clyde",
                "video": false,
                "vote_average": 7.486,
                "vote_count": 1700,
                "character": "Frank Hamer",
                "credit_id": "52fe4248c3a36847f8012045",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/h1vBJ0uN4QCbBb5WVKxmtfTrHoY.jpg",
                "genre_ids": [
                    37
                ],
                "id": 11697,
                "original_language": "en",
                "original_title": "The Man Who Shot Liberty Valance",
                "overview": "Questions arise when Senator Stoddard attends the funeral of a local man named Tom Doniphon in a small Western town. Flashing back, we learn Doniphon saved Stoddard, then a lawyer, when he was roughed up by a crew of outlaws terrorizing the town, led by Liberty Valance. As the territory's safety hung in the balance, Doniphon and Stoddard, two of the only people standing up to him, proved to be very important, but different, foes to Valance.",
                "popularity": 2.5324,
                "poster_path": "/4C1R0LEivLjbv3swAzJfzh0tzXl.jpg",
                "release_date": "1962-04-13",
                "title": "The Man Who Shot Liberty Valance",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 1216,
                "character": "Amos Carruthers",
                "credit_id": "52fe447b9251416c75036543",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/ctzKCslTsMRsOJNvAm1Mw8ytiHY.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    18,
                    37
                ],
                "id": 9359,
                "original_language": "en",
                "original_title": "Maverick",
                "overview": "Bret Maverick is a gambler who would rather con someone than fight them, and needs an additional $3k in order to enter a winner-takes-all poker game beginning in a few days. He joins forces with a woman with a marvelous Southern accent, and the two try and enter the game.",
                "popularity": 5.0672,
                "poster_path": "/mTVbGGi5PIexmxVzeyFd2RYKwfM.jpg",
                "release_date": "1994-05-20",
                "title": "Maverick",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1661,
                "character": "Old Gambler on Riverboat",
                "credit_id": "52fe44edc3a36847f80b243b",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Denver Dell Pyle",
            "دِنور پایل"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nDenver Dell Pyle (May 11, 1920 – December 25, 1997) was an American film and television actor. He was known for portraying Briscoe Darling Jr. in several episodes of The Andy Griffith Show, and playing Jesse Duke in The Dukes of Hazzard from 1979-85.\n\nPyle was born in Bethune, Colorado on May 11, 1920 to farmer Ben H. Pyle and his wife Maude; His brother, Willis, was an animator known for his work with Walt Disney Animation Studios and UPA. After graduating from high school, Pyle briefly attended Colorado State University, but dropped out to enter show business, moving to Los Angeles in 1940. He worked as a drummer and band member until the United States entered World War II, when he enlisted in the U.S. Navy. Pyle was wounded in action in the Battle of Guadalcanal and received a medical discharge in 1942. Near the end of the war, he served in the United States Merchant Marine.\n\nIn 1955, Pyle married Marilee Carpenter, a production assistant at 20th Century Fox. They had sons David and Tony. Marilee and Denver divorced in 1970. In 1983, Pyle married Tippie Johnston. That union lasted until his death.\n\nPyle died of lung cancer on Christmas 1997. Memorial services were held January 6, 1998, at First Baptist Church in Waxahachie, Texas. He is buried in an unmarked grave at the Forreston Cemetery in Forreston, Texas. His remains are interred beside those of his second wife's parents, J.T. Johnston and Erin Birch Johnston.  CLR",
        "birthday": "1920-05-11",
        "deathday": "1997-12-25",
        "gender": 2,
        "homepage": null,
        "id": 6462,
        "imdb_id": "nm0701500",
        "known_for_department": "Acting",
        "name": "Denver Pyle",
        "place_of_birth": "Bethune, Colorado, USA",
        "popularity": 1.0021,
        "profile_path": "/eYRwwhl3pWu3oNn1GKerUauooSV.jpg"
    }
}