{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vKp3NvqBkcjHkCHSGi6EbcP7g4J.jpg",
                "genre_ids": [
                    12,
                    35,
                    878
                ],
                "id": 196,
                "original_language": "en",
                "original_title": "Back to the Future Part III",
                "overview": "The final installment finds Marty digging the trusty DeLorean out of a mineshaft and looking for Doc in the Wild West of 1885. But when their time machine breaks down, the travelers are stranded in a land of spurs. More problems arise when Doc falls for pretty schoolteacher Clara Clayton, and Marty tangles with Buford Tannen.",
                "popularity": 6.4784,
                "poster_path": "/crzoVQnMzIrRfHtQw0tLBirNfVg.jpg",
                "release_date": "1990-05-25",
                "title": "Back to the Future Part III",
                "video": false,
                "vote_average": 7.488,
                "vote_count": 11045,
                "character": "Saloon Old Timer",
                "credit_id": "52fe4225c3a36847f8007965",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/cHIntxWWk3yZi3jM0HnLchBvwvT.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 475,
                "original_language": "en",
                "original_title": "Bonnie and Clyde",
                "overview": "In the 1930s, bored waitress Bonnie Parker falls in love with an ex-con named Clyde Barrow and together they start a violent crime spree through the country, stealing cars and robbing banks.",
                "popularity": 4.9124,
                "poster_path": "/sCSQFK9kMsprT4jgWqgw82dT6WI.jpg",
                "release_date": "1967-08-13",
                "title": "Bonnie and Clyde",
                "video": false,
                "vote_average": 7.486,
                "vote_count": 1700,
                "character": "Ivan Moss",
                "credit_id": "52fe4248c3a36847f8012049",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/cSHie9qJvujqN4tYq6gx88WDf7o.jpg",
                "genre_ids": [
                    37
                ],
                "id": 576,
                "original_language": "en",
                "original_title": "The Wild Bunch",
                "overview": "An aging group of outlaws look for one last big score as the \"traditional\" American West is disappearing around them.",
                "popularity": 4.049,
                "poster_path": "/8j9yEC3xjy1PJDSizIbaxcHaSph.jpg",
                "release_date": "1969-06-19",
                "title": "The Wild Bunch",
                "video": false,
                "vote_average": 7.611,
                "vote_count": 1265,
                "character": "Reverend Wainscoat",
                "credit_id": "52fe4255c3a36847f8015f01",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Reporter (uncredited)",
                "credit_id": "52fe4384c3a36847f805a047",
                "order": 53
            },
            {
                "adult": false,
                "backdrop_path": "/reqscfk2KrWSDPKLMY303nwNgTw.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 5916,
                "original_language": "en",
                "original_title": "The Getaway",
                "overview": "A recently released ex-convict and his loyal wife go on the run after a heist goes wrong.",
                "popularity": 4.584,
                "poster_path": "/8SvnGUJsr16zUJ2CN7ONX1ZWtZ8.jpg",
                "release_date": "1972-12-13",
                "title": "The Getaway",
                "video": false,
                "vote_average": 7.12,
                "vote_count": 606,
                "character": "Laughlin",
                "credit_id": "52fe442dc3a36847f8086d2b",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/ctzKCslTsMRsOJNvAm1Mw8ytiHY.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    18,
                    37
                ],
                "id": 9359,
                "original_language": "en",
                "original_title": "Maverick",
                "overview": "Bret Maverick is a gambler who would rather con someone than fight them, and needs an additional $3k in order to enter a winner-takes-all poker game beginning in a few days. He joins forces with a woman with a marvelous Southern accent, and the two try and enter the game.",
                "popularity": 5.0862,
                "poster_path": "/mTVbGGi5PIexmxVzeyFd2RYKwfM.jpg",
                "release_date": "1994-05-20",
                "title": "Maverick",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1661,
                "character": "Room Clerk",
                "credit_id": "52fe44edc3a36847f80b2427",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cannonball Taylor",
            "Dubb Taylor",
            "Walter Clarence \"Dub\" Taylor Jr.",
            "Walter Clarence Taylor Jr."
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nWalter Clarence Taylor Jr. (February 26, 1907 – October 3, 1994), known as Dub Taylor, was an American character actor who from the 1940s into the 1990s worked extensively in films and on television, often in Westerns but also in comedies. He was the father of actor Buck Taylor, who played the character Newly O'Brien on Gunsmoke.\n\nWalter C. Taylor Jr. was born in 1907 in Richmond, Virginia, the middle child of five children of Minnie and Walter C. Taylor, Sr. According to the federal census of 1920, young Walter had two older sisters, Minnie Marg[aret] and Maud, a younger brother named George, and a little sister, Edna Fay. The family moved to Augusta, Georgia around 1912 when Walter was five years old, and the Taylors lived in this city until he was 13. The census of 1920 also documents that Dub's mother was a native of Pennsylvania and his father was a native of North Carolina, who worked in Augusta at that time as a \"Cotton Broker\". While living in Georgia as a boy, Walter, Jr., got his lifelong nickname when his friends began calling him \"W\" (double-u) and then shortened his nickname even farther, to just \"Dub\". It was in Georgia, too, where Taylor befriended Ty Cobb, Jr., the son of the legendary professional baseball player.\n\nA vaudeville performer, Dub Taylor was a member of the 1937 Alabama Crimson Tide football team that played in the 1938 Rose Bowl. He stayed behind to establish a career in films, making his film debut in 1938 as the cheerful ex-football captain Ed Carmichael in Frank Capra's You Can't Take It with You. Taylor secured the part because the role required an actor who could also play the xylophone. Later, during the 1950s and early 1960s, he demonstrated his considerable talent for playing the xylophone on several television shows, including an episode on the syndicated series Ranch Party hosted by Tex Ritter.\n\nIn 1939, he appeared in the film Taming of the West, in which he originated the character of Cannonball, a role he continued to play for the next ten years, in over 50 films. Cannonball was a comic sidekick to Wild Bill Saunders (played by Bill Elliott), a pairing that continued through 13 features, during which Elliott’s character became Wild Bill Hickok.\n\nDespite his extensive career as a character actor in a wide range of roles, Dub Taylor continued to find his niche in Westerns, a genre in which he performed in literally dozens of more films and in episodes of many television series. Taylor often appeared in the guise of talkative hotel or postal clerks, court bailiffs, cooks, or dissolute doctors. He portrayed, for example, an ill-tempered chuckwagon cook in the 1969 film The Undefeated, starring John Wayne and Rock Hudson. He appeared as well in the 1971 movie Support Your Local Gunfighter as the drunken Doc Shultz.  Taylor played Houston Lamb over the course of four episodes of Little House On The Prairie in seasons six and seven (1979 to 1981).  Taylor made at least two film cameos in the early 1990s. In Back to the Future Part III, he appeared with veteran Western actors Pat Buttram and Harry Carey Jr.. His last appearance was in the film Maverick as a hotel room clerk.\n\nDub Taylor died of a heart attack on October 3, 1994 in Los Angeles.  In addition to being father to Buck Taylor, Dub had a daughter, Faydean Taylor Tharp.  CLR",
        "birthday": "1907-02-26",
        "deathday": "1994-10-03",
        "gender": 2,
        "homepage": null,
        "id": 6463,
        "imdb_id": "nm0852305",
        "known_for_department": "Acting",
        "name": "Dub Taylor",
        "place_of_birth": "Richmond, Virginia, USA",
        "popularity": 0.7875,
        "profile_path": "/a7eVCCqOeWPqJpBXoKse1vZj2sc.jpg"
    }
}