{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zf52xLEyao2xcVnpThmzW2Xl0aj.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 476,
                "original_language": "en",
                "original_title": "Drugstore Cowboy",
                "overview": "Portland, Oregon, 1971. Bob Hughes is the charismatic leader of a peculiar quartet, formed by his wife, Dianne, and another couple, Rick and Nadine, who skillfully steal from drugstores and hospital medicine cabinets in order to appease their insatiable need for drugs. But neither fun nor luck last forever.",
                "popularity": 2.8297,
                "poster_path": "/2bQXK39axyedUL6DE1pzdMYgAw1.jpg",
                "release_date": "1989-10-20",
                "title": "Drugstore Cowboy",
                "video": false,
                "vote_average": 7.098,
                "vote_count": 584,
                "character": "Tom the Priest",
                "credit_id": "58e27f0a92514127f000fb22",
                "order": 8
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/mBteXONDhdVyXRNxj54eMNGNqyT.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 2742,
                "original_language": "en",
                "original_title": "Naked Lunch",
                "overview": "Blank-faced bug killer Bill Lee and his dead-eyed wife, Joan, like to get high on Bill's pest poisons while lounging with Beat poet pals. After meeting the devilish Dr. Benway, Bill gets a drug made from a centipede. Upon indulging, he accidentally kills Joan, takes orders from his typewriter-turned-cockroach, ends up in a constantly mutating Mediterranean city and learns that his hip friends have published his work -- which he doesn't remember writing.",
                "popularity": 2.0239,
                "poster_path": "/u01kh5jKUWjhom76mguRqUgdvja.jpg",
                "release_date": "1991-12-27",
                "title": "Naked Lunch",
                "video": false,
                "vote_average": 7.006,
                "vote_count": 1143,
                "credit_id": "52fe4369c3a36847f805241b",
                "department": "Writing",
                "job": "Novel"
            },
            {
                "adult": false,
                "backdrop_path": "/oLsts7ct0NVkdYpx5rZg10MG6zh.jpg",
                "genre_ids": [
                    18
                ],
                "id": 489,
                "original_language": "en",
                "original_title": "Good Will Hunting",
                "overview": "Headstrong yet aimless, Will Hunting has a genius-level IQ but chooses to work as a janitor at MIT. When he secretly solves highly difficult graduate-level math problems, his talents are discovered by Professor Gerald Lambeau, who decides to help the misguided youth reach his potential. When Will is arrested for attacking a police officer, Professor Lambeau makes a deal to get leniency for him if he gets court-ordered therapy. Eventually, therapist Dr. Sean Maguire helps Will confront the demons that are holding him back.",
                "popularity": 12.7558,
                "poster_path": "/z2FnLKpFi1HPO7BEJxdkv6hpJSU.jpg",
                "release_date": "1997-12-05",
                "title": "Good Will Hunting",
                "video": false,
                "vote_average": 8.157,
                "vote_count": 13107,
                "credit_id": "677fa18e3881c79419bb3b12",
                "department": "Crew",
                "job": "In Memory Of"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "William Seward Burroughs II (February 5, 1914 – August 2, 1997) was an American writer and visual artist, widely considered a primary figure of the Beat Generation and a major postmodern author who influenced popular culture and literature. Burroughs wrote eighteen novels and novellas, six collections of short stories and four collections of essays, and five books have been published of his interviews and correspondences; he was initially briefly known by the pen name William Lee. He also collaborated on projects and recordings with numerous performers and musicians, made many appearances in films, and created and exhibited thousands of visual artworks, including his celebrated \"Shotgun Art\".\n\nDescription above from the Wikipedia article William S. Burroughs, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1914-02-05",
        "deathday": "1997-08-02",
        "gender": 2,
        "homepage": null,
        "id": 6471,
        "imdb_id": "nm0123221",
        "known_for_department": "Writing",
        "name": "William S. Burroughs",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.089,
        "profile_path": "/wLNshQmdpMMVcSY1tKglZgfLNrQ.jpg"
    }
}