{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zzzoRNVSaUv6e1hpADjUDeM3EvY.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 13475,
                "original_language": "en",
                "original_title": "Star Trek",
                "overview": "The fate of the galaxy rests in the hands of bitter rivals. One, James Kirk, is a delinquent, thrill-seeking Iowa farm boy. The other, Spock, a Vulcan, was raised in a logic-based society that rejects all emotion. As fiery instinct clashes with calm reason, their unlikely but powerful partnership is the only thing capable of leading their crew through unimaginable danger, boldly going where no one has gone before. The human adventure has begun again.",
                "popularity": 9.3534,
                "poster_path": "/lV5OpzAss1z06YNagOVap1I35mH.jpg",
                "release_date": "2009-05-06",
                "title": "Star Trek",
                "video": false,
                "vote_average": 7.426,
                "vote_count": 10141,
                "character": "Med Evac Pilot",
                "credit_id": "52fe456d9251416c75056237",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/azGxfdKvIhJeSusazngZlbQziIa.jpg",
                "genre_ids": [
                    878,
                    28,
                    16,
                    14
                ],
                "id": 487242,
                "original_language": "en",
                "original_title": "Suicide Squad: Hell to Pay",
                "overview": "It’s batter up at Belle Reve and that can only mean that Amanda Waller, the penitentiary’s cold and calculating warden, has a mission that only the damned will take on. It’s time to unleash Task Force X again, stacked with seasoned vets such as Deadshot, Captain Boomerang and Harley Quinn, these crafty criminals are joined by newcomers Copperhead, Killer Frost and the martial art master, Bronze Tiger! With the target objective being a mystical object so powerful that they’re willing to risk their own lives to steal it, you can be sure it will be collision of chaos, gunfire and attitudes. So, take aim for a raging road trip with the Suicide Squad!",
                "popularity": 4.1196,
                "poster_path": "/va1IgsZeWBbKLsZcFwz3CM1MkMu.jpg",
                "release_date": "2018-03-23",
                "title": "Suicide Squad: Hell to Pay",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 687,
                "character": "Ben Turner / Bronze Tiger (voice)",
                "credit_id": "60fbdb880dea6e0075f6b476",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bill Brown",
            "比利·布朗"
        ],
        "biography": "Brown was born and raised in Inglewood, California. He is known for his role as detective Mike Anderson on Showtime's Dexter from 2011 to 2012. Previously he starred as boxer Richard \"Death Row\" Reynolds in the short-lived FX series Lights Out. In 2012 he landed the recurring role of August Marks in the fifth season of Sons of Anarchy. He also provides the second voice of Cliffjumper in the animated series Transformers: Prime. In 2013, he portrayed Agent Troy Riley in the first season of The Following.\n\nBrown starred opposite Toni Collette in the CBS drama series Hostages from 2013-14. In 2014, he was cast opposite Viola Davis in ABC drama How to Get Away with Murder, produced by Shonda Rhimes.",
        "birthday": "1970-10-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 64805,
        "imdb_id": "nm0113117",
        "known_for_department": "Acting",
        "name": "Billy Brown",
        "place_of_birth": "Inglewood, California, USA",
        "popularity": 1.1352,
        "profile_path": "/i6xWRaGKMRQeM5GvWYnwlojddo8.jpg"
    }
}