{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/klH8ti8LUaEhktnjdHb1RW8Yq6w.jpg",
                "genre_ids": [
                    35
                ],
                "id": 5825,
                "original_language": "en",
                "original_title": "National Lampoon's Christmas Vacation",
                "overview": "It's Christmastime, and the Griswolds are preparing for a family seasonal celebration. But things never run smoothly for Clark, his wife Ellen, and their two kids. Clark's continual bad luck is worsened by his obnoxious family guests, but he manages to keep going, knowing that his Christmas bonus is due soon.",
                "popularity": 4.8276,
                "poster_path": "/oat42hUw8XzKYUmfy0YLAxYd484.jpg",
                "release_date": "1989-11-30",
                "title": "National Lampoon's Christmas Vacation",
                "video": false,
                "vote_average": 7.232,
                "vote_count": 2527,
                "character": "Helen Shirley",
                "credit_id": "52fe4424c3a36847f8084b45",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/gBw3sXDSCqTYi3ppBGtabXziTBS.jpg",
                "genre_ids": [
                    10751,
                    35,
                    10770,
                    14
                ],
                "id": 178682,
                "original_language": "en",
                "original_title": "The Wizards Return: Alex vs. Alex",
                "overview": "While trying to prove to her family she can be mature and responsible, teen wizard Alex Russo conjures up a spell to rid herself of her bad qualities, unintentionally creating a Good and Evil Alex. When Evil Alex gets involved in a plan to take over the world by a dark wizard, Good Alex must find a way to save her family, humankind, and ultimately herself in an epic Good vs. Evil battle.",
                "popularity": 7.7068,
                "poster_path": "/iWL88DymJrzO6hYI1ykUeUohqef.jpg",
                "release_date": "2013-06-01",
                "title": "The Wizards Return: Alex vs. Alex",
                "video": false,
                "vote_average": 7.598,
                "vote_count": 946,
                "character": "Carmela",
                "credit_id": "64fca491efea7a0137d0a49e",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/9xjUZjuYyehv2qnqMH0oR9nSTft.jpg",
                "genre_ids": [
                    80,
                    28,
                    18,
                    53
                ],
                "id": 9702,
                "original_language": "en",
                "original_title": "Bound by Honor",
                "overview": "Based on the true life experiences of poet Jimmy Santiago Baca, the film focuses on half-brothers Paco and Cruz, and their bi-racial cousin Miklo. It opens in 1972, as the three are members of an East L.A. gang known as the \"Vatos Locos\", and the story focuses on how a violent crime and the influence of narcotics alter their lives. Miklo is incarcerated and sent to San Quentin, where he makes a \"home\" for himself. Cruz becomes an exceptional artist, but a heroin addiction overcomes him with tragic results. Paco becomes a cop and an enemy to his \"carnal\", Miklo.",
                "popularity": 8.813,
                "poster_path": "/gvP6R6juhe2IpCG7QGDgjyUvm0g.jpg",
                "release_date": "1993-02-05",
                "title": "Bound by Honor",
                "video": false,
                "vote_average": 8.132,
                "vote_count": 1450,
                "character": "Janis",
                "credit_id": "65f639775907de017ce5ac61",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Natalia Nogulich"
        ],
        "biography": "Natalija Nogulich, born October 1, 1950, in Chicago, Illinois, is an American actress and author renowned for her extensive work in film, television, and theater. She began her acting career in Chicago, performing with the St. Nicholas Theatre Company founded by notable figures including David Mamet and William H. Macy. Nogulich expanded her education and training in acting across Illinois, Spain, Italy, New York, and Los Angeles, studying with acclaimed teachers such as Stella Adler and Michael Moriarty.\n\nNogulich is best known for her role as Admiral Alynna Nechayev in \"Star Trek: The Next Generation\" and \"Star Trek: Deep Space Nine.\" Her television career includes notable recurring roles and guest appearances on series such as \"The West Wing,\" \"The Practice,\" \"Days of Our Lives,\" \"Criminal Minds,\" \"NCIS,\" and many others. She also starred in the ABC series \"Red Widow\" and NBC’s \"Brooklyn Bridge.\"\n\nHer film résumé includes roles in \"Hoffa,\" \"The Guardian,\" \"National Lampoon's Christmas Vacation,\" \"Blood In Blood Out,\" \"Spartan,\" \"Postcards from the Edge,\" and the independent films \"I'll Melt With You\" and \"Commentary,\" both featured at the Sundance Film Festival. Nogulich has a strong theatre background with Broadway credits in productions like \"Hurlyburly,\" \"The Iceman Cometh,\" and \"Accomplice,\" as well as numerous regional and off-Broadway performances. Additionally, she has directed plays and taught acting and film students at several colleges.\n\nNatalija Nogulich is also an author, having published the historical novel \"One Woman’s War,\" which is being developed into a screenplay. She remains active in the entertainment industry as an actress, writer, and educator",
        "birthday": "1950-10-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.natalijanogulich.com/",
        "id": 65017,
        "imdb_id": "nm0634101",
        "known_for_department": "Acting",
        "name": "Natalija Nogulich",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.3391,
        "profile_path": "/axKrCucnVBd3Jdgrmse0GNlbaeC.jpg"
    }
}