{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uEoaOfvWibpvjBNxFoj4MxWn0OH.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10377,
                "original_language": "en",
                "original_title": "My Cousin Vinny",
                "overview": "Two carefree pals from Brooklyn traveling through rural Alabama on their way back to college are mistakenly arrested, and charged with murder. Fortunately, one of them has a cousin who's a lawyer - Vincent Gambini, a former auto mechanic from Brooklyn who just passed his bar exam after his sixth try. When he arrives with his leather-clad girlfriend, to try his first case, it's a real shock - for him and the Deep South!",
                "popularity": 10.6957,
                "poster_path": "/iwSURa8nS2ujwrU3s1lfxxX7voH.jpg",
                "release_date": "1992-03-13",
                "title": "My Cousin Vinny",
                "video": false,
                "vote_average": 7.499,
                "vote_count": 1695,
                "character": "Jim Trotter III",
                "credit_id": "52fe43639251416c7500e573",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/of6OQnsvPHXEASczrBc3nVsMZ7q.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10774,
                "original_language": "en",
                "original_title": "Network",
                "overview": "When veteran anchorman Howard Beale is forced to retire his 25-year post because of his age, he announces to viewers that he will kill himself during his farewell broadcast. Network executives rethink their decision when his fanatical tirade results in a spike in ratings.",
                "popularity": 3.8792,
                "poster_path": "/gZ8hhuVEQ78CLND09trZJ45Eiy8.jpg",
                "release_date": "1976-11-14",
                "title": "Network",
                "video": false,
                "vote_average": 7.812,
                "vote_count": 1878,
                "character": "Robert McDonough",
                "credit_id": "52fe43b49251416c7501af69",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Лейн Смит"
        ],
        "biography": "Lane Smith (April 29, 1936 – June 13, 2005) was an American actor . He graduated from the Leelanau School, a boarding school in Glen Arbor, Michigan, and spent one year boarding at the Hill School in Pottstown, Pennsylvania, before going off to study at the Actors Studio in the late 1950s and early 1960s along with Dustin Hoffman and Al Pacino; he was recognized in their Hall of Fame. Smith served two years in the United States Army.\n\nAfter graduating, Smith found steady work in New York theater before making his film debut in Maidstone in 1970. During the 1970s, he regularly made appearances in small film roles including Rooster Cogburn in 1975 and Network in 1976. In 1981, Smith appeared in the Sidney Lumet-directed film Prince of the City. He also acted on television, notably playing a United States Marine in Vietnam in the television miniseries A Rumor of War and in the 1980 Hallmark Hall of Fame TV movie Gideon's Trumpet starring Henry Fonda, José Ferrer and John Houseman. Smith is also credited for playing McMurphy 650 times in the 1971 Off-Broadway revival of One Flew Over The Cuckoo's Nest.\n\nSmith made a major breakthrough in 1984 with significant roles in Red Dawn, Places in the Heart and the television series V. He also played on Quincy, M.E. in season 8, episode 7, \"Science for Sale\" as an oncologist searching for a cure to cancer. In 1989, Smith gained recognition for his portrayal of Richard Nixon in the docudrama The Final Days. Newsweek praised the performance, writing, \"Smith] is such a good Nixon that his despair and sorrow at his predicament become simply overwhelming.\" Smith earned a Golden Globe nomination for his performance. He also appeared in the original Broadway stage production of David Mamet's Glengarry Glen Ross as James Lingk. He received a Drama Desk Award for his performance.\n\nIn 1990, Smith appeared in Air America playing a United States Senator, a role for which he was selected based on his resemblance to then-Minority Leader Bob Dole. Two years later, he played a small-town district attorney opposite Joe Pesci in My Cousin Vinny, followed by a role as Coach Jack Reilly in The Mighty Ducks. In 1993 Smith landed the role of Perry White in Lois & Clark: The New Adventures of Superman, which he played for four seasons until 1997. In 1994, he portrayed New York Yankees front officeman Ron in The Scout, alongside Albert Brooks and Brendan Fraser. In 1998, Smith appeared in a major role as fictional television anchorman Emmett Seaborn in the HBO miniseries From The Earth to the Moon. His final film appearance was in The Legend of Bagger Vance (2000).\n\nSmith was diagnosed with amyotrophic lateral sclerosis (also known as ALS, or Lou Gehrig's disease) in April 2004. He died of the disease at his home in Northridge, California on June 13, 2005 at the age of 69. He was survived by his wife, Debbie Benedict Smith and his son Robert Smith.",
        "birthday": "1936-04-29",
        "deathday": "2005-06-13",
        "gender": 2,
        "homepage": null,
        "id": 65019,
        "imdb_id": "nm0809031",
        "known_for_department": "Acting",
        "name": "Lane Smith",
        "place_of_birth": "Memphis, Tennessee, USA",
        "popularity": 0.6987,
        "profile_path": "/stmbrf2qdq6umxt3Jh30IDhCfi3.jpg"
    }
}