{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fi40dLKa4aHnvyH81BKo8Go8kSp.jpg",
                "genre_ids": [
                    12,
                    28,
                    35,
                    53
                ],
                "id": 8697,
                "original_language": "cn",
                "original_title": "我是誰",
                "overview": "A group of covert CIA operatives trailing a potential new energy source are double-crossed by corrupt agent Morgan, who causes a helicopter crash in remote South Africa. The sole survivor, suffering severe amnesia, is nursed to recovery by a kindly native tribe who call him \"Whoami\" after the question he keeps asking. With the help of a mysterious reporter Christine, Whoami pieces together his past and tracks the turncoat agent and his criminal cohorts.",
                "popularity": 6.0942,
                "poster_path": "/9YDKLbBmWGpxG5bO3TBawtNNOAr.jpg",
                "release_date": "1998-01-17",
                "title": "Who Am I?",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 922,
                "character": "Commando",
                "credit_id": "53fa0481c3a368734f002f53",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kane Takeshi Kosugi",
            "小杉 健",
            "こすぎ たけし",
            "ケイン・タケシ・コスギ",
            "ケイン・コスギ"
        ],
        "biography": "Kane Takeshi Kosugi (ケイン・健・コスギ, Kein Takeshi Kosugi, born October 11, 1974) is an American martial artist, actor and media personality of direct Chinese and Japanese descent.\n\nThe son of martial arts film star Sho Kosugi, Kane began his career as a child actor starring opposite his father in films like Revenge of the Ninja and Pray for Death. He first gained recognition in Japan for his starring role as Jiraiya (Ninja Black) in Ninja Sentai Kakuranger, being the second American-born sentai senshi. He has appeared in over 30 films and television series, including the video game adaptations DOA: Dead or Alive and Street Fighter Alpha. He competed on five seasons of the obstacle challenge program Sasuke, where he was the first American competitor.\n\nLike his father, Kosugi has appeared in both Japanese and American media. In Japan, Kane is considered gaijin tarento (foreign talent) due to his Nisei (second generation) foreign born heritage.\n\nDescription above from the Wikipedia article Kane Kosugi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1974-10-11",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.kanekosugi.com/",
        "id": 65198,
        "imdb_id": "nm0467559",
        "known_for_department": "Acting",
        "name": "Kane Kosugi",
        "place_of_birth": "Los Angeles, U.S.A",
        "popularity": 0.5865,
        "profile_path": "/zjU1zHGGlAK3yzL3cjc8lBUqrrr.jpg"
    }
}