{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iukXiB3Guz5VyTlraZiBnHT8Y0B.jpg",
                "genre_ids": [
                    878,
                    28
                ],
                "id": 1103,
                "original_language": "en",
                "original_title": "Escape from New York",
                "overview": "In a world ravaged by crime, the entire island of Manhattan has been converted into a walled prison where brutal prisoners roam free. After the US president crash-lands inside, war hero Snake Plissken has 24 hours to bring him back.",
                "popularity": 4.8834,
                "poster_path": "/vH9llaphjAssRGi0k7e75tD40Ce.jpg",
                "release_date": "1981-05-23",
                "title": "Escape from New York",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3333,
                "character": "The Duke of New York",
                "credit_id": "52fe42e7c3a36847f802bc19",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/2q3B90h2hZ6xJTvna9CIFDNaIr4.jpg",
                "genre_ids": [
                    16,
                    35
                ],
                "id": 9473,
                "original_language": "en",
                "original_title": "South Park: Bigger, Longer & Uncut",
                "overview": "In this feature film based on the hit animated series, the third graders of South Park sneak into an R-rated film by ultra-vulgar Canadian television personalities Terrance and Phillip, and emerge with expanded vocabularies that leave their parents and teachers scandalized. When outraged Americans try to censor the film, the controversy spirals into a call to wage war on Canada and Terrance and Phillip end up on death row, with the kids their only hope of rescue.",
                "popularity": 7.0939,
                "poster_path": "/tS0PedvA2mFO9VCHYwQpaU1K36U.jpg",
                "release_date": "1999-06-24",
                "title": "South Park: Bigger, Longer & Uncut",
                "video": false,
                "vote_average": 7.279,
                "vote_count": 2806,
                "character": "Chef (voice)",
                "credit_id": "52fe44fcc3a36847f80b5d15",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/29VoISagzOfJcuuhFzKQg9ZmEUU.jpg",
                "genre_ids": [
                    99,
                    10770
                ],
                "id": 318224,
                "original_language": "en",
                "original_title": "Going Clear: Scientology and the Prison of Belief",
                "overview": "GOING CLEAR intimately profiles eight former members of the Church of Scientology, shining a light on how they attract true believers and the things they do in the name of religion.",
                "popularity": 2.0887,
                "poster_path": "/zWHQYR9srde9nZjU6Dot8qTjoni.jpg",
                "release_date": "2015-01-25",
                "title": "Going Clear: Scientology and the Prison of Belief",
                "video": false,
                "vote_average": 7.589,
                "vote_count": 833,
                "character": "Self (archive footage)",
                "credit_id": "55146efe9251410462002465",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ike",
            "\tIsaac Lee Hayes Jr.",
            "The Black Moses"
        ],
        "biography": "Isaac Lee Hayes, Jr. (August 20, 1942 – August 10, 2008) was an American songwriter, musician, singer, and occasionally an actor. Hayes was one of the creative influences behind the southern soul music label Stax Records, where he served both as an in-house songwriter and as a record producer, teaming with his partner David Porter during the mid-1960s. Hayes, Porter, Bill Withers, the Sherman Brothers, Steve Cropper, and John Fogerty were inducted into the Songwriters Hall of Fame in 2005 in recognition of writing scores of notable songs for themselves, the duo \"Sam & Dave\", Carla Thomas, and others.\n\nThe hit song \"Soul Man\" written by Hayes and Porter, and first performed by \"Sam & Dave\" has been recognized as one of the most influential songs of the past 50 years by the Grammy Hall of Fame. This song was also honored by The Rock and Roll Hall of Fame, by Rolling Stone magazine, and by the RIAA as the Songs of the Century.\n\nDuring the late 1960s, Hayes also became a recording musician, and he recorded several successful soul albums such as Hot Buttered Soul (1969) and Black Moses (1971). In addition to his work in popular music, Hayes worked as composer of musical scores for motion pictures.\n\nHayes is well known for his musical score for the film Shaft (1971). For his composition of the \"Theme from Shaft\", Hayes was awarded the Academy Award for Best Original Song in 1972. Hayes became the third African-American, after Sidney Poitier and Hattie McDaniel, to win an Academy Award in any competitive field whatsoever covered by Academy of Motion Picture Arts and Sciences. Hayes also won two Grammy Awards for that same year. Later, he was given his third Grammy Award for his music album Black Moses.\n\nDuring 1992, in recognition of his humanitarian work there, Hayes was crowned as the honorary king of the Ada, Ghana region. Hayes also acted in motion pictures and television, such as in the movie, I'm Gonna Git You Sucka, and as Gandolf \"Gandy\" Fitch in the TV series The Rockford Files (1974 – 80). Then from 1997 to 2005, he lent his distinctive, deep voice to the character \"Chef\" on the animated TV series South Park.\n\nOn August 5, 2003, Isaac Hayes was honored as a BMI Icon at the 203 BMI Urban Awards for his enduring influence on generations of music makers.Throughout his songwriting career, Hayes received five BMI R&B Awards, two BMI Pop Awards, two BMI Urban Awards and six Million-Air citations. As of 2008, his songs generated more than 12 million performances.\n\nDescription above from the Wikipedia Isaac Hayes, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1942-08-20",
        "deathday": "2008-08-10",
        "gender": 2,
        "homepage": "http://www.isaachayes.com",
        "id": 6542,
        "imdb_id": "nm0005002",
        "known_for_department": "Acting",
        "name": "Isaac Hayes",
        "place_of_birth": "Covington, Tennessee, USA",
        "popularity": 0.4118,
        "profile_path": "/wHZOIi0LJNZ55dswVMX5AqKtMlT.jpg"
    }
}