{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rWFLgIRGXzECIbczgo7dmnwq55q.jpg",
                "genre_ids": [
                    53,
                    28,
                    80
                ],
                "id": 8068,
                "original_language": "en",
                "original_title": "Desperado",
                "overview": "El Mariachi plunges headfirst into the dark border underworld when he follows a trail of blood to the last of the infamous Mexican drug lords, Bucho, for an action-packed, bullet-riddled showdown. With the help of his friend and a beautiful bookstore owner, El Mariachi tracks Bucho, takes on his army of desperados, and leaves his own trail of blood.",
                "popularity": 6.4316,
                "poster_path": "/e3gwpBeXpvGZsxUya9zNym5QXrw.jpg",
                "release_date": "1995-08-25",
                "title": "Desperado",
                "video": false,
                "vote_average": 6.927,
                "vote_count": 2979,
                "character": "Mariachi Fan",
                "credit_id": "550e0da5c3a3683f0a0002cb",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/v3ClsT59peXyGJ4XuDvIQAPwcZy.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 4133,
                "original_language": "en",
                "original_title": "Blow",
                "overview": "A boy named George Jung grows up in a struggling family in the 1950's. His mother nags at her husband as he is trying to make a living for the family. It is finally revealed that George's father cannot make a living and the family goes bankrupt. George does not want the same thing to happen to him, and his friend Tuna, in the 1960's, suggests that he deal marijuana. He is a big hit in California in the 1960's, yet he goes to jail, where he finds out about the wonders of cocaine. As a result, when released, he gets rich by bringing cocaine to America. However, he soon pays the price.",
                "popularity": 7.2346,
                "poster_path": "/yYZFVfk8aeMP4GxBSU9MTvqs9mJ.jpg",
                "release_date": "2001-04-04",
                "title": "Blow",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 4437,
                "character": "Martha Oliveras",
                "credit_id": "56e2130ac3a3686ff2000839",
                "order": 67
            },
            {
                "adult": false,
                "backdrop_path": "/9X7YweCJw3q8Mcf6GadxReFEksM.jpg",
                "genre_ids": [
                    28,
                    18,
                    878
                ],
                "id": 263115,
                "original_language": "en",
                "original_title": "Logan",
                "overview": "In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces.",
                "popularity": 12.4212,
                "poster_path": "/fnbjcRDYn6YviCcePDnGdyAkYsB.jpg",
                "release_date": "2017-02-28",
                "title": "Logan",
                "video": false,
                "vote_average": 7.82,
                "vote_count": 19839,
                "character": "Gabriela",
                "credit_id": "57ea3e3192514136d8000a44",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "伊莉莎白·羅德里格斯",
            "الیزابت رودریگز"
        ],
        "biography": "Elizabeth Rodriguez is an American actress, best known for her role as Aleida Diaz in the Netflix comedy-drama series Orange Is the New Black.\n\nAfter graduation from Lehman College, Rodriguez studied for two years under acclaimed acting teacher Maggie Flanigan at William Esper Studios in NYC. While still at the studio, she began working professionally with appearances in feature films including Fresh, Dead Presidents, and I Think I Do, as well as in TV shows such as Law & Order, and recurring roles on both OZ and New York Undercover.\n\nRodriguez has since appeared in numerous shows, including a recurring role as Aleida Diaz on the Netflix Original series Orange Is The New Black. Other TV credits include roles as series regulars on both NBC's Prime Suspect, opposite Maria Bello, and ABC's All My Children, in addition to recurring roles on The Shield and ER. Other credits include Six Feet Under, FlashForward, Cold Case, Just Shoot Me, NYPD Blue and Law & Order: SVU.\n\nHer made-for-TV movies include Inflammable and The Eddie Matos Story, written by Oscar nominated writer Jose Rivera. Some of her feature films include Return to Paradise, Four Lane Highway, Acts of Worship, Blow, All Things Fall Apart, Pound Of Flesh, Tonight at Noon, A Line in the Sand, Jack Goes Boating directed by Philip Seymour Hoffman, and Michael Mann's Miami Vice, opposite Colin Farrell and Jamie Foxx, Tio Papi, Glass Chin, and Animal Rescue with Tom Hardy and James Gandolfini.\n\nIn addition to her work on screen, Rodriguez remains extremely active in the theater. She has starred in Beauty of the Father (Manhattan Theatre Club), The Last Days of Judas Iscariot (NY's Public Theater), Roger and Vanessa (Actors' Gang), Den of Thieves (Black Dahlia), Robbers (American Place Theater), A View From 151st Street (NY's Public Theater) and Unconditional (NY's Public Theater). Rodriguez is a longtime member of NY's acclaimed Labyrinth Theater Company.",
        "birthday": "1980-12-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 65421,
        "imdb_id": "nm0735300",
        "known_for_department": "Acting",
        "name": "Elizabeth Rodriguez",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.0042,
        "profile_path": "/9f851DP7NHAOKvvlZdXxYigDYbl.jpg"
    }
}