{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4hfcpHmMEgmFTdnVx4XCtM6dgCG.jpg",
                "genre_ids": [
                    14,
                    12,
                    28,
                    10751,
                    10749
                ],
                "id": 102651,
                "original_language": "en",
                "original_title": "Maleficent",
                "overview": "A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land. She rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal – an act that begins to turn her heart into stone. Bent on revenge, Maleficent faces an epic battle with the invading King's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom – and to Maleficent's true happiness as well.",
                "popularity": 10.0967,
                "poster_path": "/bDG3yei6AJlEAK3A5wN7RwFXQ7V.jpg",
                "release_date": "2014-05-28",
                "title": "Maleficent",
                "video": false,
                "vote_average": 7.089,
                "vote_count": 13415,
                "character": "Advisor to King Henry",
                "credit_id": "55e41e5792514137ec0036a9",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nOliver Maltman is a British actor notable for his appearances in the TV series Star Stories, The Kevin Bishop Show, No Heroics and Clone. He has also appeared in Mike Leigh's films Happy-Go-Lucky in 2008 and Another Year in 2010.\n\nBorn on 19 January 1976, in South London, Maltman trained at the Central School of Speech and Drama.\n\nDescription above from the Wikipedia article Oliver Maltman, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1976-01-19",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.independenttalent.com/actors/oliver-maltman/",
        "id": 65451,
        "imdb_id": "nm1169217",
        "known_for_department": "Acting",
        "name": "Oliver Maltman",
        "place_of_birth": "South London, England",
        "popularity": 0.7571,
        "profile_path": "/wZgJ4BhseHlGOakiSMLCDUE07ic.jpg"
    }
}