{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8yE0aOQoZSSl2CuuPvjxdHuQl4P.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 10514,
                "original_language": "en",
                "original_title": "The Andromeda Strain",
                "overview": "When virtually all of the residents of Piedmont, New Mexico, are found dead after the return to Earth of a space satellite, the head of the US Air Force's Project Scoop declares an emergency. A group of eminent scientists led by Dr. Jeremy Stone scramble to a secure laboratory and try to first isolate the life form while determining why two people from Piedmont - an old alcoholic and a six-month-old baby - survived. The scientists methodically study the alien life form unaware that it has already mutated and presents a far greater danger in the lab, which is equipped with a nuclear self-destruct device designed to prevent the escape of dangerous biological agents.",
                "popularity": 3.8677,
                "poster_path": "/4FBSFz8wLpxd4o6hnvKOJJ8WSIz.jpg",
                "release_date": "1971-03-12",
                "title": "The Andromeda Strain",
                "video": false,
                "vote_average": 7.054,
                "vote_count": 736,
                "character": "Dr. Jeremy Stone",
                "credit_id": "52fe437e9251416c750127d9",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/1oRug23GWxgyQmqQGbX7ke974lp.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 5902,
                "original_language": "en",
                "original_title": "A Bridge Too Far",
                "overview": "The story of Operation Market Garden—a failed attempt by the allies in the latter stages of WWII to end the war quickly by securing three bridges in Holland allowing access over the Rhine into Germany. A combination of poor allied intelligence and the presence of two crack German panzer divisions meant that the final part of this operation (the bridge in Arnhem over the Rhine) was doomed to failure.",
                "popularity": 8.5375,
                "poster_path": "/lszOk3Xmh7qpLaM9J4K9E6ADLk1.jpg",
                "release_date": "1977-06-15",
                "title": "A Bridge Too Far",
                "video": false,
                "vote_average": 7.222,
                "vote_count": 871,
                "character": "U.S. Medical Colonel",
                "credit_id": "57bb86d792514176e300031e",
                "order": 70
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Arthur Edward Spence Hill"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nArthur Edward Spence Hill (August 1, 1922 – October 22, 2006) was a Canadian actor best known for appearances in British and American theater, movies and television. He attended the University of British Columbia and continued his acting studies in Seattle, Washington. Born in Melfort, Saskatchewan, Hill served in the Royal Canadian Air Force during World War II and attended the University of British Columbia, where he studied law but was lured to the stage. Hill made his Broadway debut as Cornelius Hackl in the 1957 revival of Thornton Wilder's The Matchmaker. In 1963 he won the Tony Award for Best Dramatic Actor for his portrayal of George in the original Broadway production of Who's Afraid of Virginia Woolf? (opposite Uta Hagen). His other Broadway credits include Ben Gant in the original production of Ketti Frings's Look Homeward, Angel (1957), The Gang's All Here (1959), All the Way Home (1960), Something More! (1964), and More Stately Mansions (1967). His most recognizable film portrayal was that of Dr. Jeremy Stone in the film adaptation of Michael Crichton's The Andromeda Strain (1971). Hill's other film work included roles in Harper (1966), The Chairman (1969), Sam Peckinpah's The Killer Elite (1975) and Futureworld (1976), \" A Little Romance\" (1979), and he narrated the film version of Ray Bradbury's Something Wicked This Way Comes (1983). Arguably, Hill's most famous acting role was that of lawyer Owen Marshall, the lead role in the 1971-1974 TV series Owen Marshall: Counselor at Law. He appeared on many other series, including CBS's The Reporter, a 1964 drama starring Harry Guardino. He appeared as a guest star in the pilot episode of Murder, She Wrote in 1984, returning to that same role in an episode in 1990. This would turn out to be his last appearance in film. He died in a Pacific Palisades, California nursing home, aged 84, after a long battle with Alzheimer's disease.\n\nDescription above from the Wikipedia article Arthur Hill (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1922-08-01",
        "deathday": "2006-10-22",
        "gender": 2,
        "homepage": null,
        "id": 65505,
        "imdb_id": "nm0384050",
        "known_for_department": "Acting",
        "name": "Arthur Hill",
        "place_of_birth": "Melfort, Saskatchewan, Canada",
        "popularity": 0.3914,
        "profile_path": "/7j7FUkRWb3aMiwxzkmRoZwPwvXq.jpg"
    }
}