{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jkYdRAhshaRwiRAB4KdDz1Ocj4e.jpg",
                "genre_ids": [
                    28,
                    80,
                    35,
                    53
                ],
                "id": 10536,
                "original_language": "en",
                "original_title": "The Italian Job",
                "overview": "Charlie's got a 'job' to do. Having just left prison he finds one of his friends has attempted a high-risk job in Torino, Italy, right under the nose of the mafia. Charlie's friend doesn't get very far, so Charlie takes over the 'job'. Using three Mini Coopers, a couple of Jaguars, and a bus, he hopes to bring Torino to a standstill, steal a fortune in gold and escape in the chaos.",
                "popularity": 2.6317,
                "poster_path": "/8NOw3HPHkcBndJW2K6ofbcSb7WD.jpg",
                "release_date": "1969-06-02",
                "title": "The Italian Job",
                "video": false,
                "vote_average": 6.993,
                "vote_count": 804,
                "character": "Lorna",
                "credit_id": "52fe43829251416c7501338f",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Maggie Bly",
            "Margaret Bly",
            "Maggie Blye",
            "Margaret Jane Blye"
        ],
        "biography": "Margaret Jane Blye (October 24, 1942 – March 24, 2016) was an American actress, also sometimes billed as Margaret Bly. Early in her career, she appeared in a number of popular television series including Perry Mason, Gunsmoke and Ben Casey. Blye starred in the 1967 Paul Newman film Hombre and the 1969 version of The Italian Job, as well as Waterhole #3, a Western starring James Coburn. Blye appeared with Coburn again in the 1975 Charles Bronson film Hard Times. Byle also starred in the horror film The Entity (1981).\n\nHer later television roles included The Rockford Files, Hart to Hart and Lois & Clark: The New Adventures of Superman. She appeared in four episodes of the series In the Heat of the Night, including the pilot episode. Blye appeared in several films in the 2000s, including 2004's The Last Goodbye and the 2005 horror comedy The Gingerdead Man.\n\nDescription above from the Wikipedia article Maggie Blye, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1939-10-24",
        "deathday": "2016-03-24",
        "gender": 1,
        "homepage": null,
        "id": 65552,
        "imdb_id": "nm0089984",
        "known_for_department": "Acting",
        "name": "Margaret Blye",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.5492,
        "profile_path": "/hvgzZtn3AliCNqXgwUJT1aYrTRM.jpg"
    }
}