{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yPXW7E4Tu1Eltb5lxQSwHNLEzlx.jpg",
                "genre_ids": [
                    28,
                    35,
                    80,
                    18
                ],
                "id": 337170,
                "original_language": "en",
                "original_title": "American Made",
                "overview": "The true story of pilot Barry Seal, who transported contraband for the CIA and the Medellin cartel in the 1980s.",
                "popularity": 7.6558,
                "poster_path": "/23ILgoPSO5ShKcTZOuiTVfqFAUB.jpg",
                "release_date": "2017-08-18",
                "title": "American Made",
                "video": false,
                "vote_average": 6.896,
                "vote_count": 4742,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "67d88554509a6bfc397b9316",
                "order": 62
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/dLL90vskYFn1S89RZp5TUguK9wl.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 4982,
                "original_language": "en",
                "original_title": "American Gangster",
                "overview": "Loosely based on the criminal career of Frank Lucas, a gangster from La Grange, North Carolina, who smuggled heroin into the United States on American service planes returning from the Vietnam War, before being detained by a task force led by Newark Detective Richie Roberts.",
                "popularity": 6.9465,
                "poster_path": "/8sV6nWuKczuXRt0C6EWoXqJAj6G.jpg",
                "release_date": "2007-11-02",
                "title": "American Gangster",
                "video": false,
                "vote_average": 7.591,
                "vote_count": 5730,
                "credit_id": "56c4c379c3a3680d4e000532",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cassius Clay",
            "Cassius Marcellus Clay"
        ],
        "biography": "Muhammad Ali (born Cassius Marcellus Clay Jr.; January 17, 1942 – June 3, 2016) was an American professional boxer, activist, entertainer and philanthropist. Nicknamed The Greatest, he is widely regarded as one of the most significant and celebrated figures of the 20th century and as one of the greatest boxers of all time.\n\nAli was born and raised in Louisville, Kentucky. He began training as an amateur boxer at age 12. At 18, he won a gold medal in the light heavyweight division at the 1960 Summer Olympics and turned professional later that year. He became a Muslim after 1961. He won the world heavyweight championship from Sonny Liston in a major upset on February 25, 1964, at age 22. On March 6, 1964, he announced that he no longer would be known as Cassius Clay but as Muhammad Ali. In 1966, Ali refused to be drafted into the military, citing his religious beliefs and ethical opposition to the Vietnam War. He was found guilty of draft evasion so he faced 5 years in prison and was stripped of his boxing titles. He stayed out of prison as he appealed the decision to the Supreme Court, which overturned his conviction in 1971, but he had not fought for nearly four years and lost a period of peak performance as an athlete. Ali's actions as a conscientious objector to the Vietnam War made him an icon for the larger counterculture generation, and he was a very high-profile figure of racial pride for African Americans during the civil rights movement and throughout his career. As a Muslim, Ali was initially affiliated with Elijah Muhammad's Nation of Islam (NOI). He later disavowed the NOI, adhering to Sunni Islam, and supporting racial integration like his former mentor Malcolm X.\n\nAli was a leading heavyweight boxer of the 20th century, and he remains the only three-time lineal champion of that division. His joint records of beating 21 boxers for the world heavyweight title and winning 14 unified title bouts stood for 35 years. He is the only fighter to have been ranked as the world's best heavyweight by BoxRec twelve times. He has been ranked among BoxRec's ten best heavyweights seventeen times, the third most in history. He won 8 fights that were rated by BoxRec as 5-Star, the third most in the history of the heavyweight division. Ali is the only boxer to be named The Ring magazine Fighter of the Year six times. He has been ranked the greatest heavyweight boxer of all time, and as the greatest athlete of the 20th century by Sports Illustrated, the Sports Personality of the Century by the BBC, and the third greatest athlete of the 20th century by ESPN SportsCentury. He was involved in several historic boxing matches and feuds, most notably his fights with Joe Frazier, such as the Fight of the Century and the Thrilla in Manila, and his fight with George Foreman, known as The Rumble in the Jungle, which has been called \"arguably the greatest sporting event of the 20th century\" and was watched by a record estimated television audience of 1 billion viewers worldwide, becoming the world's most-watched live television broadcast at the time. Ali thrived in the spotlight at a time when many fighters let their managers do the talking, and he was often provocative and outlandish. He was known for trash-talking, and often free-styled with rhyme schemes and spoken word poetry, anticipating elements of hip hop.",
        "birthday": "1942-01-17",
        "deathday": "2016-06-03",
        "gender": 2,
        "homepage": null,
        "id": 65605,
        "imdb_id": "nm0000738",
        "known_for_department": "Acting",
        "name": "Muhammad Ali",
        "place_of_birth": "Louisville, Kentucky, USA",
        "popularity": 0.2512,
        "profile_path": "/u1ck2Lfx34GvW3YOoEE1ddNVdw6.jpg"
    }
}