{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2kqmEQZqime0G3ULgrKtAq3WVdH.jpg",
                "genre_ids": [
                    18
                ],
                "id": 45317,
                "original_language": "en",
                "original_title": "The Fighter",
                "overview": "Boxer \"Irish\" Micky Ward's unlikely road to the world light welterweight title. His Rocky-like rise was shepherded by half-brother Dicky, a boxer-turned-trainer who rebounded in life after nearly being KO'd by drugs and crime.",
                "popularity": 8.5953,
                "poster_path": "/xfsFerGhO1h6rLk8vwLgMyQ8WVJ.jpg",
                "release_date": "2010-12-10",
                "title": "The Fighter",
                "video": false,
                "vote_average": 7.381,
                "vote_count": 4512,
                "character": "Fight Announcer",
                "credit_id": "62c0b890aaf8970059e6b86c",
                "order": 84
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  George Edward Foreman (nicknamed \"Big George\") (born January 10, 1949) was an American two-time former World Heavyweight Boxing Champion, Olympic gold medalist, ordained Baptist minister, author and successful entrepreneur. He is credited as being one of the hardest hitters in boxing history.\n\nHis most notable fights in his early career were his knockout (TKO-2) against Joe Frazier in Kingston, Jamaica, on January 22, 1973 and his loss to Muhammad Ali (KO by 8) in \"The Rumble in the Jungle\" in Kinshasa, Zaire, on October 30, 1974. He later became the oldest man ever to become heavyweight boxing champion of the world when at age 45, he knocked out (KO-10) Michael Moorer, age 26, on November 5, 1994 to reclaim the title he held more than 20 years earlier. He has been named one of the 25 greatest fighters of all time by Ring magazine. He is now a successful businessman and an ordained Christian minister who has his own church.\n\nForeman is ranked #9 on Ring magazine's list of \"100 greatest punchers of all time\". He is also well-known for the eponymous George Foreman Grill.\n\nDescription above from the Wikipedia article George Foreman, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1949-01-10",
        "deathday": "2025-03-21",
        "gender": 2,
        "homepage": null,
        "id": 65606,
        "imdb_id": "nm0286040",
        "known_for_department": "Acting",
        "name": "George Foreman",
        "place_of_birth": "Marshall, Texas, USA",
        "popularity": 0.1219,
        "profile_path": "/7LZJVEP8iL9DQTBUDwHAnfKgmMI.jpg"
    }
}