{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hg9fFsZjtw64wworVY5mo45gkh9.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 10559,
                "original_language": "en",
                "original_title": "Frequency",
                "overview": "When a rare phenomenon gives police officer John Sullivan the chance to speak to his father, 30 years in the past, he takes the opportunity to prevent his dad's tragic death.  After his actions inadvertently give rise to a series of brutal murders he and his father must find a way to fix the consequences of altering time.",
                "popularity": 4.1403,
                "poster_path": "/eu3Hrjj271dnBdNAF0HqfmwWASt.jpg",
                "release_date": "2000-04-28",
                "title": "Frequency",
                "video": false,
                "vote_average": 7.258,
                "vote_count": 1881,
                "character": "Graham Gibson",
                "credit_id": "52fe43889251416c7501407b",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/trfjdJI51Krnig9UmxJQkz15ICo.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 11820,
                "original_language": "en",
                "original_title": "Mona Lisa Smile",
                "overview": "Katherine Watson is a recent UCLA graduate hired to teach art history at the prestigious all-female Wellesley College, in 1953. Determined to confront the outdated mores of society and the institution that embraces them, Katherine inspires her traditional students, including Betty and Joan, to challenge the lives they are expected to lead.",
                "popularity": 4.2519,
                "poster_path": "/bg0VKsXnLjIZ0cHmZHZLs9gzrvm.jpg",
                "release_date": "2003-12-19",
                "title": "Mona Lisa Smile",
                "video": false,
                "vote_average": 6.925,
                "vote_count": 1816,
                "character": "Spencer Jones",
                "credit_id": "6239e7c6075288007203ef2e",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Son of actor Beau Bridges and Julie Bridges. As a child actor, he acted in two television films: The Kid from Nowhere (1982) (TV) directed by his father, and \"Walt Disney's Wonderful World of Color: The Thanksgiving Promise (#31.8)\" (1986) starring the entire Bridges family. However, he chose not to continue working as a child actor, so he could be just a regular kid.\n\nHe attended the progressive Oakwood school with a strong emphasis on the arts, which got him interested in acting. He followed it up as a theater major and literature minor at New York's Bard College.\n\nBefore earning his bachelor's degree, Bridges spent his junior year in England studying at the prestigious London Academy of Music and Dramatic Arts, staying at a tiny basement flat in Chelsea, eating lots of chicken noodles and attending West End theater productions on free passes.\n\nClassically trained, he became a \"cater waiter\" in New York and Los Angeles for a couple of years each, before he started getting roles in television and film.",
        "birthday": "1973-11-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 65762,
        "imdb_id": "nm0108758",
        "known_for_department": "Acting",
        "name": "Jordan Bridges",
        "place_of_birth": "Los Angeles County, California, USA",
        "popularity": 0.592,
        "profile_path": "/nY1ojfUERgNcPj9PpsygP4hbofh.jpg"
    }
}