{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pNjh59JSxChQktamG3LMp9ZoQzp.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 278,
                "original_language": "en",
                "original_title": "The Shawshank Redemption",
                "overview": "Imprisoned in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
                "popularity": 28.0345,
                "poster_path": "/9cqNxx0GxF0bflZmeSMuL5tnGzr.jpg",
                "release_date": "1994-09-23",
                "title": "The Shawshank Redemption",
                "video": false,
                "vote_average": 8.7,
                "vote_count": 28883,
                "character": "Brooks Hatlen",
                "credit_id": "52fe4231c3a36847f800b14d",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/bhEJZ6XH1B9ld97OWppdAnvWzl5.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11165,
                "original_language": "en",
                "original_title": "Tora! Tora! Tora!",
                "overview": "In the summer of 1941, the United States and Japan seem on the brink of war after constant embargos and failed diplomacy come to no end. \"Tora! Tora! Tora!\", named after the code words used by the lead Japanese pilot to indicate they had surprised the Americans, covers the days leading up to the attack on Pearl Harbor, which plunged America into the Second World War.",
                "popularity": 3.337,
                "poster_path": "/c311sN931DixuZRer0JGYCwpx9N.jpg",
                "release_date": "1970-01-26",
                "title": "Tora! Tora! Tora!",
                "video": false,
                "vote_average": 7.149,
                "vote_count": 566,
                "character": "Admiral William F. Halsey",
                "credit_id": "52fe44059251416c750264c7",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/pDGkMdMHkl1qRAYmQjdLKVx3euQ.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 16958,
                "original_language": "en",
                "original_title": "The Asphalt Jungle",
                "overview": "Recently paroled from prison, legendary burglar \"Doc\" Riedenschneider, with funding from Alonzo Emmerich, a crooked lawyer, gathers a small group of veteran criminals together in the Midwest for a big jewel heist.",
                "popularity": 5.2891,
                "poster_path": "/8xsUnT0P2fJWQv9jGDhs3i9Zx2l.jpg",
                "release_date": "1950-05-12",
                "title": "The Asphalt Jungle",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 504,
                "character": "Gus Minissi",
                "credit_id": "52fe46f99251416c75089ce7",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/gmJOXle5QeOOVFEYOVBOkmIJUWV.jpg",
                "genre_ids": [
                    878,
                    12,
                    18,
                    28
                ],
                "id": 871,
                "original_language": "en",
                "original_title": "Planet of the Apes",
                "overview": "Astronaut Taylor crash lands on a distant planet ruled by apes who use a primitive race of humans for experimentation and sport. Soon Taylor finds himself among the hunted, his life in the hands of a benevolent chimpanzee scientist.",
                "popularity": 7.6719,
                "poster_path": "/2r9iKnlSYEk4daQadsXfcjHfIjQ.jpg",
                "release_date": "1968-02-07",
                "title": "Planet of the Apes",
                "video": false,
                "vote_average": 7.646,
                "vote_count": 3739,
                "character": "President of the Assembly",
                "credit_id": "549edc6bc3a3682f21008684",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Allen Whitmore Jr.",
            "جیمز ویتمور"
        ],
        "biography": "James Allen Whitmore Jr. was an American film, theatre, and television actor. During his career, Whitmore won three of the four EGOT honors; - a Tony, a Grammy, and an Emmy. Whitmore also won a Golden Globe and was nominated for two Academy Awards.  Following World War II, Whitmore appeared on Broadway in the role of the sergeant in Command Decision. Metro-Goldwyn-Mayer gave Whitmore a contract, but his role in the film adaptation was played by Van Johnson. His first major picture for MGM was Battleground, in a role that was turned down by Spencer Tracy, to whom Whitmore bore a noted physical resemblance. He was nominated for the Academy Award for Best Supporting Actor for this role, and won the Golden Globe Award as Best Performance by an Actor In A Supporting Role. Other major films included Angels in the Outfield, The Asphalt Jungle, The Next Voice You Hear, Above and Beyond, Kiss Me, Kate, Them!, Oklahoma!, Black Like Me, Guns of the Magnificent Seven, Tora! Tora! Tora!, and Give 'em Hell, Harry!, a one-man show for which he was nominated for the Academy Award for Best Actor for his portrayal of former U.S. President Harry S Truman. In the film Tora! Tora! Tora!, he played Admiral William F. \"Bull\" Halsey.\n\nWhitmore appeared during the 1950s on many television anthology series. He was cast as Father Emil Kapaun in the 1955 episode \"The Good Thief\" in the ABC religion anthology series Crossroads. Other roles followed on Jane Wyman Presents the Fireside Theater, Lux Video Theatre, Kraft Theatre, Studio One in Hollywood, Schlitz Playhouse, Matinee Theatre, and the Ford Television Theatre. In 1958, he carried the lead in \"The Gabe Carswell Story\" of NBC's Wagon Train, with Ward Bond.  Whitmore has a star on the Hollywood Walk of Fame at 6611 Hollywood Boulevard. The ceremony was held on February 8, 1960.",
        "birthday": "1921-10-01",
        "deathday": "2009-02-06",
        "gender": 2,
        "homepage": null,
        "id": 6577,
        "imdb_id": "nm0926235",
        "known_for_department": "Acting",
        "name": "James Whitmore",
        "place_of_birth": "White Plains, New York, USA",
        "popularity": 1.0322,
        "profile_path": "/nYMAbkfwFIgKK84vnLoQctI6vHg.jpg"
    }
}