{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rmiG2uwcNoGFmBKMoa1pIcf514L.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 37165,
                "original_language": "en",
                "original_title": "The Truman Show",
                "overview": "An insurance salesman begins to suspect that his whole life is actually some sort of reality TV show.",
                "popularity": 15.95,
                "poster_path": "/vuza0WqY239yBXOadKlGwJsZJFE.jpg",
                "release_date": "1998-06-04",
                "title": "The Truman Show",
                "video": false,
                "vote_average": 8.149,
                "vote_count": 19296,
                "character": "Walter Moore / Kirk Burbank",
                "credit_id": "52fe462e9251416c9104be1b",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/pNjh59JSxChQktamG3LMp9ZoQzp.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 278,
                "original_language": "en",
                "original_title": "The Shawshank Redemption",
                "overview": "Imprisoned in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
                "popularity": 28.9882,
                "poster_path": "/9cqNxx0GxF0bflZmeSMuL5tnGzr.jpg",
                "release_date": "1994-09-23",
                "title": "The Shawshank Redemption",
                "video": false,
                "vote_average": 8.7,
                "vote_count": 28883,
                "character": "Guard Dekins",
                "credit_id": "55bfa0269251413e4f0073a9",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/k0HFJNOfwuWbYKon7BwCbnX8OkB.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 10712,
                "original_language": "en",
                "original_title": "Far from Heaven",
                "overview": "In 1950s Connecticut, a housewife's life is upended by a marital crisis and mounting racial tensions in society.",
                "popularity": 4.6134,
                "poster_path": "/9gQuvFDRPLx39smUvyafm36tp0d.jpg",
                "release_date": "2002-11-08",
                "title": "Far from Heaven",
                "video": false,
                "vote_average": 7.048,
                "vote_count": 641,
                "character": "Officer #2",
                "credit_id": "5bd9355f0e0a26506c007322",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "After college graduation, Delate moved to New York City and spent his first few years adapting, both professionally and personally, to the novelty and pace of the city. Delate's first professional acting work (and his very special association with the New York Shakespeare Festival) began in 1981, when he was cast in both of the plays performed in Central Park that summer - Henry IV, Part I and The Tempest. Other plays followed (including Joseph Papp's Hamlet with Diane Venora), and in 1984-1985, Delate received critical acclaim for his performance in the award-winning play, Tracers, which had successful runs in both New York (NYSF) and London (Royal Court). An abundance of daytime television and commercial work followed. In 1987, William Friedkin cast him in Python Wolf and not long after, David Jones cast him opposite Robert DeNiro and Ed Harris in Jacknife. Theatre, film and television opportunities all combined to help Delate thrive as an actor. He spent three seasons with the River Arts Repertory, and three seasons with Phoenix Theatre Company doing rotating repertory theatre, along with numerous theatre acting stints in and out of New York. One piece of trivia from that time was that Delate got to play the Humphrey Bogart role of Rick in the only sanctioned stage production of Casablanca permitted by Warner Brothers.  Delate has had the privilege to work with some of the most talented and creative directors and actors in the industry -- most recently in The Brave One (directed by Neil Jordan, with Jodie Foster), in Salome on Broadway, directed by Estelle Parsons and elsewhere and in the film, Salomaybe (both with Al Pacino), as well as in My Brother (directed by Anthony Lover), Buffalo Soldiers (directed by Gregor Jordan, with Ed Harris and Joaquin Phoenix), The Truman Show (directed by Peter Weir, with Jim Carrey and Laura Linney), American Wake and Home Before Dark (both directed by Maureen Foley, the latter with Katherine Ross), Sudden Death (directed by Peter Hyams), Far From Heaven (directed by Todd Haynes), Ash Wednesday (directed by Edward Burns), and The Shawshank Redemption (directed by Frank Darabont, with Tim Robbins).",
        "birthday": "1949-04-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 6579,
        "imdb_id": "nm0216507",
        "known_for_department": "Acting",
        "name": "Brian Delate",
        "place_of_birth": "Trenton, New Jersey, USA",
        "popularity": 0.311,
        "profile_path": "/rydDYe4VHjZsJZPWOus4KGkhroG.jpg"
    }
}