{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jynfI114q3kOAbIiVjVfFFmttU2.jpg",
                "genre_ids": [
                    80,
                    18,
                    28
                ],
                "id": 101,
                "original_language": "fr",
                "original_title": "Léon",
                "overview": "Léon, the top hit man in New York, has earned a rep as an effective \"cleaner\". But when his next-door neighbors are wiped out by a loose-cannon DEA agent, he becomes the unwilling custodian of 12-year-old Mathilda. Before long, Mathilda's thoughts turn to revenge, and she considers following in Léon's footsteps.",
                "popularity": 11.642,
                "poster_path": "/bxB2q91nKYp8JNzqE7t7TWBVupB.jpg",
                "release_date": "1994-09-14",
                "title": "Léon: The Professional",
                "video": false,
                "vote_average": 8.301,
                "vote_count": 15446,
                "character": "Client #1",
                "credit_id": "5ec6946e5a5ed0002043d89e",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert A. LaSardo",
            "Robert La Sardo",
            "Robert Lassardo",
            "رابرت لاساردو"
        ],
        "biography": "Robert LaSardo is an American character actor and former Navy sailor.\n\nHe began his career studying at the High School of Performing Arts in New York City where he became an honors student, before going on to the Stella Adler Studio of Acting. He spent four years in the U.S. Navy. For two of those years, he handled Navy attack dogs in the Aleutian Islands.\n\nHe started his acting career in 1987 with the independent film China Girl by Abel Ferrara. After several smaller roles he appeared in such TV series as The X-Files, CSI: Miami, and Nip/Tuck, most often playing bad guys, in particular drug dealers or gang leaders. He also appeared in feature films as bad guys in several movies, including Waterworld and The Mule.\n\nHe has appeared often in independent horror movies, such as in The Human Centipede 3 (Final Sequence), Autopsy, and Parlor. In 2020, he appeared in Hope for the Holidays with Sally Kirkland.\n\nIn December 2021, it was reported that he has been cast in The Legend of Jack and Diane, a feature film described as a female-led revenge thriller written and directed by Bruce Bellocchi, starring Tom Sizemore, Lydia Zelmac, David Tomlinson and Carlo Mendez. The film's producers include Bellocchi, and filming began in Los Angeles on January 17, 2022.\n\nDue to his work in the Navy, he supports USA Cares, an organization that supports families of soldiers.\n\n​From Wikipedia, the free encyclopedia.",
        "birthday": "1963-09-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 65831,
        "imdb_id": "nm0489436",
        "known_for_department": "Acting",
        "name": "Robert LaSardo",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.7749,
        "profile_path": "/maezwGo8JUbjECLB6VZJPtGvn1B.jpg"
    }
}