{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ubICMSUij3ntP9BjnQsV3rTVnAF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 783,
                "original_language": "en",
                "original_title": "Gandhi",
                "overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
                "popularity": 4.3456,
                "poster_path": "/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
                "release_date": "1982-12-01",
                "title": "Gandhi",
                "video": false,
                "vote_average": 7.557,
                "vote_count": 2390,
                "character": "Advocate General",
                "credit_id": "55f75cbe92514103b600629b",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nSir John Selby Clements, CBE (25 April 1910 – 6 April 1988) was an English actor and producer who worked in theatre, television and film.\n\nClements attended St Paul's School and St John's College, Cambridge University then worked with Nigel Playfair and afterwards spent a few years in Ben Greet's Shakespearean Company. He made his first stage appearance in 1930. Clements founded the Intimate Theatre at Palmers Green in 1935, which is a combined repertory and try-out theatre. He appeared in almost 200 plays, and presented a number of plays in the West End as actor-manager-producer. He also started his film work in 1933. Clements was the artistic director of the Chichester Festival Theatre from 1966 to 1973.\n\nHe married the actress Kay Hammond and together they became a critical success on stage with their West End revival of Noel Coward's play Private Lives in 1945. In 1952 they both appeared in Clements' own play The Happy Marriage, an adaptation of Jean-Bernard Luc's Le Complexe de Philemon. Clements starred as Edward Moutlon Barrett in the musical Robert and Elizabeth, a successful adaptation of The Barretts of Wimpole Street. His stepson is the actor John Standing.\n\nAs a film actor John Clements came to prominence when the film director Victor Saville chose him to star opposite Ralph Richardson in South Riding (1938). The two actors were reunited in the very successful The Four Feathers (1939). After this Clements' film career was somewhat intermittent although he made a series of British war films for Ealing Studios and British Aviation Pictures, such as Convoy (1940), Ships with Wings (1942), Tomorrow We Live (1943), and as Yugoslav guerrilla leader Milosh Petrovitch in Undercover (1943). He had a cameo role (as Advocate General) in Gandhi (1982).\n\nClements was made a Commander of the British Empire (CBE) in 1956 and knighted in 1968.\n\nDescription above from the Wikipedia article John Clements, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1910-04-25",
        "deathday": "1988-04-06",
        "gender": 2,
        "homepage": null,
        "id": 65851,
        "imdb_id": "nm0166234",
        "known_for_department": "Acting",
        "name": "John Clements",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1226,
        "profile_path": "/bZDN08dAUkdYljFpTFXizXXfnQB.jpg"
    }
}