{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/npLwIeUobjVCM4fLfdeLqQhAoey.jpg",
                "genre_ids": [
                    28
                ],
                "id": 9461,
                "original_language": "en",
                "original_title": "Enter the Dragon",
                "overview": "A martial artist agrees to spy on a reclusive crime lord using his invitation to a tournament there as cover.",
                "popularity": 6.8884,
                "poster_path": "/fyrh2ULEcmLpGTVLPQqFW45hqr5.jpg",
                "release_date": "1973-08-17",
                "title": "Enter the Dragon",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 1987,
                "character": "Han",
                "credit_id": "52fe44fac3a36847f80b5711",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Siak Kin",
            "Sek Kin",
            "Sheck Kin",
            "Shih Chien",
            "Shek Kin",
            "Kien Shih",
            "Shih Kien",
            "Sek Gin",
            "Shih Kin",
            "石堅",
            "石坚",
            "Wing-Cheung Shek",
            "石荣璋",
            "奸人坚",
            "شک کین",
            "سک کین"
        ],
        "biography": "Shih Kien (Chinese: 石堅, 1 January 1913 – 3 June 2009), also known as Shek Wing-cheung, Sek Gin, or Shek Kin, was a Hong Kong–based Chinese actor and martial artist. He was born on January 1, 1913 in Shigang, Guangzhou, China and died on June 3, 2009 in Hong Kong.\n\nSek Kin began his career in the film industry in 1939 as a make-up artist. He made his acting debut in 1940 with the film \"Flower in a Sea of Blood\". In the 1950s and 1960s, he became well-known for his roles as villains in kung fu films. He appeared in many popular films of this era, including the \"Wong Fei Hung\" series, the \"Fong Sai Yuk\" series, and \"Buddha's Palm\".\n\nIn 1973, Sek Kin starred opposite Bruce Lee in the film \"Enter the Dragon\". He played the role of Han, the main villain of the film. Sek Kin's performance in \"Enter the Dragon\" was critically acclaimed and he is considered to be one of the greatest villains in kung fu cinema.\n\nIn the 1970s and 1980s, Sek Kin continued to act in both films and television series. He also began to work as a production manager on films. In 1996, he was honored with the Lifetime Achievement Award of the Hong Kong Film Critics' Association. In 2003, he was given the Professional Achievement Award at the Hong Kong Film Awards.\n\nSek Kin died on June 3, 2009 at the age of 96. He was a highly respected actor who made a significant contribution to the Hong Kong film industry. He is remembered for his iconic roles as villains in kung fu films and for his groundbreaking work in the early days of Hong Kong cinema.",
        "birthday": "1913-01-01",
        "deathday": "2009-06-03",
        "gender": 2,
        "homepage": null,
        "id": 65971,
        "imdb_id": "nm0793384",
        "known_for_department": "Acting",
        "name": "Sek Kin",
        "place_of_birth": "Canton, China",
        "popularity": 0.5941,
        "profile_path": "/aFf4n1OvDtCgrI4i3dNJktAaHkv.jpg"
    }
}