{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjlg8Gq3TAWlFSUxh7Icey8uM4P.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 10653,
                "original_language": "en",
                "original_title": "The Seven Year Itch",
                "overview": "With his family away for their annual summer holiday, a publishing executive decides to live a bachelor's life. The beautiful but ditzy blonde from the apartment above catches his eye and they soon start spending time together—maybe a little too much time!",
                "popularity": 1.7389,
                "poster_path": "/4oLqx0QbjWFzWtkxRmDLGH47CUJ.jpg",
                "release_date": "1955-06-03",
                "title": "The Seven Year Itch",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 934,
                "character": "Tom MacKenzie",
                "credit_id": "52fe439c9251416c750172d5",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bowen Charlton \"Sonny\" Tufts III",
            "Bowen Charlton Tufts III"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nSonny Tufts (born Bowen Charlton Tufts III, July 16, 1911, Boston, Massachusetts - June 4, 1970, Santa Monica, California) was a United States film actor.\n\nTufts was born into a prominent banking family, whose patriarch had supposedly sailed to America from England in 1683. He broke with the family banking tradition by studying opera at Yale, where he was a member of Skull and Bones. After graduating from college in 1935, he auditioned with the Metropolitan Opera in New York but eventually worked on the Broadway stage. In 1942, Tufts went to Hollywood. He attained some fame during World War II, principally because, due to an old college football injury, he was one of the few handsome male actors not serving overseas in the war.\n\nHe was married to Spanish dancer Barbara Dare from 1938 to 1953.\n\nIn the 1980s he was best known as one of the semi-random people and places that TV host Johnny Carson used in his jokes.\n\nTufts died of pneumonia at age 58 in Santa Monica, California, on June 4, 1970.\n\nTufts is the subject of an urban legend. The legend holds that he had been selected to host a well-known radio show as a last-minute replacement for a better known celebrity. The week before Tufts's episode was scheduled, the previous host introduced him with a combination of surprise and outrage, shocked that a relatively unknown actor would succeed him as host. There is no evidence, however, that such an incident occurred. Tufts himself parodied this legend in frequent appearances on Rowan & Martin's Laugh-In: seated in a director's chair with his name printed on it, he would turn around to face the camera and utter a word or phrase relevant to the previous bit, in mock contempt.\n\nSonny Tufts was related to Charles Tufts, for whom Tufts University is named.\n\nIn a non sequitur on the cartoon show Rocky and His Friends, in the Jet Fuel Formula story arc, Bullwinkle J. Moose becomes very upset when Boris Badenov steals his autographed picture of Sonny Tufts.\n\nAlso, Tufts is mentioned in the last sentence of the third sketch of the 48th show of the second season of the Rocky and Bullwinkle Show (also featuring Wailing Whale episodes 5 & 6), which was first released on May 13, 1961.\n\nIn an episode of The Dick Van Dyke Show, Rob sees a flying saucer that makes a noise \"Uhny Uftz\", which Rob mis-hears as \"Sonny Tufts\"\n\nIn Episode 12, Season 1 of the TV sitcom \"My Mother The Car\", titled \"And Leave The Drive-In To Us,\" the mother wants to go to a drive-in to see Sonny Tufts for her birthday. He makes an appearance at the very end of the episode, much to the appreciation of the car!\n\nSonny Tufts was a brother of the Delta Kappa Epsilon fraternity (Phi chapter).\n\nDescription above from the Wikipedia article Sonny Tufts, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1911-07-16",
        "deathday": "1970-06-04",
        "gender": 2,
        "homepage": null,
        "id": 66075,
        "imdb_id": "nm0876211",
        "known_for_department": "Acting",
        "name": "Sonny Tufts",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.2,
        "profile_path": "/561ztT7kYXtxyrzjww6wUkALGlJ.jpg"
    }
}