{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/e7cTxDnHGQIozy0Os5r6HauL1Gz.jpg",
                "genre_ids": [
                    10402,
                    18,
                    35
                ],
                "id": 10654,
                "original_language": "en",
                "original_title": "Hair",
                "overview": "Upon receiving his draft notice and leaving his family ranch in Oklahoma, Claude heads to New York and befriends a tribe of long-haired hippies on his way to boot camp.",
                "popularity": 2.8456,
                "poster_path": "/z0ctToyPWCB2RgIkMpD6RhRKAeH.jpg",
                "release_date": "1979-03-15",
                "title": "Hair",
                "video": false,
                "vote_average": 7.278,
                "vote_count": 697,
                "character": "Lady in Pink",
                "credit_id": "52fe439c9251416c7501738d",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Charlotte Rae Lubotsky"
        ],
        "biography": "Charlotte Rae Lubotsky (April 22, 1926 – August 5, 2018) was an American actress and singer. On screen, Rae was best known for her portrayal of Edna Garrett in the sitcoms Diff'rent Strokes and its spin-off, The Facts of Life.\n\nShe was born to Russian Jewish immigrants Esther (née Ottenstein), who was a childhood friend of Israeli Prime Minister Golda Meir, and Meyer Lubotsky, a retail tire business owner. She was one of three sisters, along with Miriam and the late Beverly (December 21, 1921 – June 2, 1998).\n\nShe graduated from Shorewood High School in 1944. For the first ten years or so of her life, Rae's family lived in Milwaukee, then moved to Shorewood, Wisconsin. She did radio work and was with the Wauwatosa Children's Theatre. At 16, she was an apprentice with the Port Players, a professional theater company that came for the summer to Milwaukee, with several established actors such as Morton DaCosta, who would eventually direct The Music Man on Broadway.\n\nRae attended Northwestern University, although she did not complete her studies, where she met Cloris Leachman, who many years later succeeded Rae on The Facts of Life for the show's last two seasons. At Northwestern she met several unknown stars and producers, including Agnes Nixon, Charlton Heston, Paul Lynde, Gerald Freedman, Claude Akins and songwriter Sheldon Harnick. When a radio personality told her that her last name wouldn't do, she dropped it, to her father's chagrin. She moved to New York City in 1948, where she performed in the theater and nightclubs. During her early years in New York, she worked at the Village Vanguard (alongside up-and-coming talents such as singer Richard Dyer-Bennet) and at the posh Blue Angel, home to budding talents Barbra Streisand, Mike Nichols and Elaine May. She moved to Los Angeles in 1974.",
        "birthday": "1926-04-22",
        "deathday": "2018-08-05",
        "gender": 1,
        "homepage": null,
        "id": 66071,
        "imdb_id": "nm0705989",
        "known_for_department": "Acting",
        "name": "Charlotte Rae",
        "place_of_birth": "Milwaukee, Wisconsin, USA",
        "popularity": 0.2434,
        "profile_path": "/9ZM9GjGHd8JuPH3l8SJn6w3jUnE.jpg"
    }
}