{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.66,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "The Infant Moses",
                "credit_id": "58aca8079251416f67000683",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fraser Heston",
            "Fraser C. Heston"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nFraser Clarke Heston (born February 12, 1955 in Los Angeles, California) is an American film director, film producer, screenwriter and actor. The son of actors Charlton Heston and Lydia Clarke, Fraser Clarke Heston was born in Los Angeles, California.\n\nFraser Heston's filmography includes Alaska and the 1990 version of Treasure Island which cast his father as Long John Silver. As a child, he also appeared as the infant Moses (his father played the grown Moses) in the Cecil B. DeMille epic The Ten Commandments.\n\nWhile in the process of writing Wind River, a romantic adventure novel about 19th-century fur trappers, Fraser was convinced by producer Martin Shafer to turn the story into a film script. Discovering that film-writing came naturally for him, 22-year-old Fraser wrote his first screenplay, The Mountain Men, for Columbia Pictures, which became the feature film.\n\nDescription above from the Wikipedia article Fraser Clarke Heston, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1955-02-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 66076,
        "imdb_id": "nm0381699",
        "known_for_department": "Directing",
        "name": "Fraser Clarke Heston",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.5205,
        "profile_path": "/pFuI7Wwj0eBx5Vhjfu6zP8DwKC8.jpg"
    }
}