{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/e7cTxDnHGQIozy0Os5r6HauL1Gz.jpg",
                "genre_ids": [
                    10402,
                    18,
                    35
                ],
                "id": 10654,
                "original_language": "en",
                "original_title": "Hair",
                "overview": "Upon receiving his draft notice and leaving his family ranch in Oklahoma, Claude heads to New York and befriends a tribe of long-haired hippies on his way to boot camp.",
                "popularity": 2.7797,
                "poster_path": "/z0ctToyPWCB2RgIkMpD6RhRKAeH.jpg",
                "release_date": "1979-03-15",
                "title": "Hair",
                "video": false,
                "vote_average": 7.28,
                "vote_count": 696,
                "character": "Jeannie Ryan",
                "credit_id": "52fe439c9251416c7501734b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/jkAr3eudvlHT3zs3EYH6i6lqQ6p.jpg",
                "genre_ids": [
                    878,
                    53,
                    9648
                ],
                "id": 63,
                "original_language": "en",
                "original_title": "Twelve Monkeys",
                "overview": "In the year 2035, convict James Cole reluctantly volunteers to be sent back in time to discover the origin of a deadly virus that wiped out nearly all of the earth's population and forced the survivors into underground communities. But when Cole is mistakenly sent to 1990 instead of 1996, he's arrested and locked up in a mental hospital. There he meets psychiatrist Dr. Kathryn Railly and the son of a famous virus expert who may hold the key to the Army of the 12 Monkeys; thought to be responsible for unleashing the killer disease.",
                "popularity": 7.8867,
                "poster_path": "/gt3iyguaCIw8DpQZI1LIN5TohM2.jpg",
                "release_date": "1995-12-29",
                "title": "Twelve Monkeys",
                "video": false,
                "vote_average": 7.601,
                "vote_count": 8698,
                "character": "Woman Cabbie",
                "credit_id": "540646dcc3a36816af003fb5",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Annie Golden (born October 19, 1951) is an American actress and singer.\n\nBorn in Brooklyn, New York, Golden began her career as the lead singer of The Shirts (which headlined CBGB's in the late seventies). During the early 90s she performed as part of the duo Golden Carillo with Frank Carillo. They released 3 albums, Fire in Newtown, Toxic Emotion, and Back for More. She then returned to The Shirts. Since then she has performed solo and with a band. She performs a revue of songs from her stage career along with originals called Annie Golden's Velvet Prison.\n\nWhile with The Shirts she was discovered by Miloš Forman who gave her a part in Hair. She has had featured roles on Cheers and Miami Vice. On Broadway, she has appeared in the 1977 revival of Hair, Leader of the Pack, Ah, Wilderness!, On the Town, and The Full Monty as well as the title role in the workshop of the short lived adaptation of Stephen King's novel, Carrie. She also played the role of Lynette \"Squeaky\" Fromme in Stephen Sondheim and John Weidman's musical Assassins in 1991. In 2007, she was hired as stand-by actress for the two comic villain roles in Broadway's Xanadu musical. Annie Golden was also the voice of Marina in the Don Bluth film The Pebble and the Penguin.\n\nGolden has the distinct honor of having appeared in three separate versions of Hair: a Broadway revival in 1977, the motion picture in 1979 and a special benefit performance concert in 2004. In recent years, she has been seen in commercials for Coinstar, in which she portrays The Tooth Fairy. Annie's trade mark is her over bite.\n\nShe appeared in the movie musical Temptation with actors Adam Pascal, Tony Award Winners Alice Ripley and Anika Noni Rose, and film actress Zoe Saldana and in 2009 had a small role in I Love You Phillip Morris, with actors Ewan McGregor and Jim Carrey, playing a simple woman requiring legal assistance.\n\nDescription above from the Wikipedia article Annie Golden, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1951-10-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 66094,
        "imdb_id": "nm0325390",
        "known_for_department": "Acting",
        "name": "Annie Golden",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.261,
        "profile_path": "/crqX10ztj8j1ETl3EY8BnpvAmiT.jpg"
    }
}