{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/egKntJKzEL6HgalIyQ0Q5cMmDOA.jpg",
                "genre_ids": [
                    53,
                    80,
                    9648
                ],
                "id": 65754,
                "original_language": "en",
                "original_title": "The Girl with the Dragon Tattoo",
                "overview": "Disgraced journalist Mikael Blomkvist investigates the disappearance of a weary patriarch's niece from 40 years ago. He is aided by the pierced, tattooed, punk computer hacker named Lisbeth Salander. As they work together in the investigation, Blomkvist and Salander uncover immense corruption beyond anything they have ever imagined.",
                "popularity": 5.8166,
                "poster_path": "/8bokS83zGdhaXgN9tjidUKmAftW.jpg",
                "release_date": "2011-12-14",
                "title": "The Girl with the Dragon Tattoo",
                "video": false,
                "vote_average": 7.377,
                "vote_count": 7286,
                "character": "Liv",
                "credit_id": "561e890bc3a3680e24000169",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Araceli Jover"
        ],
        "biography": "Araceli Jover was born in Melilla, a Spanish region. After living there for five years, her family was forced to move to Mallorca, in the Balearic Islands (Spain) because of her father's work as a soldier. She is the youngest of seven siblings, four sisters and three brothers.\n\nDuring her early years, she wanted to become a dancer. She began dancing at the age of 8. At 14 she dropped out of school and at 15 she won a scholarship from the Comité Hispano Norteamericano. Because of this, she left Spain and moved to New York City in order to continue to study at the School of American Ballet under Martha Graham. After two years and half in the United States, her career then moved on to becoming an actress sometime around 1995–1996. She had her first role in an episode of the TV show Women: Stories of Passion and starred in two international films Tango, and The Ballad of Johnny-Jane. After that, she did more work in TV, before making her first American film debut in Blade, in 1998, as Mercury; the vampire lover of Deacon Frost.",
        "birthday": "1971-02-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 66147,
        "imdb_id": "nm0431332",
        "known_for_department": "Acting",
        "name": "Arly Jover",
        "place_of_birth": "Melilla, Spain",
        "popularity": 0.4162,
        "profile_path": "/zmznPrQ9GSZwcOIUT0c3GyETwrP.jpg"
    }
}