{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oLsts7ct0NVkdYpx5rZg10MG6zh.jpg",
                "genre_ids": [
                    18
                ],
                "id": 489,
                "original_language": "en",
                "original_title": "Good Will Hunting",
                "overview": "Headstrong yet aimless, Will Hunting has a genius-level IQ but chooses to work as a janitor at MIT. When he secretly solves highly difficult graduate-level math problems, his talents are discovered by Professor Gerald Lambeau, who decides to help the misguided youth reach his potential. When Will is arrested for attacking a police officer, Professor Lambeau makes a deal to get leniency for him if he gets court-ordered therapy. Eventually, therapist Dr. Sean Maguire helps Will confront the demons that are holding him back.",
                "popularity": 13.8953,
                "poster_path": "/z2FnLKpFi1HPO7BEJxdkv6hpJSU.jpg",
                "release_date": "1997-12-05",
                "title": "Good Will Hunting",
                "video": false,
                "vote_average": 8.157,
                "vote_count": 13095,
                "character": "Billy McBride",
                "credit_id": "52fe4249c3a36847f801266b",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/n2wlMpTuiovYCZHpwKtbSTY8Wor.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9567,
                "original_language": "en",
                "original_title": "Tears of the Sun",
                "overview": "Navy SEAL Lieutenant A.K. Waters and his elite squadron of tactical specialists are forced to choose between their duty and their humanity, between following orders by ignoring the conflict that surrounds them, or finding the courage to follow their conscience and protect a group of innocent refugees. When the democratic government of Nigeria collapses and the country is taken over by a ruthless military dictator, Waters, a fiercely loyal and hardened veteran is dispatched on a routine mission to retrieve a Doctors Without Borders physician.",
                "popularity": 5.701,
                "poster_path": "/fszAQ7bEuO3cLTXZUSXCas28MgE.jpg",
                "release_date": "2003-03-07",
                "title": "Tears of the Sun",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 2467,
                "character": "James 'Red' Atkins",
                "credit_id": "52fe450bc3a36847f80b901d",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/jBz16NsAeKjpHNznl1EHlcr704P.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9571,
                "original_language": "en",
                "original_title": "Dazed and Confused",
                "overview": "The adventures of a group of Texas teens on their last day of school in 1976, centering on student Randall Floyd, who moves easily among stoners, jocks and geeks. Floyd is a star athlete, but he also likes smoking weed, which presents a conundrum when his football coach demands he sign a \"no drugs\" pledge.",
                "popularity": 3.7057,
                "poster_path": "/msG9awbLhVZwv1Eh9Ge7SofMexW.jpg",
                "release_date": "1993-09-24",
                "title": "Dazed and Confused",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 2142,
                "character": "Benny",
                "credit_id": "5babd3050e0a2664d4029397",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "콜 하우저",
            "科尔·豪瑟",
            "کول هاوزر"
        ],
        "biography": "Cole Kenneth Hauser (born March 22, 1975) is an American film and television actor. He's best known for his movie roles as Col. Stevens in Transcendence, Roma in Olympus Has Fallen, Mike Collins in A Good Day to Die Hard, William Cartwright in Tyler Perry's The Family That Preys, Lupus Grobowski in The Break-up, Carter Verone in 2 Fast 2 Furious, James 'Red' Atkins in Tears of the Sun, Staff Sgt. Vic Bedford in Hart's War, William Johns in Pitch Black, Billy McBride in Good Will Hunting, Benny O'Donnell in Dazed and Confused, and Jack Connors in School Ties.\n\nHis best known TV roles are as Rip Wheeler on Paramount TV's western drama Yellowstone, Charlie Siringo on Lifetime TV's The Lizzie Borden Chronicles, Ethan Kelly on Audience Network's drama Rogue, US Marshall Jimmy Godfrey on NBC's drama Chase, and Officer Randy Willitz on ABC's police drama High Incident.\n\nHis paternal grandfather was Dwight Hauser, a screenwriter, actor and film producer. His maternal grandfather was Milton Sperling, a screenwriter and film producer for 20th Century Fox and Warner Bros. His great-grandfather was Harry Warner, who was a studio executive, one of the founders of Warner Bros.(with his 3 younger brothers), and a major contributor to the development of the film industry.",
        "birthday": "1975-03-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 6614,
        "imdb_id": "nm0369513",
        "known_for_department": "Acting",
        "name": "Cole Hauser",
        "place_of_birth": "Santa Barbara, California, USA",
        "popularity": 2.1304,
        "profile_path": "/5D1nCd0Lcm3HgOWFDinEN40DNoW.jpg"
    }
}