{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k4renoGJzagylgBYWbpjQLYGAfB.jpg",
                "genre_ids": [
                    27,
                    9648,
                    18
                ],
                "id": 361292,
                "original_language": "en",
                "original_title": "Suspiria",
                "overview": "A darkness swirls at the center of a world-renowned dance company, one that will engulf the artistic director, an ambitious young dancer, and a grieving psychotherapist. Some will succumb to the nightmare. Others will finally wake up.",
                "popularity": 8.2212,
                "poster_path": "/bRpKFPb8CWKRQxVo9NzOuPPlO3Q.jpg",
                "release_date": "2018-10-26",
                "title": "Suspiria",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 2646,
                "character": "Miss Huller",
                "credit_id": "5a6a005c9251417763000040",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Renette Pauline Soutendijk"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nRenette Pauline Soutendijk, known as Renée Soutendijk, (born May 21, 1957 in The Hague) is a Dutch actress.\n\nShe was a favorite star of director Paul Verhoeven's films and is perhaps best known for her work in his 1980 release, Spetters.\n\nSoutendijk is the mother of actress Caro Lenssen.\n\nA former Olympic athlete in gymnastics, Amsterdam-born Renee Soutendijk began her film career in Germany. The blonde, powerfully built young actress scored a hit playing loose-cannon \"heroines\" in a brace of Paul Verhoeven-directed cult films, Spetters (1980) and The Fourth Man (1983). Soutendijk's first English-language assignment was as Eva Braun in the made-for-TV Inside the Third Reich. Her subsequent TV movie roles included Anna Mons in Peter the Great (1986) and Mrs. Simon Weisenthal in Murderers Among Us (1987). Ever seeking out off-the-beam film roles, Renee Soutendijk has also played the title character in Eve of Destruction (1991), her first American film.\n\nDescription above from the Wikipedia article Renée Soutendijk, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1957-05-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 66188,
        "imdb_id": "nm0816030",
        "known_for_department": "Acting",
        "name": "Renée Soutendijk",
        "place_of_birth": "The Hague, Netherlands",
        "popularity": 0.3515,
        "profile_path": "/3tNFGRfh0duFGbQgM65vAlDebHG.jpg"
    }
}