{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1XqIhsqnAozznGhxlGdI0GPcCro.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 423,
                "original_language": "en",
                "original_title": "The Pianist",
                "overview": "The true story of pianist Władysław Szpilman's experiences in Warsaw during the Nazi occupation. When the Jews of the city find themselves forced into a ghetto, Szpilman finds work playing in a café; and when his family is deported in 1942, he stays behind, works for a while as a laborer, and eventually goes into hiding in the ruins of the war-torn city.",
                "popularity": 8.4545,
                "poster_path": "/2hFvxCCWrTmCYwfy7yum0GKRi3Y.jpg",
                "release_date": "2002-09-17",
                "title": "The Pianist",
                "video": false,
                "vote_average": 8.381,
                "vote_count": 9679,
                "character": "Father",
                "credit_id": "52fe4241c3a36847f80101b7",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.7565,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "Pvt. Coke (uncredited)",
                "credit_id": "5460a3960e0a266177003b72",
                "order": 68
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "프랭크 핀레이",
            "Francis \"Frank\" Finlay",
            "Francis Finlay"
        ],
        "biography": "Frank received Academy Award, Golden Globe and BAFTA Award nominations for his performance as William Shakespeare’s Iago in Stuart Burge’s 1965 film of Laurence Olivier’s staging of Othello. He also won the Best Actor Award at the San Sebastian International Film Festival.\n\nHe later essayed the definitive screen portrayal of Alexandre Dumas’ musketeer Porthos in three movies for director Richard Lester: The Three Musketeers (1974), The Four Musketeers (1975) and The Return of the Musketeers (1989). Frank’s many other films include The Longest Day; Tony Richardson’s The Lonliness of the Long Distance Runner; Martin Ritt’s The Molly Maguires; Bob Clark’s Murder by Decree; Alan Bridges’ The Return of the Soldier (for which he recieved a BAFTA Award nomination); Franco Zeffrelli’s Sparrow; and Eric Styles’ Dreaming of Joseph Lees; and most recently Roman Polanski’s multi-award winning The Pianist and Norma Jewison’s The Statement.\n\nHis similarly extensive television projects have earned him two BAFTA Awards, for his performances in The Death of Adolf Hitler (starring as Hitler, with Rex Firkin directing); The Adventures of Don Quixote (as Sancho Panza, opposite Rex Harrison, for director Alvin Rakoff); the ground breaking Bouquet of Barbed Wire and Another Bouquet; 84 Charing Cross Road; and recently the critically acclaimed series The Sins. Born in Farnworth, Lancashire, Finlay had already begun performing on stage when he earned the Sir James Knott Scholarship at London’s Royal Academy of Dramatic Art (RADA). Since then he has led theatre companies in London and on Broadway.\n\nHe was made a Commander of the British Empire (CBE) in the 1984 New Year’s Honours List, and was presented with his CBE by the Queen in February1984.",
        "birthday": "1926-08-06",
        "deathday": "2016-01-30",
        "gender": 2,
        "homepage": "http://www.frankfinlay.net/",
        "id": 6637,
        "imdb_id": "nm0277975",
        "known_for_department": "Acting",
        "name": "Frank Finlay",
        "place_of_birth": "Farnworth, Lancashire, England, UK",
        "popularity": 0.4696,
        "profile_path": "/fO7CYAaGydu9d3s5numYRi1BRvL.jpg"
    }
}