{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rpsHpJj7FgnNBXhaO2KFthPwqH6.jpg",
                "genre_ids": [
                    10749,
                    18,
                    35
                ],
                "id": 200727,
                "original_language": "en",
                "original_title": "Love, Rosie",
                "overview": "Since the moment they met at age 5, Rosie and Alex have been best friends, facing the highs and lows of growing up side by side. A fleeting shared moment, one missed opportunity, and the decisions that follow send their lives in completely different directions. As each navigates the complexities of life, love, and everything in between, they always find their way back to each other - but is it just friendship, or something more?",
                "popularity": 6.6277,
                "poster_path": "/8Mf9GgyNv5jjLAAPGsom9skH2Du.jpg",
                "release_date": "2014-10-16",
                "title": "Love, Rosie",
                "video": false,
                "vote_average": 7.819,
                "vote_count": 6361,
                "character": "Sally",
                "credit_id": "52fe4c91c3a368484e1bcd3d",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Egerton started her acting career age six, following her older sister, Sophia to a local youth theatre, saying; \"The whole reason I'm acting now is because I wanted to be doing what my big sister was doing\". A year later, she appeared in a Royal Shakespeare Company musical production of The Secret Garden, playing Mary.\n\nEgerton's other film credits include Sarah in Driving Lessons (2006) alongside Rupert Grint, and Flora in Knife Edge (2008). Her role as Holly Goodfellow in the 2005 film Keeping Mum sparked controversy as she appeared topless at the age of 16. She was to appear as Katrina in Eragon, but the scenes which she featured in were removed from the final cut.\n\nEgerton starred as Princess Elenora in the TV children's series Sir Gadabout: The Worst Knight in the Land. In 2001, she starred as the \"young\" Morgaine in the TV mini series The Mists of Avalon. She has also appeared on stage - in the RSC's musical version of The Secret Garden.\n\nIn 2009 Egerton appears in the St Trinian's sequel, St. Trinian's II: The Legend of Fritton's Gold.\n\nIn 2010 it was confirmed that Egerton will play Guinevere in the new US Starz adaptation of Camelot. Also starring Joseph Fiennes, Eva Green and Jamie Campbell Bower.",
        "birthday": "1988-11-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 66442,
        "imdb_id": "nm0989182",
        "known_for_department": "Acting",
        "name": "Tamsin Egerton",
        "place_of_birth": "Hampshire, England, UK",
        "popularity": 0.6493,
        "profile_path": "/n7iso71As9F3H5LtESDjiqJ6e7s.jpg"
    }
}