{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d9hWzWeRYg7sIy3PeQgenL32qoV.jpg",
                "genre_ids": [
                    14,
                    18
                ],
                "id": 490,
                "original_language": "sv",
                "original_title": "Det sjunde inseglet",
                "overview": "When disillusioned Swedish knight Antonius Block returns home from the Crusades to find his country in the grips of the Black Death, he challenges Death to a chess match for his life. Tormented by the belief that God does not exist, Block sets off on a journey, meeting up with traveling players Jof and his wife, Mia, and becoming determined to evade Death long enough to commit one redemptive act while he still lives.",
                "popularity": 3.9964,
                "poster_path": "/wcZ21zrOsy0b52AfAF50XpTiv75.jpg",
                "release_date": "1957-02-16",
                "title": "The Seventh Seal",
                "video": false,
                "vote_average": 8.176,
                "vote_count": 3171,
                "character": "Death",
                "credit_id": "52fe4249c3a36847f80127dd",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nils Bengt Folke Ekerot was a Swedish actor and director. He had several important roles in Swedish films, but he became immortalized in 1957 when he starred in Ingmar Bergman's The Seventh Seal, portraying Death as a white-faced man in a black cloak, an archetype that has influenced the representation of Death in countless instances in film and other media since then. All in all Bengt Ekerot appeared in 35 feature films and directed 7 from 1940 to 1968.\n\n\"He was wrestled with the conditions of his hunger. He cried over his violent appetite. The demons destroyed his beauty.\" Erland Josephson on Bengt Ekerot in \"The Role\"(Book 1989)",
        "birthday": "1920-02-08",
        "deathday": "1971-11-26",
        "gender": 2,
        "homepage": null,
        "id": 6656,
        "imdb_id": "nm0252345",
        "known_for_department": "Acting",
        "name": "Bengt Ekerot",
        "place_of_birth": "Stockholm, Stockholms län, Sweden",
        "popularity": 0.5895,
        "profile_path": "/4UxoMzIdE9PR4THNr3U2PL17veu.jpg"
    }
}