{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d9hWzWeRYg7sIy3PeQgenL32qoV.jpg",
                "genre_ids": [
                    14,
                    18
                ],
                "id": 490,
                "original_language": "sv",
                "original_title": "Det sjunde inseglet",
                "overview": "When disillusioned Swedish knight Antonius Block returns home from the Crusades to find his country in the grips of the Black Death, he challenges Death to a chess match for his life. Tormented by the belief that God does not exist, Block sets off on a journey, meeting up with traveling players Jof and his wife, Mia, and becoming determined to evade Death long enough to commit one redemptive act while he still lives.",
                "popularity": 3.9964,
                "poster_path": "/wcZ21zrOsy0b52AfAF50XpTiv75.jpg",
                "release_date": "1957-02-16",
                "title": "The Seventh Seal",
                "video": false,
                "vote_average": 8.176,
                "vote_count": 3171,
                "character": "Mia",
                "credit_id": "52fe4249c3a36847f80127e1",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/BBVAUchYvkmPThVIqipgAfabfl.jpg",
                "genre_ids": [
                    18
                ],
                "id": 614,
                "original_language": "sv",
                "original_title": "Smultronstället",
                "overview": "Crotchety retired doctor Isak Borg travels from Stockholm to Lund, Sweden, with his pregnant and unhappy daughter-in-law, Marianne, in order to receive an honorary degree from his alma mater. Along the way, they encounter a series of hitchhikers, each of whom causes the elderly doctor to muse upon the pleasures and failures of his own life. These include the vivacious young Sara, a dead ringer for the doctor's own first love.",
                "popularity": 4.0207,
                "poster_path": "/iyTD2QnySNMPUPE3IedZQipSWfz.jpg",
                "release_date": "1957-08-28",
                "title": "Wild Strawberries",
                "video": false,
                "vote_average": 8.103,
                "vote_count": 1721,
                "character": "Sara",
                "credit_id": "52fe425ec3a36847f8018c63",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/sj2aZDetPE8RoOCAm5QJitCNfLr.jpg",
                "genre_ids": [
                    18
                ],
                "id": 797,
                "original_language": "sv",
                "original_title": "Persona",
                "overview": "A young nurse, Alma, is put in charge of Elisabeth Vogler: an actress who is seemingly healthy in all respects, but will not talk. As they spend time together, Alma speaks to Elisabeth constantly, never receiving any answer.",
                "popularity": 2.3167,
                "poster_path": "/v2KsLNChpT6vLf0YFhkJmAtGkNq.jpg",
                "release_date": "1966-10-18",
                "title": "Persona",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 2301,
                "character": "Alma",
                "credit_id": "52fe4278c3a36847f80210df",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Berit Elisabeth Andersson",
            "Биби Андерссон"
        ],
        "biography": "Berit Elisabet Andersson (November 11, 1935 – April 14, 2019) or better known professionally as Bibi Andersson (Swedish: [ˈbɪ̂bːɪ ˈânːdɛˌʂɔn]), was a Swedish actress who was best known for her frequent collaborations with filmmaker Ingmar Bergman\n\nHer artistic dreams came early in life and were further supported by her older sister Gerd Andersson who became a ballet dancer at the Royal Opera and made her acting debut in 1951. Bibi, on the other side, had to make do with bit parts and commercials. She debuted in Dum-Bom (1953), playing against Nils Poppe. Eventually, she was able to start at the Royal Dramatic Theatre's acting school in 1954. A brief relationship with Ingmar Bergman made her quit school and follow him to the Malmö city theatre, where he was a director, performing in plays by August Strindberg and Hjalmar Bergman. Bergman also gave her a small part in his comedy Smiles of a Summer Night (1955), and larger roles in his Wild Strawberries (1957) and The Seventh Seal (1957). From the the 1960s she got offers from abroad, with best result in I Never Promised You a Rose Garden (1977). During the civil war in Yugoslavia she has worked with several initiatives to give the people of Sarajevo theatre and other forms of culture.",
        "birthday": "1935-11-11",
        "deathday": "2019-04-14",
        "gender": 1,
        "homepage": null,
        "id": 6657,
        "imdb_id": "nm0000761",
        "known_for_department": "Acting",
        "name": "Bibi Andersson",
        "place_of_birth": "Kungsholmen, Stockholm, Stockholms län, Sweden",
        "popularity": 0.4056,
        "profile_path": "/6EGqmWOR3R3jv3IgrEZmCjTAVGv.jpg"
    }
}