{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mGBmiWmi7JqeTWnrPicRbkXcsuO.jpg",
                "genre_ids": [
                    99
                ],
                "id": 410718,
                "original_language": "en",
                "original_title": "Before the Flood",
                "overview": "A look at how climate change affects our environment and what society can do to prevent the demise of endangered species, ecosystems, and native communities across the planet.",
                "popularity": 1.0583,
                "poster_path": "/u0EfH2zsp6rLOvEKVvWGgzGRQn3.jpg",
                "release_date": "2016-10-21",
                "title": "Before the Flood",
                "video": false,
                "vote_average": 7.687,
                "vote_count": 798,
                "character": "Self (archive footage)",
                "credit_id": "5d116d720e0a261e56caa32e",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "앙겔라 메르켈",
            "Angela Dorothea Merkel ",
            "安格拉·默克尔"
        ],
        "biography": "Angela Dorothea Merkel (née Kasner; born 17 July 1954) is a German former politician and scientist who served as Chancellor of Germany from 2005 to 2021. A member of the Christian Democratic Union (CDU), she previously served as Leader of the Opposition from 2002 to 2005 and as Leader of the Christian Democratic Union from 2000 to 2018. Merkel was the first female chancellor of Germany. During her tenure as Chancellor, Merkel was frequently referred to as the de facto leader of the European Union (EU), the most powerful woman in the world, and since 2016 the leader of the free world.  Merkel was born in Hamburg in then-West Germany, moving to East Germany as an infant when her father, a Lutheran clergyman, received a pastorate in Perleberg. She obtained a doctorate in quantum chemistry in 1986 and worked as a research scientist until 1989. Merkel entered politics in the wake of the Revolutions of 1989, briefly serving as deputy spokeswoman for the first democratically elected Government of East Germany led by Lothar de Maizière. Following German reunification in 1990, Merkel was elected to the Bundestag for the state of Mecklenburg-Vorpommern. As the protégée of Chancellor Helmut Kohl, Merkel was appointed as Minister for Women and Youth in 1991, later becoming Minister for the Environment, Nature Conservation and Nuclear Safety in 1994. After the CDU lost the 1998 federal election, Merkel was elected CDU General Secretary, before becoming the party's first female leader and the first female Leader of the Opposition two years later, in the aftermath of a donations scandal that toppled Wolfgang Schäuble.\n\nFollowing the 2005 federal election, Merkel was appointed to succeed Gerhard Schröder as Chancellor of Germany, leading a grand coalition consisting of the CDU, its Bavarian sister party the Christian Social Union (CSU) and the Social Democratic Party of Germany (SPD). Merkel was the first woman to be elected as Chancellor, and the first Chancellor since reunification to have been raised in the former East Germany. At the 2009 federal election, the CDU obtained the largest share of the vote, and Merkel was able to form a coalition government with the Free Democratic Party (FDP). At the 2013 federal election, Merkel's CDU won a landslide victory with 41.5% of the vote and formed a second grand coalition with the SPD, after the FDP lost all of its representation in the Bundestag. At the 2017 federal election, Merkel led the CDU to become the largest party for the fourth time; Merkel formed a third grand coalition with the SPD and was sworn in for a joint-record fourth term as Chancellor on 14 March 2018. ...",
        "birthday": "1954-07-17",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.angela-merkel.de",
        "id": 66620,
        "imdb_id": "nm1361767",
        "known_for_department": "Acting",
        "name": "Angela Merkel",
        "place_of_birth": "Hamburg, Germany",
        "popularity": 0.1219,
        "profile_path": "/fjlqfSwhiRpwgsEtzJ8X004NpBw.jpg"
    }
}