{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mujUrk2diGe5vRCb3kdpHZeobRs.jpg",
                "genre_ids": [
                    53
                ],
                "id": 6145,
                "original_language": "en",
                "original_title": "Fracture",
                "overview": "A husband is on trial for the attempted murder of his wife, in what is seemingly an open/shut case for the ambitious district attorney trying to put him away. However, there are surprises for both around every corner, and, as a suspenseful game of cat-and-mouse is played out, each must manipulate and outwit the other.",
                "popularity": 9.9234,
                "poster_path": "/qNen8x5gaikjIg9CFihgxYcJwQe.jpg",
                "release_date": "2007-04-19",
                "title": "Fracture",
                "video": false,
                "vote_average": 7.261,
                "vote_count": 4093,
                "character": "Mrs. Lee Gardner",
                "credit_id": "6477b6740e29a200a65e94fe",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Кейт Кларк"
        ],
        "biography": "Kate Clarke starred in the Emmy Nominated Sophie Chase, won the ‘Best Actress’ Award for her role of Beth in Playground Girls and was nominated for ‘Best Actress’ at the Pixie Awards for the short film Lumina 12.  Before acting, Kate worked as a nurse in hospitals, nursing homes and home health care.  She grew up a tomboy playing every sport through high school and in a typical midwest family with hard working parents and a brother who was always (and still is!) finding new ways to annoy her.\n\nKate’s acting career began in her hometown of Minneapolis, Minnesota with the film 20/20 Vision starring along with Jesse Ventura.  “Jesse Ventura shares the screen with an extremely talented cast. Lead actress Kate Clarke is a beautiful, young talent.” -Star Tribune\n\nNext up, she appeared with Dave Attell in fellow Minnesotan and comedian, Mitch Hedberg’s Los Enchiladas!, a comedy favorite which screened at the Sundance Film Festival in Park City, Utah.\n\nAfter moving to Los Angeles, Kate’s performance in Playground Girls won her a ‘Best Actress’ Award and later screened at MOCA during the Basquiat Exhibit. “Kate has charisma and prescence and stands above this film with fire and originality.” -TNT\n\nIn Grace Kate tackles the difficult role of Gabby with ALS (Lou Gehrig’s Disease).  “Featuring incredible performances by its cast, especially the leads Kyle Ingleman and Kate Clarke, Grace is a raw, emotional journey that is both heartfelt and stirring.” -Tim Shively  Kate has taken on a variety of roles ranging from vampires to mothers to superheros to doctors.  In Grayson Kate kicks ass as Wonder Woman!  In USAF she is an Air Force Sergeant in Afghanistan.  In the comedy with Michael Jackson and Eric Roberts, Miss Cast Away, she is beauty pageant contestant Miss Iowa. Kate’s other credits include Street Kings, Hancock, Entourage and more.  Visit IMDb for a full list of credits.\n\nKate is currently living in Los Angeles with her better half and two dogs.  She is a published poet  and her artwork has shown in galleries around LA.  Her screenplay, Carney, won in Variety’s Jury of Peers Screenplay Competition and she most recently joined in on some Improv at the Upright Citizens Brigade. Visit her Blog for the latest and personal info.",
        "birthday": "1970-12-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 66635,
        "imdb_id": "nm0164841",
        "known_for_department": "Acting",
        "name": "Kate Clarke",
        "place_of_birth": "Minneapolis, Minnesota, USA",
        "popularity": 0.1326,
        "profile_path": "/smJyZJOI7b7q6BDUUrIw82Nx4JW.jpg"
    }
}