{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gkXL5ka6ciU4A4KYSvLIAXtvh7k.jpg",
                "genre_ids": [
                    53,
                    18,
                    27
                ],
                "id": 10242,
                "original_language": "en",
                "original_title": "What Ever Happened to Baby Jane?",
                "overview": "A former child star torments her paraplegic sister in their decaying Hollywood mansion.",
                "popularity": 3.7595,
                "poster_path": "/msGYzyWwtjAaA3DScdgmvJ5MReG.jpg",
                "release_date": "1962-10-31",
                "title": "What Ever Happened to Baby Jane?",
                "video": false,
                "vote_average": 7.904,
                "vote_count": 1103,
                "character": "Marty McDonald",
                "credit_id": "52fe43479251416c7500a62f",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/of6OQnsvPHXEASczrBc3nVsMZ7q.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10774,
                "original_language": "en",
                "original_title": "Network",
                "overview": "When veteran anchorman Howard Beale is forced to retire his 25-year post because of his age, he announces to viewers that he will kill himself during his farewell broadcast. Network executives rethink their decision when his fanatical tirade results in a spike in ratings.",
                "popularity": 3.8792,
                "poster_path": "/gZ8hhuVEQ78CLND09trZJ45Eiy8.jpg",
                "release_date": "1976-11-14",
                "title": "Network",
                "video": false,
                "vote_average": 7.812,
                "vote_count": 1878,
                "character": "Nelson Chaney",
                "credit_id": "52fe43b49251416c7501aef3",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/bhEJZ6XH1B9ld97OWppdAnvWzl5.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11165,
                "original_language": "en",
                "original_title": "Tora! Tora! Tora!",
                "overview": "In the summer of 1941, the United States and Japan seem on the brink of war after constant embargos and failed diplomacy come to no end. \"Tora! Tora! Tora!\", named after the code words used by the lead Japanese pilot to indicate they had surprised the Americans, covers the days leading up to the attack on Pearl Harbor, which plunged America into the Second World War.",
                "popularity": 3.337,
                "poster_path": "/c311sN931DixuZRer0JGYCwpx9N.jpg",
                "release_date": "1970-01-26",
                "title": "Tora! Tora! Tora!",
                "video": false,
                "vote_average": 7.149,
                "vote_count": 566,
                "character": "Lt. Commander Alwin D. Kramer",
                "credit_id": "52fe44059251416c750264d3",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/sgsW7aqUXg4jG2GcoLKotSvp807.jpg",
                "genre_ids": [
                    18
                ],
                "id": 24226,
                "original_language": "en",
                "original_title": "The Verdict",
                "overview": "Frank Galvin is a down-on-his-luck lawyer and reduced to drinking and ambulance chasing, when a former associate reminds him of his obligations in a medical malpractice suit by serving it to Galvin on a silver platter—all parties are willing to settle out of court. Blundering his way through the preliminaries, Galvin suddenly realizes that the case should actually go to court—to punish the guilty, to get a decent settlement for his clients... and to restore his standing as a lawyer.",
                "popularity": 4.6861,
                "poster_path": "/m3DdNJZfBcsTiFe0SwsLChWavrG.jpg",
                "release_date": "1982-12-08",
                "title": "The Verdict",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 674,
                "character": "Dr. Towler",
                "credit_id": "52fe448bc3a368484e028c69",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Wesley Addy (August 4, 1913 – December 31, 1996) was an American actor.\n\nHe played many roles on the Broadway stage, including several Shakespearean ones, usually opposite actor Maurice Evans. After playing two roles in one of Evans's productions of Hamlet, he played Horatio opposite Evans's Hamlet in a 1953 Hallmark Hall of Fame television production of the work, the most prestigious American production of the play seen on TV up to that time.\n\nAlso on television he played roles on The Edge of Night in the 1950s. Later, during the 1970s-1980s, he played publisher Bill Woodard on Ryan's Hope and patriarch Cabot Alden on the Agnes Nixon-Douglas Marland serial Loving. In motion pictures, Addy's career spanned four decades. Robert Aldrich used him as supporting actor in several pictures, such as Kiss Me Deadly, The Big Knife (both 1955), What Ever Happened to Baby Jane? (1962), Hush... Hush, Sweet Charlotte (1964) and The Grissom Gang (1971). In 1976, Addy appeared in Paddy Chayefsky's Network, directed by Sidney Lumet. They would work together again in The Verdict., in which Addy played a doctor who nearly derails Paul Newman's case against a hospital for malpractice. Another of Addy's best-remembered roles was that of Lt. Cdr. Alvin Kramer, who unsuccessfully tries to warn American officials of the impending attack on Pearl Harbor in Tora! Tora! Tora!.\n\nAddy was born as Robert Wesley Addy in Omaha, Nebraska and died in Danbury, Connecticut. He was married to actress Celeste Holm from 1961 until his death.\n\nDescription above from the Wikipedia article Wesley Addy, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1913-08-04",
        "deathday": "1996-12-31",
        "gender": 2,
        "homepage": null,
        "id": 66712,
        "imdb_id": "nm0011741",
        "known_for_department": "Acting",
        "name": "Wesley Addy",
        "place_of_birth": "Omaha, Nebraska, USA",
        "popularity": 0.8215,
        "profile_path": "/j0DmXhowoVNXR21jQy9QhTD8BOz.jpg"
    }
}