{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yInvVRrCmEypIt5hm0WvXkjxsQX.jpg",
                "genre_ids": [
                    10402,
                    18,
                    10749
                ],
                "id": 10784,
                "original_language": "en",
                "original_title": "Cabaret",
                "overview": "Inside the Kit Kat Club of 1931 Berlin, starry-eyed singer Sally Bowles and an impish emcee sound the clarion call to decadent fun, while outside a certain political party grows into a brutal force.",
                "popularity": 2.5415,
                "poster_path": "/fMhOeJ2TvuY46iYGmsowhgRXfnr.jpg",
                "release_date": "1972-02-13",
                "title": "Cabaret",
                "video": false,
                "vote_average": 7.431,
                "vote_count": 924,
                "character": "Sally Bowles",
                "credit_id": "52fe43b69251416c7501b3e1",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/npoUm3stzUM2lR46ClLDwBZDaeZ.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 262,
                "original_language": "en",
                "original_title": "The King of Comedy",
                "overview": "Aspiring comic Rupert Pupkin attempts to achieve success in show business by stalking his idol, a late night talk-show host who craves his own privacy.",
                "popularity": 4.1987,
                "poster_path": "/3BM78deUfeZfShqPTblZuamgC8a.jpg",
                "release_date": "1982-12-18",
                "title": "The King of Comedy",
                "video": false,
                "vote_average": 7.784,
                "vote_count": 2452,
                "character": "Liza Minnelli",
                "credit_id": "653079e61fb94f00ad7effa5",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Liza May Minnelli (born March 12, 1946) is an American actress, singer, dancer, and choreographer. Known for her commanding stage presence and powerful alto singing voice, Minnelli is among a rare group of performers awarded an Emmy, Grammy (Grammy Legend Award), Oscar, and Tony (EGOT). Minnelli is a Knight of the French Legion of Honour.\n\nDaughter of actress and singer Judy Garland and director Vincente Minnelli, Minnelli was born in Los Angeles, spent part of her childhood in Scarsdale, New York, and moved to New York City in 1961 where she began her career as a musical theatre actress, nightclub performer, and traditional pop music artist. She made her professional stage debut in the 1963 Off-Broadway revival of Best Foot Forward and received the Tony Award for Best Actress in a Musical for starring in Flora the Red Menace in 1965, which marked the start of her lifelong collaboration with John Kander and Fred Ebb. They wrote, produced or directed many of Minnelli's future stage acts and television series and helped create her stage persona of a stylized survivor, including her career-defining performances of anthems of survival (\"New York, New York\", \"Cabaret\", and \"Maybe This Time\"). Along with her roles on stage and screen, this persona and her style of performance contributed to Minnelli's status as an enduring gay icon.\n\nAn acclaimed performance in the drama film The Sterile Cuckoo (1969) marked a film breakthrough for Minnelli and brought her a nomination for the Academy Award for Best Actress. She later received the award for her performance as Sally Bowles in the musical film Cabaret (1972), which brought her to international prominence. Most of her following films, including Lucky Lady (1975), New York, New York (1977), Rent-a-Cop (1988), and Stepping Out (1991), were not as successful, aside from the major box office hit and critically lauded Arthur (1981) which starred Minnelli. She was nominated for a Golden Globe for Best Actress in a Motion Picture – Musical or Comedy for Lucky Lady, New York, New York and Arthur. She returned to Broadway on a number of occasions, including The Act (1977), for which she received her second Tony Award, as well as The Rink (1984) and Liza's at The Palace.... (2008). Minnelli has also worked on various television formats and has predominantly focused on music hall and nightclub performances since the late 1970s. Her concert performances at Carnegie Hall in 1979 and 1987 and at Radio City Music Hall in 1991 and 1992 are recognized among her most successful. From 1988 to 1990, she toured with Frank Sinatra and Sammy Davis Jr. in Frank, Liza & Sammy: The Ultimate Event.",
        "birthday": "1946-03-12",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.lizaminnelli.com",
        "id": 66776,
        "imdb_id": "nm0591485",
        "known_for_department": "Acting",
        "name": "Liza Minnelli",
        "place_of_birth": "Hollywood, California, USA",
        "popularity": 0.4975,
        "profile_path": "/6jwPCLoeJasBMOFfY3HdqlXclZF.jpg"
    }
}