{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lHx9jigYO4tIUiZV3v6PSDJFkIR.jpg",
                "genre_ids": [
                    35
                ],
                "id": 10794,
                "original_language": "en",
                "original_title": "The Party",
                "overview": "Hrundi V. Bakshi, an accident-prone actor from India, is accidentally put on the guest list for an upcoming party at the home of a Hollywood film producer. Unfortunately, from the moment he arrives, one thing after another goes wrong with compounding effect.",
                "popularity": 2.5026,
                "poster_path": "/8d2Msw39YzwkBWfBMauCulp7D0.jpg",
                "release_date": "1968-04-04",
                "title": "The Party",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 804,
                "character": "Michele Monet",
                "credit_id": "52fe43b89251416c7501b7e3",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Claudine Georgette Longet (born January 29, 1942, Height 5 ft 3 in [1.60 m]) is a Franco-American singer, actress, dancer, and recording artist who rose to prominence during the 1960s and 1970s. She captivated audiences with her talent and beauty, leaving a lasting mark on the entertainment industry.  Born in Paris, France, Longet started her career as a dancer and model before transitioning to acting. Her first acting roles were in television shows like McHale's Navy and The Andy Williams Show. In 1964, she appeared in the film adaptation of McHale's Navy, further expanding her reach.\n\nIn 1961, Longet married American singer and television personality Andy Williams. This marriage opened doors for her musical career, and she began recording albums and appearing on The Andy Williams Show. Her music, primarily pop and bossa nova, gained traction, with hits like \"Meditation\" and \"A Man and a Woman.\"\n\nLonget enjoyed a close friendship with Robert F. Kennedy and his wife, Ethel Kennedy. This association, coupled with her marriage to Andy Williams, placed her in the spotlight of American society. However, her life took a tragic turn in 1976 when she was convicted of negligent homicide in the shooting death of her boyfriend, former Olympic skier Spider Sabich.\n\nOn March 21, 1976, Claudine Longet shot her boyfriend, Olympic skier Vladimir \"Spider\" Sabich, at his home in Aspen, Colorado. The details surrounding the incident remain somewhat unclear, but Longet claimed the shooting was accidental, stating the gun went off while she was trying to unload it.\n\nAfter a lengthy trial, the jury found Longet guilty of negligent homicide, a lesser charge than initially presented. She was sentenced to pay a small fine and serve 30 days in jail, which the judge allowed her to choose at her own convenience.\n\nShe married businessman Ronald D. Austin in 1985 and has largely remained out of the public eye.\n\nDespite the controversy surrounding her personal life, Claudine Longet's talent and accomplishments stand out. Her music continues to be enjoyed by fans, and her legacy as a multi-talented entertainer remains intact.",
        "birthday": "1942-01-29",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 66834,
        "imdb_id": "nm0519296",
        "known_for_department": "Acting",
        "name": "Claudine Longet",
        "place_of_birth": "Paris, France",
        "popularity": 0.2496,
        "profile_path": "/gKK7jth0H2hM14CyaIarSSFFaLl.jpg"
    }
}