{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/maeox8nZYIxAAE4SdyLA0VOXe1x.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14
                ],
                "id": 13179,
                "original_language": "en",
                "original_title": "Tinker Bell",
                "overview": "Journey into the secret world of Pixie Hollow and hear Tinker Bell speak for the very first time as the astonishing story of Disney's most famous fairy is finally revealed in the all-new motion picture \"Tinker Bell.\"",
                "popularity": 7.0695,
                "poster_path": "/3Ma0r1n8kfH7UaQMS7bJ9KsYUjT.jpg",
                "release_date": "2008-09-11",
                "title": "Tinker Bell",
                "video": false,
                "vote_average": 6.903,
                "vote_count": 1504,
                "character": "Iridessa (voice)",
                "credit_id": "52fe45499251416c7505165d",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/2AeE4Op9qjDSXe8GbfCtlbHFxhL.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    12
                ],
                "id": 75258,
                "original_language": "en",
                "original_title": "Secret of the Wings",
                "overview": "Tinkerbell wanders into the forbidden Winter woods and meets Periwinkle. Together they learn the secret of their wings and try to unite the warm fairies and the winter fairies to help Pixie Hollow.",
                "popularity": 6.3828,
                "poster_path": "/5q72GagtB9NM4i3z7M40EXLb3ut.jpg",
                "release_date": "2012-08-17",
                "title": "Secret of the Wings",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1316,
                "character": "Iridessa (voice)",
                "credit_id": "52fe48f9c3a368484e114219",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/vcLpxfpfKCKGiTlUx83CzKxRDT2.jpg",
                "genre_ids": [
                    16,
                    10751
                ],
                "id": 175112,
                "original_language": "en",
                "original_title": "Tinker Bell and the Pirate Fairy",
                "overview": "Zarina, a smart and ambitious dust-keeper fairy who’s captivated by Blue Pixie Dust and its endless possibilities, flees Pixie Hollow and joins forces with the scheming pirates of Skull Rock, who make her captain of their ship. Tinker Bell and her friends must embark on an epic adventure to find Zarina, and together they go sword-to-sword with the band of pirates led by a cabin boy named James, who’ll soon be known as Captain Hook himself.",
                "popularity": 7.4527,
                "poster_path": "/81oxrsugqqs8sAVNX9fdlz57cVU.jpg",
                "release_date": "2014-02-13",
                "title": "Tinker Bell and the Pirate Fairy",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1038,
                "character": "Iridessa (voice)",
                "credit_id": "5430f616c3a368114300123a",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/9s58ybtK5rj4QGmAtzOMzVeiY5P.jpg",
                "genre_ids": [
                    12,
                    16,
                    10751
                ],
                "id": 297270,
                "original_language": "en",
                "original_title": "Tinker Bell and the Legend of the NeverBeast",
                "overview": "An ancient myth of a massive creature sparks the curiosity of Tinker Bell and her good friend Fawn, an animal fairy who’s not afraid to break the rules to help an animal in need. But this creature is not welcome in Pixie Hollow — and the scout fairies are determined to capture the mysterious beast, who they fear will destroy their home. Fawn must convince her fairy friends to risk everything to rescue the NeverBeast.",
                "popularity": 6.7127,
                "poster_path": "/3S0mmmpYStB3GqodRghcfOt81wQ.jpg",
                "release_date": "2014-12-12",
                "title": "Tinker Bell and the Legend of the NeverBeast",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1139,
                "character": "Iridessa (voice)",
                "credit_id": "54dfc808925141195a003c8c",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raven-Symoné Pearman",
            "Raven Symoné",
            "Raven Symone",
            "Raven",
            "Raven-Symone",
            "Raven Pearman",
            "Raven-Symoné Christina Pearman",
            "Raven S. Pearman",
            "Raven C. Pearman",
            "レイヴン=シモーネ",
            "ریون-سایمون"
        ],
        "biography": "Raven-Symoné Christina Pearman (born December 10, 1985 in Atlanta, Georgia), known professionally as Raven-Symoné, or simply Raven, is an American actress, singer, songwriter, comedian, dancer, television producer and model. Symone launched her successful career in 1989 after appearing in the show A Different World as Olivia. She released her debut album, Here's to New Dreams in 1993; the single, \"That's What Little Girls Are Made Of\" charted number sixty-eight on the US Billboard Hot 100.\n\nSymoné appeared in several successful television series, such as The Cosby Show and Hangin' with Mr. Cooper, on the mid to late 1980s and early 1990s. In 2003, Symone went on to star in the highly successful Disney Channel series, That's So Raven in which Symone starred as Raven Baxter, a psychic teenager who tried her best to keep her psychic powers a secret. Symone starred in the series from 2003 until 2007. Symone's co-stars of That's So Raven went onto appear in the follow up, Cory In the House; however, Symone did not feature permanently, as she only appeared as a guest in one episode. During her time on That's So Raven, Symone released her third studio album, This is My Time (2004) which was Symone's best selling solo album to date, charting at number fifty-one on the Billboard 200. In 2008, she followed up This Is My Time with the release of her fourth album, Raven-Symoné (2008), which charted at #159 on the Billboard charts.\n\nShe transitioned to a film career, starring in several films aimed at teenage audiences, including Dr. Dolittle (1998), Dr. Dolittle 2 (2001), College Road Trip (2008), and television movies successful, including The Cheetah Girls (2003), Cheetah Girls 2 (2006), Revenge of the Bridesmaids (2010). Raven has also lent her voice to the animated series Kim Possible, for the character Monique and films such as Disney‘s Tinker Bell. Raven-Symoné also owns a \"how-to\" video website, Raven-Symoné Presents.\n\nDescription above from the Wikipedia article Raven-Symoné, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1985-12-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 66896,
        "imdb_id": "nm0712368",
        "known_for_department": "Acting",
        "name": "Raven-Symoné",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.9772,
        "profile_path": "/76x0KF5bnkxeFaq5vx9rXylPGQZ.jpg"
    }
}