{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ljZOlqLtMa6gnTHcYn9y9lP0bK3.jpg",
                "genre_ids": [
                    18,
                    36,
                    53
                ],
                "id": 528949,
                "original_language": "es",
                "original_title": "El fotógrafo de Mauthausen",
                "overview": "Spanish photographer Francesc Boix, imprisoned in the Mauthausen-Gusen concentration camp, works in the SS Photographic Service. Between 1943 and 1945, he hides, with the help of other prisoners, thousands of negatives, with the purpose of showing the freed world the atrocities committed by the Nazis, exhaustively documented. He will be a key witness during the Nuremberg Trials.",
                "popularity": 4.1347,
                "poster_path": "/6b4L0uLVgFsDfqPx0sFZbCRwIKH.jpg",
                "release_date": "2018-10-26",
                "title": "The Photographer of Mauthausen",
                "video": false,
                "vote_average": 6.983,
                "vote_count": 721,
                "character": "Dolores",
                "credit_id": "5bd16a600e0a266174007510",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Macarena Gómez Traseira"
        ],
        "biography": "Macarena Gómez Traseira (born 2 February 1978) is a Spanish actress, known for her role of Lola in the current television series La que se avecina, aired on Telecinco. She is also known for her portrayal of mermaid-like priestess Uxía Cambarro in the 2001 horror movie Dagon and for her starring role in the 2008 comedy-horror film Sexykiller. She trained at Rose Bruford College Drama School in London.\n\nBy the end of 2013, right after the beginning of the new season of the soap opera La que se avecina, Macarena Gómez starts presenting TV-commercials for the Spanish banking group Bankia.\n\nIn June 2013, Macarena Gómez married musician and film director Aldo Comas. In 2016, Macarena Gomez has given a unique interview dedicated to all her Russian - speaking fans. the interview was given to Ukrainian horror writer Denis Bushlatov and was published in the biggest Russian horror magazine Darker.\n\n- IMDb Mini Biography By: ahmetkozan",
        "birthday": "1978-02-02",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.macarenagomez.es/en/",
        "id": 67052,
        "imdb_id": "nm1296762",
        "known_for_department": "Acting",
        "name": "Macarena Gómez",
        "place_of_birth": "Bujalance, Córdoba, Spain",
        "popularity": 0.4219,
        "profile_path": "/bv47XMjZUhptKGFKIEoVA8pVsMT.jpg"
    }
}