{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xt75NSIlfzwPwuBsuarB3i1mBxj.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 41428,
                "original_language": "ja",
                "original_title": "鉄男",
                "overview": "A \"metal fetishist\", driven mad by the maggots wriggling in the wound he's made to embed metal into his flesh, runs out into the night and is accidentally run down by a Japanese businessman and his girlfriend. The pair dispose of the corpse in hopes of quietly moving on with their lives. However, the businessman soon finds that he is now plagued by a vicious curse that transforms his flesh into iron.",
                "popularity": 3.3955,
                "poster_path": "/9RquCMBJ42Kq7ASBy0qcyVP0ugi.jpg",
                "release_date": "1989-07-01",
                "title": "Tetsuo: The Iron Man",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 655,
                "character": "Salaryman",
                "credit_id": "52fe45c9c3a36847f80da4ff",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tomoroo Taguchi",
            "Tomoro Taguchi",
            "Tomorô Taguchi",
            "田口 トモロヲ",
            "타구치 토모로오",
            "Tomoo Taguchi",
            "映☆画次郎",
            "تومورو تاگوچی"
        ],
        "biography": "Tomorowo Taguchi (born November 30, 1957) is a Japanese actor. After leaving Dokkyo University without graduating, he started to earn his living as an illustrator, writer and pornographic cartoonist. He joined a theatre called Hakken no Kai in 1978 and he made a screen debut in Zokubutsu Zukan (based on the book by Yasutaka Tsutsui) in 1982. He was also a prominent cult musician in the Tokyo underground scene with his band Bachikaburi in the 1980s and early 1990s.\n\nHe is probably most well known to the West as the lead actor in Tetsuo and Tetsuo II directed by Shinya Tsukamoto. He also makes regular appearances in Takashi Miike's films. He became known to the Japanese public as a narrator for the TV documentary series Project X - Challengers which aired between 2000 and 2005 by NHK. Taguchi directed Iden & Tity in 2003 and his second film, Shikisoku Generation, is scheduled for release in 2009.",
        "birthday": "1957-11-30",
        "deathday": null,
        "gender": 2,
        "homepage": "http://mash-info.com/profile/t_taguchi.html",
        "id": 67091,
        "imdb_id": "nm0846630",
        "known_for_department": "Acting",
        "name": "Tomorowo Taguchi",
        "place_of_birth": "Musashino, Tokyo, Japan",
        "popularity": 1.1243,
        "profile_path": "/8dyNOaOW9c9Qy2itA4haxJT4TN6.jpg"
    }
}