{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8rmx3Wh6fQdSL2nzTmdFn9thcK8.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 949423,
                "original_language": "en",
                "original_title": "Pearl",
                "overview": "Trapped on her family’s isolated farm, Pearl must tend to her ailing father under the bitter and overbearing watch of her devout mother. Lusting for a glamorous life like she’s seen in the movies, Pearl’s ambitions, temptations, and repressions collide.",
                "popularity": 8.286,
                "poster_path": "/z5uIG81pXyHKg7cUFIu84Wjn4NS.jpg",
                "release_date": "2022-09-16",
                "title": "Pearl",
                "video": false,
                "vote_average": 7.251,
                "vote_count": 2319,
                "character": "Father",
                "credit_id": "628722e52495ab004f8ecc46",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/kPKwqHl2rYsi9rFWJWA6afKdmlT.jpg",
                "genre_ids": [
                    18,
                    53,
                    37
                ],
                "id": 400090,
                "original_language": "en",
                "original_title": "The Nightingale",
                "overview": "In 1825, Clare, a 21-year-old Irish convict, chases a British soldier through the rugged Tasmanian wilderness, bent on revenge for a terrible act of violence he committed against her family. She enlists the services of an Aboriginal tracker who is also marked by trauma from his own violence-filled past.",
                "popularity": 3.1471,
                "poster_path": "/9nRpZmvdEgq8hMu1rNyc90XQtH6.jpg",
                "release_date": "2018-09-23",
                "title": "The Nightingale",
                "video": false,
                "vote_average": 7.059,
                "vote_count": 616,
                "character": "Davey",
                "credit_id": "5c503221c3a368477795a482",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Matt Sunderland"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nMatthew \"Matt\" Sunderland  (born c.1972) is a New Zealand actor. He performed the lead role of David Gray in the feature film Out of the Blue, based on the events of the Aramoana Massacre. At the New Zealand Screen Awards in 2008 he won Best Actor Award for this role.\n\nSunderland was also nominated for a Best Actor Award in the 2006 NZ Screen Awards for Natures Way, which screened In Competition at the Cannes Film Festival in 2006.\n\nHis other feature film roles include A Song of Good, Christmas, Stringer and Woodenhead as well as more than twenty short films.\n\nSunderland graduated from The New Zealand Drama School Toi Whakaari in 1997 and has concentrated on New Zealand film work with numerous theatre excursions also. He has appeared at the Silo Theatre (Fool for Love, Blasted), and the Herald Theatre (Trainspotting) in Auckland, and the Court Theatre in Christchurch (Peninsula) .\n\nSunderland appeared in the New Zealand soap opera Shortland Streets first official 90 minute episode as White Dragon in a storyline concluding the 3 year Kieran Mitchell story arc.\n\nDescription above from the Wikipedia article Matthew Sunderland, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://johnsonlaird.com/our-actors/Matthew-Sunderland",
        "id": 67119,
        "imdb_id": "nm0839146",
        "known_for_department": "Acting",
        "name": "Matthew Sunderland",
        "place_of_birth": null,
        "popularity": 0.0939,
        "profile_path": "/l98RIqtlmOGaNpo1gnprS2cxqaw.jpg"
    }
}