{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/H40nWdJngUc6gtytMAbElm9HOu.jpg",
                "genre_ids": [
                    18
                ],
                "id": 881,
                "original_language": "en",
                "original_title": "A Few Good Men",
                "overview": "When cocky military lawyer Lt. Daniel Kaffee and his co-counsel, Lt. Cmdr. JoAnne Galloway, are assigned to a murder case, they uncover a hazing ritual that could implicate high-ranking officials such as shady Col. Nathan Jessep.",
                "popularity": 5.3445,
                "poster_path": "/rLOk4z9zL1tTukIYV56P94aZXKk.jpg",
                "release_date": "1992-12-11",
                "title": "A Few Good Men",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 3874,
                "character": "Pfc. Louden Downey",
                "credit_id": "52fe4286c3a36847f8025dbf",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/g5G19q0xgkzWEvfcGo1KcL8nQOk.jpg",
                "genre_ids": [
                    18,
                    9648,
                    27
                ],
                "id": 1923,
                "original_language": "en",
                "original_title": "Twin Peaks: Fire Walk with Me",
                "overview": "In the questionable town of Deer Meadow, Washington, FBI Agent Desmond inexplicably disappears while hunting for the man who murdered a teen girl. The killer is never apprehended, and, after experiencing dark visions and supernatural encounters, Agent Dale Cooper chillingly predicts that the culprit will claim another life. Meanwhile, in the more cozy town of Twin Peaks, hedonistic beauty Laura Palmer hangs with lowlifes and seems destined for a grisly fate.",
                "popularity": 9.8063,
                "poster_path": "/rol5H6loAojd6tH2VXQYEXzGQk1.jpg",
                "release_date": "1992-06-03",
                "title": "Twin Peaks: Fire Walk with Me",
                "video": false,
                "vote_average": 7.392,
                "vote_count": 2083,
                "character": "James Hurley",
                "credit_id": "596bc93fc3a3684c7300435b",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Greenblatt",
            "Jim Greenblatt",
            "James Marchall",
            "James L. Marshall",
            "Jim Marshall",
            "James Marshall",
            "جیمز مارشال"
        ],
        "biography": "James Marshall (born January 2, 1967) is an American actor. He is best known for playing James Hurley in the cult television series Twin Peaks (1990–1991) and its 1992 prequel film Twin Peaks: Fire Walk with Me, as well as for his role as PFC Louden Downey in A Few Good Men (1992).\n\nHe has appeared in numerous other films, including Cadence (1990), Gladiator (1992), Hits! (1994), Vibrations (1995), All She Ever Wanted (1996), Criminal Affairs (1997), Soccer Dog: The Movie (1999), Luck of the Draw (2000), Down (2001) and Alien Lockdown (2004). He also provided the voice for Kurt in the video game Unlimited Saga. Marshall is married to actress Renee Griffin, with whom he has two sons. In summer 2010 Marshall sued the pharmaceutical company Hoffmann-LaRoche (a unit of Roche Holding AG) for $11 million in damages for injuries which, he claimed, resulted from his taking the drug Accutane.\n\nHe claimed he had suffered Accutane-related gastrointestinal distress so severe that it necessitated a four-month hospital stay, and the surgical removal of his colon. He asserted that these injuries had derailed his acting career. Stars Martin Sheen (a longtime family friend), Brian Dennehy, Esai Morales and Rob Reiner (Marshall's director on A Few Good Men) were to testify on his behalf. His health now substantially improved, Marshall has begun a new phase of his career, as a guitarist, songwriter and recording artist.\n\nDescription above from the Wikipedia article James Marshall (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1967-01-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 6717,
        "imdb_id": "nm0338614",
        "known_for_department": "Acting",
        "name": "James Marshall",
        "place_of_birth": "Queens, New York City, New York, USA",
        "popularity": 0.9907,
        "profile_path": "/ieK50VhhwNXx0rgOidaEG3JqrDT.jpg"
    }
}