{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 3367,
                "character": "Pawnbroker",
                "credit_id": "52fe48d7c3a368484e10d8f3",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/1z4auHDSf2Kh6OqOVmwbeWc2Jrn.jpg",
                "genre_ids": [
                    12,
                    10751,
                    18,
                    35
                ],
                "id": 8326,
                "original_language": "en",
                "original_title": "Holes",
                "overview": "A wrongfully convicted boy is sent to a brutal desert detention camp where he must dig holes in order to build character. What he doesn't know is that he is digging holes in order to search for a lost treasure hidden somewhere in the camp.",
                "popularity": 5.027,
                "poster_path": "/o2Dm2mcE1qW8vT0bpsJO5OMBbqa.jpg",
                "release_date": "2003-04-18",
                "title": "Holes",
                "video": false,
                "vote_average": 6.876,
                "vote_count": 1458,
                "character": "Igor Barkov",
                "credit_id": "5bb39b640e0a263e0200fe67",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kenneth Davitian",
            "Azamat Bagtov",
            "Azamat Baytoff",
            "Kevin Davitian",
            "John Lopez"
        ],
        "biography": "Kenneth \"Ken\" Davitian (born June 19, 1953) is an American actor who is best known for his role as Borat's producer (Azamat Bagatov) in the 2006 comedy film Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan, in which he speaks the Eastern dialect of Armenian throughout the film.\n\nKenneth Davitian was born in Los Angeles on June 19, 1953, to an Armenian American family from Montebello, California. His maternal grandparents were survivors of the Armenian genocide. His father was a Red Army soldier during World War II who was captured by Wehrmacht forces and placed at an Armenian Legion camp in Stuttgart, Germany. After the end of the war, he immigrated to the US through the efforts of restaurateur and chef George Mardikian, known for his philanthropy.\n\nDavitian graduated from Garfield High School in East Los Angeles and Whittier College. His teenage idol was Burt Reynolds, who greatly influenced his choice of becoming an actor. Davitian would go on to perform in the film Pocket Listing, which also featured Reynolds. Davitian worked in his father's waste management company. Davitian is fluent in Armenian; he speaks the language as Azamat in Borat.",
        "birthday": "1953-06-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 6734,
        "imdb_id": "nm0205772",
        "known_for_department": "Acting",
        "name": "Ken Davitian",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.6413,
        "profile_path": "/odykKQKSJDDJ5O5Drq1RVNaTbqM.jpg"
    }
}