{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iFPpb2KIWKwBfyqSJivE4JegFPP.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 10895,
                "original_language": "en",
                "original_title": "Pinocchio",
                "overview": "A little wooden puppet yearns to become a real boy.",
                "popularity": 8.2082,
                "poster_path": "/bnZJrLRnoQHpzEJdka1KYfsAF3N.jpg",
                "release_date": "1940-02-23",
                "title": "Pinocchio",
                "video": false,
                "vote_average": 7.098,
                "vote_count": 6060,
                "character": "Pinocchio / Alexander (voice) (uncredited)",
                "credit_id": "52fe43cb9251416c7501e6cb",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8482,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Richard Jones (uncredited)",
                "credit_id": "53ec5b670e0a2605da000edf",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Richard Percy Jones",
            "Dick Jones",
            "Dicky Jones"
        ],
        "biography": "Dickie Jones (February 25, 1927 – July 7, 2014) was American actor who achieved some success as a child and as a young adult, especially in B-Westerns and in television.  The son of a Texas newspaper editor, Jones was a prodigious horseman from infancy, billed at the age of four as the World's Youngest Trick Rider and Trick Roper. At the age of six, he was hired to perform riding and lariat tricks in the rodeo owned by western star Hoot Gibson. Gibson convinced young Jones and his parents that there was a place for him in Hollywood, and the boy and his mother went west. Gibson arranged for some small parts for the boy, whose good looks, energy, and pleasant voice quickly landed him more and bigger parts, both in low-budget Westerns and in more substantial productions. In 1940, he had one of his most prominent (although invisible) roles, as the voice of Pinocchio (1940) in Walt Disney's animated film of the same name. Jones attended Hollywood High School and, at 15, took over the role of Henry Aldrich on the hit radio show \"The Aldrich Family.\" He learned carpentry and augmented his income with jobs in that field. He served in the Army in Alaska during the final months of World War II. Gene Autry, who before the war had cast Jones in several Westerns, put him back to work in films and particularly in television, on programs produced by Autry's company. Now billed as Dick Jones, the handsome young man starred as Dick West, sidekick to the Western hero known as The Range Rider (1951), in a TV series that ran for 76 episodes in 1951 (and for decades in syndication). Then Autry gave Jones his own series, Buffalo Bill, Jr. (1955), which ran for 40 episodes. Jones continued working in films throughout the 1950s, then retired and entered the business world.",
        "birthday": "1927-02-25",
        "deathday": "2014-07-07",
        "gender": 2,
        "homepage": null,
        "id": 67371,
        "imdb_id": "nm0427934",
        "known_for_department": "Acting",
        "name": "Dickie Jones",
        "place_of_birth": "Snyder, Texas, USA",
        "popularity": 0.3347,
        "profile_path": "/ingaYYtcJZoiMtfXNTgABzPl5nu.jpg"
    }
}