{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iFPpb2KIWKwBfyqSJivE4JegFPP.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 10895,
                "original_language": "en",
                "original_title": "Pinocchio",
                "overview": "A little wooden puppet yearns to become a real boy.",
                "popularity": 7.8349,
                "poster_path": "/bnZJrLRnoQHpzEJdka1KYfsAF3N.jpg",
                "release_date": "1940-02-23",
                "title": "Pinocchio",
                "video": false,
                "vote_average": 7.099,
                "vote_count": 6062,
                "character": "Lampwick (voice) (uncredited)",
                "credit_id": "52fe43cb9251416c7501e6db",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/9EUmwXS6EbY5djAhLtBGzUbBwNV.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 830,
                "original_language": "en",
                "original_title": "Forbidden Planet",
                "overview": "Starship C57D travels to planet Altair 4 in search of the crew of spaceship \"Bellerophon,\" a scientific expedition that has been missing for twenty years. They find themselves unwelcome by the expedition's lone survivor and warned of destruction by an invisible force if they don't turn back immediately.",
                "popularity": 3.2734,
                "poster_path": "/aq0OQfRS7hDDI8vyD0ICbH9eguC.jpg",
                "release_date": "1956-03-23",
                "title": "Forbidden Planet",
                "video": false,
                "vote_average": 7.253,
                "vote_count": 988,
                "character": "Robby the Robot (interior) (uncredited)",
                "credit_id": "578f85ccc3a3685b500019bf",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Frank Johnson",
            "Frank Darro",
            "Frankie Darrow",
            "Frank Darrow",
            "Frank Johnson, Jr."
        ],
        "biography": "Frankie Darro (December 22, 1917 – December 25, 1976) was an American actor. Born into a show-business family - his parents were circus aerialists - Darro appeared in his first film at age six. Due to his small size and youthful appearance, he played teenagers well into his 20s. Always a physical performer, Darro often did his own stunts, many times out of necessity - his small stature made it difficult to find stunt doubles his size. He was an accomplished horseman and, in addition to westerns, made several films where he played jockeys.  In 1933 he played the lead as a troubled teen in a major film for Warner Brothers, \"Wild Boys Of The Road.\" It is a pre-code film with a realistic look at \"The Great Depression,\" from the point of view of the youth of the time. This film seems to have been rediscovered only recently and has received critical acclaim.That same year, he played a troubled youth in the James Cagney classic, \"The Mayor Of Hell\". Later in 1935, he had a key role in the cult serial classic \"The Phantom Empire\"(1935). As Darro got older, however, he found it increasingly difficult to secure employment, and by the late 1940s was doing uncredited stunt work and bit parts. He had a recurring role on The Red Skelton Hour (1951), unrecognized by his fans, he played \"Robby The Robot\" in the groundbreaking sci-fi film \"The Forbidden Planet\" (1956), though Marvin Miller, best remembered as Michael Anthony of TVs \"Millionaire\"(1955-60), was the robot's voice. After that Frankie appeared sporadically in films and on TV .",
        "birthday": "1917-12-22",
        "deathday": "1976-12-25",
        "gender": 2,
        "homepage": null,
        "id": 67370,
        "imdb_id": "nm0201660",
        "known_for_department": "Acting",
        "name": "Frankie Darro",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.3356,
        "profile_path": "/kTDMbr8WRWufs5fBKa8uDW0YMq7.jpg"
    }
}