{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qHI1IYj7QlLSCwHRzkL62X175s.jpg",
                "genre_ids": [
                    18
                ],
                "id": 73,
                "original_language": "en",
                "original_title": "American History X",
                "overview": "Derek Vineyard is paroled after serving 3 years in prison for killing two African-American men. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.",
                "popularity": 7.533,
                "poster_path": "/x2drgoXYZ8484lqyDj7L1CEVR4T.jpg",
                "release_date": "1998-07-01",
                "title": "American History X",
                "video": false,
                "vote_average": 8.335,
                "vote_count": 12035,
                "character": "Buddy #1",
                "credit_id": "53a4235f0e0a2667d50012f6",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Danso Nyameche Gordon"
        ],
        "biography": "Danso Gordon (born August 3, 1979) is a Canadian actor. Gordon was born in Toronto, Ontario, Canada, and lived in Halifax, Nova Scotia before moving on to pursue an acting career in Los Angeles. His very first acting gig was as a guest star in CBC's Street Cents and moved on to filming footwear commercials with the basketball star Charles Barkley. He later appeared in a number of other acting projects like the TV series Sliders, the 1998 film American History X and starring roles in the NBC Saturday morning sitcom Hang Time, The Disney Series In a Heartbeat and The N-Network's original series South Of Nowhere. He also made special appearances in the internet drama College Daze beginning in 2007, he was also in South Of Nowhere as Clay and Dark House. He is also co-owner of the caleb clothing company. He co-directed the short film \"COLE\" which won Best Actor in a short film during the 2007 Playhouse West Film Festival. In 2010, he was in a State Farm commercial.\n\nDescription above from the Wikipedia article  Danso Gordon,  licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1979-08-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 67453,
        "imdb_id": "nm0330115",
        "known_for_department": "Acting",
        "name": "Danso Gordon",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.121,
        "profile_path": "/ghctxCagj3shHIoDuhGJnLM423s.jpg"
    }
}