{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uxezSInaPoH20CyHx4TuY1LzGly.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    10770,
                    878,
                    12,
                    28,
                    10402
                ],
                "id": 71689,
                "original_language": "en",
                "original_title": "Phineas and Ferb The Movie: Across the 2nd Dimension",
                "overview": "Phineas and Ferb get trapped in an alternate dimension where the evil Doofenshmirtz rules the tri-state area. They must find a way back home with the help of their pet platypus named Perry, who they discover is a secret agent.",
                "popularity": 3.9455,
                "poster_path": "/updMFSOZwEftfkJRpozwBlRlYI2.jpg",
                "release_date": "2011-08-05",
                "title": "Phineas and Ferb The Movie: Across the 2nd Dimension",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 579,
                "character": "Candace Flynn / Candace-2 (voice)",
                "credit_id": "5a296d090e0a264cc1111e4b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/msCHK5Kh1YbdZ0zPJ2nzPUhhSN9.jpg",
                "genre_ids": [
                    14,
                    18,
                    9648
                ],
                "id": 141,
                "original_language": "en",
                "original_title": "Donnie Darko",
                "overview": "After narrowly escaping a bizarre accident, a troubled teenager is plagued by visions of a large bunny rabbit that manipulates him to commit a series of crimes.",
                "popularity": 7.5524,
                "poster_path": "/fhQoQfejY1hUcwyuLgpBrYs6uFt.jpg",
                "release_date": "2001-01-19",
                "title": "Donnie Darko",
                "video": false,
                "vote_average": 7.767,
                "vote_count": 12907,
                "character": "Kim",
                "credit_id": "5a6df820c3a36855410211f3",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/pWd09ohdwOSNF4IWG8a25qORc2O.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 9487,
                "original_language": "en",
                "original_title": "A Bug's Life",
                "overview": "On behalf of \"oppressed bugs everywhere,\" an inventive ant named Flik hires a troupe of warrior bugs to defend his bustling colony from a horde of freeloading grasshoppers led by the evil-minded Hopper.",
                "popularity": 8.299,
                "poster_path": "/Ah3J9OJVc2CNCuH2zMydXy9fmIC.jpg",
                "release_date": "1998-11-25",
                "title": "A Bug's Life",
                "video": false,
                "vote_average": 6.973,
                "vote_count": 9457,
                "character": "Additional Voices (voice)",
                "credit_id": "5ab3bd739251417af9009351",
                "order": 56
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/vkr2KGu10vCHbK1SM5q2AtWA4TM.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10751,
                    10770
                ],
                "id": 245473,
                "original_language": "en",
                "original_title": "Cloud 9",
                "overview": "Set high atop snow-capped mountains in the adrenaline-fueled world of competitive snowboarding, the Disney Channel Original Movie “Cloud 9″ tells the inspiring story of two snowboarders who must overcome self-doubt to learn that achieving their dreams is possible.",
                "popularity": 3.1321,
                "poster_path": "/1BD3erCSl1mh0VrTBg0g34wOWsQ.jpg",
                "release_date": "2014-01-17",
                "title": "Cloud 9",
                "video": false,
                "vote_average": 6.908,
                "vote_count": 531,
                "credit_id": "66ae38bc0fdcc4bd695b4dd8",
                "department": "Production",
                "job": "Executive Producer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ashley Michelle Tisdale (born July 2, 1985) is an American actress and singer. During her childhood, she was featured in over 100 advertisements and had minor roles in television and theatre. She achieved mainstream success as Maddie Fitzpatrick in the Disney Channel teen sitcom The Suite Life of Zack & Cody (2005–2008). This success was heightened when she starred as Sharpay Evans in the High School Musical film series (2006–2008). The success of the films led to Tisdale's signing with Warner Bros. Records and subsequently releasing her debut studio album, Headstrong (2007), which was a commercial success, earning a gold certification from the Recording Industry Association of America (RIAA). Tisdale played the voice role of Candace Flynn in the Disney Channel animated series Phineas & Ferb (2007–2015).\n\nTisdale's second studio album, Guilty Pleasure (2009), was released to less commercial success than its predecessor. Tisdale would part ways with Warner Bros. Records following the release of the album. During this time, she began appearing in more films and returned to television with shows such as Hellcats (2010). Tisdale's production company Blondie Girl Productions, first formed in 2008, signed a multi-year production deal with Relativity Media in 2010; Tisdale would produce shows such as Miss Advised (2012) as part of the deal. Tisdale starred in the High School Musical spin-off film Sharpay's Fabulous Adventure (2011), also releasing a soundtrack to promote the film.\n\nIn 2013, Tisdale announced work on her third studio album, releasing the promotional single \"You're Always Here\", and starred in the horror comedy film Scary Movie 5. She has continued to appear in television roles, joining the main cast of Clipped (2015). She also served as executive producer of the ABC Family television series Young & Hungry (2014–2018). In 2018, Tisdale returned to music with the release of the singles \"Voices in My Head\" and \"Love Me & Let Me Go\". Her third studio album and first in a decade, Symptoms, was released in 2019. Recently, Tisdale starred as Jenny Kenney in the CBS sitcom Carol's Second Act (2019–2020), and is currently serving as a panelist on the reality competition show The Masked Dancer",
        "birthday": "1985-07-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 67600,
        "imdb_id": "nm0864308",
        "known_for_department": "Acting",
        "name": "Ashley Tisdale",
        "place_of_birth": "West Deal, New Jersey, USA",
        "popularity": 0.9148,
        "profile_path": "/ot6ib67jxvKVG1JCBl0ROPGtdeP.jpg"
    }
}