{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9NlMiHVpgswGt4cWrUtrahlYDQu.jpg",
                "genre_ids": [
                    12,
                    28,
                    35
                ],
                "id": 10974,
                "original_language": "cn",
                "original_title": "龍兄虎弟",
                "overview": "Jackie Chan stars as Asian Hawk, an Indiana Jones-style adventurer looking to make a fortune in exotic antiquities. After Hawk discovers a mysterious sword in Africa, a band of Satan-worshipping monks kidnap his ex-girlfriend Lorelei, demanding the sword as ransom as well as other pieces of the legendary Armour of God - a magical outfit dating back to the Crusades.",
                "popularity": 5.2281,
                "poster_path": "/phCpGqCSBWJqutKxj73COACrlPt.jpg",
                "release_date": "1986-08-16",
                "title": "Armour of God",
                "video": false,
                "vote_average": 7.052,
                "vote_count": 594,
                "character": "Alan",
                "credit_id": "52fe43db9251416c75020c0f",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alan Tam Wing-Lun",
            "آلن تام"
        ],
        "biography": "Alan Tam Wing-Lun MH (traditional Chinese: 譚詠麟; simplified Chinese: 谭咏麟; pinyin: Tán Yǒnglín; Cantonese Yale: Taam4 Wing6Leon4; born 23 August 1950) is a Hong Kong singer and actor. He played a major role in developing the Cantopop scene in the 1980s as he was known for singing romantic ballads with modern arrangements. From 1983 to 1987, Alan Tam received numerous music awards and won Most Popular Male Artist and IFPI Award for successive four years, which made him the most famous superstar singer of Hong Kong in 1980s. In early 1988, he publicly quit all pop music award ceremonies and put most efforts in searching new direction for Cantopop music. He is also a members of The Wynners, along with Kenny Bee, Bennett Pang Kin-San, Danny Yip Chi-Keung and Anthony Chan Yau.\n\nToday, he is still active in the music and film industry, releasing new albums on a regular basis. Since the late 1980s, he has served as a mentor for the cantopop music industry, earning the nickname the \"Principal\" or \"Principal Tam\". Today he is regularly seen across the media in Hong Kong, mainland China, Taiwan, and various parts of East Asia participating in all types of entertainment-related events and charity activities. As of 2013, Alan Tam has launched a total of 115 solo albums and has sold over 35 million records worldwide; he also holds the record for having held the most concerts in Hong Kong as a solo artist.",
        "birthday": "1950-08-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 67689,
        "imdb_id": "nm0848355",
        "known_for_department": "Acting",
        "name": "Alan Tam",
        "place_of_birth": "Hong Kong, British Crown Colony [now China]",
        "popularity": 1.2604,
        "profile_path": "/vKB7KXRhersKKha1n4dbJpQaud6.jpg"
    }
}