{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/41Mlaj6wfjlF4wQaVH0tjfDXvMi.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 11020,
                "original_language": "en",
                "original_title": "Picnic at Hanging Rock",
                "overview": "In the early 1900s, Miranda attends a girls boarding school in Australia. One Valentine's Day, the school's typically strict headmistress treats the girls to a picnic field trip to an unusual but scenic volcanic formation called Hanging Rock. Despite rules against it, Miranda and several other girls venture off. It's not until the end of the day that the faculty realizes the girls and one of the teachers have disappeared mysteriously.",
                "popularity": 3.7852,
                "poster_path": "/7BAXwmFN4pZDNb9N6kzmAAwdssi.jpg",
                "release_date": "1975-09-02",
                "title": "Picnic at Hanging Rock",
                "video": false,
                "vote_average": 7.225,
                "vote_count": 836,
                "character": "Miss Greta McCraw",
                "credit_id": "52fe43e49251416c75022307",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Vivean Gray (born Jean Vivra Gray on 20 July 1924-29 July 2016) is an English actress, who found her niche playing gossipy characters in Australian television series. In her early life, she lived in England but moved to Australia after she had trouble finding any acting opportunities. She portrayed mathematics teacher Miss McGraw in Peter Weir's film adaptation of Picnic at Hanging Rock (1975).\n\nShe played two long-running characters in Australian soap operas, Mrs Ida Jessup in The Sullivans for its entire run, and Mrs Nell Mangel in Neighbours.\n\nShe appeared in Prisoner as genteel poisoner Edna Pearson in 1984. After the initial showing of her episodes in Australia, a woman claimed the story was based on her real life experience of being accused of poisoning her husband and threatened to sue the producers,Grundy Television. As a result any material that coincided with the woman's story was removed for subsequent episode screenings,including the full Australian DVD release of Prisoner. In 2010 a special DVD release of the full uncut 'Edna' story was released but only in the UK.\n\nGray left her role of Mrs Mangel after receiving abuse from Neighbours fans who could not distinguish fact from fiction. In the story Mrs Mangel moved to St Albans, England.\n\nGray returned to England, and has since retired and leads a very private life.",
        "birthday": "1924-07-20",
        "deathday": "2016-07-29",
        "gender": 1,
        "homepage": null,
        "id": 67829,
        "imdb_id": "nm0337003",
        "known_for_department": "Acting",
        "name": "Vivean Gray",
        "place_of_birth": "Cleethorpes, Lincolnshire, England, UK",
        "popularity": 1.6855,
        "profile_path": "/hIGxRT0nd1hABpD6ddc0DfrK0ie.jpg"
    }
}