{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/41Mlaj6wfjlF4wQaVH0tjfDXvMi.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 11020,
                "original_language": "en",
                "original_title": "Picnic at Hanging Rock",
                "overview": "In the early 1900s, Miranda attends a girls boarding school in Australia. One Valentine's Day, the school's typically strict headmistress treats the girls to a picnic field trip to an unusual but scenic volcanic formation called Hanging Rock. Despite rules against it, Miranda and several other girls venture off. It's not until the end of the day that the faculty realizes the girls and one of the teachers have disappeared mysteriously.",
                "popularity": 3.7852,
                "poster_path": "/7BAXwmFN4pZDNb9N6kzmAAwdssi.jpg",
                "release_date": "1975-09-02",
                "title": "Picnic at Hanging Rock",
                "video": false,
                "vote_average": 7.225,
                "vote_count": 836,
                "character": "Mlle. Dianne de Poitiers",
                "credit_id": "52fe43e49251416c7502230b",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nHelen Morse  (born 24 January 1947) is an Australian actress who has appeared in films, on television, and on stage.\n\nMorse was born in Harrow on the Hill, Middlesex, England. She was the oldest of four children; her parents were a doctor and nurse. She attended school at Presbyterian Ladies' College, in Burwood, Victoria, and studied acting at the National Institute of Dramatic Art, in the Sydney suburb of Kensington. Morse won the Australian Film Institute Award for Best Actress in a Leading Role for her performance in the 1976 film Caddie. Her notable screen performances also include roles in the film Picnic at Hanging Rock (1975) and the television miniseries A Town Like Alice (1981). In the 2000s, she occasionally appeared in theatre productions in Australia.\n\nMorse was married to Australian actor/director Sandy Harbutt, with whom she starred in Stone.\n\nDescription above from the Wikipedia article Helen Morse, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1947-01-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 67835,
        "imdb_id": "nm0607609",
        "known_for_department": "Acting",
        "name": "Helen Morse",
        "place_of_birth": "Harrow-on-the-Hill, Middlesex, England, UK",
        "popularity": 0.8755,
        "profile_path": "/kyTVpm3TuIuLPJwscIzjaTVIp9K.jpg"
    }
}