{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/41Mlaj6wfjlF4wQaVH0tjfDXvMi.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 11020,
                "original_language": "en",
                "original_title": "Picnic at Hanging Rock",
                "overview": "In the early 1900s, Miranda attends a girls boarding school in Australia. One Valentine's Day, the school's typically strict headmistress treats the girls to a picnic field trip to an unusual but scenic volcanic formation called Hanging Rock. Despite rules against it, Miranda and several other girls venture off. It's not until the end of the day that the faculty realizes the girls and one of the teachers have disappeared mysteriously.",
                "popularity": 3.7852,
                "poster_path": "/7BAXwmFN4pZDNb9N6kzmAAwdssi.jpg",
                "release_date": "1975-09-02",
                "title": "Picnic at Hanging Rock",
                "video": false,
                "vote_average": 7.225,
                "vote_count": 836,
                "character": "Miss Dora Lumley",
                "credit_id": "52fe43e49251416c7502230f",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nKirsty Child is an Australian actress, best known for playing three roles in the cult drama Prisoner. She played two guest roles – prison officer turned drug dealer Anne Yates in 1979, and Glynis Johnson, the sister of an inmate, in 1983. In 1985 she played a more prominent part in the series as supercilious fence Willie Beecham. She returned for a cameo in late 1986.\n\nChild acted in the 1975 film Picnic at Hanging Rock and appeared in serial Neighbours as Carmel Tyler. Other television guest roles include Blue Heelers.\n\nChild is the widow of Australian actor Peter Adams, who died in 1999.\n\nDescription above from the Wikipedia article Kirsty Child, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 67836,
        "imdb_id": "nm0157467",
        "known_for_department": "Acting",
        "name": "Kirsty Child",
        "place_of_birth": null,
        "popularity": 0.1189,
        "profile_path": "/uYC69RONSOUokNVd86jXay1Fpfj.jpg"
    }
}