{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vzavBt9c6v4zBaGiwQDO21aNQG9.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 11046,
                "original_language": "en",
                "original_title": "Where Eagles Dare",
                "overview": "World War II is raging, and an American general has been captured and is being held hostage in the Schloss Adler, a Bavarian castle that's nearly impossible to breach. It's up to a group of skilled Allied soldiers to liberate the general before it's too late.",
                "popularity": 6.8612,
                "poster_path": "/dnyiVS4Ad4w4rfS4Bm1YalEdonx.jpg",
                "release_date": "1968-12-04",
                "title": "Where Eagles Dare",
                "video": false,
                "vote_average": 7.514,
                "vote_count": 928,
                "character": "Col. Wyatt Turner DSO MC",
                "credit_id": "52fe43ea9251416c75022f4b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/5rbPwIdEZTyLTkpAgvGdacgCr7T.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 11481,
                "original_language": "en",
                "original_title": "Repulsion",
                "overview": "Beautiful young manicurist Carole suffers from androphobia (the pathological fear of interaction with men). When her sister and roommate, Helen, leaves their London flat to go on an Italian holiday with her married boyfriend, Carole withdraws into her apartment. She begins to experience frightful hallucinations, her fear gradually mutating into madness.",
                "popularity": 2.1445,
                "poster_path": "/dtyCKEPLqv9wxyVazL4b843vtUb.jpg",
                "release_date": "1965-06-01",
                "title": "Repulsion",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 1043,
                "character": "le propriétaire",
                "credit_id": "52fe44499251416c7502f55f",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​Born Patrick Carl Cheeseman in Cleethorpes, Lincolnshire, England. He was brought up in neighbouring Grimsby and frequently re-visited the area during the height of his career.  He attended University College, London, before training at the Old Vic Theatre School and making his first stage appearance in a walk-on part in Othello in 1951. He toured South Africa the following year and then directed plays for the drama department at Stanford University, California.  Moving to the Shakespeare Memorial Theatre, Stratford-upon-Avon, Wymark played a wide range of traditional roles, including Dogberry in Much Ado about Nothing and Stephano in The Tempest. He also played the parts of Marullus in Julius Caesar and Bottom in A Midsummer Night's Dream. Other stage parts included the title role in Danton's Death and, with the Royal Shakespeare Company, Ephihodov in The Cherry Orchard. His theatre roles also included playing the part of Bosola in a Royal Shakespeare Company production of John Webster's The Duchess of Malfi in 1960. His film roles included: Children of the Damned (1964), Operation Crossbow (1965), Battle of Britain (1969), Where Eagles Dare (1968), Blood on Satan's Claw (1971) and Cromwell (1970).  On television, where at one point he was considered as a replacement for William Hartnell on Doctor Who., he was best known for his role as the machiavellian businessman John Wilder in the drama series The Plane Makers/The Power Game, a role which led to offers of company directorships. Wymark, however, was a gentle man in real life, self-confessedly ignorant of business matters, who considered the Wilder character to be a \"bastard\" and was described by his wife as \"the most inefficient, dreamy muddler in the world.\"",
        "birthday": "1926-07-11",
        "deathday": "1970-10-20",
        "gender": 2,
        "homepage": null,
        "id": 67917,
        "imdb_id": "nm0943859",
        "known_for_department": "Acting",
        "name": "Patrick Wymark",
        "place_of_birth": "Lincolnshire, England, UK",
        "popularity": 0.1949,
        "profile_path": "/qAObkVULZr2JhbWsdwfoH0d67ht.jpg"
    }
}