{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fwhN9a0oRZvzc2tDuu5BZ59MOPz.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 817758,
                "original_language": "en",
                "original_title": "TÁR",
                "overview": "As celebrated conductor Lydia Tár starts rehearsals for a career-defining symphony, the consequences of her past choices begin to echo in the present.",
                "popularity": 4.5794,
                "poster_path": "/dRVAlaU0vbG6hMf2K45NSiIyoUe.jpg",
                "release_date": "2022-09-23",
                "title": "TÁR",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1402,
                "character": "Sharon Goodnow",
                "credit_id": "6138ce3f51c01f0025f68ed9",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "니나 호스",
            "妮娜·霍斯",
            "Ніна Госс",
            "نینا هوس"
        ],
        "biography": "Nina Hoss (born 7 July 1975) is a German stage and film actress.\n\nHoss acted in radio plays at the age of seven and appeared on stage for the first time at the age of 14.\n\nIn 1997 she graduated from the Ernst Busch Academy of Dramatic Arts in Berlin. Her first major success was the title role Rosemarie Nitribitt of Bernd Eichinger's A Girl Called Rosemary in 1996, a period drama (based on an actual scandal) set in the 1950s that looks back at the days of West Germany's postwar Wirtschaftswunder with a curdling cynicism.\n\nIn 2000 she was one of the Shooting Stars at the Berlinale. Her close collaboration with director Christian Petzold has been extremely successful: she won the 2003 Adolf Grimme Award for her role in his film Something to Remind Me and two years later the Adolf Grimme Award in Gold for Wolfsburg. Her performance of Yella, earned her the Silver Bear for Best Actress at the Berlin International Film Festival in 2007 and the German Film Award in 2008. Another collaboration with Petzold, Barbara, in which Hoss plays a doctor exiled to an East German provincial backwater in 1980, premiered at the Berlin International Film Festival in 2011 and the Toronto International Film Festival in 2012.\n\nDescription above from the Wikipedia article Nina Hoss, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1975-07-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 681,
        "imdb_id": "nm0396125",
        "known_for_department": "Acting",
        "name": "Nina Hoss",
        "place_of_birth": "Stuttgart, Baden-Württemberg, West Germany [now Germany]",
        "popularity": 0.7436,
        "profile_path": "/j4j3eenfrg0XgW0dVReFAdPNPE0.jpg"
    }
}