{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vMylmakO2K9cZexNUze8wa9muJp.jpg",
                "genre_ids": [
                    18
                ],
                "id": 510,
                "original_language": "en",
                "original_title": "One Flew Over the Cuckoo's Nest",
                "overview": "A petty criminal fakes insanity to serve his sentence in a mental ward rather than prison. He soon finds himself as a leader to the other patients—and an enemy to the cruel, domineering nurse who runs the ward.",
                "popularity": 8.5264,
                "poster_path": "/kjWsMh72V6d8KRLV4EOoSJLT1H7.jpg",
                "release_date": "1975-11-19",
                "title": "One Flew Over the Cuckoo's Nest",
                "video": false,
                "vote_average": 8.414,
                "vote_count": 10946,
                "character": "Chief Bromden",
                "credit_id": "52fe424cc3a36847f8013519",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/kXsjmuBgRzsujspv4BiHsIgzOnD.jpg",
                "genre_ids": [
                    37
                ],
                "id": 10747,
                "original_language": "en",
                "original_title": "The Outlaw Josey Wales",
                "overview": "After avenging his family's brutal murder, Wales is pursued by a pack of soldiers. He prefers to travel alone, but ragtag outcasts are drawn to him - and Wales can't bring himself to leave them unprotected.",
                "popularity": 4.0518,
                "poster_path": "/92BZIFPbyCPNhExyFScxA3xF1dy.jpg",
                "release_date": "1976-06-30",
                "title": "The Outlaw Josey Wales",
                "video": false,
                "vote_average": 7.441,
                "vote_count": 1208,
                "character": "Ten Bears",
                "credit_id": "54d799f1c3a3683ba0006d67",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Will Sampson was a Native American actor and artist.  Mr. Sampson, a Muscogee (Creek) Native American, was born in Okmulgee, Oklahoma and was an imposing 6' 7\" (2.01 m) tall and also wore size 18 EEEE shoes. Sampson's most notable roles were as \"Chief Bromden\" in One Flew Over the Cuckoo's Nest and as \"Taylor the Medicine Man\" in the horror film Poltergeist II. He had a recurring role on the TV series Vega$, as Harlon Twoleaf and starred in the movies Fish Hawk, The Outlaw Josey Wales, and Orca.\n\nMr. Sampson appeared in the production of Black Elk Speaks with the American Indian Theater Company in Tulsa, Oklahoma, where David Carradine and other Native American actors like Wes Studi and Randolph Mantooth starred in stage productions.\n\nMr. Sampson competed in rodeos, his speciality riding bucking broncos, for about twenty years. He was on the rodeo circuit when the producers of One Flew Over the Cuckoo's Nest, Saul Zaentz and Michael Douglas, were looking for a large Native American man to play the role of Chief Bromden a 6’8”, 300 lb, Native American/European American man. A rodeo announcer told them about Sampson, and after lengthy efforts to find him, they hired him on the strength of an interview. He had never acted before.\n\nMr. Sampson was also an artist. His large painting depicting the Ribbon Dance of his Muscogee people is in the collection of the Creek Council House Museum in Okmulgee, Oklahoma. His artwork is currently displayed online by The Kvskvnv (“kuskuna”) Association.",
        "birthday": "1933-09-26",
        "deathday": "1987-06-03",
        "gender": 2,
        "homepage": null,
        "id": 68301,
        "imdb_id": "nm0760225",
        "known_for_department": "Acting",
        "name": "Will Sampson",
        "place_of_birth": "Okmulgee, Oklahoma, USA",
        "popularity": 0.3736,
        "profile_path": "/eTFrqcbAxcFzqmdEDR5PhIUKTNW.jpg"
    }
}