{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nnSjkUOJGfKTy4bnVPsbl4pyL0x.jpg",
                "genre_ids": [
                    18,
                    28,
                    53,
                    80
                ],
                "id": 13635,
                "original_language": "fr",
                "original_title": "L'Instinct de mort",
                "overview": "Jacques Mesrine, a loyal son and dedicated soldier, is back home and living with his parents after serving in the Algerian War. Soon he is seduced by the neon glamour of sixties Paris and the easy money it presents. Mentored by Guido, Mesrine turns his back on middle class law-abiding and soon moves swiftly up the criminal ladder.",
                "popularity": 3.6179,
                "poster_path": "/zCyuiyIhbhgEOZde81qTgXbO0pw.jpg",
                "release_date": "2008-10-22",
                "title": "Mesrine: Killer Instinct",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 958,
                "character": "Billionaire",
                "credit_id": "561813fb9251413757000228",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gilbert Sicotte, CM (born February 18, 1948) is a Canadian actor.\n\nSicotte is known for roles in The Vultures (Les Vautours), Little Tougas (Ti-Cul Tougas), The Years of Dreams and Revolt (Les Années de rêves), The Secret Life of Happy People (La Vie secrète des gens heureux), Maria Chapdelaine (1983, Gilles Carle), Fortier, Louis Cyr, Léolo, Water Child (L'Enfant d'eau), Paul à Québec, And the Birds Rained Down (Il pleuvait des oiseaux) and Maria Chapdelaine (2021, Sébastien Pilote). He has also done some voice over work.\n\nHe has been a three-time Jutra/Iris Award winner for Best Actor, winning at the 14th Jutra Awards in 2011 for The Salesman, at the 18th Quebec Cinema Awards in 2016 for Paul à Québec, and at the 22nd Quebec Cinema Awards in 2020 for And the Birds Rained Down.\n\nHe has also been a four-time Genie and Canadian Screen Award nominee for Best Actor or Best Supporting Actor, receiving lead acting nods at the 14th Genie Awards in 1993 for Cap Tourmente, the 15th Genie Awards in 1994 for Les Pots cassés and the 8th Canadian Screen Awards in 2020 for And the Birds Rained Down, and a supporting nod at the 28th Genie Awards in 2008 for Continental, a Film Without Guns (Continental, un film sans fusil).\n\nSicotte taught at the Conservatoire d'art dramatique de Montréal from 1987 to 2018 for allegations of humiliating students in the classroom and authoritarian attitudes.\n\nSicotte was appointed a Member of the Order of Canada in 2013, \"For his contributions to the performing arts as an actor, and for his commitment to training the next generation.\"\n\nSicotte is the father of Antoine Sicotte, a member of Sky.\n\nSource: Article \"Gilbert Sicotte\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1948-02-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.agencegaillard.com/gilbert-sicotte.html",
        "id": 68311,
        "imdb_id": "nm0796449",
        "known_for_department": "Acting",
        "name": "Gilbert Sicotte",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.0742,
        "profile_path": "/ge24EFHeTuOsVRLiZlWmaIcfHC.jpg"
    }
}