{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8n9dYsTbXTykzm2Nuy7R2ftapXQ.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 703,
                "original_language": "en",
                "original_title": "Annie Hall",
                "overview": "New York comedian Alvy Singer falls in love with the ditsy Annie Hall.",
                "popularity": 3.9434,
                "poster_path": "/dEtjPywhDbAXYjoFfhBC4U9unU7.jpg",
                "release_date": "1977-04-19",
                "title": "Annie Hall",
                "video": false,
                "vote_average": 7.736,
                "vote_count": 4045,
                "character": "Annie's Date Outside Theatre",
                "credit_id": "5668d09a92514174040041d8",
                "order": 76
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/2aC3284N1p86o6S4Uyj9AaryYeR.jpg",
                "genre_ids": [
                    37,
                    28,
                    12
                ],
                "id": 966,
                "original_language": "en",
                "original_title": "The Magnificent Seven",
                "overview": "An oppressed Mexican peasant village hires seven gunfighters to help defend their homes.",
                "popularity": 8.9842,
                "poster_path": "/e5ToxOyJwuZD4VOfI0qEn5uIjeJ.jpg",
                "release_date": "1960-10-12",
                "title": "The Magnificent Seven",
                "video": false,
                "vote_average": 7.509,
                "vote_count": 1875,
                "credit_id": "56f97b26c3a36816e800a620",
                "department": "Writing",
                "job": "Screenplay"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "In February 1941, Bernstein was drafted into the U.S. Army. Eventually attaining the rank of Sergeant, he spent most of World War II as a correspondent on the staff of the Army newspaper Yank, filing dispatches from Iran, Palestine, Egypt, North Africa, Sicily and Yugoslavia. He wrote of his experiences in Palestine in an article entitled \"War and Palestine\".\n\nBernstein wrote a number of articles and stories based on his experiences in the Army, many of which originally appeared in The New Yorker. These were collected in Keep Your Head Down, his first book, published in 1945.\n\nBernstein first came to Hollywood in 1947, under a ten-week contract with writer-producer-director Robert Rossen at Columbia Pictures. Following that stint, he worked for a while for producer Harold Hecht, which resulted in his first screen credit, shared with Ben Maddow, for their adaptation of the Gerald Butler novel Kiss the Blood Off My Hands for the 1948 Universal film. He subsequently returned to New York, where he continued writing for The New Yorker and other magazines, and eventually found work as a scriptwriter in the early days of live television. In 1950, because of his numerous left-wing political affiliations and related activities, his name appeared in the notorious publication Red Channels, and as a result he found himself blacklisted. Throughout the 1950s, however, he managed to continue writing for television, both under pseudonyms and through the use of \"fronts\" (non-blacklisted individuals who would permit their names to appear on his work). In this manner, he contributed to several notable TV programs of the era, including Danger, the CBS News docudrama series You Are There and the mystery series Colonel March of Scotland Yard. (It has been incorrectly stated in some sources that Bernstein's blacklisting resulted from \"unfriendly\" testimony given to HUAC in 1951, but in fact he was not subpoenaed by the Committee until the late 1950s, and never actually testified.)\n\nHis screenwriting career began to rebound from the blacklist when director Sidney Lumet hired him to write the screenplay for the 1959 Sophia Loren movie That Kind of Woman. From then on Bernstein was able to work openly on films such as Paris Blues (1961) and Fail-Safe (1964). He also contributed, without receiving credit, to the screenplays of The Magnificent Seven (1960) and The Train (1964), and was one of several writers who worked on the script for the ill-fated Something's Got to Give, which was left uncompleted at the time of the death of its star, Marilyn Monroe, in 1962.",
        "birthday": "1919-08-20",
        "deathday": "2021-01-22",
        "gender": 2,
        "homepage": null,
        "id": 6835,
        "imdb_id": "nm0077159",
        "known_for_department": "Writing",
        "name": "Walter Bernstein",
        "place_of_birth": " Brooklyn, New York, USA",
        "popularity": 0.2132,
        "profile_path": "/tM6wByivWWyW7btLLTVufIQaSZK.jpg"
    }
}