{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5PfHGXosySGs0l1JfeREspy3v6G.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 1924,
                "original_language": "en",
                "original_title": "Superman",
                "overview": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
                "popularity": 9.8184,
                "poster_path": "/d7px1FQxW4tngdACVRsCSaZq0Xl.jpg",
                "release_date": "1978-12-14",
                "title": "Superman",
                "video": false,
                "vote_average": 7.154,
                "vote_count": 4066,
                "character": "Major",
                "credit_id": "57defc799251413d74008f06",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Larry Martin Hagman",
            "Larry Hagland",
            "لری هگمن"
        ],
        "biography": "Larry Martin Hagman (September 21, 1931 – November 23, 2012) was an American film and television actor, director, and producer. He was best known for playing ruthless oil baron J. R. Ewing in the 1978–1991 primetime television soap opera Dallas, and the befuddled astronaut Major Anthony Nelson in the 1965–1970 sitcom I Dream of Jeannie.\n\nHagman was born in Fort Worth, Texas, the son of actress Mary Martin. After his parents divorced, he lived with his grandmother in Texas while his mother pursued acting roles. At age 16, Hagman followed his mother into acting and got his start in small theater productions and commercials. He began his acting career in the early 1950s, appearing in Broadway plays and television shows. He had a supporting role in the 1964 film Fail-Safe.\n\nIn 1965, Hagman was cast as Major Anthony Nelson in the sitcom I Dream of Jeannie. The show was a huge success, and Hagman won two Golden Globe Awards for his performance. He left the show in 1970 to pursue other projects.\n\nIn 1978, Hagman was cast as J. R. Ewing in the soap opera Dallas. The show was an even bigger success than I Dream of Jeannie, and Hagman won four Emmy Awards for his performance. He remained with the show until it ended in 1991.\n\nIn 1995, Hagman underwent a liver transplant. He returned to Dallas in 2012 for a revival of the show. He died of complications from leukemia later that year.",
        "birthday": "1931-09-21",
        "deathday": "2012-11-23",
        "gender": 2,
        "homepage": "http://www.larryhagman.com/",
        "id": 6840,
        "imdb_id": "nm0001306",
        "known_for_department": "Acting",
        "name": "Larry Hagman",
        "place_of_birth": "Fort Worth, Texas, USA",
        "popularity": 0.9414,
        "profile_path": "/6z5tCuu0Qhq6a0YKpqXfHmiMbD4.jpg"
    }
}