{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ce6HzPfxRRcLk5QRLcdExeVpsA1.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 406997,
                "original_language": "en",
                "original_title": "Wonder",
                "overview": "The story of August Pullman – a boy with facial differences – who enters fifth grade, attending a mainstream elementary school for the first time.",
                "popularity": 5.5825,
                "poster_path": "/sONh3LYGFcVDTy8pm1tbSOB13Li.jpg",
                "release_date": "2017-11-13",
                "title": "Wonder",
                "video": false,
                "vote_average": 8.114,
                "vote_count": 8069,
                "character": "Miranda's Mom",
                "credit_id": "58d3666a9251411f8100eb99",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rachael Hayward"
        ],
        "biography": "Rachel Hayward (born August 7, 1968) is a Canadian actress, known for her work as a series regular in Chris Carter's Harsh Realm (1999) for FOX and her leading role in the 2015 made for TV movie, Stolen Daughter (2015).\n\nShe landed her first acting role in the feature Breaking All the Rules (1985) at the age of 17. Her feature film and TV movie credits include Stranger in the Mirror, Under the Gun, Breaking All the Rules, Deadfire, She Woke Up Pregnant, Convergence, Knight Moves and the romantic comedy Apartment Hunting. In television she has starred as Florence in Chris Carter's series Harsh Realm and had a recurring role in Jake 2.0. She is remembered by many science fiction fans as the USAF Sergeant who is abducted by Apophis in the opening moments of the Stargate SG-1 pilot.\n\nShe has also appeared in Andromeda, Bliss, Cold Squad, First Wave, Highlander: The Series, Millennium, Mutant X, Sliders, The Dead Zone, The L Word, Tru Calling, Viper, Welcome to Paradox and Xena: Warrior Princess.",
        "birthday": "1968-08-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 68764,
        "imdb_id": "nm0371787",
        "known_for_department": "Acting",
        "name": "Rachel Hayward",
        "place_of_birth": " Toronto, Ontario, Canada ",
        "popularity": 0.3402,
        "profile_path": "/pBI0J5djCYCdQ3H4MENaTskzyIt.jpg"
    }
}