{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f133nWlU6yUkZqqwcCXCbTEJWHr.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 87,
                "original_language": "en",
                "original_title": "Indiana Jones and the Temple of Doom",
                "overview": "After arriving in India, Indiana Jones is asked by a desperate village to find a mystical stone. He agrees – and stumbles upon a secret cult plotting a terrible plan in the catacombs of an ancient palace.",
                "popularity": 8.1711,
                "poster_path": "/gpdVNUaa4LhRMLfJOPj1AZdhAZ3.jpg",
                "release_date": "1984-05-23",
                "title": "Indiana Jones and the Temple of Doom",
                "video": false,
                "vote_average": 7.303,
                "vote_count": 9703,
                "character": "Willie Scott",
                "credit_id": "52fe4215c3a36847f8002c0d",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kathleen Sue Nail",
            "Kathleen Sue Spielberg",
            "کیت کپشو"
        ],
        "biography": "Kathleen Sue Spielberg (Born: November 3, 1953, Height: 5 ft 7 inches (1.70 m)), known professionally as Kate Capshaw, is an American actress and painter with a multifaceted career that traverses action-adventure classics, heartwarming comedies, and artistic pursuits. Born in Texas, Capshaw embarked on an unexpected path: initially, she pursued a career in education, earning a Master's degree in Learning Disabilities and teaching special education. However, her artistic heart yearned for a different stage. Driven by this passion, she moved to New York and delved into acting, landing a role in the soap opera \"The Edge of Night.\"  Fate and Hollywood intervened in 1984 when Capshaw, after beating out 120 actresses, landed the pivotal role of Willie Scott in Indiana Jones and the Temple of Doom. This action-adventure blockbuster, directed by Steven Spielberg, not only catapulted her to international fame but also sparked a personal connection that led to their marriage in 1991. Capshaw's career thrived in the 80s and 90s, showcasing her dramatic and comedic chops in films like Dreamscape, Black Rain, Love Affair, and Just Cause. She explored lighter roles in SpaceCamp and The Love Letter, proving her versatility. Beyond acting, Capshaw is a devoted mother to seven children, including actress Jessica Capshaw, and co-parent to adopted children with Spielberg. She has actively supported various charities, highlighting her dedication to humanitarian causes.",
        "birthday": "1953-11-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 689,
        "imdb_id": "nm0001009",
        "known_for_department": "Acting",
        "name": "Kate Capshaw",
        "place_of_birth": "Fort Worth, Texas, USA",
        "popularity": 1.1047,
        "profile_path": "/nx3JwH8kwG5RXD3uSBUdNVcejki.jpg"
    }
}