{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t8EDE4bkYZBaSCo7Gq8uIWtW4pV.jpg",
                "genre_ids": [
                    28,
                    18,
                    80
                ],
                "id": 11344,
                "original_language": "ko",
                "original_title": "달콤한 인생",
                "overview": "Kim Sun-woo is an enforcer and manager for a hotel owned by a cold, calculative crime boss, Kang who assigns Sun-woo to a simple errand while he is away on a business trip; to shadow his young mistress, Hee-soo, for fear that she may be cheating on him with a younger man with the mandate that he must kill them both if he discovers their affair.",
                "popularity": 3.4959,
                "poster_path": "/czoCxjadYUT2oe9cKzSnU6ZrYoI.jpg",
                "release_date": "2005-04-01",
                "title": "A Bittersweet Life",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 930,
                "character": "Mr. Baek",
                "credit_id": "52fe442a9251416c7502b1bb",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/9qxBNfI1QFbiZS62fsgaUd563t2.jpg",
                "genre_ids": [
                    27,
                    9648
                ],
                "id": 293670,
                "original_language": "ko",
                "original_title": "곡성",
                "overview": "A stranger arrives in a little village and soon after a mysterious sickness starts spreading. A policeman is drawn into the incident and is forced to solve the mystery in order to save his daughter.",
                "popularity": 4.5656,
                "poster_path": "/aXlL7yYwpXInhltamtzKQFBG08G.jpg",
                "release_date": "2016-05-12",
                "title": "The Wailing",
                "video": false,
                "vote_average": 7.387,
                "vote_count": 1886,
                "character": "Il-gwang",
                "credit_id": "541bf3bcc3a36801bc003680",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "황정민",
            "Hwang Jung-Min",
            "Hwang Jeong-min",
            "هوانج يونج مين",
            "هوانگ جونگ-مین",
            "ファン・ジョンミン",
            "黃晸珉",
            "黄政民",
            "黃晸玟 ",
            "黄晸珉",
            "Hwang Jung-min"
        ],
        "biography": "Hwang Jung-min (황정민) is a South Korean actor. He was born on September 1, 1970 and began his career in musical theatre, making his acting debut in Line 1 in 1995. He then starred in various musicals and plays in Daehangno such as \"Jesus Christ Superstar\" and \"Cats\".\n\nDespite a career on stage, Hwang had difficulty transitioning to film. He went through a long struggle for recognition, with people saying he \"didn’t have the right face for film.\" He even considered giving up his dream, but stuck to his conviction about walking the path of acting. Hwang said, \"After becoming interested about the stage and how it feels to be that person on stage, I've never thought of anything else. That I never swayed -- that is one thing I can say with confidence.\" His big break came when he was cast in Waikiki Brothers, a 2001 film that was a sleeper hit in Korea. In his role as a hopeless drummer, Hwang left a strong impression and earned favorable reviews, with director Im Soon-rye calling him \"an uncut gemstone.\"\n\nIt was in 2005 that Hwang became a household name, portraying a naive farmer in love with an AIDS-stricken prostitute in the hit melodrama \"You Are My Sunshine\". Hwang explains that he was \"moved by the tale of the genuine love between two people. I agreed with the director's idea of showing it as pure love, like an uncut gem, without sloppily adding to it or embellishing it.\" When he accepted the best actor award at the Blue Dragon Film Awards for his performance in You Are My Sunshine, many were moved by his now-famous speech: \"All I did was add a spoon to a dinner table that had already been prepared by others.\"",
        "birthday": "1970-09-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 68903,
        "imdb_id": "nm1058565",
        "known_for_department": "Acting",
        "name": "Hwang Jung-min",
        "place_of_birth": "Masan, South Gyeongsang, South Korea",
        "popularity": 0.8484,
        "profile_path": "/8WMT3zV5DBPgbMFm8vbCNcLTXvb.jpg"
    }
}