{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dMjNyPk3aBwXYYfAuSAwSRz1ewa.jpg",
                "genre_ids": [
                    18,
                    878
                ],
                "id": 11864,
                "original_language": "en",
                "original_title": "Enemy Mine",
                "overview": "A soldier from Earth crashlands on an alien world after sustaining battle damage. Eventually he encounters another survivor, but from the enemy species he was fighting; they band together to survive on this hostile world. In the end the human finds himself caring for his enemy in a completely unexpected way.",
                "popularity": 3.1308,
                "poster_path": "/a3dr9L8VIjhEvivzQ2M12VQDere.jpg",
                "release_date": "1985-12-12",
                "title": "Enemy Mine",
                "video": false,
                "vote_average": 6.95,
                "vote_count": 1012,
                "character": "Joey Wooster",
                "credit_id": "52fe44969251416c75039fdb",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Лэнс Кервин",
            "Lance Michael Kerwin",
            "لنس کروین"
        ],
        "biography": "Lance Michael Kerwin (November 6, 1960 – January 24, 2023) was an American actor, known primarily for roles in television and film during his childhood and teen years in the 1970s. He played lead roles in the TV series James at 15, and the made-for-TV films The Loneliest Runner and Salem's Lot.\n\nKerwin was raised in Lake Elsinore, California. His father was an acting coach, who brought home scripts for his son to read. His mother was also a performer and, later, a talent agent. He was the youngest of five brothers. His brother Shane was his stand-in.\n\nIn the 1970s, Kerwin appeared in a number of made-for-TV movies and series. He was, said former theater critic and British Film Institute governor John Holmstrom, \"probably America's leading boy actor of the late Seventies ... a handsome lad ... [with] considerable sensitivity as an actor\". His serious acting roles often portrayed anguished characters facing difficult challenges, such as in The Loneliest Runner, The Boy Who Drank Too Much, and Children of Divorce.\n\nKerwin had a daughter with Kristen Lansdale, and four children with his wife Yvonne Kerwin. He gave up acting in the mid-1990s, but returned to the screen in 2022 for The Wind & the Reckoning, filmed in Hawaii.\n\nIn July 2010, it was reported that Kerwin was working as a pastor at Calvary Chapel in Kapaa, Hawaii, and a program leader at U-Turn for Christ, a drug and alcohol rehabilitation organization.\n\nKerwin died in San Clemente, California, on January 24, 2023, at the age of 62.\n\n[preceding biography, edited, from Wikipedia]",
        "birthday": "1960-11-06",
        "deathday": "2023-01-24",
        "gender": 2,
        "homepage": null,
        "id": 69070,
        "imdb_id": "nm0450130",
        "known_for_department": "Acting",
        "name": "Lance Kerwin",
        "place_of_birth": " Newport Beach, California, USA",
        "popularity": 0.2303,
        "profile_path": "/m0XdyzDiHrGF5gQfMluPLHkaofc.jpg"
    }
}