{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zf52xLEyao2xcVnpThmzW2Xl0aj.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 476,
                "original_language": "en",
                "original_title": "Drugstore Cowboy",
                "overview": "Portland, Oregon, 1971. Bob Hughes is the charismatic leader of a peculiar quartet, formed by his wife, Dianne, and another couple, Rick and Nadine, who skillfully steal from drugstores and hospital medicine cabinets in order to appease their insatiable need for drugs. But neither fun nor luck last forever.",
                "popularity": 2.2219,
                "poster_path": "/2bQXK39axyedUL6DE1pzdMYgAw1.jpg",
                "release_date": "1989-10-20",
                "title": "Drugstore Cowboy",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 581,
                "character": "Nadine",
                "credit_id": "52fe4248c3a36847f80120cf",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/bQEIYntlPba76NN41uWxIzUmzBb.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4995,
                "original_language": "en",
                "original_title": "Boogie Nights",
                "overview": "Set in 1977, back when sex was safe, pleasure was a business and business was booming, idealistic porn producer Jack Horner aspires to elevate his craft to an art form. Horner discovers Eddie Adams, a hot young talent working as a busboy in a nightclub, and welcomes him into the extended family of movie-makers, misfits and hangers-on that are always around. Adams' rise from nobody to a celebrity adult entertainer is meteoric, and soon the whole world seems to know his porn alter ego, \"Dirk Diggler\". Now, when disco and drugs are in vogue, fashion is in flux and the party never seems to stop, Adams' dreams of turning sex into stardom are about to collide with cold, hard reality.",
                "popularity": 11.9692,
                "poster_path": "/wnE24UPCPQsQnbBOu4zVE2qaDNm.jpg",
                "release_date": "1997-10-10",
                "title": "Boogie Nights",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 3315,
                "character": "Rollergirl",
                "credit_id": "52fe43edc3a36847f8078aed",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/iuRVt8tFiXDPGgzavhuSa3QHRxD.jpg",
                "genre_ids": [
                    35
                ],
                "id": 18785,
                "original_language": "en",
                "original_title": "The Hangover",
                "overview": "When three friends finally come to after a raucous night of bachelor-party revelry, they find a baby in the closet and a tiger in the bathroom. But they can't seem to locate their best friend, Doug – who's supposed to be tying the knot. Launching a frantic search for Doug, the trio perseveres through a nasty hangover to try to make it to the church on time.",
                "popularity": 20.7833,
                "poster_path": "/A0uS9rHR56FeBtpjVki16M5xxSW.jpg",
                "release_date": "2009-06-02",
                "title": "The Hangover",
                "video": false,
                "vote_average": 7.327,
                "vote_count": 17492,
                "character": "Jade",
                "credit_id": "52fe479a9251416c7509f5fb",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/g5G19q0xgkzWEvfcGo1KcL8nQOk.jpg",
                "genre_ids": [
                    18,
                    9648,
                    27
                ],
                "id": 1923,
                "original_language": "en",
                "original_title": "Twin Peaks: Fire Walk with Me",
                "overview": "In the questionable town of Deer Meadow, Washington, FBI Agent Desmond inexplicably disappears while hunting for the man who murdered a teen girl. The killer is never apprehended, and, after experiencing dark visions and supernatural encounters, Agent Dale Cooper chillingly predicts that the culprit will claim another life. Meanwhile, in the more cozy town of Twin Peaks, hedonistic beauty Laura Palmer hangs with lowlifes and seems destined for a grisly fate.",
                "popularity": 9.8063,
                "poster_path": "/rol5H6loAojd6tH2VXQYEXzGQk1.jpg",
                "release_date": "1992-06-03",
                "title": "Twin Peaks: Fire Walk with Me",
                "video": false,
                "vote_average": 7.392,
                "vote_count": 2083,
                "character": "Annie Blackburn",
                "credit_id": "593ca23192514105b70153b3",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Heather Joan Graham",
            "헤더 그레이엄",
            "ヘザー・グラハム",
            "ヘザー・グレアム",
            "Хізер Грем",
            "Гізер Ґрем",
            "هِدر گراهام"
        ],
        "biography": "Heather Graham, a talented actor born in Milwaukee, Wisconsin, rose to prominence for her captivating performances on screen. Her career took off with memorable roles in films such as \"Boogie Nights\" and \"Austin Powers: The Spy Who Shagged Me,\" showcasing her versatility and charm. Graham's ability to embody diverse characters across genres, from comedy to drama, solidified her as a versatile and esteemed actor. Beyond her on-screen success, she's also ventured into writing and directing, further showcasing her multifaceted talent in the entertainment industry. Her dedication to her craft and her enduring presence in Hollywood have made her a respected figure among audiences and peers alike.",
        "birthday": "1970-01-29",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 69122,
        "imdb_id": "nm0001287",
        "known_for_department": "Acting",
        "name": "Heather Graham",
        "place_of_birth": "Milwaukee, Wisconsin, USA",
        "popularity": 1.8137,
        "profile_path": "/avYdNkeg1oTvmrNJbFDcTlBCkKs.jpg"
    }
}