{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rRY5VgnpT1Pm9eYIlsboCbUgn5z.jpg",
                "genre_ids": [
                    35,
                    18,
                    37
                ],
                "id": 16563,
                "original_language": "en",
                "original_title": "Seven Brides for Seven Brothers",
                "overview": "In 1850 Oregon, when a backwoodsman brings a wife home to his farm, his six brothers decide that they want to get married too.",
                "popularity": 2.5557,
                "poster_path": "/8Z4W2oRQKkmt7lhqNPROcNru9yJ.jpg",
                "release_date": "1954-07-22",
                "title": "Seven Brides for Seven Brothers",
                "video": false,
                "vote_average": 7.148,
                "vote_count": 553,
                "character": "Girl (uncredited)",
                "credit_id": "660db28ed6dbba0163708803",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Miss Loey (nickname)"
        ],
        "biography": "Hall was born in Grand Rapids, Minnesota, the daughter of Lois Grace (née Lambert), a teacher, and Ralph Stewart Hall, a businessman and inventor. Hall's television appearances included Studio One, The Cisco Kid, Episode 112 of The Lone Ranger, Adventures of Superman, Highway Patrol, Marcus Welby, M.D., the penultimate episode of Little House on the Prairie and Star Trek: The Next Generation.\n\nHall has been seen in such classic films as Every Girl Should Be Married (1948), Love Happy, My Blue Heaven, Carrie, Night Raiders, Seven Brides for Seven Brothers in small roles, as well as in starring roles in pictures like Daughter of the Jungle and Pirates of the High Seas. She is perhaps best known for her supporting role as Sister Constance in Kenneth Branagh's acclaimed 1991 drama Dead Again, which also featured Raymond Cruz and Steven Culp.\n\nShe also guest-starred in TV series such as CSI, Cold Case, Six Feet Under, Nip/Tuck, and The Unit. She was also seen in the hit films Gone in 60 Seconds and Flightplan",
        "birthday": "1926-08-22",
        "deathday": "2006-01-01",
        "gender": 1,
        "homepage": null,
        "id": 69642,
        "imdb_id": "nm0355838",
        "known_for_department": "Acting",
        "name": "Lois Hall",
        "place_of_birth": "Grand Rapids, Minnesota, USA",
        "popularity": 0.1562,
        "profile_path": "/AnkWfPkYSF24XQo4BONFWz8UsCQ.jpg"
    }
}