{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5ChBhGXIX7RgOMSjIlXgBp6UjMf.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749,
                    36
                ],
                "id": 11661,
                "original_language": "fr",
                "original_title": "Joyeux Noël",
                "overview": "France, 1914, during World War I. On Christmas Eve, an extraordinary event takes place in the bloody no man's land that the French and the Scots dispute with the Germans…",
                "popularity": 3.824,
                "poster_path": "/9Ka8lKCIiWjnZiMslPQeakS5UhW.jpg",
                "release_date": "2005-11-09",
                "title": "Joyeux Noel",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 886,
                "character": "The Major",
                "credit_id": "5e087fb3d285af001391e10e",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nChristopher Fulford (born 1955 in London) is a British actor who is best known for his supporting roles in many British TV shows.\n\nIn his early career he often appeared in British crime dramas. He was guest star of both the ITV crime series Inspector Morse, as a suspect in Driven to Destruction (1990)  and as a killer in the early A Touch of Frost episode Widows and Orphans (1994). In 1993, Fulford also starred in the BBC adaptation of Scarlet and Black alongside a virtually unknown Ewan McGregor and Rachel Weisz. He also appeared as a \"male vigilante\" in Dalziel &amp; Pascoe.\n\nHe has featured in the films D-Tox (2002), Millions (2004) and Pierrepoint (2005) and the television dramas The Last Train and Deceit. He has also appeared extensively on British television, appearing in guest roles in episodes of series such as Inspector Morse, Cracker, Prime Suspect, Dalziel and Pascoe, Spooks, Judge John Deed and Waking the Dead. He recently appeared in the ITV1 dramas Whitechapel and Collision, both alongside Phil Davis.\n\nChristopher married actress Camille Coduri in 1992. They have two children, Rosa (born 1993) and Santino (born 1996).\n\nDescription above from the Wikipedia article Christopher Fulford, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 6970,
        "imdb_id": "nm0298089",
        "known_for_department": "Acting",
        "name": "Christopher Fulford",
        "place_of_birth": "London, England, UK",
        "popularity": 0.4128,
        "profile_path": "/2n73aEyiU4fJprC2vHIf0M7YJ62.jpg"
    }
}