{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bVmDpF2VzVivzH8GVFXfVJeRPd7.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 37495,
                "original_language": "en",
                "original_title": "Four Lions",
                "overview": "Four Lions tells the story of a group of British jihadists who push their abstract dreams of glory to the breaking point. As the wheels fly off, and their competing ideologies clash, what emerges is an emotionally engaging (and entirely plausible) farce.",
                "popularity": 1.6728,
                "poster_path": "/x4JzaRPXBs9wiHCe3e3ymXWuwfd.jpg",
                "release_date": "2010-05-07",
                "title": "Four Lions",
                "video": false,
                "vote_average": 6.949,
                "vote_count": 1200,
                "character": "Barry",
                "credit_id": "52fe464e9251416c91050439",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nigel Lyndsay",
            "奈杰尔·林赛"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nNigel Lindsay is an English actor. As well as many roles in TV and in film, most notably as Barry, the Muslim convert in Chris Morris's feature debut Four Lions for which he was nominated for Best British Comedy Performance in Film at the British Comedy Awards 2011, he has worked extensively in theatre, most recently opposite Sir Antony Sher as Dr Harry Hyman in Arthur Miller's Broken Glass at the Tricycle Theatre, for which he won the 2011 Whatsonstage Theatregoers' Choice Award as Best Supporting Actor. Nigel played Mugsy opposite Ray Winstone and Phil Daniels in the original 1995 National Theatre production of Patrick Marber’s Dealer's Choice; Max in The Real Thing by Tom Stoppard which won three Tonys on Broadway in 2000; Ariel in the 2004 Olivier award winning National Theatre production of Martin McDonagh’s The Pillowman, with Jim Broadbent and David Tennant; Nathan Detroit in Michael Grandage’s Guys and Dolls at the Piccadilly Theatre in 2005, and Lenny in Harold Pinter’s The Homecoming with Ken Cranham and Danny Dyer at the Almeida Theatre in 2009. He was also nominated in the 2008 WOS Awards as Best Supporting Actor opposite Stockard Channing and Jodie Whittaker in Awake and Sing, directed by Michael Attenborough at the Almeida Theatre. He will play the title character in the West End production of Shrek the Musical, which will begin performances at Theatre Royal, Drury Lane in May 2011.\n\nDescription above from the Wikipedia article Nigel Lindsay, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1969-12-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 6971,
        "imdb_id": "nm0512283",
        "known_for_department": "Acting",
        "name": "Nigel Lindsay",
        "place_of_birth": "St. John's Wood, London, England, UK",
        "popularity": 0.3112,
        "profile_path": "/bvkX9ju5Irpw0m1qnW1UuW0F24q.jpg"
    }
}