{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4VgyburZo88ocO1aSRFm0i5H5VX.jpg",
                "genre_ids": [
                    35
                ],
                "id": 760,
                "original_language": "fr",
                "original_title": "Les Aventures de Rabbi Jacob",
                "overview": "In this riot of frantic disguises and mistaken identities, Victor Pivert, a blustering, bigoted French factory owner, finds himself taken hostage by Slimane, an Arab rebel leader. The two dress up as rabbis as they try to elude not only assasins from Slimane's country, but also the police, who think Pivert is a murderer. Pivert ends up posing as Rabbi Jacob, a beloved figure who's returned to France for his first visit after 30 years in the United States. Adding to the confusion are Pivert's dentist-wife, who thinks her husband is leaving her for another woman, their daughter, who's about to get married, and a Parisian neighborhood filled with people eager to celebrate the return of Rabbi Jacob.",
                "popularity": 2.62,
                "poster_path": "/oYuCFxS2BGCHNGuv9No0GoP2DZf.jpg",
                "release_date": "1973-10-17",
                "title": "The Mad Adventures of Rabbi Jacob",
                "video": false,
                "vote_average": 7.401,
                "vote_count": 1012,
                "character": "Police biker",
                "credit_id": "5962b562c3a368293b0e7dd5",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Жан-Жак Моро"
        ],
        "biography": "Jean-Jacques Moreau is a French actor and screenwriter, born on February 4, 1947, in Stains, Seine-Saint-Denis. His artistic career spans both theater and film. He is distinguished by his versatility and the diversity of his collaborations with numerous renowned directors.\n\nIn film, Jean-Jacques Moreau has appeared in several notable films, including Gérard Oury's The Adventures of Rabbi Jacob, A Few Quiet Gentlemen, Jackal, and Good Kisses, Until Monday. He has also appeared in television productions, playing Leroy-Champier in the miniseries The Big Secret (1989), Duroc in Josephine or the Comedy of Ambitions (1979), and Theo van Gogh in Paul Gauguin (1975). He also appeared in the cult film Diva (1981), where he played the character of Krantz.\n\nHis presence on stage has been marked by numerous roles in both classical and contemporary works. He has worked under the direction of such leading figures as Gabriel Garran in Bertolt Brecht's The Visions of Simone Machard, Denis Llorca in William Shakespeare's Romeo and Juliet, and Jacques Echantillon in Dario Fo's Accidental Death of an Anarchist, a role for which he was nominated for a Molière Best Actor Award. He has also appeared in plays such as Jean-Michel Ribes' The Sycamore Tree Must Flow and Jean Genet's The Balcony.\n\nJean-Jacques Moreau has portrayed a variety of characters, ranging from drama to comedy, both on television and in the theater. His artistic career demonstrates a great adaptability and a pronounced taste for the eclecticism of genres and registers. Throughout his career, he has collaborated with directors and producers both in France and internationally, consolidating his reputation in the world of live performance and audiovisual.",
        "birthday": "1947-02-04",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.agencea.fr/artiste.cfm/687846_115_2-Jean-Jacques_MOREAU",
        "id": 69746,
        "imdb_id": "nm0603398",
        "known_for_department": "Acting",
        "name": "Jean-Jacques Moreau",
        "place_of_birth": "Stains, Seine-Saint-Denis, France",
        "popularity": 0.1198,
        "profile_path": "/y6wb6QiocsF7Wc991cpYAcG7Guq.jpg"
    }
}