{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xdefSJpYARFdW4jPhPsuvUlmt2M.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14
                ],
                "id": 11533,
                "original_language": "en",
                "original_title": "Jason and the Argonauts",
                "overview": "Jason, a fearless sailor and explorer, returns to his home land of Thessaly after a long voyage to claim his rightful throne. He learns, however, that he must first find the magical Golden Fleece. To do so, he must embark on an epic quest fraught with fantastic monsters and terrible perils.",
                "popularity": 3.524,
                "poster_path": "/xHVxIgqD5CxlOI5GHxvVSt5Zh5Y.jpg",
                "release_date": "1963-06-19",
                "title": "Jason and the Argonauts",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 648,
                "character": "Medea",
                "credit_id": "52fe44549251416c75030dcd",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nancy Diane Kovach",
            "نانسی کووَک"
        ],
        "biography": "A native of Flint, Michigan, Nancy Kovack was a student at the University of Michigan at 15, a radio deejay at 16, a college graduate at 19 and the holder of eight beauty titles by 20. Her professional acting career began on television in New York, first as one of Jackie Gleason's \"Glea Girls\" and then, more prominently, on The Dave Garroway Show (1953), Today (1952) and Beat the Clock (1950). A stage role opened Hollywood doors for Kovack, who signed with Columbia. She later racked up an impressive list of episodic television credits, and was Emmy-nominated for a 1969 guest shot on Mannix (1967). The wife of world-renowned maestro Zubin Mehta of New York Philharmonic fame, Kovack publicly alleges that she was recently bamboozled (to the tune of $150,000) by Susan McDougal, a central figure in the Whitewater scandal.",
        "birthday": "1935-03-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 69763,
        "imdb_id": "nm0468222",
        "known_for_department": "Acting",
        "name": "Nancy Kovack",
        "place_of_birth": "Flint, Michigan, USA ",
        "popularity": 0.2974,
        "profile_path": "/v8dMVo6jjfjGBOHSAzhJtopgqYZ.jpg"
    }
}