{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sLjeApi5odpyEoCzAnbr5DycL3z.jpg",
                "genre_ids": [
                    12,
                    35,
                    14,
                    10751,
                    18
                ],
                "id": 381289,
                "original_language": "en",
                "original_title": "A Dog's Purpose",
                "overview": "A dog goes on quest to discover his purpose in life over the course of several lifetimes with multiple owners.",
                "popularity": 6.9571,
                "poster_path": "/3jcNvhtVQe5Neoffdic39fRactM.jpg",
                "release_date": "2017-01-19",
                "title": "A Dog's Purpose",
                "video": false,
                "vote_average": 7.639,
                "vote_count": 3434,
                "character": "Rachel",
                "credit_id": "588df177925141183a009706",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jane McGregor is a Canadian actress, best known for her roles in Flower &amp; Garnet (2002), Slap Her, She's French! (2002), and That Beautiful Somewhere (2006), as well as her recurring role on the CTV series Robson Arms (2005).\n\nMcGregor's career began with classes at the Vancouver Youth Theatre at the age of eight, which were followed by toy commercials. Her first television series appearance was a guest role on two episodes of the Canadian classic The Odyssey (1992). Following this she appeared in a string of made-for-television movies. In 2000 she landed a lead in the MTV series Live Through This (2000), followed by the multi-Emmy Award-winning TV Movie Bang Bang You're Dead (2002).\n\nIn 2002 she starred in the American comedy Slap Her, She's French! (2002). She played Starla Grady, a popular Texas cheerleader, opposite Piper Perabo and Micheal McKean.\n\nLater that year she did the Canadian independent film Flower &amp; Garnet (2002), where she played Flower, an isolated, pregnant teenager. The film premiered at Toronto International Film Festival, played in the Berlin International Film Festival, and won several awards. Jane's performance was very well received.\n\nJane guest starred on The CW's Supernatural (2005), and played opposite Keri Rusell in the TV Movie The Magic of Ordinary Days (2005). She starred with Roy Dupuis in That Beautiful Somewhere (2006) as Catherine Nyland, an archaeologist suffering from debilitating migraines.\n\nFrom 2005 to 2008 she had a recurring role as Alicia Plecas in the Canadian series Robson Arms (2005). In 2007 she appeared in American Venus (2007) as Jenna Lane, a competitive ice skater hovering on the brink of a mental breakdown due to her controlling mother (portrayed by Rebecca De Mornay).\n\nMost recently, Jane appeared on Fox's Fringe (2008), CTV's _\"The Listener\" (2009- )_, Fox's _\"Almost Human\" (2013- )_, FX's _\"Fargo\" (2014- )_ and the upcoming The 9th Life of Louis Drax (2016).",
        "birthday": "1983-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 69855,
        "imdb_id": "nm0569990",
        "known_for_department": "Acting",
        "name": "Jane McGregor",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.2571,
        "profile_path": "/9ve8LkAFIk7X8ASTBnKPdANlNrZ.jpg"
    }
}