{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rBL73dGfdEqTr7Xj0HytF9s9SbM.jpg",
                "genre_ids": [
                    35,
                    12
                ],
                "id": 11153,
                "original_language": "en",
                "original_title": "National Lampoon's Vacation",
                "overview": "Clark Griswold is on a quest to take his family to the Walley World theme park for a vacation, but things don't go exactly as planned.",
                "popularity": 4.0035,
                "poster_path": "/q3DvoqY06yZnRp9faH6uge7n7VP.jpg",
                "release_date": "1983-07-29",
                "title": "National Lampoon's Vacation",
                "video": false,
                "vote_average": 7.104,
                "vote_count": 1638,
                "character": "Aunt Edna",
                "credit_id": "52fe44039251416c75025eff",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Emogeane Coca"
        ],
        "biography": "Imogene Fernandez de Coca (November 18, 1908 – June 2, 2001) was an American comic actress best known for her role opposite Sid Caesar on Your Show of Shows.\n\nStarting out in vaudeville as a child acrobat, she studied ballet and wished to have a serious career in music and dance, graduating to decades of stage musical revues, cabaret and summer stock. Finally in her 40s she began a celebrated career as a comedienne in television, starring in six series and guesting on successful television programs from the 1940s to the 1990s.\n\nShe was nominated for five Emmy awards for Your Show of Shows, winning Best Actress in 1951 and singled out for a Peabody Award for excellence in broadcasting in 1953. Coca was also nominated for a Tony Award in 1978 for On the Twentieth Century and received a sixth Emmy nomination at the age of 80 for an episode of Moonlighting.\n\nShe possessed a rubbery face capable of the broadest expressions—Life magazine compared her to Beatrice Lillie and Charlie Chaplin, and described her characterizations as taking \"people or situations suspended in their own precarious balance between dignity and absurdity, and push(ing) them over the cliff with one single, pointed gesture\"—the magazine noted a \"particularly high-brow critic\" as observing, \"The trouble with most comedians who try to do satire is that they are essentially brash, noisy and indelicate people who have to use a sledge hammer to smash a butterfly. Miss Coca, on the other hand, is the timid woman who, when aroused, can beat a tiger to death with a feather.\"\n\nIn addition to vaudeville, cabaret, theater and television, she appeared in film, voiced children's cartoons and was even featured in an MTV video by a New Wave band. Though her fame began late, she worked well into her 80s. Twice a widow, Coca died in 2001.\n\nDescription above from the Wikipedia article Imogene Coca, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1908-11-18",
        "deathday": "2001-06-02",
        "gender": 1,
        "homepage": null,
        "id": 70089,
        "imdb_id": "nm0168042",
        "known_for_department": "Acting",
        "name": "Imogene Coca",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.3264,
        "profile_path": "/jHvjlAGwQVUdlrwgWAcolkLHuLP.jpg"
    }
}