{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dENLz9Np9EV5Ro8UIBhbKC8BmSS.jpg",
                "genre_ids": [
                    53,
                    28,
                    18,
                    878
                ],
                "id": 61791,
                "original_language": "en",
                "original_title": "Rise of the Planet of the Apes",
                "overview": "A highly intelligent chimpanzee named Caesar has been living a peaceful suburban life ever since he was born. But when he gets taken to a cruel primate facility, Caesar decides to revolt against those who have harmed him.",
                "popularity": 8.3976,
                "poster_path": "/cjLsuP75UDlRdJVMXzXg3TJ4umX.jpg",
                "release_date": "2011-08-03",
                "title": "Rise of the Planet of the Apes",
                "video": false,
                "vote_average": 7.337,
                "vote_count": 12321,
                "character": "Irena - Charles' Nurse",
                "credit_id": "52fe4664c3a368484e08e215",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/gz3rCM34UicmOxRY1T2SgiQZJoS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 249164,
                "original_language": "en",
                "original_title": "If I Stay",
                "overview": "Mia Hall, a talented young cellist, thought the most difficult decision she would ever have to make would be whether to pursue her musical dreams at prestigious Juilliard or follow her heart to be with the love of her life, Adam, a rock singer/guitarist. However, a car wreck changes everything in an instant, and now Mia's life hangs in the balance. Suspended between life and death, Mia faces a choice that will decide her future.",
                "popularity": 3.8833,
                "poster_path": "/7Twh8h3Wh7GC9npTAEUThgkxkWL.jpg",
                "release_date": "2014-08-21",
                "title": "If I Stay",
                "video": false,
                "vote_average": 7.366,
                "vote_count": 4239,
                "character": "Liddy",
                "credit_id": "542d5aec0e0a2607ab001ccb",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Chelah Horsdale"
        ],
        "biography": "Chelah Horsdal is a Canadian actress. She is known for her regular roles in the television series Hell on Wheels, When Calls the Heart, and The Man in the High Castle, recurring roles on Stargate SG-1, Level Up, Arrow, and Star Trek: Discovery, and for her roles in the films Aliens vs. Predator: Requiem and Rise of the Planet of the Apes. Horsdal was born in Vancouver, British Columbia. She says she \"was born to hippie parents while surrounded by friends and family on the 'farm' Headacres.\"\n\nShe is the daughter of mother Lindsay and folksinger father Valdy. She grew up with her mother in Kitsilano and attended Bayview Elementary followed by Lord Byng Secondary. She began modelling in locally shot TV shows and commercials at 18, and then lived in the Caribbean for a year.\n\nHorsdal began her acting career in 2002. She has since appeared in more than 75 commercials as well as in films and on television. She has played lead and supporting roles on Hell on Wheels, The Man In the High Castle, When Calls the Heart, Candiland, Patterson's Wager, Three Weeks, Three Kids, On Strike For Christmas, Marley & Me: The Puppy Years, and Lifetime's The Client List. She had lead roles in Lying To Be Perfect and Mrs. Miracle.\n\nAdditional credits include leads on the feature Burning Mussolini, Nickelodeon's Gym Teacher: The Movie, co-starring Christopher Meloni and Amy Sedaris, Flirting with Forty with Heather Locklear and the FOX TV pilot The Virgin of Akron, Ohio. Supporting leads include Aliens vs. Predator: Requiem for 20th Century Fox and Possession alongside Sarah Michelle Gellar, as well as Elegy with Ben Kingsley and Penélope Cruz and Rise of the Planet of the Apes with John Lithgow and James Franco.\n\nHer performances in the short films Dark Room (2006) and The Hostage (2010) both earned Leo nominations for Best Performance. Recurring roles include Battlestar Galactica, Exes & Ohs, The L Word, Stargate: SG1, Saved, DaVinci's Inquest, Whistler, Blackstone, Clue and Cartoon Network's Level Up.\n\nThe Hostage, for which Horsdal was nominated for Best Actress at the 2011 Leos, co-starred and was produced by Tahmoh Penikett and Aleks Paunovic. Horsdal was nominated for four more Leo Awards for her guest starring turn on Arctic Air (2013), for Hell on Wheels and When Calls the Heart, and for Patterson's Wager.",
        "birthday": "1973-06-19",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.chelah.com",
        "id": 70175,
        "imdb_id": "nm1319098",
        "known_for_department": "Acting",
        "name": "Chelah Horsdal",
        "place_of_birth": " Vancouver Island, British Columbia, Canada",
        "popularity": 0.5545,
        "profile_path": "/gnylfySYJwlfAhm3QIdQ2Ua4zGd.jpg"
    }
}