{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mSwyH7ix20lqdKmPx7682gALwGu.jpg",
                "genre_ids": [
                    35
                ],
                "id": 4727,
                "original_language": "fr",
                "original_title": "Le Gendarme de Saint-Tropez",
                "overview": "The ambitious police officer Cruchot is transferred to St. Tropez. He's struggling with crimes such as persistent nude swimming, but even more with his teenage daughter, who's trying to impress her rich friends by telling them her father was a millionaire and owned a yacht in the harbor.",
                "popularity": 1.4271,
                "poster_path": "/6510K6Y8eYLf9FJ7O4xaOnwhn2u.jpg",
                "release_date": "1964-09-08",
                "title": "Le Gendarme de Saint-Tropez",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 893,
                "character": "Gypsy (uncredited)",
                "credit_id": "5e125f0e8741c400173ce82d",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Pierre Barouh (born Élie Pierre Barouh; 19 February 1934 – 28 December 2016) was a French writer-composer-singer best known for his work on Claude Lelouch's film A Man and a Woman as an actor and the lyricist/singer for Francis Lai's music score.  Barouh was born in Paris and along with his brother, Albert, and sister, was raised in Levallois-Perret. Their parents were Turkish-Jewish stallholders selling fabrics. During the Second World War, their parents hid them from the Nazis; Pierre and his sister in Montournais and Albert in la Limouzinière. During these years Élie, baptised Pierre, lived at La Grèlerie, the home of Hilaire and Marie Rocher, who had two sons. From this time, he drew inspiration for songs like \"À bicyclette\", \"Des ronds dans l'eau\" and \"Les Filles du dimanche\".\n\nAfter the war, he was briefly a sports journalist for Paris-Presse-Intransigeant and also played for the national volleyball B team in the 1950s. He spent some months in Portugal and discovered Brazilian music. He visited Brazil in 1959 and on his return to Paris got to know the principal Brazilian writers and composers of bossa nova.\n\nWith his first earnings he bought the mill, la Morvient, by the river in Le Boupère in the Vendée where he had spent part of his childhood. There he established a recording studio and welcomed other artists, using it to advance the talent of others and creating his own label Saravah in 1965. With the label he wished to mix musicians and styles, to multiply musical encounters. He worked, notably, with Pierre Akendengué, Areski Belkacem, Brigitte Fontaine, Nana Vasconcelos, Gérard Ansaloni, Jacques Higelin, Alfred Panou, Maurane, David McNeil, Elis Regina.\n\nSoon after the label's creation, Barouh realised that he was not a manager and so entrusted management to a teenage friend he had known when he was 15 playing volleyball. However, in 1972, he discovered that this friend had stolen 1,500,000 francs by means which prevented Barouh from being able to get any of it back, as he \"had given him everything: signatures, etc\".\n\nAs an actor, he played the role of the gypsy leader in the film D'ou viens-tu Johnny? and appeared in Lelouch's Une fille et des fusils. As writer/performer he had success with La Plage – immortalised by Marie Laforêt and the guitarist Claude Ciari -, Tes dix-huit ans and Monsieur de Furstenberg. He shot a documentary on the beginnings of bossa nova with his longtime friend Baden Powell de Aquino.\n\nIn 1966 he participated in the enormous success of the film A Man and a Woman which won the Palme d'Or at the 1966 Festival de Cannes. He married the actress Anouk Aimée the same year; they divorced three years later.\n\nBarouh died in the Hôpital Cochin in Paris from an infarction on 28 December 2016, at the age of 82. He was buried a week later at Montmartre Cemetery.\n\nSource: Article \"Pierre Barouh\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1934-02-19",
        "deathday": "2016-12-28",
        "gender": 2,
        "homepage": null,
        "id": 70179,
        "imdb_id": "nm0056435",
        "known_for_department": "Acting",
        "name": "Pierre Barouh",
        "place_of_birth": "Paris, France",
        "popularity": 1.2648,
        "profile_path": "/aTWFrf4papNqmKD61cCd0cWfBTR.jpg"
    }
}