{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5ChBhGXIX7RgOMSjIlXgBp6UjMf.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749,
                    36
                ],
                "id": 11661,
                "original_language": "fr",
                "original_title": "Joyeux Noël",
                "overview": "France, 1914, during World War I. On Christmas Eve, an extraordinary event takes place in the bloody no man's land that the French and the Scots dispute with the Germans…",
                "popularity": 3.824,
                "poster_path": "/9Ka8lKCIiWjnZiMslPQeakS5UhW.jpg",
                "release_date": "2005-11-09",
                "title": "Joyeux Noel",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 886,
                "character": "Nurse",
                "credit_id": "5e087e30a1c59d0016a9aebb",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/7hcoMi2AMRvPC7YnGm41k3Wcgvy.jpg",
                "genre_ids": [
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 10795,
                "original_language": "fr",
                "original_title": "Ne le dis à personne",
                "overview": "A man receives a mysterious email appearing to be from his wife, who was murdered years earlier. As he frantically tries to find out whether she's alive, he finds himself being implicated in her death.",
                "popularity": 4.9671,
                "poster_path": "/fr2wEeO1H8dzx6EDfzYTRBIvZaE.jpg",
                "release_date": "2006-11-01",
                "title": "Tell No One",
                "video": false,
                "vote_average": 7.229,
                "vote_count": 1450,
                "character": "Lucille's father",
                "credit_id": "68c2d1f3bf527c93a54e754d",
                "order": 40
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/5ChBhGXIX7RgOMSjIlXgBp6UjMf.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749,
                    36
                ],
                "id": 11661,
                "original_language": "fr",
                "original_title": "Joyeux Noël",
                "overview": "France, 1914, during World War I. On Christmas Eve, an extraordinary event takes place in the bloody no man's land that the French and the Scots dispute with the Germans…",
                "popularity": 3.824,
                "poster_path": "/9Ka8lKCIiWjnZiMslPQeakS5UhW.jpg",
                "release_date": "2005-11-09",
                "title": "Joyeux Noel",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 886,
                "credit_id": "52fe44739251416c7503537d",
                "department": "Directing",
                "job": "Director"
            },
            {
                "adult": false,
                "backdrop_path": "/5ChBhGXIX7RgOMSjIlXgBp6UjMf.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749,
                    36
                ],
                "id": 11661,
                "original_language": "fr",
                "original_title": "Joyeux Noël",
                "overview": "France, 1914, during World War I. On Christmas Eve, an extraordinary event takes place in the bloody no man's land that the French and the Scots dispute with the Germans…",
                "popularity": 3.824,
                "poster_path": "/9Ka8lKCIiWjnZiMslPQeakS5UhW.jpg",
                "release_date": "2005-11-09",
                "title": "Joyeux Noel",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 886,
                "credit_id": "5e0876f4d236e60010a1ff1b",
                "department": "Writing",
                "job": "Screenplay"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christian Carion (born 4 January 1963) is a French film director, dialogue writer and screenwriter, gaining international attention for Joyeux Noël (Merry Christmas), which was nominated for several awards, including the 2005 Academy Award for Best Foreign Language Film.\n\nChristian Carion was born into a family of farmers in the north of France. Carion's youth was spent in his parents' farm fields, where he was constantly reminded of World War I as the family often found dangerous, unexploded shells left over from the conflicts in the fields. He had also heard of the stories in which French soldiers would leave their trenches at night to meet with their wives in the surrounding German-occupied towns and return to fight the next morning. After passing his baccalauréat, he joined an engineering school affiliated to the French ministry of agriculture.\n\nLater he decided to quit his scientific career and began shooting films he himself describes as \"uninteresting\". When he met Christophe Rossignon, both men started to collaborate in movie-making - Carion as film-maker and Rossignon as producer. In 1999, Rossignon also acted in Carion's short film Monsieur le député.\n\nIn 2001, Carion directed his first feature film: Une hirondelle a fait le printemps (The Girl from Paris), the story, an hommage to his upbringing, tells the meeting of a brooding farmer, Michel Serrault, and a parisian girl seeking the calm of the countryside, played by Mathilde Seigner. The film attracted over 2.4 million of French moviegoers.\n\nFollowing this success, Carion started a more ambitious project, Joyeux Noël (Merry Christmas). Screened in Cannes for the film festival in 2005, this historic fiction film depicts the fraternizations of warriors from three different countries on the eve of Christmas during World War I. Carion stated that he'd never heard of the actual Christmas truce incidents while growing up in France, as the French Army and authorities suppressed them, having been viewed as an act of disobedience. He was introduced to the story via a historian who showed him photos and documents archived in France, Great Britain, and Germany. The film was a commercial success. It was nominated for numerous awards at the French César Awards and for the Oscar for Best Foreign Film.\n\nTwo years later, he filmed another historic film; L'Affaire Farewell (Farewell), with Emir Kusturica and Guillaume Canet - a spy film set in Russia and based on true events.\n\nIn 2014 he shot, on the roads of northern France, En mai, fais ce qu'il te plait. This movie is another historical piece about the exodus of millions of people in May 1940, when France was falling apart and the inhabitants of northern France were fleeing the German troops. Written using numerous recollections from the northern people, the film depicts the quest of a German dissident, looking for his son. The original music was composed by Ennio Morricone.\n\nDescription above from the Wikipedia article Christian Carion, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1963-01-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 70221,
        "imdb_id": "nm0137228",
        "known_for_department": "Directing",
        "name": "Christian Carion",
        "place_of_birth": "Cambrai, Nord, France",
        "popularity": 0.2487,
        "profile_path": "/swZtgm2jWzptuElgRj8WHLhi4E8.jpg"
    }
}