{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aSA7RuKmCQBnYKn70GYPi6ckgoY.jpg",
                "genre_ids": [
                    28,
                    53,
                    18
                ],
                "id": 11690,
                "original_language": "en",
                "original_title": "Bloodsport",
                "overview": "An American Army Major goes AWOL to Hong Kong for an outlawed martial arts contest called the Kumite.",
                "popularity": 4.09,
                "poster_path": "/kndxR9TRK0kJ5hxzDprRSS80F2W.jpg",
                "release_date": "1988-02-26",
                "title": "Bloodsport",
                "video": false,
                "vote_average": 7.027,
                "vote_count": 1994,
                "character": "Ray Jackson",
                "credit_id": "52fe447a9251416c750361e7",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Donald Richard Gibb",
            "Don Gibb",
            "دونالد گیب"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nDonald Gibb (born August 4, 1954), sometimes credited as Don Gibb, is an American actor with an imposing 6 ft-4in frame, best known for portraying the hulking, dimwitted fraternity brother \"Ogre\" in several installments of the Revenge of the Nerds film series.\n\nRaised in California, Gibb attended the University of New Mexico on a basketball scholarship, where he joined Phi Delta Theta fraternity. He then transferred to University of San Diego to play football. Gibb played briefly for the San Diego Chargers before turning to acting, beginning with small, uncredited roles in Stripes and Conan the Barbarian.\n\nGibb is best known for his \"Ogre\" character portrayed first in Revenge of the Nerds and later in Revenge of the Nerds II: Nerds in Paradise and Revenge of the Nerds IV: Nerds in Love. Chugging beer from a trophy, throwing nerds off fraternity buildings and competing in belching contests, Gibb gleefully played up his former days as a college football jock.\n\nGibb's other famous recurring role was in a string of martial arts pictures. As American kumite entrant named Ray Jackson, he starred alongside Jean-Claude Van Damme in Bloodsport, and alone in the 1996 Bloodsport sequel. Gibb has appeared in more than 25 movies including Jocks and Amazon Women on the Moon. Gibb also had a starring role in the HBO sitcom, 1st &amp; Ten, from 1984–1991, as Leslie \"Dr. Death\" Krunchner, a linebacker. Then he played small roles in Quantum Leap, MacGyver, Night Court, Renegade and Step by Step. Subsequently, he also played a small role in the PC game Zork: Grand Inquisitor as the man in the third portal with Lucy and can be seen in a bit role in the film Hancock, starring Will Smith.\n\nGibb is the spokesman and co-owner for Chicago brewery, Trader Todd's, through which Gibb is marketing Ogre beer, which is named after his iconic character in Revenge of the Nerds.\n\nHe can be seen portraying a pillager in the Capital One (credit card) \"Pillagers\" commercial series. In the commercials, he can be spotted as the pillager who smashes the musician's violin at a dinner table, or being told by a make-up artist that \"you are definitely an Autumn,\" or as the pillager who breaks the lobsters open with a war mace.\n\nDescription above from the Wikipedia article Donald Gibb, licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1954-08-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 70254,
        "imdb_id": "nm0316455",
        "known_for_department": "Acting",
        "name": "Donald Gibb",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.1895,
        "profile_path": "/3SGqGltQ6J0LUJ84DZTdWSMh8O8.jpg"
    }
}