{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/egyi9TQjLhNEQuEsK1dXovdHOHL.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 509,
                "original_language": "en",
                "original_title": "Notting Hill",
                "overview": "London bookstore owner William Thacker's quiet life turns upside down when a chance encounter with famous actress Anna Scott sparks an unlikely romance challenged by their vastly different worlds.",
                "popularity": 8.2899,
                "poster_path": "/hHRIf2XHeQMbyRb3HUx19SF5Ujw.jpg",
                "release_date": "1999-05-21",
                "title": "Notting Hill",
                "video": false,
                "vote_average": 7.265,
                "vote_count": 6425,
                "character": "Anna's Publicist",
                "credit_id": "52fe424cc3a36847f8013461",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lorelei King is a United States-born actress who has been based in the United Kingdom since 1981. She is primarily known for her voice acting, narrating audiobooks and appearing in plays on BBC Radio 4.\n\nKing spent her childhood moving between Pennsylvania, Arkansas, and California. In 1981, she planned to move to either Paris or Yugoslavia, where her family originated, but after a three-day stopover in London, she decided to stay in Britain\n\nKing has made numerous television roles, which include drama, comedy and children's shows. Her first appearance was in the drama Murrow (1983), a biography of the American news reporter and political commentator Edward R. Murrow and since then she has had roles in many British shows, such as Series 2 on the Sky One show, Mile High as Fresh! airlines HR boss, Stella Lightfoot, Chef! (as Savanna), Linda Milson in ‘’Rumpole of the Bailey’’ in 1991 and in the ITV soap opera Emmerdale as showgirl Vonda Lockhart. As well as this, she has also had parts in films such as Shining Through (1992), Notting Hill (1999), 24 Hours in London (2000) and The House of Mirth (2000), as well lending her voice to radio shows and video games. This includes Dirk Maggs' adaptations of The Adventures of Superman and Batman: Knightfall. She voiced the character of Mary Osakwe in the UFO: Afterlight computer game. More recently, she provided voices to small parts in the video games Mass Effect: Andromeda (2017), Subnautica (2018) and its sequel Subnautica: Below Zero (2021). In 2006, she appeared in an episode of sitcom Not Going Out as a therapist. She has narrated over 400 audiobooks.  King also provided the voice of Samus Aran's Power Suit in a 2005 pinball video game, Metroid Prime Pinball. In 2017 she portrayed the voice of MUTHUR, the eponymous spaceship's computer in Alien: Covenant.",
        "birthday": "1963-03-08",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.loreleiking.com/",
        "id": 7032,
        "imdb_id": "nm0455009",
        "known_for_department": "Acting",
        "name": "Lorelei King",
        "place_of_birth": "Pittsburgh, Pennsylvania, United States",
        "popularity": 0.2107,
        "profile_path": "/yCli8FtnvC50bmg5NGYEGO5n5yS.jpg"
    }
}