{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7g5v2zXedkwiFqDlWqcoRUUQYD6.jpg",
                "genre_ids": [
                    18,
                    28,
                    35
                ],
                "id": 11712,
                "original_language": "ja",
                "original_title": "椿三十郎",
                "overview": "Toshiro Mifune swaggers and snarls to brilliant comic effect in Kurosawa's tightly paced, beautifully composed \"Sanjuro.\" In this companion piece and sequel to \"Yojimbo,\" jaded samurai Sanjuro helps an idealistic group of young warriors weed out their clan's evil influences, and in the process turns their image of a proper samurai on its ear.",
                "popularity": 3.2847,
                "poster_path": "/zW47oIH3bc3ggmmmzTvKqM4Fqjk.jpg",
                "release_date": "1962-01-01",
                "title": "Sanjuro",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 661,
                "character": "The Spy",
                "credit_id": "52fe447e9251416c75036ceb",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/rphor0XQcYO4CQoQ6auaQm3UPap.jpg",
                "genre_ids": [
                    16,
                    18,
                    10751
                ],
                "id": 37797,
                "original_language": "ja",
                "original_title": "耳をすませば",
                "overview": "Shizuku lives a simple life, dominated by her love for stories and writing. One day she notices that all the library books she has have been previously checked out by the same person: 'Seiji Amasawa'.",
                "popularity": 6.6653,
                "poster_path": "/5FROLD8zpWFs9ja7aYho1uOMJHg.jpg",
                "release_date": "1995-07-15",
                "title": "Whisper of the Heart",
                "video": false,
                "vote_average": 7.955,
                "vote_count": 2140,
                "character": "Shiro Nishi (voice)",
                "credit_id": "52fe466f9251416c91054605",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Кэйдзю Кобаяси"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nKeiju Kobayashi (23 November 1923–16 September 2010) was a Japanese actor. Born in Gunma Prefecture, he began acting at the Nikkatsu studio after dropping out of Nihon University and made his film debut in 1942. In a career that spanned 65 years, he appeared in over 250 films, most famously in the \"Company President\" (Shachō) comedy films made at Toho, where he worked alongside Hisaya Morishige, Daisuke Kato, Norihei Miki, and others. There he helped define the popular image of the postwar salaryman. He also won many awards for his acting, including best actor awards at the Mainichi Film Awards for The Naked General in 1958 (where he played Kiyoshi Yamashita), for Kuroi gashū in 1960, and for The Elegant Life of Mr Everyman in 1963. Kobayashi appeared in films made by such notable directors as Akira Kurosawa, Yasujirō Ozu, Mikio Naruse, and Kihachi Okamoto. He continued to give powerful performances after largely moving to television in the late 1960s.\n\nHe died on 16 September 2010 of heart failure at the age of 86.\n\nDescription above from the Wikipedia article Keiju Kobayashi, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1923-11-23",
        "deathday": "2010-09-16",
        "gender": 2,
        "homepage": null,
        "id": 70324,
        "imdb_id": "nm0462013",
        "known_for_department": "Acting",
        "name": "Keiju Kobayashi",
        "place_of_birth": "Gunma, Japan",
        "popularity": 0.4971,
        "profile_path": "/nG3Yzjl2zJXdpQwJDXvoGND87Sh.jpg"
    }
}