{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lHx9jigYO4tIUiZV3v6PSDJFkIR.jpg",
                "genre_ids": [
                    35
                ],
                "id": 10794,
                "original_language": "en",
                "original_title": "The Party",
                "overview": "Hrundi V. Bakshi, an accident-prone actor from India, is accidentally put on the guest list for an upcoming party at the home of a Hollywood film producer. Unfortunately, from the moment he arrives, one thing after another goes wrong with compounding effect.",
                "popularity": 2.5026,
                "poster_path": "/8d2Msw39YzwkBWfBMauCulp7D0.jpg",
                "release_date": "1968-04-04",
                "title": "The Party",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 804,
                "character": "'Wyoming Bill' Kelso",
                "credit_id": "582f3920925141381800e5a7",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dennis Miller",
            "Denny Scott Miller",
            "Scott Miller"
        ],
        "biography": "Born in Bloomington, Indiana, on April 25, 1934, Denny Miller's family eventually settled in Los Angeles. As a 6'4\" college student, Miller found success as the star player of UCLA's basketball team and earned a degree in physical education from the university. Following a stint in the Army, by chance Miller was discovered by a talent agent in 1958 while working a summer job and signed a multi-year contract with MGM. Miller's first starring film role was Tarzan, the Ape Man, released by MGM in 1959.\n\nAlthough Miller's film career never achieved great momentum, he did lots of television, including guest appearances on Gilligan's Island, The Brady Bunch, Wonder Woman, and Dr. Quinn, Medicine Woman, to name a few. Until 2005, Miller was seen on Gorton's commercials as the Gorton's fisherman. After a lengthy battle with ALS, Denny Miller passed away on September 9, 2014, at age 80.",
        "birthday": "1934-04-25",
        "deathday": "2014-09-09",
        "gender": 2,
        "homepage": null,
        "id": 70425,
        "imdb_id": "nm0588225",
        "known_for_department": "Acting",
        "name": "Denny Miller",
        "place_of_birth": "Bloomington, Indiana, USA",
        "popularity": 0.5509,
        "profile_path": "/c8QSpis4XRMi0nXf8LiYEejOY9e.jpg"
    }
}