{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lMRX4cLx4hxYth3iQ96c0E1RHGB.jpg",
                "genre_ids": [
                    28,
                    35
                ],
                "id": 11770,
                "original_language": "cn",
                "original_title": "少林足球",
                "overview": "A young Shaolin follower reunites with his discouraged brothers to form a soccer team using their martial art skills to their advantage.",
                "popularity": 7.446,
                "poster_path": "/mu5oyde0MK3Xgl6CCy6xyTNuiHv.jpg",
                "release_date": "2001-07-05",
                "title": "Shaolin Soccer",
                "video": false,
                "vote_average": 7.149,
                "vote_count": 2398,
                "character": "Fung",
                "credit_id": "52fe44819251416c7503731d",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Man Tat Ng",
            "Ng Man Tat",
            "Wú Mèngdá ",
            "Wu Meng Da",
            "Man-Tat Ng",
            "Wu Meng-da",
            "Richard Ng",
            "Ngô Mạnh Đạt",
            "吳孟達",
            "吴孟达",
            "Uncle Tat",
            "达叔",
            "達叔",
            "阿達",
            "Richard Ng Man-Tat"
        ],
        "biography": "Richard Ng Man-Tat (Chinese: 吳孟達, 2 January 1952 - 27 February 2021) was a veteran actor in the Hong Kong film industry, with dozens of titles under his belt. Ng worked with famous actor and director Stephen Chow in a series of \"mo lei tau\" movies (\"mo lei tau\" translates to \"brainless\"/\"senseless or random,\" and it is a genre of slapstick comedy unique to Hong Kong). Ng co-starred with Stephen Chow in a Hong Kong TVB television series called Dun Fei Final Combat (1989), and also the popular 1990 film All for the Winner, where he played the role of Chow's uncle. From then on, the two would grow to star in many more \"mo lei tau\" films in the same style as All for the Winner. Although Ng Man-Tat owed much of his popularity from co-starring with Chow in \"mo lei tau\" films, he showed himself to be a versatile enough actor to successfully portray various different roles. A perfect example of his talent was in his portrayal of Sister 13's father in Portland Street Blues, where he played a man who could not feel anything but abuse and rejection. This role proved to be the perfect complement to his usual \"mo lei tau\" style with Stephen Chow. He also played Andy Lau's sidekick in the Lee Rock series in a more serious role. In Hong Kong, Ng Man-Tat was often known as \"Uncle Tat\", a nickname most likely influenced from his roles as Stephen Chow's sidekick (often as his uncle) in their films. Ng was sometimes credited as Richard Ng. Even though he was Stephen Chow's good friend, he stopped starring in his movies because he didn't want to be known as \"Stephen Chow's Sidekick\".",
        "birthday": "1952-01-02",
        "deathday": "2021-02-27",
        "gender": 2,
        "homepage": null,
        "id": 70437,
        "imdb_id": "nm0628806",
        "known_for_department": "Acting",
        "name": "Richard Ng Man-Tat",
        "place_of_birth": "Xiamen, Fujian Province, China",
        "popularity": 1.0057,
        "profile_path": "/3c2rDkLmuJnRo00ObM4K82plqZO.jpg"
    }
}