{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7ldtxkVW93dTVKRrA2Fe0CSl0S1.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 11798,
                "original_language": "en",
                "original_title": "This Is England",
                "overview": "A story about a troubled boy growing up in England, set in 1983. He comes across a few skinheads on his way home from school, after a fight. They become his new best friends, even like family. Based on experiences of director Shane Meadows.",
                "popularity": 0.9127,
                "poster_path": "/bmhVn89BoAAIziFklH3TusE26H0.jpg",
                "release_date": "2007-04-27",
                "title": "This Is England",
                "video": false,
                "vote_average": 7.481,
                "vote_count": 1331,
                "character": "Shaun",
                "credit_id": "52fe44879251416c75038025",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/eVHVwP71el20fofkCHo78ebQv7Q.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 343668,
                "original_language": "en",
                "original_title": "Kingsman: The Golden Circle",
                "overview": "When an attack on the Kingsman headquarters takes place and a new villain rises, Eggsy and Merlin are forced to work together with the American agency known as the Statesman to save the world.",
                "popularity": 8.4784,
                "poster_path": "/34xBL6BXNYFqtHO9zhcgoakS4aP.jpg",
                "release_date": "2017-09-20",
                "title": "Kingsman: The Golden Circle",
                "video": false,
                "vote_average": 6.954,
                "vote_count": 10745,
                "character": "Liam",
                "credit_id": "59c2f084c3a368141e001a29",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/pkZ8SaIQwjBuS1fcJJE7Are7IrL.jpg",
                "genre_ids": [
                    878,
                    35,
                    12
                ],
                "id": 696506,
                "original_language": "en",
                "original_title": "Mickey 17",
                "overview": "Unlikely hero Mickey Barnes finds himself in the extraordinary circumstance of working for an employer who demands the ultimate commitment to the job… to die, for a living.",
                "popularity": 16.906,
                "poster_path": "/edKpE9B5qN3e559OuMCLZdW1iBZ.jpg",
                "release_date": "2025-02-28",
                "title": "Mickey 17",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 2679,
                "character": "Bazooka Soldier",
                "credit_id": "66ea76afb2917eb1800b5187",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Thomas Aiden Turgoose (born February 11, 1992) is an English actor, best known for his role as Shaun Fields in the film This Is England (2006), a role he reprises in the This Is England TV series This Is England '86 (2010), This Is England '88 (2011) and This Is England '90 (2015).\n\nIn his first film role in 2006, he played the lead character, Shaun Fields, in This Is England, written and directed by Shane Meadows. On television he played the character Dizzy, a young boy mentored by Adam Solomons (Luke Treadaway), in the 2006 BBC drama series The Innocence Project. The programme was cancelled after eight episodes due to poor ratings and negative reviews. Turgoose's character was in six of the eight episodes. In 2008, he was again in a Shane Meadows film, Somers Town, where he co-starred in a comedy role with young Polish actor Piotr Jagiello. Both young actors shared the \"Best Actor in a Narrative Feature\" award at New York's Tribeca Film Festival. He was also in The Scouting Book for Boys, and appeared in This Is England '86, a 4-part TV series for Channel 4 looking at characters from This is England three years on. A year later, he appeared in the three-part series This Is England '88, aired just before Christmas 2011, and also appeared in This Is England '90, aired in 2015.\n\nHe appeared on Pointless Celebrities, where he was paired with fellow actor Vas Blackwood. On 7 November 2015, he made his second appearance on Pointless Celebrities, where he was paired with Tyger Drew-Honey. In 2017, Turgoose appeared in the Season 7 premiere of the HBO series Game of Thrones as a Lannister soldier.\n\nTurgoose is a supporter of Grimsby Town, although he admits that as a boy he supported Manchester United, and is a season ticket holder at his hometown club. Prior to Grimsby Town's Conference Premier play-off final against Bristol Rovers, he interviewed manager Paul Hurst, club captain Craig Disley and striker Lenell John-Lewis for Football Focus, which was aired on 16 May 2015.",
        "birthday": "1992-02-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 70517,
        "imdb_id": "nm2129938",
        "known_for_department": "Acting",
        "name": "Thomas Turgoose",
        "place_of_birth": "Grimsby, England, UK",
        "popularity": 0.8229,
        "profile_path": "/3PsCUvclNzVrjDGg69Q3blw83ei.jpg"
    }
}