{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wpz62HFxCGaMX6jImELAspwqjT1.jpg",
                "genre_ids": [
                    878,
                    27,
                    18
                ],
                "id": 11815,
                "original_language": "en",
                "original_title": "The Fly",
                "overview": "Industrialist François Delambre is called late at night by his sister-in-law, Helene Delambre, who tells him that she has just killed her husband, André. Reluctant at first, she eventually explains to the police that André invented a matter transportation apparatus and, while experimenting on himself, a fly entered the chamber during the matter transference.",
                "popularity": 3.4147,
                "poster_path": "/kXdBcDh2EbgSIf4Oo1dxKapZM2f.jpg",
                "release_date": "1958-07-16",
                "title": "The Fly",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 573,
                "character": "Helene Delambre",
                "credit_id": "52fe448a9251416c750386d5",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pat Owens",
            "Patricia Molly Owens"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nPatricia Owens (17 January 1925, Golden, British Columbia - 31 August 2000, Lancaster, California) was a Canadian-born American actress, working in Hollywood. She appeared in about 40 films and 10 TV episodes in a career lasting from 1943 to 1968.\n\nCanadian-born actress Patricia Owens moved to England with her parents in 1933, and ten years later, at age 18, she made her motion-picture debut in Val Guest's musical comedy Miss London Ltd. The following year, she had a small role in Harold French's social satire English Without Tears. Her career continued in this manner for the next few years, Owens getting ever-larger roles in generally better movies (though not always—the same year in which she worked in the Launder-Gilliat production of The Happiest Days of Your Life, one of the funniest movies ever made in England, she also appeared in the abysmal Old Mother Riley, Headmistress).\n\nHer career took a giant step upward when she was seen by a 20th Century Fox executive while performing in a theatrical production of Sabrina Fair and was offered a screen test. The result was a contract with the studio and a move to Hollywood. Her first American film was Island in the Sun (1957) for Fox, and then Owens was loaned out to Warner Bros. to play opposite Marlon Brando in the drama Sayonara (1957), one of the most critically acclaimed movies of the year. Owens spent the rest of 1957 working mostly on loan-out, but it was a 1958 Fox production that secured her place in motion picture history—as Helene Delambre, the wife of scientist Andre Delambre in The Fly (1958), co-starring with David Hedison and Vincent Price. Owens carried much of the film's story and drama, which were told in flashback from her character's point-of-view. The Fly was one of the most successful science fiction movies of the decade; the image of Owens unmasking her stricken husband and screaming at what she sees—and the shot of her horrified visage seen in a \"fly's eye\" view—became one of the defining moments in the genre.\n\nUnfortunately for Owens, she never got another movie half as good as The Fly, from Fox or anyone else, and in 1961 was reduced to working in the threadbare, backlot POW/jungle chase drama Seven Women from Hell. Owens made occasional television appearances, on series such as Perry Mason and Burke's Law, but these were relatively infrequent. Owens also starred in one of the 17 episodes of Alfred Hitchcock Presents directed by Hitchcock himself, \"The Crystal Trench\" (1959). By 1965, she was working in Black Spurs, one of producer A.C. Lyles' B-Westerns, renowned for their use of aging genre stars, and Owens retired from movies after portraying Richard Egan's love interest in the low-budget espionage thriller The Destructors (1968). Her last professional appearance was in a 1968 episode of Lassie.\n\nShe was the third wife of screenwriter and producer Sy Bartlett.\n\nDescription above from the Wikipedia article Patricia Owens (actress), licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1925-01-17",
        "deathday": "2000-08-31",
        "gender": 1,
        "homepage": null,
        "id": 70564,
        "imdb_id": "nm0654433",
        "known_for_department": "Acting",
        "name": "Patricia Owens",
        "place_of_birth": "Golden, British Columbia, Canada",
        "popularity": 0.3825,
        "profile_path": "/sIWUitlqck6PKoEUU0hziHV07nU.jpg"
    }
}