{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xUWf5xX0AnZgAnYXAMk03zTbsef.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 508,
                "original_language": "en",
                "original_title": "Love Actually",
                "overview": "Eight very different couples deal with their love lives in various loosely interrelated tales all set during a frantic month before Christmas in London.",
                "popularity": 6.7867,
                "poster_path": "/7QPeVsr9rcFU9Gl90yg0gTOTpVv.jpg",
                "release_date": "2003-09-07",
                "title": "Love Actually",
                "video": false,
                "vote_average": 7.105,
                "vote_count": 7040,
                "character": "Mia",
                "credit_id": "52fe424bc3a36847f801336d",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/arFPEDEW4PzPaMBXgTPzJlumfGw.jpg",
                "genre_ids": [
                    18
                ],
                "id": 203833,
                "original_language": "en",
                "original_title": "The Book Thief",
                "overview": "While subjected to the horrors of WWII Germany, young Liesel finds solace by stealing books and sharing them with others. Under the stairs in her home, a Jewish refugee is being sheltered by her adoptive parents.",
                "popularity": 3.0586,
                "poster_path": "/wj4U5sMLcJMa3WR9CpRR9e2sdgZ.jpg",
                "release_date": "2013-11-08",
                "title": "The Book Thief",
                "video": false,
                "vote_average": 7.496,
                "vote_count": 4414,
                "character": "Liesel's mother",
                "credit_id": "52fe4ce7c3a368484e1cc1d7",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Makatsch was born in Düsseldorf, Germany, the daughter of former German national ice hockey team goaltender Rainer Makatsch. She spent several months in New Mexico in 1988 in an effort to improve her English, and later studied politics and sociology at the University of Düsseldorf for four semesters, which was followed by an apprenticeship as a dressmaker until 1994. Her television career started in 1993, when she was hired by music channel VIVA, hosting shows such as Interaktiv and Heikes Hausbesuche; two years later, on August 13 1995, she became the host of the German chart show BRAVO TV, aired by RTL II, a position she kept until summer 1996. In 1997 she started hosting her own weekly, late night show titled Heike Makatsch Show. However, due to bad ratings, it was cancelled after only eight episodes. Makatsch first appeared in a movie in 1996, when she starred in Detlev Buck's Männerpension (English: \"Jailbirds\"); she received the Bavarian Film Award as most talented young actor for her performance. Since then, she has appeared in several German and English language productions.",
        "birthday": "1971-08-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 7059,
        "imdb_id": "nm0538443",
        "known_for_department": "Acting",
        "name": "Heike Makatsch",
        "place_of_birth": "Düsseldorf, Germany",
        "popularity": 0.6275,
        "profile_path": "/plwQwvsMG18F3eiD0rWN1Vpw75u.jpg"
    }
}