{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rpsHpJj7FgnNBXhaO2KFthPwqH6.jpg",
                "genre_ids": [
                    10749,
                    18,
                    35
                ],
                "id": 200727,
                "original_language": "en",
                "original_title": "Love, Rosie",
                "overview": "Since the moment they met at age 5, Rosie and Alex have been best friends, facing the highs and lows of growing up side by side. A fleeting shared moment, one missed opportunity, and the decisions that follow send their lives in completely different directions. As each navigates the complexities of life, love, and everything in between, they always find their way back to each other - but is it just friendship, or something more?",
                "popularity": 6.6277,
                "poster_path": "/8Mf9GgyNv5jjLAAPGsom9skH2Du.jpg",
                "release_date": "2014-10-16",
                "title": "Love, Rosie",
                "video": false,
                "vote_average": 7.819,
                "vote_count": 6361,
                "character": "Alice Dunne",
                "credit_id": "57d7574a925141404c000067",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/bQHHEFYBZc23nhbo0z0qB7nxW31.jpg",
                "genre_ids": [
                    35,
                    18,
                    10402
                ],
                "id": 11663,
                "original_language": "en",
                "original_title": "The Commitments",
                "overview": "Jimmy Rabbitte, just a thick-ya out of school, gets a brilliant idea: to put a soul band together in Barrytown, his slum home in north Dublin. First he needs musicians and singers: things slowly start to click when he finds three fine-voiced females virtually in his back yard, a lead singer (Deco) at a wedding, and, responding to his ad, an aging trumpet player, Joey \"The Lips\" Fagan.",
                "popularity": 2.4471,
                "poster_path": "/iccBDq9aS1gwi6b8aJjBgPU4t2D.jpg",
                "release_date": "1991-08-14",
                "title": "The Commitments",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 569,
                "character": "Pawnbroker",
                "credit_id": "5892876c92514122dd00081e",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nGer Ryan is an Irish film and television actress, whose credits include Queer as Folk, The War of the Buttons, The Van, Moll Flanders, Driftwood, A Love Divided and Intermission.\n\nRyan has worked extensively in theatre, television and film. She has been twice nominated for a Royal Television Society Award for Family and Amongst Women, and three times nominated by IFTA for Amongst Women, Intermission and The Return. She is also a recipient of a Belfast Telegraph EMA Award in for her work on A Place with the Pigs and Song of the Yellow Bittern. In 2007, she received an IFTA for her work on the two-part docu-drama, Stardust, by RTÉ. She also played Margie McEvoy in all three series of the award-winning BBC drama series, The Street, with Timothy Spall. Most recently, she has played the role of Maeve Harte in RTÉ's popular drama series, Raw.\n\nDescription above from the Wikipedia article Ger Ryan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 70685,
        "imdb_id": "nm0752557",
        "known_for_department": "Acting",
        "name": "Ger Ryan",
        "place_of_birth": null,
        "popularity": 0.1762,
        "profile_path": "/4fHO7Ogf9SEkg0HfDUhEwQ30AW1.jpg"
    }
}