{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kcK6wlt4TT1ETgr8mJhXgUg3HYE.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11646,
                "original_language": "en",
                "original_title": "Gallipoli",
                "overview": "Two Australian sprinters face the brutal realities of war when they are sent to fight in the Gallipoli campaign in the Ottoman Empire during World War I.",
                "popularity": 1.824,
                "poster_path": "/un7VCqTmjrq3u75mQ204a8tofD4.jpg",
                "release_date": "1981-08-13",
                "title": "Gallipoli",
                "video": false,
                "vote_average": 7.05,
                "vote_count": 505,
                "character": "Rose Hamilton",
                "credit_id": "52fe446f9251416c75034a7b",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gerda Nicholson"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nGerda Nicolson, (11 November 1937 – 12 June 1992) was an Australian theatre and television actor best known for several long-running television roles. Nicolson first reached wide audiences through her long-running role in Australian Broadcasting Corporation daily soap opera Bellbird. After leaving that series she had a regular role in police drama Bluey (1976). However perhaps her most famous role was as Governor Ann Reynolds in the popular Australian television soap opera Prisoner. Her second part in the show (she had already played a corrupt officer in earlier episodes) Nicolson played the role from 1983 until the series ended in 1986. The series found international cult success in the 1990s and 2000s. Nicolson also appeared in Neighbours as Robyn Taylor, whom almost had an affair with Harold Bishop. Nicolson collapsed in her dressing room prior to going on stage for a theatre performance in 1992 and died in hospital 10 days later. The cause of death was a massive stroke. She was 54 years old.\n\nDescription above from the Wikipedia article Gerda Nicolson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1937-11-11",
        "deathday": "1992-06-12",
        "gender": 1,
        "homepage": null,
        "id": 70754,
        "imdb_id": "nm0630490",
        "known_for_department": "Acting",
        "name": "Gerda Nicolson",
        "place_of_birth": "Hobart, Tasmania, Australia",
        "popularity": 0.2588,
        "profile_path": "/lBmlp7hDMQ8Aqme4hDSssJhxkXk.jpg"
    }
}