{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kcK6wlt4TT1ETgr8mJhXgUg3HYE.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11646,
                "original_language": "en",
                "original_title": "Gallipoli",
                "overview": "Two Australian sprinters face the brutal realities of war when they are sent to fight in the Gallipoli campaign in the Ottoman Empire during World War I.",
                "popularity": 1.9838,
                "poster_path": "/un7VCqTmjrq3u75mQ204a8tofD4.jpg",
                "release_date": "1981-08-13",
                "title": "Gallipoli",
                "video": false,
                "vote_average": 7.05,
                "vote_count": 505,
                "character": "Jack",
                "credit_id": "52fe446f9251416c75034a77",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/zyWbOvKCdA9V9P5xuUG2eiPYsUo.jpg",
                "genre_ids": [
                    12,
                    14,
                    10751
                ],
                "id": 10601,
                "original_language": "en",
                "original_title": "Peter Pan",
                "overview": "In stifling Edwardian London, Wendy Darling mesmerizes her brothers every night with bedtime tales of swordplay, swashbuckling and the fearsome Captain Hook. But the children become the heroes of an even greater story, when Peter Pan flies into their nursery one night and leads them over moonlit rooftops through a galaxy of stars and to the lush jungles of Neverland.",
                "popularity": 4.8015,
                "poster_path": "/6QdU3TZZrIvXFzoHOwafZAynFjB.jpg",
                "release_date": "2003-12-18",
                "title": "Peter Pan",
                "video": false,
                "vote_average": 7.15,
                "vote_count": 2699,
                "character": "Fairy Guide",
                "credit_id": "5a4fc5570e0a262da2002197",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Henry Kerr",
            "Willie Kerr"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nWilliam Henry Kerr (10 June 1922 – 28 August 2014) was a British and Australian film and television actor. He was born into a performing arts family in Cape Town, South Africa, but grew up in Wagga Wagga, New South Wales, Australia.\n\nHe began working as a child actor in depression era Australia, taking his first major role in The Silence of Dean Maitland, one of Australia's first talking films.\n\nAfter serving in the Second World War, Kerr moved to England to further his acting career, and during the 1940s he was regularly featured in the BBC radio series Variety Bandbox. His trademark was his catch phrase \"I'm only here for 4 minutes...\"\n\nIn the 1950s, he had a recurring role as an Australian lodger in the BBC radio comedy series Hancock's Half Hour. Initially sharper than Hancock's characterisation, it was developed into a more dim-witted character who became the butt of Hancock's jokes. His television appearances in Britain include a 1968 Doctor Who story called The Enemy of the World, with Patrick Troughton, and a long running part in the early 1960s BBC-TV soap, Compact.\n\nBill Kerr had much theatrical success in Britain, playing The Devil in the original West End production of Damn Yankees, directed by Bob Fosse, and Cole. He also worked with Spike Milligan. He appeared in Milligan and John Antrobus's stage play The Bed-Sitting Room, which opened at the Mermaid Theatre on 31 January 1963. A subsequent production opened on 3 May 1967 at the Saville Theatre, and \"a cast containing an unusually high proportion of Australian actors including Bill Kerr and David Nettheim.\" Then in 1972 he co-starred with Anthony Newley in the long running Newley/Bricusse musical, The Good Old Bad Old Days. In 1975, Kerr took the part of Bluey Notts, described as \"an Australian bookie's clerk, a crude racialist\", in The Melting Pot. This was a sitcom written by Spike Milligan and Neil Shand, which was cancelled by the BBC after just one episode had been broadcast.\n\nHe also appeared in several British films, including The Dam Busters and The Wrong Arm of the Law, before moving back to Australia. Although probably best known as a comic actor, and especially for his appearances in Hancock's Half Hour, he has since played a number of serious roles, notably in Peter Weir's films Gallipoli (1981) and The Year of Living Dangerously (1982). He also worked on the Australian stage in the 1980s, in musicals such as My Fair Lady, where he received excellent reviews as Alfred Doolittle. In 2001, he appeared in the Australian comedy Let's Get Skase.\n\nKerr also appeared in Glenview High and the 1998 television comedy series Minty.\n\nKerr has also been involved in documentaries, providing the narration for No Survivor - The Mysterious Loss of HMAS Sydney Nine Network Australia (1995), Malice or Mutiny for the ABC Australia 2003 and Animal X Natural Mystery Unit series for Discovery in the US, TV2 Norway and many others.\n\nDescription above from the Wikipedia article Bill Kerr, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1922-06-10",
        "deathday": "2014-08-28",
        "gender": 2,
        "homepage": null,
        "id": 70753,
        "imdb_id": "nm0449652",
        "known_for_department": "Acting",
        "name": "Bill Kerr",
        "place_of_birth": "Cape Town, South Africa",
        "popularity": 0.1241,
        "profile_path": "/aJ7t8clJBKwG50en67Owk36XdAC.jpg"
    }
}