{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5BBwSVytssbFuSPZE4DtJVhROjN.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 11878,
                "original_language": "ja",
                "original_title": "用心棒",
                "overview": "A nameless ronin, or samurai with no master, enters a small village in feudal Japan where two rival businessmen are struggling for control of the local gambling trade. Taking the name Sanjuro Kuwabatake, the ronin convinces both silk merchant Tazaemon and sake merchant Tokuemon to hire him as a personal bodyguard, then artfully sets in motion a full-scale gang war between the two ambitious and unscrupulous men.",
                "popularity": 4.3638,
                "poster_path": "/tN7kYPjRhDolpui9sc9Eq9n5b2O.jpg",
                "release_date": "1961-04-25",
                "title": "Yojimbo",
                "video": false,
                "vote_average": 8.092,
                "vote_count": 1573,
                "character": "Nui",
                "credit_id": "52fe44999251416c7503a5ef",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yoko Shoji",
            "Yôko Tsukasa",
            "یوکو تسوکاسا"
        ],
        "biography": "Yōko Aizawa (相澤 葉子, Aizawa Yōko, born August 20, 1934) is a Japanese actress. She won the award for best actress at the 17th Blue Ribbon Awards for Kinokawa. She is a professor at Tokyo University of Social Welfare and serves as the 2nd head of Nihon Taishōmura theme park.\n\nBorn as Yōko Shōji (庄司 葉子) in Tottori Prefecture, to a family of cotton merchants who had settled in Yumihama. Her family is a branch of the Shōji family, the landed magnate of Watari.\n\nShe married politician and attorney Hideyuki Aizawa. Their son Hiromitsu married singer and actress Shoko Aida. She's been awarded the Medal with Purple Ribbon (2003) and the Order of the Rising Sun, 4th Class, Gold Rays with Rosette (2010).",
        "birthday": "1934-08-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 70811,
        "imdb_id": "nm0875362",
        "known_for_department": "Acting",
        "name": "Yōko Tsukasa",
        "place_of_birth": "Sakaiminato, Japan",
        "popularity": 0.568,
        "profile_path": "/hq7RFoQmnq82KoJpFPzioNXqlrK.jpg"
    }
}