{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tdGCuUge9wZUYP785WTGVrMIxBk.jpg",
                "genre_ids": [
                    14,
                    28,
                    9648
                ],
                "id": 337556,
                "original_language": "de",
                "original_title": "Smaragdgrün",
                "overview": "Emerald Green is the stunning conclusion to Kerstin Gier's Ruby Red Trilogy, picking up where Sapphire Blue left off, reaching new heights of intrigue and romance as Gwen finally uncovers the secrets of the time-traveling society and learns her fate.",
                "popularity": 3.3047,
                "poster_path": "/jsUvDbjD4ZEd1AswFLAvqyUs7jc.jpg",
                "release_date": "2016-07-07",
                "title": "Emerald Green",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 866,
                "character": "Lady Amalia",
                "credit_id": "553d68dec3a3685cf80082b0",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Эмилия Шюле",
            "إميليا شول",
            "에밀리아 슐레",
            "امیلیا شوله"
        ],
        "biography": "Emilia Schüle was born in 1992 in Russia to a German family. When she was one year old, she moved to Berlin with her parents. She took professional dance classes in modern dance, street dance and ballet when she was eight years old.\n\nAfter she participated in the workshop Talents Getting Started in 2005, she appeared in several commercials for Arcor, IKEA, Clearasil and Deutsche Telekom. After further appearances in the television movies Guten Morgen, Herr Grothe and Manatu – Nur die Wahrheit rettet dich, where she also got her first leading roles, she had her film breakthrough in 2008, when she starred next to Anke Engelke, Armin Rohde and Piet Klocke in the movie Freche Mädchen.\n\nHer next major role was in 2009 in the movie Gangs as Sophie, alongside the young actors and brothers, Wilson Gonzalez and Jimi Blue Ochsenknecht. In 2010 she appeared in Rock It! and Freche Mädchen 2.",
        "birthday": "1992-11-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 70839,
        "imdb_id": "nm2163092",
        "known_for_department": "Acting",
        "name": "Emilia Schüle",
        "place_of_birth": "Blagoveshchensk, Russia",
        "popularity": 0.6184,
        "profile_path": "/em77YMVTapnvCSq44Bs99OcDdLv.jpg"
    }
}