{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/isRzCN0ATsZ4CdBf6CSGA2ruclW.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 8923,
                "original_language": "en",
                "original_title": "Green Street Hooligans",
                "overview": "After being wrongfully expelled from Harvard University, American Matt Buckner flees to his sister's home in England. Once there, he is befriended by her charming and dangerous brother-in-law, Pete Dunham, and introduced to the underworld of British football hooliganism. Matt learns to stand his ground through a friendship that develops against the backdrop of this secret and often violent world. 'Green Street Hooligans' is a story of loyalty, trust and the sometimes brutal consequences of living close to the edge.",
                "popularity": 4.8125,
                "poster_path": "/oTxHFRSbFcCWdfJB4ozA41Yq57c.jpg",
                "release_date": "2005-09-09",
                "title": "Green Street Hooligans",
                "video": false,
                "vote_average": 7.271,
                "vote_count": 2455,
                "character": "Steve Dunham",
                "credit_id": "52fe44c8c3a36847f80a9d1d",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/2NU8w8djgX6SzLrg7rN6yMXWAzC.jpg",
                "genre_ids": [
                    18
                ],
                "id": 7863,
                "original_language": "en",
                "original_title": "Shine",
                "overview": "Pianist David Helfgott, driven by his father and teachers, has a breakdown. Years later he returns to the piano, to popular if not critical acclaim.",
                "popularity": 2.8392,
                "poster_path": "/cbmThowj2XAW7lKlMAXmnhZvjGI.jpg",
                "release_date": "1996-08-15",
                "title": "Shine",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 677,
                "character": "Ray",
                "credit_id": "61c7126f37b3a9001d7bd6e7",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mark Warren",
            "\tMarc Stephens",
            "马克·沃伦",
            "مارک وارن"
        ],
        "biography": "Marc Warren is an English actor, known for his roles in British television series such as Band of Brothers, Hustle, The Vice, State of Play, Mad Dogs, The Musketeers, Jonathan Strange & Mr Norrell, and Van Der Valk. He was born in Northampton, England, in 1967. He studied acting at the East 15 Acting School in Essex.\n\nWarren made his professional acting debut in 1986 in the play Stags and Hens at the Northampton Theatre Royal. He has since appeared in numerous stage productions, including Kes, Kingdom of Earth, and To Kill a Mockingbird.\n\nWarren's breakthrough television role came in 2001, when he played Albert Blithe in the HBO miniseries Band of Brothers. He has since starred in a number of other successful television series, including Hustle, The Vice, State of Play, Mad Dogs, The Musketeers, Jonathan Strange & Mr Norrell, and Van Der Valk.\n\nWarren has also appeared in a number of films, including Love Actually, The Other Boleyn Girl, and The Woman in Black.\n\nIn 2013, Warren was awarded the British Independent Film Award for Best Supporting Actor for his performance in the film Hyde Park on Hudson.\n\nWarren is married to actress Polly Walker and they have two children.",
        "birthday": "1967-03-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 70903,
        "imdb_id": "nm0912938",
        "known_for_department": "Acting",
        "name": "Marc Warren",
        "place_of_birth": "Northampton, Northamptonshire, England, UK",
        "popularity": 1.732,
        "profile_path": "/sIsnids6kyarj8QjMrlA1j9p08n.jpg"
    }
}