{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gSFkUGrgCSDDQpsQ6HbrEQ41tMl.jpg",
                "genre_ids": [
                    12,
                    37,
                    18,
                    28
                ],
                "id": 11943,
                "original_language": "en",
                "original_title": "Jeremiah Johnson",
                "overview": "A mountain man who wishes to live the life of a hermit becomes the unwilling object of a long vendetta by Indians when he proves to be the match of their warriors in one-to-one combat on the early frontier.",
                "popularity": 9.7667,
                "poster_path": "/732cOohUbdH3FCo7lPbYVtbgUot.jpg",
                "release_date": "1972-09-10",
                "title": "Jeremiah Johnson",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 647,
                "character": "Bear Claw",
                "credit_id": "52fe44a59251416c7503c1eb",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "High Ghere",
            "William Aughe Ghere",
            "Уилл Гир"
        ],
        "biography": "Will Geer (March 9, 1902 – April 22, 1978) was an American actor and social activist. His original name was William Aughe Ghere. He is remembered for his portrayal of Grandpa Zebulon Tyler Walton in the 1970s TV series, The Waltons.  \n\nGeer made his Broadway debut as Pistol in a 1928 production of Much Ado About Nothing, created the role of Mr. Mister in Marc Blitzstein's The Cradle Will Rock, played Candy in John Steinbeck's theatrical adaptation of his novella Of Mice and Men, and appeared in numerous plays and revues throughout the 1940s. From 1948 to 1951, he appeared in more than a dozen movies, including Winchester '73 (as Wyatt Earp), Broken Arrow, Comanche Territory (all 1950) and Bright Victory (1951).\n\nGeer became a member of the Communist Party of the United States in 1934. Geer was also influential in introducing Harry Hay to organizing in the Communist Party. In 1934, Geer and Hay gave support to a labor strike of the port of San Francisco; the 1934 West Coast waterfront strike which lasted 83 days. Though marred by violence, it was an organizing triumph, one that became a model for future union strikes Geer became a reader of the West Coast Communist newspaper People's World.\n\nGeer became a dedicated activist, touring government work camps in the 1930s with folk singers like Burl Ives and Woody Guthrie (whom he introduced to the People's World and the Daily Worker; Guthrie would go on to write a column for the latter paper). In 1956, the duo released an album together on Folkways Records, titled Bound for Glory: Songs and Stories of Woody Guthrie. In his biography, fellow organizer and homosexual rights pioneer Harry Hay described Geer's activism and outlined their activities while organizing for the strike. Geer is credited with introducing Guthrie to Pete Seeger at the 'Grapes of Wrath' benefit Geer organized in 1940 for migrant farm workers.\n\nGeer acted with the Group Theatre (New York) studying under Harold Clurman, Cheryl Crawford and Lee Strasberg. Geer also acted in radio, appearing as Mephistopheles (the Devil) in the 1938 and 1944 productions of Norman Corwin's The Plot to Overthrow Christmas. He also acted in the radio soap opera Bright Horizon.\n\nGeer was blacklisted in the early 1950s for refusing to testify before the House Committee on Un-American Activities. As a result, Geer appeared in very few films over the next decade. Among them was Salt of the Earth (1954) which was produced, directed, written, and starring blacklisted Hollywood personnel and told the story of a miners' strike in New Mexico from a pro-union standpoint. The film was denounced as \"subversive\" and faced difficulties in its production and distribution as a consequence.",
        "birthday": "1902-03-09",
        "deathday": "1978-04-22",
        "gender": 2,
        "homepage": null,
        "id": 70990,
        "imdb_id": "nm0002095",
        "known_for_department": "Acting",
        "name": "Will Geer",
        "place_of_birth": "Frankfort, Indiana, USA",
        "popularity": 0.7107,
        "profile_path": "/lpiuWaZxn0dov4FoYE6fxtsee8c.jpg"
    }
}