{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7qsKE8GsgjreeQ2mTLd5oKZ7Tbf.jpg",
                "genre_ids": [
                    28,
                    18,
                    36,
                    10752
                ],
                "id": 11953,
                "original_language": "ja",
                "original_title": "影武者",
                "overview": "Akira Kurosawa's lauded feudal epic presents the tale of a petty thief who is recruited to impersonate Shingen, an aging warlord, in order to avoid attacks by competing clans. When Shingen dies, his generals reluctantly agree to have the impostor take over as the powerful ruler. He soon begins to appreciate life as Shingen, but his commitment to the role is tested when he must lead his troops into battle against the forces of a rival warlord.",
                "popularity": 3.3775,
                "poster_path": "/fJgqj9s8HNZz9zwX6femVJn8HEB.jpg",
                "release_date": "1980-04-26",
                "title": "Kagemusha",
                "video": false,
                "vote_average": 7.829,
                "vote_count": 694,
                "character": "Katsuyori Takeda",
                "credit_id": "56917316c3a36802f90008ca",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ken'ichi Hagiwara",
            "Kenichi Hagiwara"
        ],
        "biography": "Kenichi Hagiwara (born 26 July 1950 in Omiya, Saitama, Japan), also known as Sho-Ken, was the lead singer of The Tempters, the \"bad boys\" of the Group Sounds Japan pop scene in the mid and late 1960s. A teen idol with a legion of loyal fans, Hagiwara was known for his good looks and arrogance, which appealed to both young male and female Japanese fans. After The Tempters, he formed the band PYG along with Kenji Sawada, the first true Japanese supergroup, a unit which included members of The Tigers, The Tempters and The Spiders.\n\nDescription above from the Wikipedia article Kenichi Hagiwara, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1950-07-26",
        "deathday": "2019-03-26",
        "gender": 2,
        "homepage": null,
        "id": 71027,
        "imdb_id": "nm0353714",
        "known_for_department": "Acting",
        "name": "Kenichi Hagiwara",
        "place_of_birth": "Omiya, Saitama Prefecture, Japan",
        "popularity": 1.179,
        "profile_path": "/8kNMHlEiANklSuuqiZu4jU7Ef9V.jpg"
    }
}