{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/85k0kaoRgGmF6ACq0M61AFxhjLN.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 12153,
                "original_language": "en",
                "original_title": "White Chicks",
                "overview": "Two FBI agent brothers, Marcus and Kevin Copeland, accidentally foil a drug bust. To avoid being fired they accept a mission escorting a pair of socialites to the Hamptons--but when the girls are disfigured in a car accident, they refuse to go. Left without options, Marcus and Kevin decide to pose as the sisters, transforming themselves from black men into rich white women.",
                "popularity": 13.9263,
                "poster_path": "/aHTUpo45qy9QYIOnVITGGqLoVcA.jpg",
                "release_date": "2004-06-23",
                "title": "White Chicks",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 4258,
                "character": "Brittany Wilson",
                "credit_id": "52fe44bf9251416c7503fa2b",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Maitland Ward Baxter",
            "Ashley Maitland Welkos"
        ],
        "biography": "Maitland Ward (born Ashley Maitland Welkos on February 3, 1977 in Long Beach, California) is most commonly known as Rachel McGuire from the hit prime time series, Boy Meets World.\n\nProfessionally as Maitland Ward, is a tall (6’0”) European American actress and model. She made her acting debut as Jessica Forrester on the CBS soap opera The Bold and the Beautiful (1994–1996). Continuing to appear in film and television through the mid-2000s, she came to further prominence for playing Rachel McGuire on the sixth and seventh seasons of the ABC sitcom Boy Meets World (1998–2000). After retiring from mainstream acting in 2007, Ward began performing in pornographic films in 2019.\n\nOctober 2021 Playboy Plus All Star of the Month\n\nMaitland Ward is best known for her roles as Rachel McGuire in the final three seasons of the ABC sitcom \"Boy Meets World\", Jessica Forrester in \"The Bold and the Beautiful\" and as Brittany Wilson in the 2004 comedy \"White Chicks\".\n\nMore recently, Ward has been producing nude and hardcore material for Patreon supporters. In July 2019, it was announced that she had signed with porn talent agency Society 15. She has an exclusive contract with Vixen and Kayden Kross 's Deeper brand. Maitland is a FLESHLIGHT™ Girl.\n\n\"With over 25 million views on Pornhub of her xxx videos, one million followers on OnlyFans, and a growing fanbase on Reddit, Instagram, and Twitter, Maitland is doing everything she’s ever wanted and then some.\" Playboy October 2021.\n\nAdult film career\n\nBeginning in mid-2013, Ward began posting nude and topless photographs of herself on Snapchat and Instagram, gaining a large following on both sites.[14] In April 2016, she posted her first nude pictures to social media of her being body-painted for Luciano Paesani for a Los Angeles exhibition called \"Living Art\".[13] In 2019, she announced on Instagram that she would be performing in an adult film entitled Drive, a move described by In Touch Weekly as a \"drastic career-shift\".[6] Ward received support from former Boy Meets World co-star Trina McGee.[7]\n\nIn May 2019, Ward signed with adult talent agency Society 15.[15] She stated that she had been approached by adult actress and director Kayden Kross and was \"just floored\" by the proposition of doing adult films.[6] She told In Touch Weekly, \"It's been an evolution. It's all been my authentic journey because everything that I have done along the way is something I wanted to explore and do. I just did it publicly for my fans, that is the exhibitionist style of me.\"[16] Drive was released online at the website Deeper.com on September 30, 2019.[6]\n\nOf her decision, Ward stated that she feared being typecast and believed that if she became a porn actress, new fans would have an opportunity to discover her.Upon Drive's release, Ward promised \"more taboo stuff to come\", and she subsequently appeared in multiple additional porn scenes released on Deeper.com.She has said that she did not perceive any stigma associated with being a pornographic actress, and that she regards her transition into adult films as a savvy business move.\n\nPersonal life",
        "birthday": "1977-02-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 71482,
        "imdb_id": "nm0005533",
        "known_for_department": "Acting",
        "name": "Maitland Ward",
        "place_of_birth": "Long Beach, California, USA",
        "popularity": 62.849,
        "profile_path": "/kbi23u4XeYaE00PtWLuX1JQ0Ept.jpg"
    }
}