{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qK7Ssnrfvrt65F66A1thvehfQg2.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    12,
                    9648
                ],
                "id": 420821,
                "original_language": "en",
                "original_title": "Chip 'n Dale: Rescue Rangers",
                "overview": "Decades since their successful television series was canceled, Chip has succumbed to a life of suburban domesticity as an insurance salesman. Dale, meanwhile, has had CGI surgery and works the nostalgia convention circuit, desperate to relive his glory days. When a former cast mate mysteriously disappears, Chip and Dale must repair their broken friendship and take on their Rescue Rangers detective personas once again to save their friend’s life.",
                "popularity": 3.845,
                "poster_path": "/7UGmn8TyWPPzkjhLUW58cOUHjPS.jpg",
                "release_date": "2022-05-20",
                "title": "Chip 'n Dale: Rescue Rangers",
                "video": false,
                "vote_average": 6.998,
                "vote_count": 1300,
                "character": "Bull Co-Worker (voice)",
                "credit_id": "6287b8da7d5db50099d07a35",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/l36ekUEEDLMAuL0YAU2Qxfq1i6X.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 458253,
                "original_language": "en",
                "original_title": "Missing Link",
                "overview": "The charismatic Sir Lionel Frost considers himself to be the world's foremost investigator of myths and monsters. Trouble is, none of his small-minded, high-society peers seems to recognize this. Hoping to finally gain acceptance from these fellow adventurers, Sir Lionel travels to the Pacific Northwest to prove the existence of a legendary creature known as the missing link.",
                "popularity": 3.1991,
                "poster_path": "/bqQ38oKuROlAgyZcRII9tqtoPNi.jpg",
                "release_date": "2019-04-04",
                "title": "Missing Link",
                "video": false,
                "vote_average": 6.933,
                "vote_count": 891,
                "character": "New Worlder (voice)",
                "credit_id": "5f6532171684f700374bf8d7",
                "order": 42
            },
            {
                "adult": false,
                "backdrop_path": "/mabuNsGJgRuCTuGqjFkWe1xdu19.jpg",
                "genre_ids": [
                    28,
                    12,
                    16,
                    10751
                ],
                "id": 260513,
                "original_language": "en",
                "original_title": "Incredibles 2",
                "overview": "Elastigirl springs into action to save the day, while Mr. Incredible faces his greatest challenge yet – taking care of the problems of his three children.",
                "popularity": 22.17,
                "poster_path": "/9lFKBtaVIhP7E2Pk0IY1CwTKTMZ.jpg",
                "release_date": "2018-06-14",
                "title": "Incredibles 2",
                "video": false,
                "vote_average": 7.454,
                "vote_count": 13263,
                "character": "Additional Voices (voice)",
                "credit_id": "682f43e45e60dbe8b67ba624",
                "order": 79
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/7NRGAtu8E4343NSKwhkgmVRDINw.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 507089,
                "original_language": "en",
                "original_title": "Five Nights at Freddy's",
                "overview": "Recently fired and desperate for work, a troubled young man named Mike agrees to take a position as a night security guard at an abandoned theme restaurant: Freddy Fazbear's Pizzeria. But he soon discovers that nothing at Freddy's is what it seems.",
                "popularity": 13.1364,
                "poster_path": "/7BpNtNfxuocYEVREzVMO75hso1l.jpg",
                "release_date": "2023-10-25",
                "title": "Five Nights at Freddy's",
                "video": false,
                "vote_average": 7.395,
                "vote_count": 4557,
                "credit_id": "653e47fabc2cb3012c31d2ff",
                "department": "Sound",
                "job": "ADR & Dubbing"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nScott Whyte (born January 8, 1978, in Manhattan Beach, California) is an American actor who is best known for his role on City Guys where he portrayed Chris, one of the main characters. He has also appeared in other TV series, such as That '70s Show, and Just Shoot Me!, as well as appearing in the films D2: The Mighty Ducks and its sequel, D3, although as different characters.\n\nWhyte has spent his entire life living in the South Bay of California. Whyte, always interested in the arts, has been leaping from one form to the other, having spent time in animation along with playing music, all while maintaining an acting career. Whyte also attended the University of Southern California briefly until he landed a starring role on NBC’s City Guys. Whyte made his film debut in the Mel Gibson/Kurt Russell feature Tequila Sunrise. At age ten, after watching Raiders of the Lost Ark, Whyte figured he could become the next Indiana Jones. But after breaking his wrist swinging from a tree, he set his sights on the goal of becoming an actor, so that he \"could do all those fun things and not get hurt.\" He landed his first part at the age of 13, appearing in a commercial for Pop Tarts, and later appeared in the television series That '70s Show, Just Shoot Me!, The Nanny, Full House, Locals and TNBC's Hang Time, along with hosting the television series Chicken Soup for the Soul, based on the best selling books. His recent films include Reeker, The Fallen Ones, Voodoo Moon, All In, and Death Row.\n\nDescription above from the Wikipedia article Scott Whyte, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1978-01-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 71520,
        "imdb_id": "nm0926697",
        "known_for_department": "Acting",
        "name": "Scott Whyte",
        "place_of_birth": "Manhattan Beach, California, USA",
        "popularity": 0.6552,
        "profile_path": "/cTsWZRSgWtkitBMwpikTr11kdYC.jpg"
    }
}