{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6t8ES1d12OzWyCGxBeDYLHoaDrT.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 330459,
                "original_language": "en",
                "original_title": "Rogue One: A Star Wars Story",
                "overview": "A rogue band of resistance fighters unite for a mission to steal the Death Star plans and bring a new hope to the galaxy.",
                "popularity": 6.8029,
                "poster_path": "/i0yw1mFbB7sNGHCs7EXZPzFkdA1.jpg",
                "release_date": "2016-12-14",
                "title": "Rogue One: A Star Wars Story",
                "video": false,
                "vote_average": 7.502,
                "vote_count": 15864,
                "character": "Additional Voices (voice)",
                "credit_id": "58634002c3a36852ba0075bb",
                "order": 88
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Chopper",
            "David Filoni",
            "C1-10P a.k.a. 'Chopper'",
            "데이브 필로니",
            "דייב פילוני",
            "Дейв Филони",
            "Dave C. Filoni",
            "Dave Chopper Filoni"
        ],
        "biography": "David Filoni (born June 7, 1974) is an American director, producer, and screenwriter currently serving as the chief creative officer of Lucasfilm. He directed multiple episodes of Avatar: The Last Airbender before being hired by George Lucas to oversee direction on the television series Star Wars: The Clone Wars, as well as directing and writing numerous episodes, including its theatrical film. He was the creator of the follow-up series Star Wars Rebels and served as a supervising director, executive producer, and writer.\n\nFiloni is the creator, executive producer, and sole writer of the live-action miniseries Ahsoka and is an executive producer on The Mandalorian, The Book of Boba Fett, and Skeleton Crew. Filoni is also the creator and executive producer of the animated series Star Wars Resistance, Star Wars: The Bad Batch, and Tales of the Jedi, and an executive producer of the web series Star Wars Forces of Destiny. Filoni is an executive vice president at Lucasfilm and in 2023 accepted a promotion to chief creative officer.\n\nDescription above from the Wikipedia article Dave Filoni, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1974-06-07",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.lucasfilm.com/leadership/dave-filoni",
        "id": 71538,
        "imdb_id": "nm1396048",
        "known_for_department": "Writing",
        "name": "Dave Filoni",
        "place_of_birth": "Mt. Lebanon, Pennsylvania, USA",
        "popularity": 0.3659,
        "profile_path": "/dDTTrShpCnCacxB3LhpPffFIdB5.jpg"
    }
}