{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9UAhRDffrWkOwxqzqAF6ls1iEZ8.jpg",
                "genre_ids": [
                    18,
                    53,
                    10752
                ],
                "id": 12162,
                "original_language": "en",
                "original_title": "The Hurt Locker",
                "overview": "During the Iraq War, a Sergeant recently assigned to an army bomb squad is put at odds with his squad mates due to his maverick way of handling his work.",
                "popularity": 7.245,
                "poster_path": "/m2duGsKjBOl3BB8uFOTnRUzdEhg.jpg",
                "release_date": "2008-10-10",
                "title": "The Hurt Locker",
                "video": false,
                "vote_average": 7.257,
                "vote_count": 5856,
                "character": "Iraqi Translator",
                "credit_id": "5a8f98020e0a26399b009342",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Anthony Desante",
            "Michael Desante"
        ],
        "biography": "Hani Al Naimi (birth-name Michael Anthony Desante) is an Arab American actor, writer and director of Palestinian descent. He was born in Bethlehem and spent the beginning years of his childhood in Beirut, Lebanon. At age 9 he attended Fettes College for Boys in Edinburgh, Scotland and then Hurtwood House in Surrey, England where he completed his school. His interest in acting started at an early age with school play renditions of Shakespeare's \"A Midsummer Night Dream\" and \"Much Ado About Nothing.\" He was 12 when Andrew Lloyd Webber came to his school to cast his play \"Joseph and His Technicolor Dreamcoat\" for its Edinburgh premiere; Hani was selected to be in the choir and went on to be in the production of \"Jesus Christ Superstar\" as well.\n\nAfter graduating from school, Hani moved to the United States to continue his education, where he earned his Bachelor's and Master's degrees. His dedication and passion for acting and storytelling never wavered. Shortly thereafter Hani was discovered by casting director Judith Holstra when she cast him in his first movie role with Mariel Hemingway.",
        "birthday": "1962-08-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 71678,
        "imdb_id": "nm0619726",
        "known_for_department": "Acting",
        "name": "Hani Al Naimi",
        "place_of_birth": "Palestine",
        "popularity": 0.1456,
        "profile_path": "/3FUm9gba0AqmK3SSvPuMUYfRbE9.jpg"
    }
}