{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ojgXOhVi9Yk8irDpRfDkIzdD1LK.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 18240,
                "original_language": "en",
                "original_title": "The Proposal",
                "overview": "When she learns she's in danger of losing her visa status and being deported, overbearing book editor Margaret Tate forces her put-upon assistant, Andrew Paxton, to marry her.",
                "popularity": 12.422,
                "poster_path": "/aEqtJDj8MvSDQwzggvcOfFTZMw.jpg",
                "release_date": "2009-06-02",
                "title": "The Proposal",
                "video": false,
                "vote_average": 7.155,
                "vote_count": 7158,
                "character": "Grandma Annie",
                "credit_id": "52fe476d9251416c75098e57",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/q62bpQ67qaXY0u6b2wFEnQYIbPd.jpg",
                "genre_ids": [
                    10751,
                    12,
                    16,
                    35,
                    14
                ],
                "id": 301528,
                "original_language": "en",
                "original_title": "Toy Story 4",
                "overview": "Woody has always been confident about his place in the world and that his priority is taking care of his kid, whether that's Andy or Bonnie. But when Bonnie adds a reluctant new toy called \"Forky\" to her room, a road trip adventure alongside old and new friends will show Woody how big the world can be for a toy.",
                "popularity": 11.5477,
                "poster_path": "/w9kR8qbmQ01HwnvK4alvnQ2ca0L.jpg",
                "release_date": "2019-06-19",
                "title": "Toy Story 4",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 10149,
                "character": "Bitey White (voice)",
                "credit_id": "5d0669640e0a260b0ad139af",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Betty Marion White",
            "Grand Dame of Television",
            "Queen of Television",
            "Queen of T.V.",
            "Queen of TV",
            "Betty White Ludden",
            "Allen & Betty",
            "Betty Marion White Ludden",
            "بتی وایت"
        ],
        "biography": "Betty Marion White Ludden (January 17, 1922 - December 31, 2021) was an American actress and comedian, with the longest television career of any entertainer, spanning 80 years. Regarded as a pioneer of television, she was one of the first women to have control both in front of and behind the camera and is recognized as the first woman to produce a sitcom (Life with Elizabeth), which contributed to her receiving the honorary title Mayor of Hollywood in 1955.\n\nWhite was known for her award-winning roles as Sue Ann Nivens on The Mary Tyler Moore Show (1973–77) and Rose Nylund on The Golden Girls (1985–92) – the Writers Guild of America has included both sitcoms in its list of the 101 Best Written TV Series of All Time – and Elka Ostrovsky on Hot in Cleveland (2010–15).\n\nA staple guest of many American game shows such as Password, Match Game, Hollywood Squares and The $25,000 Pyramid, White was dubbed the 'First Lady of Game Shows' and became the first woman to receive an Emmy Award for Outstanding Game Show Host in 1983 for the show Just Men! She was also known for her appearances on Boston Legal, Mama's Family, and Saturday Night Live.\n\nWhite received eight Emmy Awards in various categories, three American Comedy Awards, three Screen Actors Guild Awards, and a Grammy Award. She also has a star on the Hollywood Walk of Fame and is a Television Hall of Fame inductee.",
        "birthday": "1922-01-17",
        "deathday": "2021-12-31",
        "gender": 1,
        "homepage": null,
        "id": 71727,
        "imdb_id": "nm0924508",
        "known_for_department": "Acting",
        "name": "Betty White",
        "place_of_birth": "Oak Park, Illinois, USA",
        "popularity": 0.8856,
        "profile_path": "/eYDjR4ajOkzYDyEIMzOoSJz8za2.jpg"
    }
}