{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xcjJ5khg2yzOa282mza39Lbrm7j.jpg",
                "genre_ids": [
                    27
                ],
                "id": 9552,
                "original_language": "en",
                "original_title": "The Exorcist",
                "overview": "When a charming 12-year-old girl takes on the characteristics and voices of others, doctors say there is nothing they can do. As people begin to die, the girl's mother realizes her daughter has been possessed by the Devil. Her daughter's only possible hope lies with two priests and the ancient rite of demonic exorcism.",
                "popularity": 9.9003,
                "poster_path": "/5x0CeVHJI8tcDx8tUUwYHQSNILq.jpg",
                "release_date": "1973-12-26",
                "title": "The Exorcist",
                "video": false,
                "vote_average": 7.736,
                "vote_count": 8287,
                "character": "Dr. Barringer",
                "credit_id": "52fe4508c3a36847f80b86a5",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/knYZcpl08qhiEPCytyNXOq7Z1oS.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648,
                    53
                ],
                "id": 10633,
                "original_language": "en",
                "original_title": "In the Heat of the Night",
                "overview": "African-American Philadelphia police detective Virgil Tibbs is arrested on suspicion of murder by Bill Gillespie, the racist police chief of tiny Sparta, Mississippi. After Tibbs proves not only his own innocence but that of another man, he joins forces with Gillespie to track down the real killer. Their investigation takes them through every social level of the town, with Tibbs making enemies as well as unlikely friends as he hunts for the truth.",
                "popularity": 4.1761,
                "poster_path": "/1zjS7aSgvOX98BSWEsshDw3kxe5.jpg",
                "release_date": "1967-08-02",
                "title": "In the Heat of the Night",
                "video": false,
                "vote_average": 7.651,
                "vote_count": 1161,
                "character": "Fryer",
                "credit_id": "56cdf978c3a368126e0002c3",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pete Masterson",
            "Carlos Bee Masterson Jr."
        ],
        "biography": "Carlos Bee Masterson Jr. was an American actor, director, producer, and writer.  Masterson often worked with his cousin, writer Horton Foote. Acting from the mid-1960s to the mid-1980s, including 1975's The Stepford Wives as Walter Eberhart, since then he concentrated mostly on directing and producing. Actress Mary Stuart Masterson is his daughter; she appeared with her father in The Stepford Wives, playing one of his daughters. His other acting credits include roles in Ambush Bay (1966), In the Heat of the Night (1967), Counterpoint (1968), Von Richthofen and Brown (1971), Tomorrow (1972), The Exorcist (1973), Man on a Swing (1974), and Gardens of Stone (1987).\n\nMasterson co-wrote (with Larry L. King) the books for the hit musical The Best Little Whorehouse in Texas (1978) and its short-lived sequel The Best Little Whorehouse Goes Public (1994). In 1980, he produced the ABC television movie, \"City in Fear\" based on an idea by screenwriter William Goldman—an idea that became the well-reviewed 1979 novel \"Panic on Page One\" by Linda Stewart, and the television script by Albert Ruben. The cast was led by Robert Vaughn and David Janssen in the final role before his death that year. In 1985, he directed The Trip to Bountiful, for which Geraldine Page won the Academy Award for Best Actress. The film also featured his wife, Carlin Glynn who had previously won a Tony Award for her role in 'Whorehouse.' His directing credits additionally include Full Moon in Blue Water (1988), Night Game (1989), Blood Red (1989), Convicts (1991), Arctic Blue (1993), The Only Thrill (1997), Lost Junction (2003), and Whiskey School (2005).\n\nMasterson died at the age of 84 on December 18, 2018, after suffering a fall at his home. He had received a diagnosis of Parkinson's disease 14 years earlier.",
        "birthday": "1934-06-01",
        "deathday": "2018-12-18",
        "gender": 2,
        "homepage": null,
        "id": 71732,
        "imdb_id": "nm0557751",
        "known_for_department": "Directing",
        "name": "Peter Masterson",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.2417,
        "profile_path": "/xNIV2DrSMBsxs1XRt0YBBKVnBul.jpg"
    }
}