{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/asC4h9U7pD72bkYcqzgTB7VJYLy.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 11545,
                "original_language": "en",
                "original_title": "Rushmore",
                "overview": "When a beautiful first-grade teacher arrives at a prep school, she soon attracts the attention of an ambitious teenager named Max, who quickly falls in love with her. Max turns to the father of two of his schoolmates for advice on how to woo the teacher. However, the situation soon gets complicated when Max's new friend becomes involved with her, setting the two pals against one another in a war for her attention.",
                "popularity": 5.0699,
                "poster_path": "/hSJ6swahAuZ8wM96lHDTwQPXUvZ.jpg",
                "release_date": "1998-12-11",
                "title": "Rushmore",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 2588,
                "character": "Magnus Buchan",
                "credit_id": "52fe44569251416c7503139f",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nStephen McCole is a Scottish actor. McCole plays the leading role in the television black comedy High Times. McCole portrays Rab, an unemployed stoner who lives with his family in a bleak high-rise flat in Glasgow. The series, which received the 2004 BAFTA Scotland Best Drama Award, also features McCole's older brother, Paul. McCole credits the believability of his role to growing up in similar surroundings in Glasgow's Castlemilk project.\n\nMcCole has also starred in the 2008 adventure comedy Stone of Destiny. Previous to High Times, McCole appeared in The Young Person's Guide to Becoming a Rock Star (TV Series) (1998), The Acid House (1998), Postmortem (1998) and the 2003 BBC One miniseries The Key.\n\nIn 2005, McCole directed the comedy short Electric Blues, written by Paul McCole.\n\nDescription above from the Wikipedia article Stephen McCole, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 71770,
        "imdb_id": "nm0566089",
        "known_for_department": "Acting",
        "name": "Stephen McCole",
        "place_of_birth": "Scotland",
        "popularity": 0.3771,
        "profile_path": "/y3IuUJVnfXwdKILa7O4LmMdQr01.jpg"
    }
}