{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uTTySGAQ092zr5TP7PqDnHuWR1W.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 994,
                "original_language": "en",
                "original_title": "Straw Dogs",
                "overview": "David Sumner, a mild-mannered academic from the United States, marries Amy, an Englishwoman. In order to escape a hectic stateside lifestyle, David and his wife relocate to the small town in rural Cornwall where Amy was raised. There, David is ostracized by the brutish men of the village, including Amy's old flame, Charlie. Eventually the taunts escalate.",
                "popularity": 2.8767,
                "poster_path": "/yigkfHE1OhkxPPrjrV78Y9ibGEk.jpg",
                "release_date": "1971-11-25",
                "title": "Straw Dogs",
                "video": false,
                "vote_average": 7.161,
                "vote_count": 997,
                "character": "Norman Scutt",
                "credit_id": "52fe4297c3a36847f802ac43",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/DNb1rBm6R75IJ88PKOd0wfCHm6.jpg",
                "genre_ids": [
                    12,
                    35,
                    14
                ],
                "id": 526,
                "original_language": "en",
                "original_title": "Ladyhawke",
                "overview": "Captain Etienne Navarre is a man on whose shoulders lies a cruel curse. Punished for loving each other, Navarre must become a wolf by night whilst his lover, Lady Isabeau, takes the form of a hawk by day. Together, with the thief Philippe Gaston, they must try to overthrow the corrupt Bishop and in doing so break the spell.",
                "popularity": 4.1684,
                "poster_path": "/vJA2Fhw2uBMiVFdBde2kH7kZ2gw.jpg",
                "release_date": "1985-03-27",
                "title": "Ladyhawke",
                "video": false,
                "vote_average": 7.006,
                "vote_count": 1192,
                "character": "Marquet",
                "credit_id": "52fe424dc3a36847f8013c7f",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/ubICMSUij3ntP9BjnQsV3rTVnAF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 783,
                "original_language": "en",
                "original_title": "Gandhi",
                "overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
                "popularity": 4.3456,
                "poster_path": "/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
                "release_date": "1982-12-01",
                "title": "Gandhi",
                "video": false,
                "vote_average": 7.557,
                "vote_count": 2390,
                "character": "Police Sergeant",
                "credit_id": "55f761e9c3a3686d0b00c365",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ken Hutchinson",
            "Aitken Hutchison"
        ],
        "biography": "One of the most brilliant character actors of his generation, Hollywood's loss was British television's gain with Ken Hutchison. Born in Scotland, his handsome features and cheeky expression guaranteed him a career in character roles, but his dangerous streak led him early in his career into dark, villainous roles. He was cast by Sam Peckinpah as one of the sinister villagers of Straw Dogs (1971), raping Susan George and participating in the film's closing violent siege. Peckinpah took to the actor, and the pair indulged in their love of drinking throughout the shoot, often to the frustration of those around them. Hutchison was soon offered a role in the Robert Mitchum film The Wrath of God (1972) but this was his one and only shot at the big time. Quite what went wrong is open to debate. Some say he was wary of success and got cold feet. Whether that is true or not, what certainly didn't help was his unruly behaviour which made studio execs nervous of casting him again. He returned to Britain and continued his career as an anonymous but astounding character actor. He appeared in two of John Mackenzie's Play For Today films based on Peter McDougall scripts. In Play for Today: Just Another Saturday (1975) he played the head thug of the Orange Lodge, and in Play for Today: Just a Boys' Game (1979) he played Dancer Dunnichy, an irresponsible rogue who lived for drinking and dodging responsibility, a character that seemed to echo his offscreen persona. Hutchison was a stalwart of British TV crime series at this time, appearing in series such as Shoestring (1979), Target (1977) and Jemima Shore Investigates (1983) as well as The Sweeney (1974). In fact he also played the lead villain in the movie Sweeney 2 (1978), but the script allowed him precious little opportunity to shown off his skills as an actor. In 1978 the BBC cast him as Heathcliff in a serialisation of Wuthering Heights (1978) and he brilliantly captured the rough magic of the character. In the 80s he was seen less, although he had a regular role as the boss in children's series Murphy's Mob (1982). Since then he has appeared inevitably in shows like The Bill (1984). His great strength is an incredible ability with accents, and super comic timing, but he is also excellent at conveying menace. A riveting screen presence, Hutchison is long overdue for recognition as a treasure for British drama, a talent which his own country has rarely recognised.",
        "birthday": "1943-11-24",
        "deathday": "2021-08-09",
        "gender": 2,
        "homepage": null,
        "id": 7194,
        "imdb_id": "nm0404455",
        "known_for_department": "Acting",
        "name": "Ken Hutchison",
        "place_of_birth": "Leslie, Fife, Scotland, UK",
        "popularity": 0.2933,
        "profile_path": "/cxIwZOEewWBtyxKRTJlQwaKtaVQ.jpg"
    }
}