{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ubICMSUij3ntP9BjnQsV3rTVnAF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 783,
                "original_language": "en",
                "original_title": "Gandhi",
                "overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
                "popularity": 4.2391,
                "poster_path": "/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
                "release_date": "1982-12-01",
                "title": "Gandhi",
                "video": false,
                "vote_average": 7.557,
                "vote_count": 2389,
                "character": "G.O.C.",
                "credit_id": "55f75d9592514123ea001241",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/pRBCb6Hs6Xo4diXwpnBTcwMizE.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 1485,
                "original_language": "en",
                "original_title": "Get Carter",
                "overview": "Jack Carter is a small-time hood working in London. When word reaches him of his brother's death, he travels to Newcastle to attend the funeral. Refusing to accept the police report of suicide, Carter seeks out his brother’s friends and acquaintances to learn who murdered his sibling and why.",
                "popularity": 2.9415,
                "poster_path": "/3AytAYzJuPmS4Wo8X3jcsaN4oM3.jpg",
                "release_date": "1971-02-03",
                "title": "Get Carter",
                "video": false,
                "vote_average": 6.999,
                "vote_count": 525,
                "character": "Thorpe",
                "credit_id": "5792aa909251410d1200521c",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/okdg55jhsr9k1F2lxsZoQncrLZL.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752,
                    36
                ],
                "id": 3175,
                "original_language": "en",
                "original_title": "Barry Lyndon",
                "overview": "An Irish rogue uses his cunning and wit to work his way up the social classes of 18th century England, transforming himself from the humble Redmond Barry into the noble Barry Lyndon.",
                "popularity": 6.1938,
                "poster_path": "/x2JQCgLjieWOwvImeGtLmuNgsrq.jpg",
                "release_date": "1975-12-18",
                "title": "Barry Lyndon",
                "video": false,
                "vote_average": 8.003,
                "vote_count": 2995,
                "character": "Diner at Feast for Lord Wendover",
                "credit_id": "5ab8de8cc3a36817a000c079",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bernard Hepton (born 19 October 1925 - 27th July, 2018) was a British actor of stage, film and television.\n\nHepton was known as a particularly versatile character actor. He trained at Bradford Civic Theatre school under Esme Church along with actors such as Robert Stephens. He had extensive stage experience as an actor, under Sir Barry Jackson in addition to a spell as Artistic Director of Birmingham Rep and Liverpool Playhouse.\n\nOn television, he played Toby Esterhase in the BBC Television adaptations of Tinker, Tailor, Soldier, Spy and Smiley's People, and George Smiley in the radio adaptations. He also played the Kommandant in Colditz (1972–74), and later appeared for the same production team as Albert Foiret in three seasons of Secret Army (1977–79). Before that he had made a guest appearance in an episode of the first series of Catweazle in 1970 where he played a naturalist. Other notable performances included Thomas Cranmer in both The Six Wives of Henry VIII (1970) and Elizabeth R (1971).\n\nHe played Sam Toovey in the 1989 television adaptation of Susan Hill's ghost story The Woman in Black.\n\nOn radio Hepton played the role of Albert, in Stranger In The Home by Alan Dapre, also the role of The Old Man in the Corner, the Baroness Orczy amateur, and mostly sedentary, sleuth in the BBC dramatizations called The Teahouse Detective (1998–2000).\n\nHis appearances in feature film were less frequent. He made a brief appearance as Thorpey, a gangster in the classic British film Get Carter (1971), and had another small role, as Milton Goldsmith, in Voyage of the Damned (1976).\n\nHe was a fan of the Rugby League team Hunslet Hawks and also played stand-off for them in the 1952/53 season, winning a Yorkshire Cup Medal.\n\nDescription above from the Wikipedia article Bernard Hepton, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1925-10-19",
        "deathday": "2018-07-27",
        "gender": 2,
        "homepage": null,
        "id": 71949,
        "imdb_id": "nm0378404",
        "known_for_department": "Acting",
        "name": "Bernard Hepton",
        "place_of_birth": "Bradford, Yorkshire, England, UK",
        "popularity": 0.1945,
        "profile_path": "/ud9XqroQkWEdR58W5bK0aRZhGqR.jpg"
    }
}