{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjnfM8QmrXQkWl8dUimsDGl73el.jpg",
                "genre_ids": [
                    12,
                    10749,
                    36
                ],
                "id": 10907,
                "original_language": "en",
                "original_title": "The Adventures of Robin Hood",
                "overview": "Robin Hood fights nobly for justice against the evil Sir Guy of Gisbourne while striving to win the hand of the beautiful Maid Marian.",
                "popularity": 2.6754,
                "poster_path": "/4mazyXEMkmLw5h6076yyNSm9uv0.jpg",
                "release_date": "1938-05-13",
                "title": "The Adventures of Robin Hood",
                "video": false,
                "vote_average": 7.484,
                "vote_count": 800,
                "character": "Much",
                "credit_id": "52fe43ce9251416c7501ede9",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nHerbert Mundin (21 August 1898 – 5 March 1939) was an English-born Hollywood character actor. He was frequently typecast in films as an older cheeky eccentric, a type helped by his jowled features and cheerful disposition.\n\nHe was born Herbert Thomas Mundin in St Helens, then in Lancashire (now part of Merseyside). His father was a nomadic, Primitive Methodist home missionary. His family moved within a short time of his birth to St Albans in Hertfordshire (the 1901 census data reveal that the family lived at St Helens Villa, Paxton Road, St Albans; his parents William and Jane apparently naming their house after the town where they first met and where Herbert was born).\n\nMundin was educated at St Albans School, and joined the Royal Navy during World War I. He began his acting career on the London stage during the 1920s. Mundin first travelled to America on 18 December 1923 for a series of theatrical engagements in New York. He sailed from Southampton on the RMS Aquitania and described himself in ship’s passenger manifest as 5'7\" tall with a fair complexion, brown hair, blue eyes and a scar over his left eye. His big break as an actor was arguably with Gertrude Lawrence and Beatrice Lillie in Charlot's Revue when it appeared on Broadway in 1925.\n\nIn 1931, after working in Australia and London, he permanently moved to the US, where he received a contract with Twentieth Century Fox Studios and enjoyed a successful career as a character actor in over 50 films.\n\nPerhaps his most celebrated role was as Much in The Adventures of Robin Hood (1938), alongside Errol Flynn. Other film appearances included Mutiny on the Bounty (1935) with Charles Laughton and Clark Gable, and MGM's David Copperfield (1935).\n\nHe died in Van Nuys, California following a car crash. He was killed instantly when the car in which he was riding collided with another car at a street intersection. The force of the impact threw open the door and hurled Mundin to the street.He received a fractured skull and crushed chest.He was 40 years old. The other occupants of the car were not injured.\n\nDescription above from the Wikipedia article Herbert Mundin, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1898-08-20",
        "deathday": "1939-03-05",
        "gender": 2,
        "homepage": null,
        "id": 72060,
        "imdb_id": "nm0612743",
        "known_for_department": "Acting",
        "name": "Herbert Mundin",
        "place_of_birth": "St Helens, Lancashire, UK",
        "popularity": 0.1384,
        "profile_path": "/3aXh1VxGhVLCqLEBXUyoJK6TlIz.jpg"
    }
}