{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3aGsZdB5ud6LmU9lppwTLh2fqH1.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 16320,
                "original_language": "en",
                "original_title": "Serenity",
                "overview": "When the renegade crew of Serenity agrees to hide a fugitive on their ship, they find themselves in an action-packed battle between the relentless military might of a totalitarian regime who will destroy anything – or anyone – to get the girl back and the bloodthirsty creatures who roam the uncharted areas of space. But... the greatest danger of all may be on their ship.",
                "popularity": 7.1808,
                "poster_path": "/4sqUOaPFoP2W81mq1UYqZqf5WzA.jpg",
                "release_date": "2005-09-25",
                "title": "Serenity",
                "video": false,
                "vote_average": 7.363,
                "vote_count": 3675,
                "character": "Kaywinnet Lee 'Kaylee' Frye",
                "credit_id": "52fe46c59251416c75082fef",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jewel",
            "Jewel Belair Staite"
        ],
        "biography": "Jewel Belair Staite (born June 2, 1982) is a Canadian actress who portrayed Catalina in Space Cases, Kaylee Frye in Firefly and Serenity, and Dr. Jennifer Keller on Stargate Atlantis. Most recently, she starred as Raquel Westbrook in the Canadian drama, The L.A. Complex.Staite was born in White Rock, British Columbia. The youngest of seven children, she modeled as a child and has acted since age six. She has stated that she is of British, Irish, French Canadian, and Iroquois ancestry. Staite attended the Vancouver Film School and worked at the Vancouver Youth Theatre.\n\nShe married actor Matt Anderson on April 25, 2003. On December 13, 2011, she announced they were divorcing in a post on her food blog. Staite played Kaylee Frye in the short-lived space westerntelevision seriesFirefly and its subsequent 2005 film, Serenity. She wrote a chapter in the book Finding Serenity, called \"Kaylee Speaks: Jewel Staite On Firefly\".She played Heidi Gotts in the television series Wonderfalls, and appeared in a Season Three episode of The X-Files.Staite played the role of head medical doctor Jennifer Keller in the Stargate SG-1 spinoff Stargate Atlantis,making her the third actor from the Firefly series to move on to appear in a Stargate series (the first being Adam Baldwin, who had a brief role as a colonel in the Stargate SG-1 Season Seven episode \"Heroes\", and the second being Morena Baccarin, who played Adria, the main villain in the tenth season of SG-1), and the second to take a recurring role. She replaced Paul McGillion (Dr. Carson Beckett). In the fifth season her character was changed from recurring status to part of the main cast. Before taking on the role as Dr. Keller she previously played the Wraith child Ellia in the Stargate Atlantis episode \"Instinct\".She also appeared in the 2010 Sci-Fi film, Mothman, under direction from Sheldon Wilson.\n\nStaite guest starred in an episode of Warehouse 13 as the love interest of Sheldon (played by Sean Maher, who played Jewel's love interest in Firefly).\n\nShe also did voices in the animated TV series Mummies Alive! and Sabrina: The Animated Series for DIC Entertainment. As of 2012, Staite was a series regular on The L.A. Complex, in which she portrayed Raquel Westbrook, a struggling actress. The show aired in Canada on MuchMusic and in the U.S. on The CW. She also appeared recently in an episode of The Listener.",
        "birthday": "1982-06-02",
        "deathday": null,
        "gender": 1,
        "homepage": "http://jewelstaite.com/",
        "id": 72092,
        "imdb_id": "nm0821612",
        "known_for_department": "Acting",
        "name": "Jewel Staite",
        "place_of_birth": "White Rock, British Columbia, Canada",
        "popularity": 1.2684,
        "profile_path": "/P6p0ASNBqx8PSaHNom5NR9vTci.jpg"
    }
}