{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3CcO4QdasRCitq2dczOpx7CXgLM.jpg",
                "genre_ids": [
                    10751,
                    12,
                    18
                ],
                "id": 12837,
                "original_language": "en",
                "original_title": "The Secret Life of Bees",
                "overview": "Set in South Carolina in 1964, this is the tale of Lily Owens a 14 year-old girl who is haunted by the memory of her late mother. To escape her lonely life and troubled relationship with her father, Lily flees with Rosaleen, her caregiver and only friend, to a South Carolina town that holds the secret to her mother's past.",
                "popularity": 3.6554,
                "poster_path": "/m1LGEeoYfc6crbfG8WmTKg9SVqL.jpg",
                "release_date": "2008-09-17",
                "title": "The Secret Life of Bees",
                "video": false,
                "vote_average": 7.482,
                "vote_count": 551,
                "character": "June Boatwright",
                "credit_id": "52fe45299251416c7504dc77",
                "order": 3
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/oAcV4179Kdpvb2xk9TtS8Ewrp8q.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 612706,
                "original_language": "en",
                "original_title": "Work It",
                "overview": "A brilliant but clumsy high school senior vows to get into her late father's alma mater by transforming herself and a misfit squad into dance champions.",
                "popularity": 2.4053,
                "poster_path": "/b5XfICAvUe8beWExBz97i0Qw4Qh.jpg",
                "release_date": "2020-08-07",
                "title": "Work It",
                "video": false,
                "vote_average": 7.513,
                "vote_count": 1193,
                "credit_id": "5d1bb3a494d8a800103ba4ef",
                "department": "Production",
                "job": "Producer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alicia Augello Cook",
            "آلیشا کیز"
        ],
        "biography": "Alicia Augello Cook (born January 25, 1981), known professionally as Alicia Keys, is an American singer-songwriter. A classically-trained pianist, Keys was composing songs by age 12. She was signed at 15 years old by Columbia Records, and then, after disputes with the label, by Arista Records. Her debut album, Songs in A Minor, was released with J Records in 2001. Praised for Keys' musical talents and creative control, Songs in A Minor was critically and commercially successful, producing her first Billboard Hot 100 number-one single \"Fallin'\" and selling over 12 million copies worldwide. Songs in A Minor earned Keys five Grammy Awards in 2002. Her second album, The Diary of Alicia Keys (2003), was also a critical and commercial success, spawning successful singles \"You Don't Know My Name\", \"If I Ain't Got You\" and \"Diary\", and selling eight million copies worldwide. The album garnered her an additional four Grammy Awards. Her duet song \"My Boo\" with Usher became her second number-one single in 2004. Keys released her first live album, Unplugged (2005), and became the first female to have an MTV Unplugged album debut at number one.\n\nHer third album, As I Am (2007), produced the Hot 100 number-one single \"No One\", selling 5 million copies worldwide and earning an additional three Grammy Awards. In 2007, Keys made her film debut in the action-thriller film Smokin' Aces. Her fourth album,The Element of Freedom (2009), became her first chart-topping album in the UK, and sold 4 million copies worldwide. In 2009, Keys also collaborated with Jay Z on \"Empire State of Mind\", which became her fourth number-one single, and won the Grammy Award for Best Rap/Sung Collaboration in 2010. Girl on Fire (2012) was her fifth Billboard 200 topping album, spawning the successful title track, and won the Grammy Award for Best R&B Album. In 2013, VH1 Storytellers was released as her second live album. Her sixth studio album, Here (2016), became her seventh US R&B/Hip-Hop chart topping album.\n\nKeys has received numerous accolades throughout her career, including 15 competitive Grammy Awards, 17 NAACP Image Awards, 12 ASCAP Awards, and awards from the Songwriters Hall of Fame and National Music Publishers Association. She has sold over 35 million albums and 30 million singles worldwide. Considered a musical icon, Keys was named by Billboard the top R&B artist of the 2000s decade and placed number 10 on their list of Top 50 R&B/Hip-Hop Artists of the Past 25 Years. VH1 also included her on their 100 Greatest Artists of All Time and 100 Greatest Women in Music lists, while Time have named her in their 100 list of most influential people in 2005 and 2017. Keys is also known for her humanitarian work, philanthropy and activism, and has received accolades for such work. Keys co-founded and is the Global Ambassador of the nonprofit HIV/AIDS-fighting organization Keep a Child Alive.",
        "birthday": "1981-01-25",
        "deathday": null,
        "gender": 1,
        "homepage": "http://aliciakeys.com/",
        "id": 72208,
        "imdb_id": "nm1006024",
        "known_for_department": "Acting",
        "name": "Alicia Keys",
        "place_of_birth": "Hell's Kitchen, New York City, New York, USA",
        "popularity": 0.4384,
        "profile_path": "/nPM0mhOgK971G3IPiALSGFDi7PL.jpg"
    }
}