{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/upyQnoXc0RP4DXhPbijG7xDlSos.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11159,
                "original_language": "en",
                "original_title": "Secrets & Lies",
                "overview": "After her adoptive mother dies, Hortense, a successful black optometrist, seeks out her birth mother. She's shocked when her research leads her to Cynthia, a working class white woman.",
                "popularity": 3.2398,
                "poster_path": "/zQBuRQ3hrLhkEsXcxteUxuxLrvs.jpg",
                "release_date": "1996-05-24",
                "title": "Secrets & Lies",
                "video": false,
                "vote_average": 7.556,
                "vote_count": 687,
                "character": "Boxer",
                "credit_id": "589359e8925141625100007a",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nGary McDonald (born in London in 1961) is an English actor of Jamaican descent. A student at Elliott school in Putney, McDonald played football for Wimbledon FC under Dario Gradi.\n\nHe was a member of the Royal Court Theatre from 1979-80, appearing in various plays at the Court such as Hard time Pressure, Hero’s Welcome and Che Walker’s Been so Long. In the 1980’s he performed with the Talawa Theatre company in The Black Jacobins, The Importance of Being Earnest and A Raisin in the Sun with the Black Theatre. He appeared at the Royal National Theatre in Macbeth and Black Poppies, Rhapsody in Black & White and at The Cottlesloe in Blood Wedding. Other theatre credits include Scrape of the Black and Mike Leigh’s It’s a Great Big Shame at the Theatre Royal Stratford East.\n\nHis first notable television role came in 1987 when he was cast as Darren Roberts in the BBC soap opera EastEnders. He left the role in 1988. He has also appeared in Numb3ers, The Bill, Between the Lines, South of the Border, as Captain John Black in Dream Team (1999-2006) and in Brothers and Sisters, among others. He has also appeared in various films.\n\nDescription above from the Wikipedia article Gary McDonald (actor),licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1961-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 72312,
        "imdb_id": "nm0531722",
        "known_for_department": "Acting",
        "name": "Gary McDonald",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1113,
        "profile_path": "/hUhWQzBftLCLJojBNHnwsDZM0sO.jpg"
    }
}