{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7hcoMi2AMRvPC7YnGm41k3Wcgvy.jpg",
                "genre_ids": [
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 10795,
                "original_language": "fr",
                "original_title": "Ne le dis à personne",
                "overview": "A man receives a mysterious email appearing to be from his wife, who was murdered years earlier. As he frantically tries to find out whether she's alive, he finds himself being implicated in her death.",
                "popularity": 4.9671,
                "poster_path": "/fr2wEeO1H8dzx6EDfzYTRBIvZaE.jpg",
                "release_date": "2006-11-01",
                "title": "Tell No One",
                "video": false,
                "vote_average": 7.229,
                "vote_count": 1450,
                "character": "Yaël Gonzales",
                "credit_id": "593bce1cc3a3680f3300a930",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Djellil Lespert",
            "جاليل لسبرت",
            "Djallil Lespert"
        ],
        "biography": "Jalil Lespert is the son of actor Jean Lespert, born in 1942 in Rosny-sous-Bois, and Farida Azi, lawyer of Algerian origin born in 1948 in Palestro (today Lakhdaria), in Algeria. He is the older brother of actor Yaniss Lespert.\n\nPushed by his mother, a lawyer, Jalil Lespert began studying law, but he changed his mind when in 1995, Laurent Cantet noticed him and cast him with his father in the short film Jeux de Plage. Subsequently, the young actor reunited with the director to shoot the TV film Les Sanguinaires in 1997. Two years later, Laurent Cantet offered him a new role, this time in the cinema, in the film Ressources Humaines. Thanks to the role of Franck, he was revealed to the general public and won the César for best male actor in 2001. In 2003, he won the prize for best new actor at the Cabourg Film Festival for his role in Vivre me tue by Jean- Pierre Sinapi. From then on, the actor made a series of films (Pas sur la bouche, Le Promeneur du Champ-de-Mars, Virgil, Le petit Lieutenant…).\n\nJalil Lespert also stands out as a director. In 2007, he moved behind the camera and signed the feature film 24 measures. A few years later, he repeated the experience with the adaptation of the novel Contrary Winds, which received a good reception. In 2014, he co-wrote and directed the biopic dedicated to Yves Saint-Laurent, played by Pierre Niney. In 2015, he joined the team of directors of the series Versailles, broadcast on Canal+, which was a great success. He continued the following year with the production of the feature film Iris in which he also starred. Since then, Jalil Lespert has alternated between his career as a director and that of an actor. In 2020, he starred in La terre des hommes by Noël Marandin and L’Enfant rêve by Raphaël Jacoulot.\n\nOn the private side, Jalil Lespert has shared the life of Sonia Rolland since 2009. The couple has a daughter, Kahina, born in November 2010. From his union with the actress Bérangère Allaux, the actor has two children, a boy named Aliosha and a daughter, Gena. In October 2018, he announced on social networks that he was separated from Sonia Rolland. On December 15, 2020, he formalized his relationship with the widow of Johnny Hallyday, Laeticia, on Instagram. Jalil Lespert is the ambassador of the NGO Plan International (children's rights in developing countries). In 2016, Jalil Lespert was a member of the jury for the 2016 Dinard British Film Festival.",
        "birthday": "1976-05-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 72327,
        "imdb_id": "nm0504267",
        "known_for_department": "Acting",
        "name": "Jalil Lespert",
        "place_of_birth": "Paris, France",
        "popularity": 0.2718,
        "profile_path": "/lvHoQZBYLV33KDoog9Xt30GtaOy.jpg"
    }
}