{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/38zhXIWXlWDzwI8gRJOf5ISyGFc.jpg",
                "genre_ids": [
                    35,
                    53,
                    18
                ],
                "id": 10843,
                "original_language": "en",
                "original_title": "After Hours",
                "overview": "Desperate to escape his mind-numbing routine, uptown Manhattan office worker Paul Hackett ventures downtown for a hookup with a mystery woman.",
                "popularity": 3.9708,
                "poster_path": "/eamOBurHBu0MIxohTIVcfxmZ6Z7.jpg",
                "release_date": "1985-09-13",
                "title": "After Hours",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1603,
                "character": "Bouncer",
                "credit_id": "61ac8f7738e51000194ee5a8",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nClarence Felder (born September 2, 1938) is an American character actor who starred in films and on television and co-starred in ten Broadway productions.\n\nClarence's first feature film was in the 1974 movie Man on a Swing, his other films include After Hours (1985), Ruthless People (1986), The Hidden (1987), The Last Boy Scout (1991), and The Ride (1997). He stars in the award-winning feature film, All for Liberty (2009) portraying his ancestor, Captain Henry Felder, an American Revolutionary War hero of the Backcountry of South Carolina, based on his play, Captain Felder's Cannon. His starring role on a television series was ABC's 1980s hit series Hooperman as Inspector Bobo Pritzger. Clarence has starred in many TV movies including Playing for Time, Mystery of the Morrow Castle and The Killing Floor. He has made many guest appearances on prime time TV series, including Kojak, Hill Street Blues, Alien Nation, Dream On, L.A. Law and NYPD Blue.\n\nOn Broadway, he co-starred with Christopher Walken in Macbeth, with Glenn Close in Love for Love, Colleen Dewhurst in Queen &amp; the Rebels and Meryl Streep in Memory of Two Mondays. He played Debbie Harry's [Blondie] father in Teaneck Tanzi. He is married to actress/writer/director, Chris Weatherhead and is the co-founder of Actors' Theatre of South Carolina and their film division, Moving Images Group. He has one daughter, Helen Huggins. He is also a playwright and director.\n\nDescription above from the Wikipedia article Clarence Felder, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1938-09-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 72408,
        "imdb_id": "nm0270948",
        "known_for_department": "Acting",
        "name": "Clarence Felder",
        "place_of_birth": "St. Matthews, South Carolina",
        "popularity": 0.7248,
        "profile_path": "/vzTNlKkS6CqGV58mmGCPGxuOByk.jpg"
    }
}