{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x29PYzoNYPGzdj3M8FDwSwEgNpf.jpg",
                "genre_ids": [
                    35,
                    80,
                    9648,
                    53
                ],
                "id": 5236,
                "original_language": "en",
                "original_title": "Kiss Kiss Bang Bang",
                "overview": "A petty thief posing as an actor is brought to Los Angeles for an unlikely audition and finds himself in the middle of a murder investigation along with his high school dream girl and a detective who's been training him for his upcoming role...",
                "popularity": 2.3875,
                "poster_path": "/aWfjIkpENFX6Uw82pET7EQ6jnrd.jpg",
                "release_date": "2005-09-14",
                "title": "Kiss Kiss Bang Bang",
                "video": false,
                "vote_average": 7.163,
                "vote_count": 2833,
                "character": "Gift Bag Girl",
                "credit_id": "56ad1d64c3a3681c340064b1",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "is an American actress who has starred in many films and a television show. She played Sara Duncan on the short-lived series Pursuit of Happiness (1987–88)  Aronson was born in Los Angeles, California in 1964. Her first film role was in the 1984 horror film Friday the 13th: The Final Chapter as Samantha. In 1985, she starred in the hit comedy movie Weird Science as Hilly[3] and in the action movie American Ninja.[4] Other than short films, she hasn't appeared in film or television since the 2005 film Kiss Kiss Bang Bang.  Aronson has made numerous guest appearances on such television shows as Sledge Hammer!, The Powers of Matthew Star, Simon & Simon, Midnight Caller, Full House, Beverly Hills, 90210, Las Vegas, Charles in Charge, and Law & Order: Criminal Intent. She made an appearance in the 1990 music video, \"(Can't Live Without Your) Love and Affection\" by Nelson.\n\nIn addition to her acting career, Aronson is also an entrepreneur. She owned a Curio Shoppe and currently runs Pilates studios in the Los Angeles area",
        "birthday": "1964-06-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 72541,
        "imdb_id": "nm0036978",
        "known_for_department": "Acting",
        "name": "Judie Aronson",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2801,
        "profile_path": "/mHfgGvgdrfFvWTbkqRjziyNFxny.jpg"
    }
}