{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kiSderXBFLpkSp7dZ5RQkHOD5nh.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 1555,
                "original_language": "fr",
                "original_title": "L'Auberge espagnole",
                "overview": "A strait-laced French student moves into an apartment in Barcelona with a cast of six other characters from all over Europe. Together, they speak the international language of love and friendship.",
                "popularity": 4.5365,
                "poster_path": "/baDm4V3Dqx2hNh7WF1NvGrHGgqQ.jpg",
                "release_date": "2002-06-19",
                "title": "The Spanish Apartment",
                "video": false,
                "vote_average": 7.126,
                "vote_count": 1176,
                "character": "La professeur de flamenco",
                "credit_id": "53785fc10e0a261416004512",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nPaulina Gálvez (born September 14, 1969) is a Spanish actress. She was born in Santiago de Chile, Chile to a Chilean mother and a Spanish father, both economists. She was raised in Madrid from the age of eight. Started her artistic career as a Flamenco dancer in several companies (Carmen Cortes, Zambra), theatre with famous experimental Catalan group Els Joglars, from Barcelona and films and television in Europe. Actually she lives in the United States. She played the role of Gabriela in the movie Un rey en la Habana, 2005.\n\nIn 2000 she played Marta, the Gypsy servant of the Queen of Swords and with Tessie Santiago were the only two actors to appear in all 22 episodes of this TV series filmed at Texas Hollywood, Almeria, Spain.\n\nDescription above from the Wikipedia article Paulina Gálvez (actress), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1969-09-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 72674,
        "imdb_id": "nm0350638",
        "known_for_department": "Acting",
        "name": "Paulina Gálvez",
        "place_of_birth": "Santiago de Chile, Chile",
        "popularity": 0.1551,
        "profile_path": "/qLn6T7rPAm0qLtwRwhVodD4BUTY.jpg"
    }
}