{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qOyw4yfzbzTp5YsCX26C28Do0S.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 872,
                "original_language": "en",
                "original_title": "Singin' in the Rain",
                "overview": "In 1927 Hollywood, a silent film star falls for a chorus girl just as he and his paranoid screen partner struggle to make the difficult transition to talking pictures.",
                "popularity": 4.2669,
                "poster_path": "/w03EiJVHP8Un77boQeE7hg9DVdU.jpg",
                "release_date": "1952-04-10",
                "title": "Singin' in the Rain",
                "video": false,
                "vote_average": 8.146,
                "vote_count": 3306,
                "character": "Teresa - a Lady-in-Waiting (uncredited)",
                "credit_id": "61abe62762e86f008f3aa769",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Дон Аддамс",
            "Доун Аддамс",
            "Victoria Dawn Addams"
        ],
        "biography": "Victoria Dawn Addams (21 September 1930 – 7 May 1985) was a British actress, particularly in Hollywood motion pictures of the 1950s and on British television in the 1960s and 1970s. She became a princess in 1954 (until 1971).\n\nAddams was born in Felixstowe, Suffolk, England, the daughter of Ethel Mary (née Hickie) and Captain James Ramage Addams, of the Royal Air Force. Her mother died when she was young, and she spent her early life in Calcutta, India.\n\nAddams' face and physique attracted the attention of talent agents. In December 1950, she signed a seven-year contract with Metro-Goldwyn-Mayer studios. Her film career began with a role in Night into Morning (1951), and her subsequent MGM films included Singin' in the Rain (1952), Plymouth Adventure (1952), Young Bess (1953) and the female lead opposite Peter Lawford in The Hour of 13 (1952). She played David Niven's daughter in The Moon Is Blue (1953), a film which helped loosen the system of censorship of Hollywood which had been in place since 1934. She also embarked on a USO tour the same year to help entertain troops in Korea. She worked steadily in films during the remainder of the 1950s, including a heavily publicised role as Richard Carlson's model girlfriend in the science fiction film Riders to the Stars (1954) and the female lead opposite actor-director-filmmaker legend Charlie Chaplin in his final comedy to star himself, A King in New York (1957). During the 1960s and 1970s, she appeared mainly in British TV shows and French films.\n\nShe was a semi-regular on the instructional series En France (1962) and the leading lady in several episodes of The Saint (1962–69), which starred Roger Moore as Simon Templar. Among her last film credits were two British horror films, The Vampire Lovers (1970) and The Vault of Horror (1973), and she was also a regular in the British sitcom Father, Dear Father (1971–1973). One of her last television roles was in the science fiction serial Star Maidens (1977). Addams retired in the early 1980s, dividing her remaining years between Europe and the United States.\n\nShe married Don Vittorio Emanuele Massimo, Prince of Roccasecca, in 1954; the wedding was the subject of a cover story in Life magazine. They separated four years later, though they did not formally divorce until 1971. Their son, Prince Stefano (b.1955), married Atalanta Foxwell, daughter of film producer Ivan Foxwell and Lady Edith (Lambart), granddaughter of the 9th Earl of Cavan.\n\nIn 1974 she married retired businessman Jimmy White.\n\nAddams died in 1985 in a London hospital at age 54 from lung cancer.",
        "birthday": "1930-09-21",
        "deathday": "1985-05-07",
        "gender": 1,
        "homepage": null,
        "id": 72717,
        "imdb_id": "nm0011625",
        "known_for_department": "Acting",
        "name": "Dawn Addams",
        "place_of_birth": "Felixstowe, Suffolk, England, UK",
        "popularity": 1.1839,
        "profile_path": "/jdkF0IUkajyfcyKtD1OB3RqC2M4.jpg"
    }
}