{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mmd1HnuvAzFc4iuVJcnBrhDNEKr.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 694,
                "original_language": "en",
                "original_title": "The Shining",
                "overview": "Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest of the world for the winter. But they aren't prepared for the madness that lurks within.",
                "popularity": 9.1204,
                "poster_path": "/xazWoLealQwEgqZ89MLZklLZD3k.jpg",
                "release_date": "1980-05-23",
                "title": "The Shining",
                "video": false,
                "vote_average": 8.21,
                "vote_count": 18177,
                "character": "Watson",
                "credit_id": "52fe426bc3a36847f801d423",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/9jxLUKbuDgYW8Ro94q50rLQQL0P.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14
                ],
                "id": 11639,
                "original_language": "en",
                "original_title": "The Dark Crystal",
                "overview": "On another planet in the distant past, a Gelfling embarks on a quest to find the missing shard of a magical crystal and restore order to his world, before the grotesque race of Skeksis find and use the crystal for evil.",
                "popularity": 3.9881,
                "poster_path": "/6g1Kh73qQRosyhRJpL3euQpMxOE.jpg",
                "release_date": "1982-12-17",
                "title": "The Dark Crystal",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1186,
                "character": "Chamberlain / Podling (voice)",
                "credit_id": "52fe446e9251416c7503481d",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/xQRh7hSPdtEE0aUmuY8EdifrXPK.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 12545,
                "original_language": "en",
                "original_title": "Jesus Christ Superstar",
                "overview": "As played out by a theatre troupe, the last days of Jesus Christ are depicted from the perspective of Judas Iscariot, his betrayer. As Jesus' following increases, Judas begins to worry that Jesus is falling for his own hype, forgetting the principles of his teachings and growing too close to the prostitute Mary Magdalene.",
                "popularity": 3.6148,
                "poster_path": "/p5LGgKCVGGVZKTkwKzpBDIesydj.jpg",
                "release_date": "1973-08-15",
                "title": "Jesus Christ Superstar",
                "video": false,
                "vote_average": 7.086,
                "vote_count": 579,
                "character": "Pontius Pilate",
                "credit_id": "52fe44f89251416c750473f3",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/rqnOgJWvlURkcOWfGqiACvkTAqG.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 14811,
                "original_language": "en",
                "original_title": "Fiddler on the Roof",
                "overview": "In a pre-revolutionary Russia, a poor Jewish milkman struggles with the challenges of a changing world as his daughters fall in love and antisemitism grows.",
                "popularity": 3.5771,
                "poster_path": "/v65PHx7Q6Jx0anyNeUOX07SJic9.jpg",
                "release_date": "1971-11-03",
                "title": "Fiddler on the Roof",
                "video": false,
                "vote_average": 7.73,
                "vote_count": 605,
                "character": "Mendel",
                "credit_id": "570538f9c3a3680f3d0003b8",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/tupgjqhWx5oieQrdyesO3aclUX9.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 597,
                "original_language": "en",
                "original_title": "Titanic",
                "overview": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
                "popularity": 23.0816,
                "poster_path": "/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
                "release_date": "1997-11-18",
                "title": "Titanic",
                "video": false,
                "vote_average": 7.906,
                "vote_count": 26321,
                "character": "Praying Man",
                "credit_id": "5880c7fbc3a368312000ba44",
                "order": 79
            },
            {
                "adult": false,
                "backdrop_path": "/ltlPFTMRsohmi2QbbSZUkAVg7Nc.jpg",
                "genre_ids": [
                    878,
                    28,
                    16,
                    12
                ],
                "id": 297556,
                "original_language": "en",
                "original_title": "Justice League: Throne of Atlantis",
                "overview": "After the events of Justice League: War, Ocean Master and Black Manta have declared a war against the surface in retaliation of the aftermath of Apokoliptian-tyrant Darkseid's planetary invasion. Queen Atlanna seeks out her other son, Ocean Master’s half-brother Arthur Curry, a half-human with aquatic powers with no knowledge of his Atlantean heritage, to restore balance.  Living with powers he doesn’t understand and seeing the danger around him, Curry takes steps to embrace his destiny, joining the Justice League, and with his new teammates he battles to save Earth from total destruction.",
                "popularity": 3.1164,
                "poster_path": "/iaYZA8teYeIxmR8wRrEED5wwR0u.jpg",
                "release_date": "2015-01-13",
                "title": "Justice League: Throne of Atlantis",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 957,
                "character": "Defense Advisor (voice)",
                "credit_id": "5c52c974c3a36847779993a1",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/2pViauhiZLhAUb1lsY6wRir69SF.jpg",
                "genre_ids": [
                    35
                ],
                "id": 1621,
                "original_language": "en",
                "original_title": "Trading Places",
                "overview": "A snobbish investor and a wily street con-artist find their positions reversed as part of a bet by two callous millionaires.",
                "popularity": 6.727,
                "poster_path": "/8mBuLCOcpWnmYtZc4aqtvDXslv6.jpg",
                "release_date": "1983-06-07",
                "title": "Trading Places",
                "video": false,
                "vote_average": 7.23,
                "vote_count": 3444,
                "character": "Demitri",
                "credit_id": "5e0e1b7168b1ea00157f8973",
                "order": 85
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​Barry Dennen (February 22, 1938–September 26, 2017) was an American actor, singer, and writer.\n\nDennen was born in Chicago, Illinois. In New York City from 1960 to 1963, he had a relationship with Barbra Streisand, including living together for a year, during which time he helped her develop the nightclub act that began her successful career as a singer and actress.\n\nHe moved to London for fifteen years and in 1968 landed the starring role of the master of ceremonies in the London version of Cabaret. In 1970, he played Pontius Pilate on the album of Jesus Christ Superstar, and he played the same role in the Broadway production (1971). In the same year, he played Mendel in Norman Jewison's film of Fiddler on the Roof. According to Dennen's website, he suggested to Jewison that he direct a film of Superstar. Jewison did so, and Dennen played Pilate again (1973).\n\nHe was the voice actor who portrayed the Chamberlain SkekSil in The Dark Crystal. He has also done voice work on such cartoons as DuckTales, Batman: The Animated Series, The Pirates of Dark Water, Animaniacs, and Avatar: The Last Airbender.\n\nSince that time Dennen has had a variety of small parts on American television shows and films, including: Batman; Superman III; The Kentucky Fried Movie; The Shining; Galtar and the Golden Lance; Tales from the Darkside and Titanic. He played auto dealer Irwin Lapsey in Shock Treatment, the sequel toThe Rocky Horror Picture Show. He has also done voices for many video games, including Fatman in Metal Gear Solid 2, Police Chief Bogen in Grim Fandango, Mimir in the recent video game Too Human, Dean Domino in Fallout: New Vegas expansion \"Dead Money\", and the Dark One in The Mark of Kri.\n\nHe wrote the screenplay for an episode of Amazing Stories titled \"The Secret Cinema\" (1985) and cowrote an episode of The Comic Strip Presents... titled \"Demonella\" (1993). His autobiographical book, My Life With Barbra: A Love Story (1997), deals with their relationship and with his gradual realization that he was a homosexual.\n\nDescription above from the Wikipedia article  Barry Dennen, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1938-02-22",
        "deathday": "2017-09-26",
        "gender": 2,
        "homepage": null,
        "id": 72742,
        "imdb_id": "nm0219336",
        "known_for_department": "Acting",
        "name": "Barry Dennen",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.1824,
        "profile_path": "/6m6LMpQZlHLYDuMxbPU4R5gr75l.jpg"
    }
}