{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/czLjLCZTie8Oaf9Bz9ANhsD705i.jpg",
                "genre_ids": [
                    28,
                    53,
                    80,
                    18
                ],
                "id": 15362,
                "original_language": "fr",
                "original_title": "L'ennemi public n°1",
                "overview": "After nearly two decades of legendary criminal feats, making him France's most notorious criminal while simultaneously feeding his desire for media attention and public adoration, Mesrine becomes increasingly paranoid and isolated, leading to a dramatic confrontation with the law that ultimately seals his fate as the nation's most infamous public enemy.",
                "popularity": 4.314,
                "poster_path": "/k9lhZ0PhY78nzwG034rNpsLXlpW.jpg",
                "release_date": "2008-11-19",
                "title": "Mesrine: Public Enemy #1",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 908,
                "character": "Henri Lelièvre",
                "credit_id": "575ac1a5c3a3683b5000156b",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "Alexandre Renaud",
                "credit_id": "5e50ea3335811d0017553286",
                "order": 59
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Georges Wilson du T.N.P.",
            "George Wilson",
            "Georges Willson",
            "Жорж Вильсон"
        ],
        "biography": "Georges Wilson (né Willson; 16 October 1921 – 3 February 2010) was a French actor and director of stage and screen. He was a significant figure in French theatre during the latter 20th-century, serving as director of the Theatre National Populaire from 1963 and 1972, while his film work earned him both BAFTA Award and Cesar Award nominations. He was also the father of French actor Lambert Wilson.\n\nWilson was born in Champigny-sur-Marne, Seine (now Val-de-Marne) as the illegitimate son of a French father and an Irish mother. His professional surname, Wilson, derives from his Irish grandmother; his birthname has not been made public.\n\nHe was nominated for a BAFTA Film Award, and also nominated for a César Award. Georges Wilson's last film was Mesrine: Public Enemy Number One.\n\nFrom 1963 to 1972 Georges Wilson was the director of the Théâtre national de Chaillot (formerly known as the Théâtre National Populaire).\n\nGeorges Wilson died in Rambouillet in 2010, aged 88, from undisclosed causes.\n\nSource: Article \"Georges Wilson\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1921-10-16",
        "deathday": "2010-02-03",
        "gender": 2,
        "homepage": null,
        "id": 7277,
        "imdb_id": "nm0933447",
        "known_for_department": "Acting",
        "name": "Georges Wilson",
        "place_of_birth": "Champigny-sur-Marne, Val-de-Marne, France",
        "popularity": 0.1155,
        "profile_path": "/hifU1QhRKnX44VyrRBHmPldTsRy.jpg"
    }
}