{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/o7JVhqMmrex1TPbmuxl8YXVlcfl.jpg",
                "genre_ids": [
                    28,
                    35,
                    14
                ],
                "id": 287947,
                "original_language": "en",
                "original_title": "Shazam!",
                "overview": "A boy is given the ability to become an adult superhero in times of need with a single magic word.",
                "popularity": 6.2104,
                "poster_path": "/xnopI5Xtky18MPhK40cZAGAOVeV.jpg",
                "release_date": "2019-03-29",
                "title": "Shazam!",
                "video": false,
                "vote_average": 6.988,
                "vote_count": 9869,
                "character": "Interviewee",
                "credit_id": "5e15d22dd8af670016c44736",
                "order": 82
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Pamela Matthews is Cree from the Sachigo Lake First Nation. She works as an Actor, Director, Filmmaker, Editor, Producer and Instructor with more than thirty years experience in the industry. She teaches Directing & Performance at Ryerson University and is a Professor (Film/Video/Sound Design) at Centennial College. Pam has been teaching Filmmaking since 2002 for The American Indian Film Institute's Tribal Touring Program in San Francisco where she has overseen the production of approximately fifty short films. Pam received her Masters Degree in Film Production from York University, completed undergraduate Film Studies at Ryerson University and graduated from Ryerson Theatre School in 1989. In 2003, she received the Gold Medal for Outstanding Academic Achievement from Ryerson University's Department of Film. Pam has numerous theatre credits as an Actor and Director. She has appeared in theatres across the country, including the National Arts Centre, Alberta Theatre Projects, Sunshine Theatre, Theatre Aquarius and O'Kaadenigan Wiingashk, and, in 2007, appeared in Margaret Atwood's new play, 'The Penelopiad' at the Royal Shakespeare Company in Stratford-Upon-Avon, England. As a theatre director, she has directed productions for Magnus Theatre, Factory Theatre, Native Earth Performing Arts, Canadian Stage, The Center for Indigenous Theatre, Woodland Cultural Centre, Buddies in Bad Times and Two Planks and a Passion. Pam studied directing at the Lincoln Center Theater in New York City and at the Royal National Theatre of Great Britain in London, England.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://pamelamatthews.workbooklive.com/",
        "id": 730171,
        "imdb_id": "nm0200490",
        "known_for_department": "Acting",
        "name": "Pamela Matthews",
        "place_of_birth": "Kenora, Ontario, Canada",
        "popularity": 0.6701,
        "profile_path": "/ryQ7uy47ojgVnVQSEyUkmyUQTVn.jpg"
    }
}