{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bbec0wDUaV8nQnQHC6Fb0fSYwNM.jpg",
                "genre_ids": [
                    53,
                    18
                ],
                "id": 982,
                "original_language": "en",
                "original_title": "The Manchurian Candidate",
                "overview": "Near the end of the Korean War, a platoon of U.S. soldiers is captured by communists and brainwashed. Following the war, the platoon is returned home, and Sergeant Raymond Shaw is lauded as a hero by the rest of his platoon. However, the platoon commander, Captain Bennett Marco, finds himself plagued by strange nightmares and soon races to uncover a terrible plot.",
                "popularity": 6.1899,
                "poster_path": "/2xQ856kd9hw6bB3OnusGyTvvkwB.jpg",
                "release_date": "1962-10-24",
                "title": "The Manchurian Candidate",
                "video": false,
                "vote_average": 7.527,
                "vote_count": 753,
                "character": "Eugenie Rose Chaney",
                "credit_id": "52fe4296c3a36847f802a3c7",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/uif5fUshJrXyyDzfpzp1DLw3N0S.jpg",
                "genre_ids": [
                    27,
                    53,
                    9648
                ],
                "id": 539,
                "original_language": "en",
                "original_title": "Psycho",
                "overview": "When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother.",
                "popularity": 8.4504,
                "poster_path": "/yz4QVqPx3h1hD1DfqqQkCq3rmxW.jpg",
                "release_date": "1960-06-22",
                "title": "Psycho",
                "video": false,
                "vote_average": 8.422,
                "vote_count": 10505,
                "character": "Marion Crane",
                "credit_id": "52fe424fc3a36847f8014217",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/ousBoWTm1CltjAGSYOELYP0jFFC.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 1480,
                "original_language": "en",
                "original_title": "Touch of Evil",
                "overview": "When a car bomb explodes on the American side of the U.S./Mexico border, Mexican drug enforcement agent Miguel Vargas begins his investigation, along with American police captain Hank Quinlan. When Vargas begins to suspect that Quinlan and his shady partner, Menzies, are planting evidence to frame an innocent man, his investigations into their possible corruption quickly put himself and his new bride, Susie, in jeopardy.",
                "popularity": 2.8972,
                "poster_path": "/1pvRgmfBaoMczIJBOi9gCOZ4FMC.jpg",
                "release_date": "1958-03-30",
                "title": "Touch of Evil",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 1511,
                "character": "Susan 'Susie' Vargas",
                "credit_id": "52fe42f8c3a36847f8030c91",
                "order": 1
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/6L1Co3uRWuoaqDxpWvGDvgXms7T.jpg",
                "genre_ids": [
                    18
                ],
                "id": 976,
                "original_language": "en",
                "original_title": "Sweet Smell of Success",
                "overview": "New York City newspaper writer J.J. Hunsecker holds considerable sway over public opinion with his Broadway column, but one thing that he can't control is his younger sister, Susan, who is in a relationship with aspiring jazz guitarist Steve Dallas. Hunsecker strongly disapproves of the romance and recruits publicist Sidney Falco to find a way to split the couple, no matter how ruthless the method.",
                "popularity": 5.3575,
                "poster_path": "/akzvV8JasNrgEl5iAP9K6zPHGJe.jpg",
                "release_date": "1957-07-04",
                "title": "Sweet Smell of Success",
                "video": false,
                "vote_average": 7.61,
                "vote_count": 539,
                "credit_id": "634686e971ffdf007a265925",
                "department": "Production",
                "job": "Executive Producer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jeanette Helen Morrison",
            "جنت لی"
        ],
        "biography": "Janet Leigh (born Jeanette Helen Morrison) was an American actress, singer, dancer, and author. Her career spanned over five decades. Raised in Stockton, California, by working-class parents, Leigh was discovered at 18 by actress Norma Shearer, who helped her secure a contract with Metro-Goldwyn-Mayer.\n\nLeigh appeared in radio programs before her first formal foray into acting, making her film debut in the drama The Romance of Rosy Ridge (1947). With MGM, she appeared in many films which spanned a wide variety of genres, which include the crime-drama Act of Violence (1948), the drama Little Women (1949), the comedy Angels in the Outfield (1951), the romance Scaramouche (1952) and the western drama The Naked Spur (1953). She played dramatic roles during the late 1950s, in such films as Safari (1956) and Orson Welles's film noir Touch of Evil (1958). With RKO Radio pictures she co-starred in the romantic comedy Holiday Affair (1949) with Robert Mitchum.\n\nLeigh achieved her biggest success starring as Marion Crane in Alfred Hitchcock's psychological thriller Psycho (1960). For her performance, Leigh won the Golden Globe Award for Best Supporting Actress and earned a nomination for the Academy Award for Best Supporting Actress. Intermittently, she continued to appear in films, including Bye Bye Birdie (1963), Harper (1966), Night of the Lepus (1972), and Boardwalk (1979). She made her Broadway debut in 1975 in a production of Murder Among Friends. She would also go on to appear in two horror films with her daughter, Jamie Lee Curtis: The Fog (1980) and Halloween H20: 20 Years Later (1998).\n\nIn addition to her work as an actress, Leigh also wrote four books between 1984 and 2002, two of which were novels. Leigh had two brief marriages as a teenager (one of which was annulled) before marrying actor Tony Curtis in 1951. The pair's highly publicized union ended in divorce in 1962, and after starring in The Manchurian Candidate that same year, Leigh remarried and scaled back her career. She died in October 2004 at age 77, following a year-long battle with vasculitis, an inflammation of the blood vessels.",
        "birthday": "1927-07-06",
        "deathday": "2004-10-03",
        "gender": 1,
        "homepage": null,
        "id": 7302,
        "imdb_id": "nm0001463",
        "known_for_department": "Acting",
        "name": "Janet Leigh",
        "place_of_birth": " Merced, California, USA",
        "popularity": 1.0292,
        "profile_path": "/2dv9IqJEx31RSoH7xAHlJZXF5uB.jpg"
    }
}