{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ziC23LkMYj8gToQQYQGWSGJCLNF.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 82690,
                "original_language": "en",
                "original_title": "Wreck-It Ralph",
                "overview": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
                "popularity": 15.0327,
                "poster_path": "/zWoIgZ7mgmPkaZjG0102BSKFIqQ.jpg",
                "release_date": "2012-11-01",
                "title": "Wreck-It Ralph",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 12695,
                "character": "Roy (voice)",
                "credit_id": "52fe486b9251416c9108bd0d",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/2sE6hrwfn9IV7eDlMvpIb9q1EWy.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749
                ],
                "id": 114150,
                "original_language": "en",
                "original_title": "Pitch Perfect",
                "overview": "College student Beca knows she does not want to be part of a clique, but that's exactly where she finds herself after arriving at her new school. Thrust in among mean gals, nice gals and just plain weird gals, Beca finds that the only thing they have in common is how well they sing together. She takes the women of the group out of their comfort zone of traditional arrangements and into a world of amazing harmonic combinations in a fight to the top of college music competitions.",
                "popularity": 5.2945,
                "poster_path": "/gsFoJk9g8W3zgaipRrrURk7LbiF.jpg",
                "release_date": "2012-09-28",
                "title": "Pitch Perfect",
                "video": false,
                "vote_average": 7.28,
                "vote_count": 6699,
                "character": "Jesse Swanson",
                "credit_id": "52fe4b46c3a36847f81fb81f",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Skylar Lipstein"
        ],
        "biography": "Skylar Astin Lipstein (born September 23, 1987) is an American actor and singer. He's best known for portraying Jesse Swanson in the musical films Pitch Perfect (2012) and Pitch Perfect 2 (2015).\n\nHe was in the original cast of the Broadway musical Spring Awakening, and has since appeared in films such as Hamlet 2 (2008), Taking Woodstock (2009), Cavemen (2013), and 21 & Over (2013).\n\nHe played the role of Greg Serrano (originally played by Santino Fontana) on the last season of Crazy Ex-Girlfriend; and the role of Max in the musical dramedy Zoey's Extraordinary Playlist (2020). He co-stars as the title character in the dramedy So Help Me Todd (2022).",
        "birthday": "1987-09-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 73128,
        "imdb_id": "nm2799457",
        "known_for_department": "Acting",
        "name": "Skylar Astin",
        "place_of_birth": "New York, USA",
        "popularity": 0.8135,
        "profile_path": "/dx6xbrerLNKHbUSOdTI68h7qrE3.jpg"
    }
}