{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1ZeURMZP7GdKWhwK142IuGqGUZH.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    878,
                    14
                ],
                "id": 530,
                "original_language": "en",
                "original_title": "A Grand Day Out",
                "overview": "Wallace and Gromit have run out of cheese, and this provides an excellent excuse for the duo to take their holiday to the moon, where, as everyone knows, there is ample cheese.  Preserved by the Academy Film Archive.",
                "popularity": 3.9087,
                "poster_path": "/h5e3r12VwfUotN36fBr1DNeCD4n.jpg",
                "release_date": "1990-05-18",
                "title": "A Grand Day Out",
                "video": false,
                "vote_average": 7.487,
                "vote_count": 947,
                "character": "Wallace (voice)",
                "credit_id": "52fe424ec3a36847f8013dcb",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/9AbessEz2YKjmPtYKATDeYRW3Px.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751
                ],
                "id": 531,
                "original_language": "en",
                "original_title": "The Wrong Trousers",
                "overview": "Wallace rents out Gromit's former bedroom to a penguin, who takes up an interest in the techno pants created by Wallace. However, Gromit later learns that the penguin is a wanted criminal.  Preserved by the Academy Film Archive.",
                "popularity": 3.1271,
                "poster_path": "/mV8SDTjkxrDxu0a0egvFz1lRPU7.jpg",
                "release_date": "1993-12-17",
                "title": "The Wrong Trousers",
                "video": false,
                "vote_average": 7.806,
                "vote_count": 1090,
                "character": "Wallace (voice)",
                "credit_id": "52fe424ec3a36847f8013e1d",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/3mbuK1tZ981G9I2Niu522s6y7hG.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35
                ],
                "id": 532,
                "original_language": "en",
                "original_title": "A Close Shave",
                "overview": "Wallace's whirlwind romance with the proprietor of the local wool shop puts his head in a spin, and Gromit is framed for sheep-rustling in a fiendish criminal plot.",
                "popularity": 2.4107,
                "poster_path": "/qdIR27trLyrlJ5nmkbcG3Bomah6.jpg",
                "release_date": "1996-03-07",
                "title": "A Close Shave",
                "video": false,
                "vote_average": 7.574,
                "vote_count": 878,
                "character": "Wallace (voice)",
                "credit_id": "52fe424ec3a36847f8013e63",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/Aqvtwgu1G4eEwIf8nSIxiCN5ewC.jpg",
                "genre_ids": [
                    12,
                    16,
                    35,
                    10751
                ],
                "id": 533,
                "original_language": "en",
                "original_title": "Wallace & Gromit: The Curse of the Were-Rabbit",
                "overview": "Cheese-loving eccentric Wallace and his cunning canine pal, Gromit, investigate a mystery in Nick Park's animated adventure, in which the lovable inventor and his intrepid pup run a business ridding the town of garden pests. Using only humane methods that turn their home into a halfway house for evicted vermin, the pair stumble upon a mystery involving a voracious vegetarian monster that threatens to ruin the annual veggie-growing contest.",
                "popularity": 5.8598,
                "poster_path": "/cMQ2lNd7sBe6PCf6zF5QxrKzbRG.jpg",
                "release_date": "2005-09-15",
                "title": "Wallace & Gromit: The Curse of the Were-Rabbit",
                "video": false,
                "vote_average": 7.114,
                "vote_count": 2934,
                "character": "Wallace / Hutch (voice)",
                "credit_id": "52fe424ec3a36847f8013f27",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/p55hZFMTWHl2j6xrPKp1qA9kF1I.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35
                ],
                "id": 14447,
                "original_language": "en",
                "original_title": "A Matter of Loaf and Death",
                "overview": "Wallace and Gromit open a bakery, accidentally getting tied up with a murder mystery in the process. But when Wallace falls in love, Gromit is left to solve the case by himself.",
                "popularity": 2.784,
                "poster_path": "/egKYj3L9HMsHjHXk3tYMU0O87g8.jpg",
                "release_date": "2008-12-26",
                "title": "A Matter of Loaf and Death",
                "video": false,
                "vote_average": 7.347,
                "vote_count": 567,
                "character": "Wallace (voice)",
                "credit_id": "52fe45f59251416c750684ab",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/yhfHeIsR5Ki02b5SqBuLqAsLDCk.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648
                ],
                "id": 3009,
                "original_language": "en",
                "original_title": "Le Procès",
                "overview": "The surreal tale of an unassuming man who is accused of a never-specified crime and shambles through bizarre encounters to escape this nightmare.",
                "popularity": 1.3546,
                "poster_path": "/2o1oe54a4doiwB4uJq9Kx1RHal0.jpg",
                "release_date": "1962-08-25",
                "title": "The Trial",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 525,
                "character": "Uncle Max (uncredited)",
                "credit_id": "665618192c7537f5811cc04d",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Peter John Sallis",
            "Pete Sallis",
            "ピーター・サリス",
            "Pītā Sarisu",
            "彼得·薩里斯",
            "Pedro Sallis",
            "Pierre Sallis",
            "Pietro Sallis",
            "بيتر ساليس"
        ],
        "biography": "Peter Sallis, OBE (February 1, 1921 – June 2, 2017) was an English actor and entertainer, well-known for his work on British television. Although he was born and brought up in London, his two most notable roles required him to adopt the accents and mannerisms of a Northerner.\n\nPeter John Sallis was born on 1 February 1921 in Twickenham, Middlesex (now in Greater London). He was the only child of bank manager Harry Sallis (1889–1964) and Dorothy Amea Frances (née Barnard; 1891–1975).\n\nHis first big television role came in 1958 where he played the role of Samuel Pepys in the BBC serial The Diary of Samuel Pepys.\n\nSallis was best known for his role as the main character Norman Clegg in the long-running British TV comedy Last of the Summer Wine, set in a Yorkshire town. He was the longest serving cast member, appearing in all 295 episodes, and by the end of the show's run was the only one surviving from the programme's first episode in 1973. He also appeared in all 13 of the episodes of the prequel series First of the Summer Wine as Norman Clegg's father. He was also famous for providing the voice of Wallace in the Wallace and Gromit films, again using a northern accent. Sallis also starred alongside Richard Pearson, Michael Horden and David Jason in Cosgrove Hall's The Wind in the Willows (1984-1990) as the voice of Rat/Ratty.\n\nIn 1975 he appeared in the BBC Wales, TV play The Snowdropper as Spicer, a snowdropper that where's Overalls/Dungarees. In 1976 he played Mr. Gudgin/Arnold Gudgin in the children's series The Ghosts of Motley Hall (1976–78). The character Gudgin Sallis played in the series was a estate agent who did not want to see the hall fall into the wrong hands.\n\nSallis also appeared in the TV series Yanks Go Home (1976-1977) where he played Randell Todd in four episodes of the series. Around the same period, he starred alongside Northern comic actor David Roper in the ITV sitcom Leave it to Charlie (1978-1980) as Charlie's pessimistic boss. The programme ran for a total of 26 episodes over four series, ending in 1980. He also played the part of the ghost-hunter Milton Guest in the children's paranormal drama TV series The Clifton House Mystery (1978).\n\nSallis was married to Elaine Usher in 1957 until they eventually divorced in 1965. Sallis and Usher eventually reconciled and decided to come living together until 1999. Sallis continued to  remain close to Usher until eventually she died on 1 January 2014 at the age of 81. They both had one son named Crispian Sallis who was born on 24 June 1959 who later became a British art director and set decorator. Sallis and Usher also had two grandchildren from Crispian. Sallis also lived with three small cats in a small cottage.\n\nDescription above from the Wikipedia article Peter Sallis, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1921-02-01",
        "deathday": "2017-06-02",
        "gender": 2,
        "homepage": "https://www.palatinate.org.uk/obituary-peter-sallis/",
        "id": 7317,
        "imdb_id": "nm0758608",
        "known_for_department": "Acting",
        "name": "Peter Sallis",
        "place_of_birth": "Twickenham, England, UK",
        "popularity": 0.5186,
        "profile_path": "/tB7r7LxdNEn7RfRs837V3REfgF4.jpg"
    }
}