{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tbF57JNof8j3X14GhZtqafkrziU.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 313106,
                "original_language": "en",
                "original_title": "Doctor Who: The Day of the Doctor",
                "overview": "In 2013, something terrible is awakening in London's National Gallery; in 1562, a murderous plot is afoot in Elizabethan England; and somewhere in space an ancient battle reaches its devastating conclusion. All of reality is at stake as the Doctor's own dangerous past comes back to haunt him.",
                "popularity": 1.2786,
                "poster_path": "/6c0CjymaupC5xerJCemuaSV4CLj.jpg",
                "release_date": "2013-11-23",
                "title": "Doctor Who: The Day of the Doctor",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 761,
                "character": "The Doctor (1) (archive footage)",
                "credit_id": "55266f26c3a3687e110043e6",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Billy Hartnell ",
            " Bill Hartnell",
            "Уильям Хартнелл",
            "William Henry Hartnell"
        ],
        "biography": "William Henry Hartnell (8 January 1908 – 23 April 1975), also known as Billy Hartnell or Bill Hartnell, was an English actor. Hartnell played the first incarnation of the Doctor in Doctor Who, from 1963 to 1966. He was also known for his roles as Sergeant Grimshaw, the title character of the first Carry On film, Carry On Sergeant in 1958, and Company Sergeant Major Percy Bullimore in the sitcom The Army Game from 1957 until 1958, and again in 1960.\n\nHartnell entered the theatre in 1925 working under Frank Benson as a general stagehand. He appeared in numerous Shakespearian plays, including The Merchant of Venice (1926), Julius Caesar (1926), As You Like It (1926), Hamlet (1926), The Tempest (1926) and Macbeth (1926). He also appeared in She Stoops to Conquer (1926), School for Scandal (1926) and Good Morning, Bill (1927), before performing in Miss Elizabeth's Prisoner (1928). This play was written by Robert Neilson Stephens and E. Lyall Swete. It featured the actress Heather McIntyre, whom he married during the following year. His first of more than sixty film appearances was in Say It With Music (1932).\n\nHartnell continued to play comic characters until he was cast in the robust role of Sergeant Ned Fletcher in The Way Ahead (1944). From then on his career was defined by playing mainly policemen, soldiers, and thugs.\n\nHartnell's performance in This Sporting Life was noted by Verity Lambert, the producer who was setting up a new science-fiction television series for the BBC entitled Doctor Who; and, mainly on the strength of that performance, Lambert offered him the title role.",
        "birthday": "1908-01-08",
        "deathday": "1975-04-23",
        "gender": 2,
        "homepage": null,
        "id": 73245,
        "imdb_id": "nm0367156",
        "known_for_department": "Acting",
        "name": "William Hartnell",
        "place_of_birth": "Saint Pancras, London, England, UK",
        "popularity": 0.4296,
        "profile_path": "/dyXEOTXAbby0ifgnpDFTsNG8qTv.jpg"
    }
}