{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 7.3665,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Ray",
                "credit_id": "55725a6bc3a3683920002db8",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Arnold Stang (September 28, 1918 – December 20, 2009) was an American comic actor who played a small and bespectacled, yet brash and knowing big-city type. One of the most arresting facts about Arnold Stang is that he is perfectly happy with the role of Gerard on NBC's Henry Morgan Show. Unlike many actors and comedians who have climbed to fame with one particular role, Stang isn't afraid of becoming \"typed.\" The small, economy-size, Arnold twenty-eight-year-old comic, who has been likened to a near-sighted chipmunk dragged out of the rain, has dispensed laughs on shows with many top comedians; yet every time he appears on a new television show, he points out with dismay, both the critics and the public \"suddenly recognize me as 'fresh new talent.'  Stang's career in show business began at a radio audition when he was eleven. Wearing heavy horn-rimmed eyeglasses and speaking in a voice somewhere between a quaver and a croak, Arnold began a serious recitation for the directors. They could not take him seriously. When they had recovered from spasms of laughter, they signed him up on the spot for a comic role, a \"type\" of role which Stang has been handling ever since.",
        "birthday": "1918-09-28",
        "deathday": "2009-12-20",
        "gender": 2,
        "homepage": null,
        "id": 7332,
        "imdb_id": "nm0822205",
        "known_for_department": "Acting",
        "name": "Arnold Stang",
        "place_of_birth": "Manhattan, New York City, New York, USA",
        "popularity": 0.8315,
        "profile_path": "/d6JMdwwrMZeVy2uV8ZMZIfbK6tS.jpg"
    }
}