{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f133nWlU6yUkZqqwcCXCbTEJWHr.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 87,
                "original_language": "en",
                "original_title": "Indiana Jones and the Temple of Doom",
                "overview": "After arriving in India, Indiana Jones is asked by a desperate village to find a mystical stone. He agrees – and stumbles upon a secret cult plotting a terrible plan in the catacombs of an ancient palace.",
                "popularity": 5.7791,
                "poster_path": "/gpdVNUaa4LhRMLfJOPj1AZdhAZ3.jpg",
                "release_date": "1984-05-23",
                "title": "Indiana Jones and the Temple of Doom",
                "video": false,
                "vote_average": 7.302,
                "vote_count": 9706,
                "character": "Eel Eater",
                "credit_id": "5497f1319251416e2b007e9b",
                "order": 25
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/yz8QL8WFD8yj0LA5zIlNOgcHvZK.jpg",
                "genre_ids": [
                    12,
                    35,
                    878
                ],
                "id": 105,
                "original_language": "en",
                "original_title": "Back to the Future",
                "overview": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
                "popularity": 11.9872,
                "poster_path": "/vN5B5WgYscRGcQpVhHl6p9DDTP0.jpg",
                "release_date": "1985-07-03",
                "title": "Back to the Future",
                "video": false,
                "vote_average": 8.321,
                "vote_count": 20883,
                "credit_id": "56af975992514101f90003d8",
                "department": "Crew",
                "job": "Post Production Supervisor"
            },
            {
                "adult": false,
                "backdrop_path": "/12fvZHskx57kQfNEUXJ3v0flWYQ.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 89,
                "original_language": "en",
                "original_title": "Indiana Jones and the Last Crusade",
                "overview": "In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!",
                "popularity": 6.6566,
                "poster_path": "/sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg",
                "release_date": "1989-05-24",
                "title": "Indiana Jones and the Last Crusade",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 10616,
                "credit_id": "6381b76b2e06970292e31e61",
                "department": "Production",
                "job": "Associate Producer"
            },
            {
                "adult": false,
                "backdrop_path": "/5qsyqA7FeYRymBmNbPBqBgqWPO4.jpg",
                "genre_ids": [
                    12,
                    35,
                    10751
                ],
                "id": 9340,
                "original_language": "en",
                "original_title": "The Goonies",
                "overview": "Young teen Mikey Walsh and his friends set off on a quest to find Pirate One-Eyed Willie's treasure in hopes of saving their homes from demolition.",
                "popularity": 5.523,
                "poster_path": "/eBU7gCjTCj9n2LTxvCSIXXOvHkD.jpg",
                "release_date": "1985-06-07",
                "title": "The Goonies",
                "video": false,
                "vote_average": 7.514,
                "vote_count": 5947,
                "credit_id": "5ac136dd0e0a264a4e04fa93",
                "department": "Crew",
                "job": "Post Production Supervisor"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Arthur Repola",
            "Art Repola"
        ],
        "biography": "Art Repola is the Senior Vice President of Visual Effects and Production for the Walt Disney Motion Pictures Group. Repola is responsible for all aspects of Visual Effects production for the studio's various banners, including Disney, Touchstone and Hollywood Pictures. In this role he has managed the visual effects on more than 80 Disney live action films, including \"Pearl Harbor,\" \"Armageddon,\" \"Inspector Gadget\" and \"Mighty Joe Young.\" He is also the Executive in Charge of Production for the company's Large Format film business. He was previously responsible for overseeing the operation of Dream Quest Images, the Academy Award®-winning visual effects facility, which was acquired in 1996 by the Walt Disney Studios. Under Repola's leadership, Disney Studios has received three Academy Award® nominations for Best Visual Effects.\n\nRepola had previously worked at the Walt Disney Studios where he served as Vice President of Post Production for Hollywood Pictures. Following that, he co-wrote and produced a Special Venue-High-Definition, Interactive film for the Sony Corporation. This educational film details Sound and Picture technologies through the use of live-action, computer graphics and traditional animation. He went on to produce a television pilot, and also served as the Associate Producer on the 1995 fantasy film, \"The Indian in the Cupboard.\" Before rejoining Disney, he served as Vice President of Film and Video Production for the Universal Theme Parks. There his credits included Executive Producer of the innovative 12-minute, 3D film featured in the theme park attraction, \"T2 -- 3D: Battle Across Time,\" which was directed by James Cameron and stars Arnold Schwarzenegger. Repola began his professional career in the International Film department at 20th Century Fox. After working on the foreign versions of George Lucas' \"Star Wars,\" he joined Lucasfilm's Marin County-based Industrial Light and Magic (ILM) as a visual effects editor, eventually being named Visual Effects Producer. During his stay at ILM, he contributed to such ground-breaking projects as \"The Empire Strikes Back,\" \"Raiders of the Lost Ark,\" \"Indiana Jones and the Temple of Doom,\" \"Dragonslayer\" and \"Return of the Jedi.\"\n\nAfter moving back to Los Angeles, Repola became a member of the team at Boss Films, which was responsible for the visual effects on \"Ghostbusters\" and \"2010\". He then joined Steven Spielberg's Amblin Entertainment as the Executive in Charge of Post Production, supervising the post activities for such projects as \"Back to the Future,\" \"The Color Purple\" and \"Empire of the Sun,\" among others. He also served as the Associate Producer for Lucasfilm's \"Indiana Jones and the Last Crusade.\"\n\nRepola is a member of the Academy of Motion Picture Arts and Sciences and serves on the Board of Directors of the Visual Effects Society.\n\n- IMDb Mini Biography",
        "birthday": "1953-08-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 735,
        "imdb_id": "nm0720085",
        "known_for_department": "Production",
        "name": "Arthur F. Repola",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.8822,
        "profile_path": null
    }
}