{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2eznGndOi8s9CGReAvcQ8PEULwm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 5176,
                "original_language": "en",
                "original_title": "3:10 to Yuma",
                "overview": "In Arizona in the late 1800s, infamous outlaw Ben Wade and his vicious gang of thieves and murderers have plagued the Southern Railroad. When Wade is captured, Civil War veteran Dan Evans, struggling to survive on his drought-plagued ranch, volunteers to deliver him alive to the \"3:10 to Yuma\", a train that will take the killer to trial.",
                "popularity": 4.4463,
                "poster_path": "/voMB69AsLnPNmtfbrBl0lbeFKDH.jpg",
                "release_date": "2007-09-06",
                "title": "3:10 to Yuma",
                "video": false,
                "vote_average": 7.221,
                "vote_count": 3798,
                "character": "Darden",
                "credit_id": "52fe43fac3a36847f807b799",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/c9RwZm40IizTKwWPO933SyDufHS.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 11975,
                "original_language": "en",
                "original_title": "The Rainmaker",
                "overview": "When Rudy Baylor, a young attorney with no clients, goes to work for a seedy ambulance chaser, he wants to help the parents of a terminally ill boy in their suit against an insurance company. But to take on corporate America, Rudy and a scrappy paralegal must open their own law firm.",
                "popularity": 6.6625,
                "poster_path": "/twLGHXPjQtS8UyVGp5GXmhJiTM7.jpg",
                "release_date": "1997-11-18",
                "title": "The Rainmaker",
                "video": false,
                "vote_average": 7.022,
                "vote_count": 1378,
                "character": "Donny Ray Black",
                "credit_id": "52fe44ae9251416c7503d379",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/vQGo5VjJcHxpzIa8lMBFzpAth1w.jpg",
                "genre_ids": [
                    53,
                    9648,
                    878
                ],
                "id": 51876,
                "original_language": "en",
                "original_title": "Limitless",
                "overview": "The life of an unsuccessful writer is transformed by a top-secret 'smart drug' that allows him to use 100% of his brain and become a perfect version of himself. His enhanced abilities soon attract shadowy forces that threaten his new life.",
                "popularity": 5.9439,
                "poster_path": "/un0a2U7KLjMH77N6EhqYh7ZOlVx.jpg",
                "release_date": "2011-03-17",
                "title": "Limitless",
                "video": false,
                "vote_average": 7.192,
                "vote_count": 11021,
                "character": "Vernon",
                "credit_id": "52fe4809c3a36847f81552dd",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJohnny Whitworth (born October 31, 1975) is an American actor.\n\nHis early years were spent in his birth place of Charleston, South Carolina, with his mother. When he grew older, he moved to Dallas, Texas with his father (his parents are divorced). At age 15/16 in 1991, he won the 1st Young and Modern Man Contest. Shortly after, he moved to Los Angeles with his mother and at the age of 18 started his acting career with a guest appearance on Party of Five in 1994. His debut in movies was with Bye Bye Love in 1995. That same year, he played A.J. in the film Empire Records. The movie became a cult classic.\n\nHe quit acting after his first few movies, but then made a comeback in 1997s The Rainmaker. He currently has a recurring role on the CBS crime drama CSI: Miami, where he plays bad-boy Detective Jake Berkeley, a love interest of Calleigh Duquesne. The storyline is swiftly making Whitworth's character a controversial one, as his competition for Calleigh is long-time CSI agent Eric Delko. Since the end of Season 5 and throughout Season 6, Jake was no longer an ATF agent but a Miami-Dade homicide detective working with the CSIs. Season 7 sees Whitworth return in the first episode, with a promise of more to come.\n\nIn 2007, he appeared in the film 3:10 to Yuma, starring Christian Bale and Russell Crowe, and in 2009, co-starred in Gamer with Gerard Butler.\n\nHe appeared in the films Locked in, Valley of the Sun, and Neil Burger's Limitless. He also will be playing the villain Blackout in the 2012 sequel and reboot Ghost Rider: Spirit of Vengeance.\n\nDescription above from the Wikipedia article Johnny Whitworth, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1975-10-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 73589,
        "imdb_id": "nm0926615",
        "known_for_department": "Acting",
        "name": "Johnny Whitworth",
        "place_of_birth": "Charleston, South Carolina, USA",
        "popularity": 0.5103,
        "profile_path": "/v8pUdmBfRp4oQuG7PAAXtsvuomk.jpg"
    }
}