{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bQObbnj0TY2Q1c55w78m1AN6VNX.jpg",
                "genre_ids": [
                    28,
                    80,
                    37,
                    35,
                    18
                ],
                "id": 52629,
                "original_language": "es",
                "original_title": "El Infierno",
                "overview": "After being deported back to Mexico, a man has no choice but to join the vicious drug cartel that has corrupted his hometown in order to survive.",
                "popularity": 8.4468,
                "poster_path": "/vry7NyLM6I0fL53H2KxCX4uAz5H.jpg",
                "release_date": "2010-09-03",
                "title": "El Infierno",
                "video": false,
                "vote_average": 7.882,
                "vote_count": 718,
                "character": "Don José Reyes",
                "credit_id": "52fe4838c3a36847f815d09b",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ernesto Gómez Cruz (November 8, 1933 - April 6, 2024) was a prolific Mexican actor with more than 154 films.\n\nIn his beginnings, he began as a photographer in his native Veracruz, where he met a friend who invited him to study dramatic art. In his notes from yesterday, he mentions that he wanted to be a singer, but his shyness and lack of preparation led him to abandon this path. He has more than two hundred films to his credit. He has worked with great directors such as Miguel Littin, Felipe Cazals, Arturo Ripstein and Luis Estrada; He has also worked with actors of the stature of Damián Alcázar, Ignacio López Tarso and Pedro Armendáriz Jr., among others.\n\nHis long artistic career has allowed him to be deserving and awarded with different recognitions; one of the most recent was in 2014, at the 56th Ariel award, where he was awarded the Ariel de Oro. He is the second Mexican actor with the most Ariel awards and nominations.\n\nIn 2018 the Academy of Motion Picture Arts and Sciences officially invited him to be a special part of its new members.",
        "birthday": "1933-11-08",
        "deathday": "2024-04-06",
        "gender": 2,
        "homepage": null,
        "id": 7368,
        "imdb_id": "nm0350884",
        "known_for_department": "Acting",
        "name": "Ernesto Gómez Cruz",
        "place_of_birth": "Puerto de Veracruz, Mexico",
        "popularity": 0.0947,
        "profile_path": "/rtDS8sZw9PniGdDPW12QKsUcNSb.jpg"
    }
}