{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/12fvZHskx57kQfNEUXJ3v0flWYQ.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 89,
                "original_language": "en",
                "original_title": "Indiana Jones and the Last Crusade",
                "overview": "In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!",
                "popularity": 6.9797,
                "poster_path": "/sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg",
                "release_date": "1989-05-24",
                "title": "Indiana Jones and the Last Crusade",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 10606,
                "character": "Elsa",
                "credit_id": "52fe4216c3a36847f8002e29",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/77GGKq6Ixq6ZiqBM6XcPZgQmiN2.jpg",
                "genre_ids": [
                    28,
                    12,
                    18
                ],
                "id": 579974,
                "original_language": "te",
                "original_title": "రౌద్రం రణం రుధిరం",
                "overview": "A fictional history of two legendary revolutionaries' journey away from home before they began fighting for their country in the 1920s.",
                "popularity": 7.3164,
                "poster_path": "/nEufeZlyAOLqO2brrs0yeF1lgXO.jpg",
                "release_date": "2022-03-24",
                "title": "RRR",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 1448,
                "character": "Cassandra Buxton",
                "credit_id": "5dd535772634620016b76e31",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "آلیسون دودی"
        ],
        "biography": "Alison Doody (born November 11, 1966) is an Irish actress and model. She is the youngest of three children. She was educated in a convent, where she gained a passion for the arts. She later studied at the National College of Fine Arts in Dublin, but left because she lacked the motivation and thought she would take a year off to think it out. Meanwhile, while sitting in a café with friends, she was approached by a still photographer who asked her if she would be interested to model. Thinking she could use the pocket money, she said yes. Modeling proved to be both fun and lucrative, and very soon she did it professionally. Her modeling contracts led to commercial work, which would take her around the world. One day, a casting director saw her work and suggested she try acting instead. She was sent to London at age 19, where she quickly won an audition to appear in the new James Bond film, A View to a Kill (1985). She so loved acting that she pursued a career in that direction. After her first film, she shot a few TV dramas in London and in Dublin, but her big break came when she was cast as Austrian seductress Dr. Elsa Schneider in Indiana Jones and the Last Crusade (1989). Apparently she made a huge impression on Steven Spielberg and George Lucas, who loved her great sense of humor and her Grace Kelly looks. After Indiana Jones, which introduced her to Hollywood and to the United States, she was chosen to replace Cybill Shepherd as spokeswoman for L'Oréal. After that she shot a few B-movies in the United States, but at one point felt she missed Ireland too much, so she went back to Dublin. In 1994, she put her career on hold to spend more time with media heir Gavin O'Reilly, whom she had been dating for two years. In 1996 they married, and later had two children. In 2002, she was asked to cameo in the 'Michael Caine (I)_ comedy Les acteurs (2003), and there she regained a lust for the movie industry. The following summer, she shot Allan Quatermain et la pierre des ancêtres (2004) with co-starPatrick Swayze, and it's then that the whole ball started rolling again. In 2005, she and her husband divorced and she decided to re-launch her stalled career, but she quickly realized how difficult it was to break into this kind of business for a second time, especially after ten years away from the camera. Recently she appeared in the short film Benjamin's Struggle (2005), directed by newcomer James Breese, and played a role in the well-known British series Meurtres en sommeil (2000). In a recent interview, she said she was thrilled to be acting again, but added that she wasn't willing to accept anything for the sake of working. She is determined to find the right part, but she also wants to do different things: \"I'm fed up playing the nasty Nazi. I'd like to do something quite extreme.\"",
        "birthday": "1966-11-11",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.alisondoody.com/",
        "id": 739,
        "imdb_id": "nm0233145",
        "known_for_department": "Acting",
        "name": "Alison Doody",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.6589,
        "profile_path": "/m6LFIXUtjnyV2HTeITWLvNePkVX.jpg"
    }
}