{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kVsFGeyGwK7gCY72sFjczY4dmDs.jpg",
                "genre_ids": [
                    18
                ],
                "id": 809140,
                "original_language": "en",
                "original_title": "Father Stu",
                "overview": "The true-life story of boxer-turned-priest. When an injury ends his amateur boxing career, Stuart Long moves to Los Angeles to find money and fame. While scraping by as a supermarket clerk, he meets Carmen, a Sunday school teacher who seems immune to his bad-boy charm. Determined to win her over, the longtime agnostic starts going to church to impress her. However, a motorcycle accident leaves him wondering if he can use his second chance to help others, leading to the surprising realization that he's meant to be a Catholic priest.",
                "popularity": 2.4068,
                "poster_path": "/pLAeWgqXbTeJ2gQtNvRmdIncYsk.jpg",
                "release_date": "2022-04-13",
                "title": "Father Stu",
                "video": false,
                "vote_average": 7.158,
                "vote_count": 665,
                "character": "Medieval Set Assistant Director",
                "credit_id": "62a66d05175051006644e9b5",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Steven Robert Olson",
            "Steven Olson"
        ],
        "biography": "Steve is an actor, writer and improviser. He has trained extensively in acting with top coaches like Lesly Kahn, Stan Kirsch, Andrew Wood, Jamie Renee Smith, Margie Haber, Scott Sedita and Annie Grindlay, and improvisation with The Groundlings and Acme Comedy Theater.\n\nTV Credits include Hacks (HBO Max), NCIS (CBS), The Goldbergs (ABC), New Girl (FOX), Dave (FX), General Hospital (ABC), For All Mankind (Apple TV), Days Of Our Lives (NBC), Those Who Can't (TruTV), Bookie (HBO Max), The Company You Keep (ABC), 'Ving Break (Comedy Central), and TV Movies for Lifetime, Hallmark and SyFy. Films include Father Stu (SONY/opposite Mark Wahlberg), Fishbowl California (HULU/opposite Kate Flannery of The Office), and Single (SXSW). He plays a major supporting role in the upcoming Apple TV+ series Lucky, produced by Reese Witherspoon.\n\nHas been drumming since the age of 13.",
        "birthday": "1989-12-04",
        "deathday": null,
        "gender": 2,
        "homepage": "http://imdb.me/steveolson",
        "id": 739624,
        "imdb_id": "nm1726049",
        "known_for_department": "Acting",
        "name": "Steve Olson",
        "place_of_birth": "USA",
        "popularity": 0.1112,
        "profile_path": "/6a5DkKXmUlB5HsnB6nyZjQv9J6I.jpg"
    }
}