{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1GZVHgJUcVyytQRJ533GpMavAcL.jpg",
                "genre_ids": [
                    18
                ],
                "id": 7984,
                "original_language": "en",
                "original_title": "In the Name of the Father",
                "overview": "A small-time Belfast thief, Gerry Conlon, is wrongly convicted of an IRA bombing in London, along with his father and friends, and spends 15 years in prison fighting to prove his innocence.",
                "popularity": 2.6913,
                "poster_path": "/3NcIkKxaO2SmRVsG1v50XhtmL0f.jpg",
                "release_date": "1993-12-12",
                "title": "In the Name of the Father",
                "video": false,
                "vote_average": 7.896,
                "vote_count": 1845,
                "character": "Policewoman",
                "credit_id": "56081740925141290e001253",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nTina Kellegher is an Irish actress, born in Dublin in 1967. She is best known for her role as Niamh Quigley in BBC television series Ballykissangel. She is also a well-known voice on BBC Radio 4, having played policewoman Tina Mahon in the first four series of Baldi. She is married to Gordon Wycherley, location manager on, among other projects, Ballykissangel. They have two sons, Michael, who was born in 2003 and Brian who was born in 2007. Her brother-in-law is fellow Ballykissangel star Don Wycherley\n\nShe also starred opposite Colm Meaney (The Commitments, Star Trek: Deep Space Nine) as Sharon Curley in Stephen Frears' 1993 film, The Snapper, as a young woman from a working class Dublin family dealing with an unintended pregnancy.\n\nTina is currently based in Mullingar, County Westmeath where she is a member of the North Westmeath Hospice committee.\n\nDescription above from the Wikipedia article Tina Kellegher,licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 74018,
        "imdb_id": "nm0445530",
        "known_for_department": "Acting",
        "name": "Tina Kellegher",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.1671,
        "profile_path": "/jnGgWXon1cAITuuoK9JJLlMARdV.jpg"
    }
}