{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nvxrQQspxmSblCYDtvDAbVFX8Jt.jpg",
                "genre_ids": [
                    35,
                    878
                ],
                "id": 646380,
                "original_language": "en",
                "original_title": "Don't Look Up",
                "overview": "Two astronomers go on a media tour to warn humankind of a planet-killing comet hurtling toward Earth. The response from a distracted world: Meh.",
                "popularity": 8.1404,
                "poster_path": "/th4E1yqsE8DGpAseLiUrI60Hf8V.jpg",
                "release_date": "2021-12-08",
                "title": "Don't Look Up",
                "video": false,
                "vote_average": 7.068,
                "vote_count": 8782,
                "character": "Sarah Benterman",
                "credit_id": "61c9e7f581a7fc00917071c5",
                "order": 54
            },
            {
                "adult": false,
                "backdrop_path": "/ziC23LkMYj8gToQQYQGWSGJCLNF.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 82690,
                "original_language": "en",
                "original_title": "Wreck-It Ralph",
                "overview": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
                "popularity": 10.864,
                "poster_path": "/zWoIgZ7mgmPkaZjG0102BSKFIqQ.jpg",
                "release_date": "2012-11-01",
                "title": "Wreck-It Ralph",
                "video": false,
                "vote_average": 7.349,
                "vote_count": 12694,
                "character": "Vanellope von Schweetz (voice)",
                "credit_id": "52fe486a9251416c9108bcdd",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/sYnrdolxonyMucMezj8PMVBRlVr.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 382614,
                "original_language": "en",
                "original_title": "The Book of Henry",
                "overview": "Susan, a single mother of two, works as a waitress in a small town. Her son, Henry, is an 11-year-old genius who not only manages the family finances but acts as emotional support for his mother and younger brother. When Henry discovers that the girl next door has a terrible secret, he implores Susan to take matters into her own hands.",
                "popularity": 4.5355,
                "poster_path": "/suLFg4UjvM5BoDipg2Wu3gZ802T.jpg",
                "release_date": "2017-06-16",
                "title": "The Book of Henry",
                "video": false,
                "vote_average": 7.51,
                "vote_count": 1317,
                "character": "Sheila",
                "credit_id": "56c004b4c3a36817ef00ae2d",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/iv1ajZACUGHn4JztG9Z8yvbcmic.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 1584,
                "original_language": "en",
                "original_title": "School of Rock",
                "overview": "Fired from his band and hard up for cash, guitarist and vocalist Dewey Finn finagles his way into a job as a fifth-grade substitute teacher at a private school, where he secretly begins teaching his students the finer points of rock 'n' roll. The school's hard-nosed principal is rightly suspicious of Finn's activities. But Finn's roommate remains in the dark about what he's doing.",
                "popularity": 7.6025,
                "poster_path": "/zXLXaepIBvFVLU25DH3wv4IPSbe.jpg",
                "release_date": "2003-10-03",
                "title": "School of Rock",
                "video": false,
                "vote_average": 7.085,
                "vote_count": 5874,
                "character": "Patty Di Marco",
                "credit_id": "5ac4e13792514126be04e591",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/txzQ45okJz2fLUQTClCr2Vuk9Nt.jpg",
                "genre_ids": [
                    16,
                    35,
                    878
                ],
                "id": 7249,
                "original_language": "en",
                "original_title": "Futurama: Bender's Big Score",
                "overview": "The Planet Express crew return from cancellation, only to be robbed blind by hideous \"sprunging\" scam artists.  Things go from bad to worse when the scammers hack Bender, start traveling through time, and take Earth over entirely!  Will the crew be able to save the day, or will Bender's larcenous tendencies and their general incompetence doom them all?",
                "popularity": 1.6002,
                "poster_path": "/bmVE90IHvx4uXQgtbRtu4RyMWpt.jpg",
                "release_date": "2007-11-27",
                "title": "Futurama: Bender's Big Score",
                "video": false,
                "vote_average": 7.368,
                "vote_count": 719,
                "character": "Michelle (voice)",
                "credit_id": "5bcff14a0e0a266242025e7a",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/qDQEQbgP3v7B9IYLAUcYexNrVYP.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 404368,
                "original_language": "en",
                "original_title": "Ralph Breaks the Internet",
                "overview": "Video game bad guy Ralph and fellow misfit Vanellope von Schweetz must risk it all by traveling to the World Wide Web in search of a replacement part to save Vanellope's video game, Sugar Rush. In way over their heads, Ralph and Vanellope rely on the citizens of the internet — the netizens — to help navigate their way, including an entrepreneur named Yesss, who is the head algorithm and the heart and soul of trend-making site BuzzzTube.",
                "popularity": 6.8595,
                "poster_path": "/iVCrhBcpDaHGvv7CLYbK6PuXZo1.jpg",
                "release_date": "2018-11-20",
                "title": "Ralph Breaks the Internet",
                "video": false,
                "vote_average": 7.168,
                "vote_count": 7833,
                "character": "Vanellope von Schweetz (voice)",
                "credit_id": "5c9ea884c3a3687352801171",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "사라 실버맨",
            "Sarah Kate Silverman"
        ],
        "biography": "Sarah Kate Silverman (born December 1, 1970) is an American comedian, actress, and writer. Her comedy addresses social taboos and controversial topics, including racism, sexism, homophobia, politics, and religion, sometimes having her comic character endorse them in a satirical or deadpan fashion. She has won two Primetime Emmy Awards for her work on television.\n\nSilverman was a writer and performer on Saturday Night Live, and she starred in and produced The Sarah Silverman Program, which ran from 2007 to 2010 on Comedy Central, for which she was nominated for a Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series. She released an autobiography The Bedwetter in 2010. She also appeared in other television programs, such as Mr. Show and V.I.P. and starred in films, including Who's the Caboose? (1997), School of Rock (2003), Wreck-It Ralph (2012), A Million Ways to Die in the West (2014) and Ralph Breaks the Internet (2018). In 2015, she starred in the drama I Smile Back, for which she was nominated for a Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role.\n\nDuring the 2016 election, she became increasingly politically active; she initially campaigned for Bernie Sanders but later spoke in support of Hillary Clinton at the 2016 Democratic National Convention. She hosted the Hulu streaming television late-night talk show I Love You, America with Sarah Silverman from 2017 until late 2018.\n\nDescription above from the Wikipedia article Sarah Silverman, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1970-12-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 7404,
        "imdb_id": "nm0798971",
        "known_for_department": "Acting",
        "name": "Sarah Silverman",
        "place_of_birth": "Bedford, New Hampshire, USA",
        "popularity": 1.0641,
        "profile_path": "/g5G711XyVokJm2RoItpkaHa8mkQ.jpg"
    }
}