{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rdISVXhHt8F6VZrdLadqUqQGmFc.jpg",
                "genre_ids": [
                    18,
                    9648,
                    878,
                    53,
                    14
                ],
                "id": 9667,
                "original_language": "en",
                "original_title": "The Jacket",
                "overview": "A military veteran goes on a journey into the future, where he can foresee his death and is left with questions that could save his life and those he loves.",
                "popularity": 3.7717,
                "poster_path": "/mdUKskPTFYxPgbEUfoQryM79wz8.jpg",
                "release_date": "2005-03-04",
                "title": "The Jacket",
                "video": false,
                "vote_average": 6.869,
                "vote_count": 1580,
                "character": "Damon",
                "credit_id": "52fe4519c3a36847f80bc421",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/nBHKT3pm5DmidZd5VS4bD5Hc2S3.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 820446,
                "original_language": "en",
                "original_title": "Downton Abbey: A New Era",
                "overview": "The Crawley family goes on a grand journey to the south of France to uncover the mystery of the dowager countess's newly inherited villa. Meanwhile, a Hollywood director seeks to film his latest production at Downton.",
                "popularity": 8.4976,
                "poster_path": "/r5n4CLoIjUcnT3shWDi6MHdJ25a.jpg",
                "release_date": "2022-04-27",
                "title": "Downton Abbey: A New Era",
                "video": false,
                "vote_average": 7.236,
                "vote_count": 540,
                "character": "John Bates",
                "credit_id": "61b6828a58efd3001b019f8e",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/3WK7p9EdZmmvB1IbB2Vw9Rf4lXH.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 296096,
                "original_language": "en",
                "original_title": "Me Before You",
                "overview": "A small town girl is caught between dead-end jobs. A high-profile, successful man becomes wheelchair bound following an accident. The man decides his life is not worth living until the girl is hired for six months to be his new caretaker. Worlds apart and trapped together by circumstance, the two get off to a rocky start. But the girl becomes determined to prove to the man that life is worth living and as they embark on a series of adventures together, each finds their world changing in ways neither of them could begin to imagine.",
                "popularity": 14.9446,
                "poster_path": "/Ia3dzj5LnCj1ZBdlVeJrbKJQxG.jpg",
                "release_date": "2016-06-01",
                "title": "Me Before You",
                "video": false,
                "vote_average": 7.928,
                "vote_count": 12828,
                "character": "Bernard Clark",
                "credit_id": "56b77aba9251415b4b0003c2",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/lgQQ6n1vPw40buW7QGc1DxDzQS9.jpg",
                "genre_ids": [
                    18,
                    10749,
                    36
                ],
                "id": 535544,
                "original_language": "en",
                "original_title": "Downton Abbey",
                "overview": "The beloved Crawleys and their intrepid staff prepare for the most important moment of their lives. A royal visit from the King and Queen of England will unleash scandal, romance and intrigue that will leave the future of Downton hanging in the balance.",
                "popularity": 5.2434,
                "poster_path": "/pWt1iRuhNpeVDNP2QiUT2C5OiBt.jpg",
                "release_date": "2019-09-12",
                "title": "Downton Abbey",
                "video": false,
                "vote_average": 7.152,
                "vote_count": 1193,
                "character": "John Bates",
                "credit_id": "5b48b9f40e0a267ae2015ccb",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "布蘭登·柯伊爾"
        ],
        "biography": "Brendan Coyle (born 2 December 1962) is a British-Irish actor. He won the Olivier Award for Best Performance in a Supporting Role for The Weir in 1999. He also played Nicholas Higgins in the miniseries North & South, Robert Timmins in the first three series of Lark Rise to Candleford, and more recently Mr Bates, the valet, in Downton Abbey, which earned him a nomination for a Primetime Emmy Award for Outstanding Supporting Actor in a Drama Series and a BAFTA nomination for Best Supporting Actor.\n\nBrendan Coyle was born David Coyle in Corby, Northamptonshire, on 2 December 1962, the son of a Patrick B Coyle and Bedelia M B Anderson. He has an older brother named Shaun  Due to his British birth and Irish heritage, he holds both British and Irish citizenship. He is the great-nephew of football manager Sir Matt Busby. He studied drama in Dublin in 1981 and received a scholarship to Mountview Academy of Theatre Arts in London in 1983.\n\nCoyle received a Laurence Olivier Award in 1999 for his performance in Conor McPherson's The Weir and won a New York Critics Theater World Award for Outstanding Broadway Debut for the same play in its New York production. In 2001, Coyle appeared in the film Conspiracy as Gestapo Chief Heinrich Müller. He played Kaz Sweeney in the British drama True Dare Kiss, and Nicholas Higgins in North & South for the BBC.\n\nFrom 2008 he played Robert Timmins in three BBC series based on the Lark Rise to Candleford novels, written by Flora Thompson. In 2010, he began playing John Bates, valet and former British Army batman to the Earl of Grantham in Julian Fellowes's period drama series, Downton Abbey. Fellowes wrote the part for Coyle, and it won him nominations for a BAFTA and IFTA as well as a nomination for the Primetime Emmy Awards as Outstanding Supporting Actor in a Drama Series in 2012. He also won three Screen Actors Guild Awards 2013–16. Coyle also played the character of Terry Starling in the short-lived Sky comedy series Starlings.\n\n​",
        "birthday": "1963-12-02",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.independenttalent.com/actors/brendan-coyle/",
        "id": 74056,
        "imdb_id": "nm0185354",
        "known_for_department": "Acting",
        "name": "Brendan Coyle",
        "place_of_birth": "Corby, Northamptonshire, England, UK",
        "popularity": 0.963,
        "profile_path": "/6KpSP6cmqKySFyRoFjDjH7Ews8Z.jpg"
    }
}