{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ZtcGMc204JsNqfjS9lU6udRgpo.jpg",
                "genre_ids": [
                    28,
                    18
                ],
                "id": 911430,
                "original_language": "en",
                "original_title": "F1",
                "overview": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.",
                "popularity": 171.1139,
                "poster_path": "/9PXZIUsSDh4alB80jheWX4fhZmy.jpg",
                "release_date": "2025-06-25",
                "title": "F1",
                "video": false,
                "vote_average": 7.828,
                "vote_count": 2106,
                "character": "Tiësto",
                "credit_id": "685ddc21589f687af5915008",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "DJ Tiësto",
            "TsT",
            "Tijs Michiel Verwest",
            "Tijs Verwest"
        ],
        "biography": "Tijs Michiel Verwest, OON ( born 17 January 1969), known as Tiësto (Dutch pronunciation: [cɛsto]), is a Dutch musician, DJ and record producer of electronic dance music. Although he has used many aliases in the past, he is best known for his work as DJ Tiësto. On his latest productions, however, he has dropped the \"DJ\" label and is now known simply as \"Tiësto\", an alias which is a twist of his childhood nickname.\n\nIn 1997, he founded the label Black Hole Recordings with Arny Bink, where he released the Magik and In Search of Sunrise CD series. Tiësto met producer Dennis Waakop Reijers in 1998, and the two have worked together extensively since then. Reijers is credited as producer, writer, composer, or arranger on many of Tiësto's releases. In 1999 and 2000 Tiësto collaborated with Ferry Corsten to create Gouryella. His 2000 remix of Delerium's \"Silence\" featuring Sarah McLachlan exposed him to more mainstream audiences. In 2001, he released his first solo album In My Memory which gave him several major hits that launched his career. He ranked in the #1 poll position 3 consecutive times in the DJ Magazine Top 100 Popularity Poll from 2002 to 2004.\n\nJust after releasing his second studio album Just Be in 2004 at the Summer Olympics, he performed live at the opening ceremony in Athens, Greece, becoming the first DJ to play live on stage at an Olympics. Tracks he made especially for the Olympics were mixed together and released as the mix compilation Parade of the Athletes later that year. In April 2007 Tiësto launched both his radio show Tiësto's Club Life on Radio 538 in the Netherlands and released his third studio album Elements of Life. The album reached number one on the Dutch album chart as well on \"Billboard Top Electronic Albums\" in the U.S. and received a nomination for a Grammy Award in 2008.Tiësto released his fourth studio album Kaleidoscope in October 2009.  As at 2012, Tiësto attained the #3 poll position of the DJ Mag 100 Popularity Poll, and he refers to the styles he mainly plays as House, Electro House, and Progressive House. He plays a new balanced sound sometimes demonstrating lesser known genres such as Dubstep. For nostalgia, Tiësto still throws in the odd Trance House record, the style he became attached to in the early 2000's.  Description above from the Wikipedia article Tiësto, licensed under CC-BY-SA, full list of contributors on Wikipedia.     ",
        "birthday": "1969-01-17",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.tiesto.com/",
        "id": 74090,
        "imdb_id": "nm1451495",
        "known_for_department": "Acting",
        "name": "Tiësto",
        "place_of_birth": "Breda, Noord-Brabant, Netherlands",
        "popularity": 0.0524,
        "profile_path": "/aFBqoHkI38ayQUX1o3owJTeaqDH.jpg"
    }
}