{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/12fvZHskx57kQfNEUXJ3v0flWYQ.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 89,
                "original_language": "en",
                "original_title": "Indiana Jones and the Last Crusade",
                "overview": "In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!",
                "popularity": 7.0651,
                "poster_path": "/sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg",
                "release_date": "1989-05-24",
                "title": "Indiana Jones and the Last Crusade",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 10606,
                "character": "Young Indy",
                "credit_id": "52fe4216c3a36847f8002e35",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/yjGllQUm28R4X9xD9T5xMszirgw.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 235,
                "original_language": "en",
                "original_title": "Stand by Me",
                "overview": "After learning that a boy their age has been accidentally killed near their rural homes, four Oregon boys decide to go see the body. On the way, Gordie,  Vern, Chris and Teddy encounter a mean junk man and a marsh full of leeches, as they also learn more about one another and their very different home lives. Just a lark at first, the boys' adventure evolves into a defining event in their lives.",
                "popularity": 6.1713,
                "poster_path": "/vz0w9BSehcqjDcJOjRaCk7fgJe7.jpg",
                "release_date": "1986-08-08",
                "title": "Stand by Me",
                "video": false,
                "vote_average": 7.853,
                "vote_count": 6166,
                "character": "Chris Chambers",
                "credit_id": "52fe422ac3a36847f800914b",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/stSaFz5CtMXwIj3r4MDjqxqWRot.jpg",
                "genre_ids": [
                    18
                ],
                "id": 468,
                "original_language": "en",
                "original_title": "My Own Private Idaho",
                "overview": "In this loose adaptation of Shakespeare's \"Henry IV,\" Mike Waters is a hustler afflicted with narcolepsy. Scott Favor is the rebellious son of a mayor. Together, the two travel from Portland, Oregon to Idaho and finally to the coast of Italy in a quest to find Mike's estranged mother. Along the way they turn tricks for money and drugs, eventually attracting the attention of a wealthy benefactor and sexual deviant.",
                "popularity": 6.2687,
                "poster_path": "/p9TF90Pb5yg2MNb2UztzyXktMm4.jpg",
                "release_date": "1991-02-01",
                "title": "My Own Private Idaho",
                "video": false,
                "vote_average": 7.061,
                "vote_count": 1175,
                "character": "Mike Waters",
                "credit_id": "52fe4247c3a36847f8011cf5",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/smK3ud9IKSLVuRXdKauJ9p0DwNB.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 2322,
                "original_language": "en",
                "original_title": "Sneakers",
                "overview": "When shadowy U.S. intelligence agents blackmail a reformed computer hacker and his eccentric team of security experts into stealing a code-breaking 'black box' from a Soviet-funded genius, they uncover a bigger conspiracy. Now, he and his 'sneakers' must save themselves and the world economy by retrieving the box from their blackmailers.",
                "popularity": 15.7127,
                "poster_path": "/l2pIGwCvpZEpBuMb55YBl6A04Jv.jpg",
                "release_date": "1992-09-09",
                "title": "Sneakers",
                "video": false,
                "vote_average": 6.907,
                "vote_count": 976,
                "character": "Carl",
                "credit_id": "52fe434ec3a36847f804a445",
                "order": 4
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/3fChciF2G1wXHsyTfJD9y7uN6Il.jpg",
                "genre_ids": [
                    27,
                    18,
                    14
                ],
                "id": 628,
                "original_language": "en",
                "original_title": "Interview with the Vampire",
                "overview": "A vampire relates his epic life story of love, betrayal, loneliness, and dark hunger to an over-curious reporter.",
                "popularity": 9.5984,
                "poster_path": "/2162lAT2MP36MyJd2sttmj5du5T.jpg",
                "release_date": "1994-11-11",
                "title": "Interview with the Vampire",
                "video": false,
                "vote_average": 7.382,
                "vote_count": 6109,
                "credit_id": "60d5804f25b9550046ab6a7c",
                "department": "Crew",
                "job": "In Memory Of"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ریور فینیکس",
            "River Jude Phoenix",
            "Rio Jude Phoenix",
            "River Jude Bottom"
        ],
        "biography": "River Jude Phoenix (né Bottom) was an American actor, musician, and activist.\n\nPhoenix grew up in an itinerant family, as the older brother of Rain Phoenix, Joaquin Phoenix, Liberty Phoenix, and Summer Phoenix. He had no formal schooling, but he showed an instinctive talent for the guitar. He began his acting career at age 10 in television commercials. He starred in the science fiction adventure film Explorers (1985) and had his breakthrough role in 1986's Stand by Me, a coming-of-age film based on the novella The Body by Stephen King.\n\nPhoenix made a transition into more adult-oriented roles with Running on Empty (1988), playing Danny Pope, the son of fugitive parents in a well-received performance that earned him a nomination for an Academy Award for Best Supporting Actor (at age 18, he became the sixth-youngest nominee in the category), and My Own Private Idaho (1991), playing Michael Waters, a gay hustler in search of his estranged mother. For his performance in the latter, Phoenix garnered enormous praise and won a Volpi Cup for Best Actor at the 1991 Venice Film Festival as well as Independent Spirit Award for Best Male Lead and National Society of Film Critics Award for Best Actor, becoming the second-youngest winner of the former.\n\nPhoenix died at age 23 from combined drug intoxication in West Hollywood in the early hours of Halloween, 1993, after unknowingly ingesting cocaine and heroin (a mixture commonly known as a speedball) at The Viper Room.",
        "birthday": "1970-08-23",
        "deathday": "1993-10-31",
        "gender": 2,
        "homepage": null,
        "id": 741,
        "imdb_id": "nm0000203",
        "known_for_department": "Acting",
        "name": "River Phoenix",
        "place_of_birth": "Metolius, Oregon USA",
        "popularity": 1.5849,
        "profile_path": "/paiEKUSv2ey7hV83D6Aw80NmTOr.jpg"
    }
}