{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bQEIYntlPba76NN41uWxIzUmzBb.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4995,
                "original_language": "en",
                "original_title": "Boogie Nights",
                "overview": "Set in 1977, back when sex was safe, pleasure was a business and business was booming, idealistic porn producer Jack Horner aspires to elevate his craft to an art form. Horner discovers Eddie Adams, a hot young talent working as a busboy in a nightclub, and welcomes him into the extended family of movie-makers, misfits and hangers-on that are always around. Adams' rise from nobody to a celebrity adult entertainer is meteoric, and soon the whole world seems to know his porn alter ego, \"Dirk Diggler\". Now, when disco and drugs are in vogue, fashion is in flux and the party never seems to stop, Adams' dreams of turning sex into stardom are about to collide with cold, hard reality.",
                "popularity": 11.9692,
                "poster_path": "/wnE24UPCPQsQnbBOu4zVE2qaDNm.jpg",
                "release_date": "1997-10-10",
                "title": "Boogie Nights",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 3315,
                "character": "Little Bill's Wife",
                "credit_id": "5890dd6492514103ec0094ba",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Anal Annie",
            "Nina Hartely",
            "Nina Hartly",
            "Nina Hartman",
            "Nina Hartwell",
            "Nina",
            "Marie Hartman",
            "尼娜·哈特利",
            "Marie Louise Hartman"
        ],
        "biography": "Marie Louise Hartman (born March 11, 1959), known professionally as Nina Hartley, is an American pornographic film actress and sex educator. She has been described by Las Vegas Weekly as an \"outspoken feminist\" and \"advocate for sexual freedom\", and by CNBC as \"a legend in the adult world\". Her pornographic film debut was in Educating Nina (1984), where she was cast and directed by fellow performer Juliet Anderson. Since then she has gone on to become one of the most enduring and recognizable performers in the industry, winning  numerous awards throughout her career from various critic and fan organizations. By 2017 she had appeared in more than one thousand adult films.\n\nHartley grew up in the San Francisco Bay Area, after graduating from Berkeley High School in 1977, she attended San Francisco State University's undergraduate nursing school and graduated magna cum laude in 1985, receiving a Bachelor of Science in Nursing. She was a registered nurse until her license expired in 1986. Hartley sought a career in pornography as a way to make a living by having sex, later telling Las Vegas Weekly, \"Porn gave me easy access to women without having to date them or have a relationship.\" She writes that part of her reason for choosing sex work was to be able to indulge her exhibitionistic and voyeuristic streak. She has said she chose her life's work when she saw the 1976 erotic film The Autobiography of a Flea alone at a theater in San Francisco. In 1982, during her sophomore year of nursing school, she started working as a stripper at the Sutter Cinema and then the Mitchell Brothers O'Farrell Theatre.",
        "birthday": "1959-03-11",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.nina.live/",
        "id": 74252,
        "imdb_id": "nm0000440",
        "known_for_department": "Acting",
        "name": "Nina Hartley",
        "place_of_birth": "Berkeley, California, USA",
        "popularity": 52.945,
        "profile_path": "/grzgW8C2aacxGCenhqLQvvBdsKL.jpg"
    }
}