{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/leehjwM57DKJ79XMUll4oAF0kin.jpg",
                "genre_ids": [
                    35
                ],
                "id": 9377,
                "original_language": "en",
                "original_title": "Ferris Bueller's Day Off",
                "overview": "After high school slacker Ferris Bueller successfully fakes an illness in order to skip school for the day, he goes on a series of adventures throughout Chicago with his girlfriend Sloane and best friend Cameron, all the while trying to outwit his wily school principal and fed-up sister.",
                "popularity": 6.3107,
                "poster_path": "/9LTQNCvoLsKXP0LtaKAaYVtRaQL.jpg",
                "release_date": "1986-06-11",
                "title": "Ferris Bueller's Day Off",
                "video": false,
                "vote_average": 7.571,
                "vote_count": 5129,
                "character": "Katie Bueller",
                "credit_id": "52fe44efc3a36847f80b2ccb",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nCindy Lou Pickett (born April 18, 1947) is an American actress best known for her 1970s role as Jackie Marler-Spaulding on the CBS soap Guiding Light; her role as Dr. Carol Novino on the hugely-popular television drama St. Elsewhere in the 1980s; for her critically acclaimed performance as the real-life Kay Stayner, the mother of a boy who was kidnapped for several years, in the dramatic TV movie I Know My First Name Is Steven; and for her cinematic roles and performances as Valerie St. John in Roger Vadim's little-known 1980 erotic cult film, Night Games, for which she would have the leading role, and as the tough-as-nails and heroic Dr. Jane Norris in the 1989 sci-fi-horror film DeepStar Six. Pickett, however, is handily best-known to audiences for her highly memorable turn as Katie Bueller, Matthew Broderick's titular character's loving and unsuspecting mother, in the 1986 classic and iconic American comedy movie Ferris Bueller's Day Off.",
        "birthday": "1947-04-18",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 74276,
        "imdb_id": "nm0681882",
        "known_for_department": "Acting",
        "name": "Cindy Pickett",
        "place_of_birth": "Sand Springs, Oklahoma, USA",
        "popularity": 0.6756,
        "profile_path": "/oZMzCxIIv0od25webjx8Z6foNjR.jpg"
    }
}