{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mFfyE5DPFDqoes4HIcElHc2a15y.jpg",
                "genre_ids": [
                    18
                ],
                "id": 334,
                "original_language": "en",
                "original_title": "Magnolia",
                "overview": "On one random day in the San Fernando Valley, a dying father, a young wife, a male caretaker, a famous lost son, a police officer in love, a boy genius, an ex-boy genius, a game show host and an estranged daughter will each become part of a dazzling multiplicity of plots, but one story.",
                "popularity": 8.4459,
                "poster_path": "/tpfC325Jk6S38VTe5dDWjWtoyxr.jpg",
                "release_date": "1999-12-17",
                "title": "Magnolia",
                "video": false,
                "vote_average": 7.729,
                "vote_count": 3746,
                "character": "Cynthia",
                "credit_id": "52fe4239c3a36847f800d6fb",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Φελίσιτι Χάφμαν",
            "فلیسیتی هافمن"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nFelicity Kendall Huffman (born December 9, 1962) is an American film, stage, and television actress. She is known for her role as executive producer Dana Whitaker on the ABC television show Sports Night (1998—2000), which earned her an Golden Globe Award nomination, and as hectic supermom Lynette Scavo on the ABC show Desperate Housewives (2004—present), which has earned her an Emmy Award.\n\nIn 2005, her critically acclaimed role as a trans woman in the independent film Transamerica earned her a Golden Globe Award and an Academy Award nomination. She has also starred in films such as Reversal of Fortune, The Spanish Prisoner, Magnolia, Path to War, Georgia Rule and Phoebe in Wonderland.\n\nDescription above from the Wikipedia article Felicity Huffman, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1962-12-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 7427,
        "imdb_id": "nm0005031",
        "known_for_department": "Acting",
        "name": "Felicity Huffman",
        "place_of_birth": "Bedford, New York, USA",
        "popularity": 0.7159,
        "profile_path": "/hbGEEamG47fo4rrfBKU6YgbasVQ.jpg"
    }
}