{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ivGXj9i01x5FECAikQkP4X5ojmY.jpg",
                "genre_ids": [
                    28,
                    35,
                    80
                ],
                "id": 2109,
                "original_language": "en",
                "original_title": "Rush Hour",
                "overview": "When Hong Kong Inspector Lee is summoned to Los Angeles to investigate a kidnapping, the FBI doesn't want any outside help and assigns cocky LAPD Detective James Carter to distract Lee from the case. Not content to watch the action from the sidelines, Lee and Carter form an unlikely partnership and investigate the case themselves.",
                "popularity": 10.7356,
                "poster_path": "/we7wOLVFgxhzLzUt0qNe50xdIQZ.jpg",
                "release_date": "1998-09-18",
                "title": "Rush Hour",
                "video": false,
                "vote_average": 7.056,
                "vote_count": 5308,
                "character": "Johnson",
                "credit_id": "52fe4336c3a36847f8042fb5",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/oubk1SEFtg3Q8eOncFvGQVa6OoP.jpg",
                "genre_ids": [
                    18,
                    9648,
                    27
                ],
                "id": 2291,
                "original_language": "en",
                "original_title": "Jacob's Ladder",
                "overview": "After returning home from the Vietnam War, veteran Jacob Singer struggles to maintain his sanity. Plagued by hallucinations and flashbacks, Singer rapidly falls apart as the world and people around him morph and twist into disturbing images. His girlfriend, Jezzie, and ex-wife, Sarah, try to help, but to little avail. Even Singer's chiropractor friend, Louis, fails to reach him as he descends into madness.",
                "popularity": 3.4814,
                "poster_path": "/ufLcHIi1aXjjH8MediAMvnwDsVI.jpg",
                "release_date": "1990-11-02",
                "title": "Jacob's Ladder",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1752,
                "character": "Jezzie",
                "credit_id": "52fe434ac3a36847f80491e7",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/cgrQefMZspzBD2HXmZ8LYoCuN5m.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 16620,
                "original_language": "en",
                "original_title": "La Bamba",
                "overview": "Los Angeles teenager Ritchie Valens becomes an overnight rock 'n' roll success in 1958, thanks to a love ballad called \"Donna\" that he wrote for his girlfriend. But as his star rises, Valens has conflicts with his jealous brother, Bob, and becomes haunted by a recurring nightmare of a plane crash just as he begins his first national tour alongside Buddy Holly.",
                "popularity": 4.7234,
                "poster_path": "/6Znulqtc7cdqlUC69HGf26Ef5fi.jpg",
                "release_date": "1987-07-24",
                "title": "La Bamba",
                "video": false,
                "vote_average": 7.272,
                "vote_count": 744,
                "character": "Rosie Morales",
                "credit_id": "52fe46e09251416c750868a3",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/bf5BLoF4IbKx4vn0NbeqCbgBNdi.jpg",
                "genre_ids": [
                    28,
                    12,
                    16,
                    10751
                ],
                "id": 9806,
                "original_language": "en",
                "original_title": "The Incredibles",
                "overview": "Bob Parr has given up his superhero days to log in time as an insurance adjuster and raise his three children with his formerly heroic wife in suburbia. But when he receives a mysterious assignment, it's time to get back into costume.",
                "popularity": 30.3658,
                "poster_path": "/2LqaLgk4Z226KkgPJuiOQ58wvrm.jpg",
                "release_date": "2004-10-27",
                "title": "The Incredibles",
                "video": false,
                "vote_average": 7.716,
                "vote_count": 18265,
                "character": "Mirage (voice)",
                "credit_id": "66185a2fbbcae0017c949672",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Elizabeth Pena",
            "Elizabeth Maria Peña",
            "Elizabeth Anne Dickinson"
        ],
        "biography": "Elizabeth Maria Peña (September 23, 1959 – October 14, 2014) was an American actress, and the daughter of a theater-company co-founder, who has also compiled experience as a television director in her own right. Peña was born in Elizabeth, New Jersey, daughter of Estella Margarita (née Toirac), an arts administrator and producer, and Mario Peña, the Cuban-born actor, writer, and director who jointly founded the Latin American Theatre Ensemble. It is unknown whether Peña was named after the town of her birth. Peña graduated from New York's High School of Performing Arts in 1977. Her classmates included Ving Rhames, alongside whom she would later co-star in Jacob's Ladder, and Esai Morales, alongside whom she would later co-star in La Bamba. She is also a founding member of the Hispanic Organization of Latin Actors.\n\nIn 1979, Peña appeared in her first film, El Super, \"an exceptionally moving and melancholy comedy about a family of lower-middle-class Cuban refugees attempting to adjust to life in Spanish Harlem.\", New York City. Peña worked once again with film director, Leon Ichaso in his next feature Crossover Dreams opposite Ruben Blades.\n\nPeña has appeared in movies such as La Bamba, Down and Out in Beverly Hills, Lone Star, Vibes, and Rush Hour. In 2002, she starred in Showtime's Resurrection Blvd. as Tia Bibi Corrades in the episode \"Justicia,\" which she also directed. During the next year, 2003, she appeared in and directed \"It Was Fun While It Lasted,\" an episode of The Brothers Garcia. She also provided the voice of the character Mirage in Pixar's animated film The Incredibles. She guest starred in the 18th episode of Numb3rs, Season Two, as Sonya Benavides. Although the actress does speak Spanish, she does not dub her own voice for Spanish releases.\n\nPeña is also noted for having starred in I Married Dora, a sitcom that lasted only 13 episodes in 1987, as Dora Calderon, the \"Dora\" of the show's title. In the final show, the cast broke the \"fourth wall\" of suspended disbelief by announcing their cancellation on-camera and taking a curtain call.\n\nWriter-director John Sayles produced the critically acclaimed but short-lived television series Shannon's Deal (1989–1991) co-starring Peña alongside series lead Jamey Sheridan. In 1996 Sayles wrote and directed the mystery film Lone Star and again cast her in a co-starring role.\n\nPeña died on October 14, 2014 at Cedars-Sinai Medical Center in Los Angeles, California at the age of 55.",
        "birthday": "1959-09-23",
        "deathday": "2014-10-14",
        "gender": 1,
        "homepage": null,
        "id": 7430,
        "imdb_id": "nm0001615",
        "known_for_department": "Acting",
        "name": "Elizabeth Peña",
        "place_of_birth": "Elizabeth, New Jersey, USA",
        "popularity": 1.6984,
        "profile_path": "/uyUrPmtbwiGFOq8pIfYVQYgmBmK.jpg"
    }
}