{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/49fFaToKnGkZkM0sgIcdaf54A2g.jpg",
                "genre_ids": [
                    27,
                    18
                ],
                "id": 13310,
                "original_language": "sv",
                "original_title": "Låt den rätte komma in",
                "overview": "When Oskar, a sensitive, bullied 12-year-old boy, meets his new neighbor, the mysterious and moody Eli, they strike up a friendship. Initially reserved with each other, Oskar and Eli slowly form a close bond, but it soon becomes apparent that she is no ordinary young girl.",
                "popularity": 2.5847,
                "poster_path": "/7IG4WjaAOVDlLvLUkh513HSwhW8.jpg",
                "release_date": "2008-10-24",
                "title": "Let the Right One In",
                "video": false,
                "vote_average": 7.539,
                "vote_count": 3070,
                "character": "Oskar",
                "credit_id": "52fe45599251416c750537d1",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kåre Gillis Hedebrant"
        ],
        "biography": "Kåre Hedebrant (born 28 June 1995) is a Swedish actor. He played the main character in the 2008 Swedish romantic horror film Let the Right One In.\n\nIn 2007, after an open casting involving 4000 kids, Hedebrant was chosen to play the role of Oskar in Let the Right One In. Oskar, the protagonist of the film, is a 12-year old bullied boy who strikes up a friendship with the mysterious Eli (Lina Leandersson), who later turns out to be a vampire. Hedebrant received generally positive notices for his role.\n\nHedebrant has expressed that although he hasn't decided to pursue a career in acting, he would \"definitely\" want to try it again. In 2010, Hedebrant was chosen as the lead role in Amors Baller, a Norwegian romantic comedy directed by Kristoffer Metcalfe. Hedebrant plays Lucas, a Swedish teenager who moves to a small Norwegian town, and falls in love with the goalkeeper on the local girl's football team.The film premiered in Norway on 25 March 2011.\n\nDescription above from the Wikipedia article Kåre Hedebrant, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1995-06-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 74382,
        "imdb_id": "nm2968765",
        "known_for_department": "Acting",
        "name": "Kåre Hedebrant",
        "place_of_birth": "Stockholm, Sweden",
        "popularity": 0.1398,
        "profile_path": "/t1hmgD3UPSDn0uxJadm0gkj8v2s.jpg"
    }
}