{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/12fvZHskx57kQfNEUXJ3v0flWYQ.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 89,
                "original_language": "en",
                "original_title": "Indiana Jones and the Last Crusade",
                "overview": "In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!",
                "popularity": 7.0651,
                "poster_path": "/sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg",
                "release_date": "1989-05-24",
                "title": "Indiana Jones and the Last Crusade",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 10606,
                "character": "Grail Knight",
                "credit_id": "52fe4216c3a36847f8002e41",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Leadam Eddison"
        ],
        "biography": "Robert Leadam Eddison, OBE (10 June 1908 – 14 December 1991) was an English actor, who is probably most widely remembered in the role of the Grail Knight in Indiana Jones and the Last Crusade. He also played the tragic ferryman in The Storyteller episode \"The Luck Child\".  Born in Japan to English parents, Edwin Eddison and Hilda Muriel Leadham, he had a twin brother Talbot Leadam Eddison. Through his paternal grandmother, Anna Paulina Tatham of Philadelphia, he was related to the Tatham Brothers Iron pipe manufacturers of Philadelphia. As his paternal great-grandfather Henry Billington Tatham's name suggests, he was a descendant of the Billington family who came to America from England on the Mayflower.  Eddison was known for his resonant, baritone voice and long, lean figure. He performed William Shakespeare and other classics, was noted for his Hamlet at the Old Vic, and later playing the comic roles of Feste and Sir Andrew Aguecheek inTwelfth Night, and King Lear on the New York stage. He was also a familiar figure in plays by Ibsen, Chekhov, andSophocles, and played Canon Chasuble in Oscar Wilde's The Importance of Being Earnest.  Eddison also made his mark in radio, in countless BBC dramas through the decades, with some of his last roles includingDeath in The Canterbury Tales and parts in an adaptation of Japanese Noh plays. His film career was limited, but included a supporting role in Peter Ustinov's 1948 comedy Vice Versa, the electrical 'Nick' in The Boy Who Turned Yellow (1972), the college president in American Friends (1991), and a notable cameo in Indiana Jones and the Last Crusadeas the ancient Grail Knight, warning adventurers to choose wisely.",
        "birthday": "1908-06-10",
        "deathday": "1991-12-14",
        "gender": 2,
        "homepage": null,
        "id": 744,
        "imdb_id": "nm0248848",
        "known_for_department": "Acting",
        "name": "Robert Eddison",
        "place_of_birth": "Yokohama, Japan",
        "popularity": 0.24,
        "profile_path": "/vABVhicQpeFrOQa5mwOqqK5xspO.jpg"
    }
}