{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5P6hWD4zxAMntRuRnB4MmPLijNw.jpg",
                "genre_ids": [
                    18
                ],
                "id": 22881,
                "original_language": "en",
                "original_title": "The Blind Side",
                "overview": "The story of Michael Oher, a homeless and traumatized boy who became an All American football player and first round NFL draft pick with the help of a caring woman and her family.",
                "popularity": 14.2372,
                "poster_path": "/bMgq7VBriuBFknXEe9E9pVBYGZq.jpg",
                "release_date": "2009-11-20",
                "title": "The Blind Side",
                "video": false,
                "vote_average": 7.674,
                "vote_count": 6589,
                "character": "Sean Tuohy",
                "credit_id": "52fe4453c3a368484e01cd2f",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/dxXhdYuQyuMPX0lCEo6LhCv69Xq.jpg",
                "genre_ids": [
                    18
                ],
                "id": 13416,
                "original_language": "en",
                "original_title": "Friday Night Lights",
                "overview": "A small, turbulent town in Texas obsesses over their high school football team to an unhealthy degree. When the star tailback, Boobie Miles, is seriously injured during the first game of the season, all hope is lost, and the town's dormant social problems begin to flare up. It is left to the inspiring abilities of new coach Gary Gaines to instill in the other team members -- and, by proxy, the town itself -- a sense of self-respect and honor.",
                "popularity": 3.5769,
                "poster_path": "/8HIqpOgqShRc3TAleabnYispDl1.jpg",
                "release_date": "2004-10-08",
                "title": "Friday Night Lights",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 594,
                "character": "Charles Billingsley",
                "credit_id": "52fe45669251416c750551ab",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/bAup7FGUlmNVOuhZFlLgmDPo0Eg.jpg",
                "genre_ids": [
                    18,
                    10751
                ],
                "id": 345938,
                "original_language": "en",
                "original_title": "The Shack",
                "overview": "A grieving man receives a mysterious, personal invitation to meet with God at a place called 'The Shack'.",
                "popularity": 9.472,
                "poster_path": "/doAzav9kfdtsoSdw1MDFvjKq3J4.jpg",
                "release_date": "2017-03-03",
                "title": "The Shack",
                "video": false,
                "vote_average": 7.494,
                "vote_count": 2196,
                "character": "Willie",
                "credit_id": "57eb8ccb9251410db4003786",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "提姆·麥克羅",
            "تیم مک‌گرا"
        ],
        "biography": "Samuel Timothy 'Tim' McGraw (born May 1, 1967) is an American country singer and actor. Many of his albums and singles have topped the country music charts, leading him to achieve total album sales in excess of 40 million units. He is married to country singer Faith Hill and is the son of former baseball player Tug McGraw.\n\nHe had 11 consecutive albums debut at Number One on the Billboard albums charts. Twenty-one singles hit No. 1 on the Billboard Hot Country Songs chart. He has won 3 Grammys, 14 Academy of Country Music awards, 11 Country Music Association (CMA) awards, 10 American Music Awards, and 3 People's Choice Awards. His Soul2Soul II Tour with his wife Faith Hill is the highest grossing tour in country music history, and one of the top five among all genres of music.\n\nHe has ventured into acting, with supporting roles in The Blind Side (with Sandra Bullock), Friday Night Lights, The Kingdom, and Four Christmases (with Vince Vaughn and Reese Witherspoon), and lead roles in Flicka (2006) and Country Strong (2010). He was a minority owner of the Arena Football League's Nashville Kats. Taylor Swift's debut single, \"Tim McGraw\", refers to him and his song, \"Can't Tell Me Nothin'\".\n\nIn honor of his grandfather's Italian heritage, he was honored by the National Italian American Foundation (NIAF) in 2004, receiving the NIAF Special Achievement Award in Music during the Foundation's 29th Anniversary Gala.\n\nDescription above from the Wikipedia article Tim McGraw, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1967-05-01",
        "deathday": null,
        "gender": 2,
        "homepage": "http://timmcgraw.com",
        "id": 74428,
        "imdb_id": "nm0005210",
        "known_for_department": "Acting",
        "name": "Tim McGraw",
        "place_of_birth": "Delhi, Louisiana, USA",
        "popularity": 0.6167,
        "profile_path": "/gJdDFQHnsptnjI1bepJ2nxzBPkv.jpg"
    }
}