{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/12fvZHskx57kQfNEUXJ3v0flWYQ.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 89,
                "original_language": "en",
                "original_title": "Indiana Jones and the Last Crusade",
                "overview": "In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!",
                "popularity": 6.9797,
                "poster_path": "/sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg",
                "release_date": "1989-05-24",
                "title": "Indiana Jones and the Last Crusade",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 10606,
                "character": "Fedora",
                "credit_id": "52fe4216c3a36847f8002e45",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Richard Young (born in 1955 in Kissimmee, Florida) is an American actor who spent most of his career as a blandly competent, mostly-supporting player in various films and on television. Young began his career in the early 70s with TV guest spots and in Roger Corman's New World exploitation films like Fly Me and Night Call Nurses (both 1972). He went on to many other TV appearances, leading up to recurring roles on shows like Flamingo Road and Texas in the early 80s. Parts in higher profile films like High Risk (1981) and The Ice Pirates (1984) followed suit.\n\nYoung is perhaps best known for his small role in the opening sequence of Indiana Jones and the Last Crusade (1989) as \"Fedora,\" the leader of the tomb-robbers who chases the young Indiana Jones then gives the young Jones his own fedora which later becomes Jones' hat. That same year he had a decent supporting role in the prison-set action / drama An Innocent Man alongside Tom Selleck. He also had top-billed starring roles in 'B' action films like Final Mission (1984) and Saigon Commandos (1988), and a supporting part in the Corman production Lords of the Deep (1989), one of many films hoping to cash-in on all the hype behind The Abyss.\n\nHorror fans know Young as the friendly psychiatrist Matt, who gets a spike driven through his forehead, in the fifth installment of the Friday the 13th series. Likewise, starring in the big budget international bomb Eye of the Widow (1991), which took three years to produce and wasn't even released in the U.S., seemed to drive a spike through his career as a leading man. Outside of a couple of TV appearances, he hasn't been seen in anything since.",
        "birthday": "1939-10-17",
        "deathday": "2010-12-15",
        "gender": 2,
        "homepage": null,
        "id": 745,
        "imdb_id": "nm0949985",
        "known_for_department": "Acting",
        "name": "Richard Young",
        "place_of_birth": "Penfield, État de New York, États-Unis",
        "popularity": 0.2338,
        "profile_path": "/8z3i4A06B0YnY9tPcI6rFWehh7E.jpg"
    }
}