{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tDn1dA52bQH9B85vilHeU7C83W1.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648
                ],
                "id": 548,
                "original_language": "ja",
                "original_title": "羅生門",
                "overview": "Four people recount different versions of the story of a man's murder and the rape of his wife.",
                "popularity": 4.2275,
                "poster_path": "/vL7Xw04nFMHwnvXRFCmYYAzMUvY.jpg",
                "release_date": "1950-08-26",
                "title": "Rashomon",
                "video": false,
                "vote_average": 8.054,
                "vote_count": 2375,
                "character": "Masako",
                "credit_id": "52fe4250c3a36847f801488b",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/iB1tCWl4MKl6OO1kMBD5LxM5BmJ.jpg",
                "genre_ids": [
                    14,
                    18,
                    9648
                ],
                "id": 14696,
                "original_language": "ja",
                "original_title": "雨月物語",
                "overview": "In 16th century Japan, peasants Genjuro and Tobei sell their earthenware pots to a group of soldiers in a nearby village, in defiance of a local sage's warning against seeking to profit from warfare. Genjuro's pursuit of both riches and the mysterious Lady Wakasa, as well as Tobei's desire to become a samurai, run the risk of destroying both themselves and their wives, Miyagi and Ohama.",
                "popularity": 3.1302,
                "poster_path": "/r8RiuKTIYIJBjczBVsfeP5C00CJ.jpg",
                "release_date": "1953-03-26",
                "title": "Ugetsu",
                "video": false,
                "vote_average": 7.998,
                "vote_count": 611,
                "character": "Lady Wakasa",
                "credit_id": "5e7da1b0278d8a001572f263",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Machiko Kyô ",
            "ماچیکو کیو"
        ],
        "biography": "Machiko Kyō (Japanese: 京 マチ子 Hepburn: Kyō Machiko, March 25, 1924 – May 12, 2019) was a Japanese actress whose film work occurred primarily during the 1950s. She rose to extraordinary domestic praise in Japan for her work in two of the greatest Japanese films of the 20th century, Akira Kurosawa's Rashōmon and Kenji Mizoguchi's Ugetsu.\n\nMachiko trained to be a dancer before entering films in 1949. The following year, she would achieve international fame as the female lead in Akira Kurosawa's classic film Rashōmon. Kyō starred in many more Japanese productions, including Kenji Mizoguchi's Ugetsu (1953) and Street of Shame (1956), Teinosuke Kinugasa's Gate of Hell (1953), Kon Ichikawa's Odd Obsession (1959), Yasujirō Ozu's Floating Weeds (1959), and Hiroshi Teshigahara's The Face of Another (1966).\n\nHer only role in a non-Japanese film was as Lotus Blossom, a young geisha, in The Teahouse of the August Moon, starring opposite Marlon Brando and Glenn Ford.\n\nIn her eighties, Kyō continued to perform in traditional Japanese theatrical productions put on by famed producer Fukuko Ishii. Her final role was as Matsuura Shino in the NHK television drama series Haregi Koko Ichiban in 2000. Kyō was nominated for a Golden Globe for The Teahouse of the August Moon, a great feat for an Asian actress at the time, and was awarded many prizes, including a Lifetime Achievement Award from the Awards of the Japanese Academy.\n\nDescription above from the Wikipedia article Machiko Kyō, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1924-03-25",
        "deathday": "2019-05-12",
        "gender": 1,
        "homepage": null,
        "id": 7451,
        "imdb_id": "nm0477553",
        "known_for_department": "Acting",
        "name": "Machiko Kyō",
        "place_of_birth": "Osaka, Osaka Prefecture, Japan",
        "popularity": 0.4944,
        "profile_path": "/24tQVUgGN4s6rp1P9qlnT74RSJI.jpg"
    }
}