{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3mpgltEMgPf8zFtPnAWdDVN8ZT1.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1056360,
                "original_language": "en",
                "original_title": "American Fiction",
                "overview": "A novelist fed up with the establishment profiting from \"Black\" entertainment uses a pen name to write a book that propels him into the heart of hypocrisy and the madness he claims to disdain.",
                "popularity": 3.759,
                "poster_path": "/57MFWGHarg9jid7yfDTka4RmcMU.jpg",
                "release_date": "2023-11-10",
                "title": "American Fiction",
                "video": false,
                "vote_average": 7.305,
                "vote_count": 1174,
                "character": "Lisa Ellison",
                "credit_id": "638a5f537d5db50084af163b",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/zbPVujc7qIEqpqkG70t2NpNvHOa.jpg",
                "genre_ids": [
                    35,
                    14,
                    10749
                ],
                "id": 526050,
                "original_language": "en",
                "original_title": "Little",
                "overview": "Jordan Sanders, a take-no-prisoners tech mogul, wakes up one morning in the body of her 13-year-old self right before a do-or-die presentation. Her beleaguered assistant April is the only one in on the secret that her daily tormentor is now trapped in an awkward tween body, just as everything is on the line.",
                "popularity": 4.0416,
                "poster_path": "/4MDB6jJl3U7xK1Gw64zIqt9pQA4.jpg",
                "release_date": "2019-04-04",
                "title": "Little",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 733,
                "character": "Homegirl (voice)",
                "credit_id": "5ed1b5ffe4b576001f30967a",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "تریسی الیس راس",
            "特雷斯·埃利斯·罗斯"
        ],
        "biography": "Tracee Joy Silberstein (born October 29, 1972), known professionally as Tracee Ellis Ross, is an American actress. She is known for her lead roles in the television series Girlfriends (2000–2008) and Black-ish (2014–2022) receiving nominations for five Primetime Emmy Awards for Outstanding Lead Actress in a Comedy Series for the latter.\n\nShe is the daughter of actress and Motown recording artist Diana Ross and Robert Ellis Silberstein. She began acting in independent films and variety series. She hosted the pop-culture magazine The Dish on Lifetime. From 2000 to 2008 she played the starring role of Joan Clayton in the UPN/CW comedy series Girlfriends, for which she received two NAACP Image Awards for Outstanding Actress in a Comedy Series. She also has appeared in the films Hanging Up (2000), I-See-You.Com (2006), and Daddy's Little Girls (2007), before returning to television playing Dr. Carla Reed on the BET sitcom Reed Between the Lines (2011), for which she received her third NAACP Image Award.\n\nFrom 2014 to 2022, Ross starred as Dr. Rainbow Johnson in the ABC comedy series, Black-ish. Her work on it has earned her six NAACP Image Awards and a Golden Globe Award for Best Actress – Television Series Musical or Comedy. She has also received nominations for two Critics' Choice Television Awards and five Primetime Emmy Awards for Outstanding Lead Actress in a Comedy Series. In 2019, she co-created a prequel spin-off of Black-ish titled Mixed-ish. In 2020, she starred in and recorded the soundtrack album for the musical film The High Note.\n\nDescription above from the Wikipedia article Tracee Ellis Ross, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1972-10-29",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 74611,
        "imdb_id": "nm0743896",
        "known_for_department": "Acting",
        "name": "Tracee Ellis Ross",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.5284,
        "profile_path": "/dIaX2VojiARhVpxDkOG9ozvsBB.jpg"
    }
}