{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nk87CtgZ7wd86W37oJHGYAJbmLz.jpg",
                "genre_ids": [
                    53,
                    9648,
                    80
                ],
                "id": 11644,
                "original_language": "en",
                "original_title": "Blow Out",
                "overview": "While recording sound effects for a slasher flick, Jack Terry stumbles upon a real-life horror: a car careening off a bridge and into a river. Jack jumps into the water and fishes out Sally from the car, but the other passenger is already dead — a governor intending to run for president. As Jack does some investigating of his tapes, and starts a perilous romance with Sally, he enters a tangled web of conspiracy that might leave him dead.",
                "popularity": 2.8983,
                "poster_path": "/weMW1wLzeagP3tw6BfmYf1iL7dz.jpg",
                "release_date": "1981-07-24",
                "title": "Blow Out",
                "video": false,
                "vote_average": 7.374,
                "vote_count": 1561,
                "character": "Betty",
                "credit_id": "5cc48cd4c3a36820b581d977",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Robin Sherwood is an American actress. She was born in Miami Beach,  Florida to the Hon. Wolfie Cohen, a two-term city councilman and  successful restaurateur, and Miriam Rose Cohen a prominent society  hostess. The family lived in Miami Beach, Florida during the fall and  winter and traveled in Europe during the spring and summer. She first  appeared on stage when she was nine years old.\n\nShe lost her  mother at the age of 11 to Ovarian Cancer and subsequently navigated  adolescence on her own. Without a mother to guide her, she learned about  becoming a woman and a lady through watching movies, and reading  classic romantic literature such as Jane Austen, the Bronte Sisters,  Emily Dickinson and Lord Byron. By being brought up in a household with  all men Robin learned about life as a woman through her imagination. She  would later draw on her self-formed nature to create her acting roles.\n\nRobin  signed with a talent agency in Miami, Florida at the age of 14. Already  a great beauty, the resulting contract landed her a national television  commercial, fashion modeling assignments in Glamour Magazine and on the  runway for designer Oleg Cassini.\n\nThrough  Sarah Lawrence college in New York, she studied acting in London,  England. Robin performed the leading roles in both musical comedies,  Guys and Dolls as Sarah Brown to Sky Masterson played by Jeff Zinn  (founder of the Wellfleet Harbor Actors Theater), and Philia in Funny  Thing Happened on the Way to the Forum for the North Country Players New  England summer repertory theater, under the direction of Ron Bennett.\n\nRobin made her movie debut in independent films. She appeared briefly in the Bill Murray comedy Coming Attractions (1980). Soon her resume began to grow with a role in Outside Chance (1978) a CBS movie of the week with Yvette Mimieux. She arrived as a leading lady, with the David Schmoeller iconic mystery/horror film Tourist Trap (1979), which she starred in with Chuck Connors.\n\nShe then moved into major motion pictures, at MGM Studios, director Martin Davidson saw a photograph of her on the wall of the studio's art director and cast Sherwood in a small role in the romantic comedy, Hero at Large (1980) with John Ritter.  Immediately following, showing a keen comedic talent, she was  delightful as a Marin County hippie feminist, in a supporting role  opposite Tuesday Weld in Serial (1980) for Paramount. She then was given the chance to work with director Brian De Palma in a scene stealing cameo role with John Travolta in Blow Out (1981) for Columbia Studios. Her break-through role came when she signed to star opposite Charles Bronson as his emotionally traumatized daughter in the high profile, box office hit, Death Wish II (1982) for MGM, directed by Michael Winner.\n\nShe  was showered with accolades for her performance as the muted daughter  in Death Wish II and singled out for her beauty on screen by Vincent Canby of the New York Times. Her talent and beauty made her an international box office star.",
        "birthday": "1952-01-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 74682,
        "imdb_id": "nm0792848",
        "known_for_department": "Acting",
        "name": "Robin Sherwood",
        "place_of_birth": "Miami Beach - Florida - USA",
        "popularity": 0.1305,
        "profile_path": "/suEapDhDsMzBWnaAIddfZmuTCH1.jpg"
    }
}