{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hZkgoQYus5vegHoetLkCJzb17zJ.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 550,
                "original_language": "en",
                "original_title": "Fight Club",
                "overview": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.",
                "popularity": 21.4235,
                "poster_path": "/jSziioSwPVrOy9Yow3XhWIBDjq1.jpg",
                "release_date": "1999-10-15",
                "title": "Fight Club",
                "video": false,
                "vote_average": 8.438,
                "vote_count": 30752,
                "character": "Robert Paulson",
                "credit_id": "52fe4250c3a36847f80149ff",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/a53EGF0NzHRGKuRItsrtXBM8FCD.jpg",
                "genre_ids": [
                    35,
                    878,
                    14,
                    27
                ],
                "id": 36685,
                "original_language": "en",
                "original_title": "The Rocky Horror Picture Show",
                "overview": "After getting a flat tire in the middle of nowhere, newly engaged couple Brad and Janet encounter the eerie mansion of the flamboyant, seductive Dr. Frank-N-Furter and a variety of eccentric characters. Through elaborate dance and rock music, the mad scientist unveils his latest creation: a perfect, muscular man.",
                "popularity": 5.5733,
                "poster_path": "/3pyE6ZqDbuJi7zrNzzQzcKTWdmN.jpg",
                "release_date": "1975-08-14",
                "title": "The Rocky Horror Picture Show",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 2953,
                "character": "Eddie",
                "credit_id": "52fe46029251416c91045ee3",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Meat Loaf Aday",
            "Marvin Lee Aday",
            "Meatloaf",
            "Michael Lee Aday",
            "میت لوف"
        ],
        "biography": "Michael Lee Aday, better known as Meat Loaf, was an American singer and actor. He was noted for his powerful, wide-ranging voice and theatrical live shows. His Bat Out of Hell trilogy—Bat Out of Hell, Bat Out of Hell II: Back into Hell, and Bat Out of Hell III: The Monster Is Loose—has sold more than 65 million albums worldwide. More than four decades after its release, the first album still sells an estimated 200,000 copies annually and stayed on the charts for over nine years, making it one of the best-selling albums in history.\n\nAfter the commercial success of Bat Out of Hell and Bat Out of Hell II: Back Into Hell, and earning a Grammy Award for Best Solo Rock Vocal Performance for the song \"I'd Do Anything for Love\", Meat Loaf nevertheless experienced some difficulty establishing a steady career within the United States. This did not stop him from becoming one of the best-selling music artists of all time, with worldwide sales of more than 80 million records. The key to this success was his retention of iconic status and popularity in Europe, especially the United Kingdom, where he received the 1994 Brit Award for best-selling album and single, appeared in the 1997 film Spice World, and ranks 23rd for the number of weeks spent on the UK charts, as of 2006. He ranks 96th on VH1's \"100 Greatest Artists of Hard Rock\".\n\nAday appeared in over 50 movies and television shows, sometimes as himself or as characters resembling his stage persona. His film roles include Eddie in The Rocky Horror Picture Show (1975), and Bob Paulson in Fight Club (1999). His early stage work included dual roles in the original Broadway cast of The Rocky Horror Show, and he also appeared in the musical Hair, both on- and off-Broadway.",
        "birthday": "1947-09-27",
        "deathday": "2022-01-20",
        "gender": 2,
        "homepage": "http://www.meatloaf.net",
        "id": 7470,
        "imdb_id": "nm0001533",
        "known_for_department": "Acting",
        "name": "Meat Loaf",
        "place_of_birth": "Dallas, Texas, USA",
        "popularity": 0.6176,
        "profile_path": "/7gKLR1u46OB8WJ6m06LemNBCMx6.jpg"
    }
}