{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1RWLMyC9KcFfcaoViMiJGSSZzzr.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 100402,
                "original_language": "en",
                "original_title": "Captain America: The Winter Soldier",
                "overview": "After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America is living quietly in Washington, D.C. and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy—the Winter Soldier.",
                "popularity": 8.6751,
                "poster_path": "/tVFRpFw3xTedgPGqxW0AOI8Qhh0.jpg",
                "release_date": "2014-03-20",
                "title": "Captain America: The Winter Soldier",
                "video": false,
                "vote_average": 7.655,
                "vote_count": 19406,
                "character": "Georges Batroc",
                "credit_id": "52fe49d8c3a36847f81a95b7",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "GSP",
            "Rush"
        ],
        "biography": "Georges St-Pierre was born on May 19, 1981 in Saint-Isidore, Quebec, to Jim and Paulyne St-Pierre. St-Pierre had a difficult childhood, attending a school where others would steal his clothes and money. He started learning Kyokushin karate at age seven from his father and later from a Kyokushin Karate Master to defend himself against a school bully. He took up wrestling and Brazilian Jiu-Jitsu after his karate teacher died and also trained in boxing. Before turning pro as a mixed-martial artist, St-Pierre worked as a bouncer at a Montreal night club in the South Shore called Fuzzy Brossard and as a garbageman for six months to pay for his school fees.\n\nSt-Pierre has trained with a number of groups in a large variety of gyms throughout his fighting career. Prior to his fight with B.J. Penn at UFC 58, he trained at the Renzo Gracie Jiu-Jitsu Academy in New York City. St-Pierre received his brown belt in BJJ from Renzo Gracie on July 21, 2006. In September 2008, St-Pierre earned his black belt in Brazilian Jiu-Jitsu under Bruno Fernandes.",
        "birthday": "1981-05-19",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.gspofficial.com/",
        "id": 74750,
        "imdb_id": "nm2017048",
        "known_for_department": "Acting",
        "name": "Georges St-Pierre",
        "place_of_birth": "Saint-Isidore, Québec, Canada",
        "popularity": 0.7331,
        "profile_path": "/1gRSxCOOf9jxJdGtYNi5FPoXS9l.jpg"
    }
}