{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yCnJT53HMXAK87xzPAdjdYhZ3JE.jpg",
                "genre_ids": [
                    18,
                    9648,
                    878
                ],
                "id": 1124,
                "original_language": "en",
                "original_title": "The Prestige",
                "overview": "A mysterious story of two magicians whose intense rivalry leads them on a life-long battle for supremacy -- full of obsession, deceit and jealousy with dangerous and deadly consequences.",
                "popularity": 11.832,
                "poster_path": "/2ZOzyhoW08neG27DVySMCcq2emd.jpg",
                "release_date": "2006-10-17",
                "title": "The Prestige",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 16794,
                "character": "Tesla",
                "credit_id": "52fe42e8c3a36847f802bf3b",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/rBqdcQeM1h05YjF9rFtPWnNaDO2.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11051,
                "original_language": "en",
                "original_title": "The Last Temptation of Christ",
                "overview": "Jesus, a humble Judean carpenter beginning to see that he is the son of God, is drawn into revolutionary action against the Roman occupiers by Judas -- despite his protestations that love, not violence, is the path to salvation. The burden of being the savior of mankind torments Jesus throughout his life, leading him to doubt.",
                "popularity": 3.0063,
                "poster_path": "/7L4qwrC1mipZXJfU5oRgQWChLv1.jpg",
                "release_date": "1988-05-28",
                "title": "The Last Temptation of Christ",
                "video": false,
                "vote_average": 7.228,
                "vote_count": 1125,
                "character": "Pontius Pilatus",
                "credit_id": "52fe43eb9251416c75023195",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/tg33XbGTPvHLan2UaDtF4M95Rx4.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9589,
                "original_language": "de",
                "original_title": "Christiane F. - Wir Kinder vom Bahnhof Zoo",
                "overview": "This movie portrays the drug scene in Berlin in the 70s, following tape recordings of Christiane F. 14 years old Christiane lives with her mother and little sister in a typical multi-storey apartment building in Berlin. She's fascinated by the 'Sound', a new disco with most modern equipment. Although she's legally too young, she asks a friend to take her. There she meets Detlef, who's in a clique where everybody's on drugs. Step by step she gets drawn deeper into the scene.",
                "popularity": 4.1366,
                "poster_path": "/gDnWMZ8d39KwmweE4OK5P7ph4OL.jpg",
                "release_date": "1981-04-02",
                "title": "Christiane F.",
                "video": false,
                "vote_average": 7.332,
                "vote_count": 1379,
                "character": "David Bowie",
                "credit_id": "52fe450ec3a36847f80b9aff",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/92tb8mgjgL1S2KwrZezyPHPkQ3R.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14
                ],
                "id": 13597,
                "original_language": "en",
                "original_title": "Labyrinth",
                "overview": "When Sarah is forced to babysit her half-brother Toby, she inadvertently summons the Goblin King who whisks Toby away to his castle at the center of a labyrinth. Sarah enters into a bargain with the Goblin King where she is given just thirteen hours to solve the labyrinth and rescue Toby, or else lose him forever.",
                "popularity": 5.8337,
                "poster_path": "/hbSdA1DmNA9IlfVoqJkIWYF2oYm.jpg",
                "release_date": "1986-06-27",
                "title": "Labyrinth",
                "video": false,
                "vote_average": 7.276,
                "vote_count": 2570,
                "character": "Jareth",
                "credit_id": "52fe457f9251416c750588e5",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/g5G19q0xgkzWEvfcGo1KcL8nQOk.jpg",
                "genre_ids": [
                    18,
                    9648,
                    27
                ],
                "id": 1923,
                "original_language": "en",
                "original_title": "Twin Peaks: Fire Walk with Me",
                "overview": "In the questionable town of Deer Meadow, Washington, FBI Agent Desmond inexplicably disappears while hunting for the man who murdered a teen girl. The killer is never apprehended, and, after experiencing dark visions and supernatural encounters, Agent Dale Cooper chillingly predicts that the culprit will claim another life. Meanwhile, in the more cozy town of Twin Peaks, hedonistic beauty Laura Palmer hangs with lowlifes and seems destined for a grisly fate.",
                "popularity": 7.5606,
                "poster_path": "/rol5H6loAojd6tH2VXQYEXzGQk1.jpg",
                "release_date": "1992-06-03",
                "title": "Twin Peaks: Fire Walk with Me",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 2083,
                "character": "Phillip Jeffries",
                "credit_id": "593ca0a592514105b701526c",
                "order": 5
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/92tb8mgjgL1S2KwrZezyPHPkQ3R.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14
                ],
                "id": 13597,
                "original_language": "en",
                "original_title": "Labyrinth",
                "overview": "When Sarah is forced to babysit her half-brother Toby, she inadvertently summons the Goblin King who whisks Toby away to his castle at the center of a labyrinth. Sarah enters into a bargain with the Goblin King where she is given just thirteen hours to solve the labyrinth and rescue Toby, or else lose him forever.",
                "popularity": 5.8337,
                "poster_path": "/hbSdA1DmNA9IlfVoqJkIWYF2oYm.jpg",
                "release_date": "1986-06-27",
                "title": "Labyrinth",
                "video": false,
                "vote_average": 7.276,
                "vote_count": 2570,
                "credit_id": "65e70e6a6332f7017c91b4fd",
                "department": "Sound",
                "job": "Songs"
            },
            {
                "adult": false,
                "backdrop_path": "/7tWktnLQ81G8pHUkhuTebcTkcB3.jpg",
                "genre_ids": [
                    12,
                    35,
                    18
                ],
                "id": 421,
                "original_language": "en",
                "original_title": "The Life Aquatic with Steve Zissou",
                "overview": "Renowned oceanographer Steve Zissou has sworn vengeance upon the rare shark that devoured a member of his crew. In addition to his regular team, he is joined on his boat by Ned, a man who believes Zissou to be his father, and Jane, a journalist pregnant by a married man. They travel the sea, all too often running into pirates and, perhaps more traumatically, various figures from Zissou's past, including his estranged wife, Eleanor.",
                "popularity": 3.1469,
                "poster_path": "/qZoFLNBC78jzboWeDH6Ha0qavF2.jpg",
                "release_date": "2004-12-10",
                "title": "The Life Aquatic with Steve Zissou",
                "video": false,
                "vote_average": 7.077,
                "vote_count": 3018,
                "credit_id": "64b16a3ed236e600ad6c27da",
                "department": "Sound",
                "job": "Songs"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Robert Jones ",
            "Tin Machine",
            "David Jones",
            "Davie Jones",
            "Ziggy Stardust"
        ],
        "biography": "David Robert Jones, known professionally as David Bowie, was an English singer, songwriter and actor. He was a figure in popular music for over five decades, regarded by critics and musicians as an innovator, particularly for his work in the 1970s. His career was marked by reinvention and visual presentation, his music and stagecraft significantly influencing popular music. During his lifetime, his record sales, estimated at 140 million worldwide, made him one of the world's best-selling music artists. In the UK, he was awarded nine platinum album certifications, eleven gold and eight silver, releasing eleven number-one albums. In the US, he received five platinum and seven gold certifications. He was inducted into the Rock and Roll Hall of Fame in 1996. Born and raised in South London, Bowie developed an interest in music as a child, eventually studying art, music and design before embarking on a professional career as a musician in 1963. “Space Oddity” became his first top-five entry on the UK Singles Chart after its release in July 1969. After a period of experimentation, he re-emerged in 1972 during the glam rock era with his flamboyant and androgynous alter ego Ziggy Stardust. The character was spearheaded by the success of his single “Starman” and album The Rise and Fall of Ziggy Stardust and the Spiders from Mars, which won him widespread popularity. In 1975, Bowie's style shifted radically towards a sound he characterized as “plastic soul,” initially alienating many of his UK devotees but garnering him his first major US crossover success with the number-one single “Fame” and the album Young Americans. In 1976, Bowie starred in the cult film The Man Who Fell to Earth and released Station to Station. The following year, he further confounded musical expectations with the electronic-inflected album Low (1977), the first of three collaborations with Brian Eno that would come to be known as the Berlin Trilogy. Heroes (1977) and Lodger (1979) followed; each album reached the UK top five and received lasting critical praise. After uneven commercial success in the late 1970s, Bowie had UK number ones with the 1980 single “Ashes to Ashes,” its parent album Scary Monsters (and Super Creeps), and “Under Pressure,” a 1981 collaboration with Queen. He then reached his commercial peak in 1983 with Let's Dance, with its title track topping both UK and US charts. Throughout the 1990s and 2000s, Bowie continued to experiment with musical styles, including industrial and jungle. Bowie also continued acting; his roles included Major Celliers in Merry Christmas, Mr. Lawrence (1983), the Goblin King Jareth in Labyrinth (1986), Pontius Pilate in The Last Temptation of Christ (1988), and Nikola Tesla in The Prestige (2006), among other film and television appearances and cameos. He stopped concert touring after 2004 and his last live performance was at a charity event in 2006. In 2013, Bowie returned from a decade-long recording hiatus with the release of The Next Day. He remained musically active until he died of liver cancer two days after the release of his final album, Blackstar (2016).",
        "birthday": "1947-01-08",
        "deathday": "2016-01-10",
        "gender": 2,
        "homepage": "https://www.davidbowie.com",
        "id": 7487,
        "imdb_id": "nm0000309",
        "known_for_department": "Acting",
        "name": "David Bowie",
        "place_of_birth": "London, England, UK",
        "popularity": 0.7259,
        "profile_path": "/7OIa363iSLG43x9Sb9HojUANwbh.jpg"
    }
}