{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1lVzpmCxVd7SNSswEIfFND4I2si.jpg",
                "genre_ids": [
                    35,
                    53
                ],
                "id": 596054,
                "original_language": "es",
                "original_title": "La odisea de los giles",
                "overview": "In a town in the Northwest of the province of Buenos Aires, a group of neighbors is organized to recover the economy of the area, but when the corralito is implemented in the country and they suffer a fraud, their hopes disappear. Now, they will unite to recover the lost money and give the blow of their lives to their greatest enemy.",
                "popularity": 1.7786,
                "poster_path": "/9MaAzW8sERDcIEYORE7jzeCew3P.jpg",
                "release_date": "2019-08-15",
                "title": "Heroic Losers",
                "video": false,
                "vote_average": 7.573,
                "vote_count": 584,
                "character": "Antonio Fontana",
                "credit_id": "5cb940a70e0a266b96f279cd",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brandoni was born in Dock Sud, a port community east of Avellaneda. He debuted on the stage in 1962, television in 1963, and on film in 1966. He joined the National Comedy Theater in 1964 under the direction of Luisa Vehil. Politically active in the centrist Radical Civic Union (UCR), he served as cultural policy adviser for President Raúl Alfonsín (1983-89), and was elected to the Argentine Chamber of Deputies in 1993, where he served until 2001.\n\nHe was an unsuccessful Argentine Senate candidate for the UCR in 2005, and for Vice Governor of Buenos Aires Province, with nominee Ricardo Alfonsín, in 2007. He was married to actress Marta Bianchi, and in 2007 married Monica Lopez. An actor with extensive film, television and theatre credits, he portrayed leading roles in acclaimed pictures such as La tregua (1974), Juan que reía (1976), Darse cuenta (1984), Esperando la carroza (1985), Made in Argentina (1986), Cien veces no debo (1990), Convivencia (1993), Una sombra ya pronto serás (1994), De mi barrio con amor (1995), and Los pasos perdidos (2001). His career remained strong during 2011: among his notable theatre credits was his portrayal of former President Arturo Illia; and his notable television credits included a starring role in the Telefé; sitcom, El Hombre de tu vida.\n\nHe earned three Martín Fierro Awards (1970, 1990, and 1993); and an Argentine Film Critics Association Silver Condor awards for Best Actor for his roles in Made in Argentina and Convivencia. Brandoni also served in numerous actors' guilds, including the International Federation of Actors (IFA) as its Vice President between 1974 and 2004.",
        "birthday": "1940-04-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 74896,
        "imdb_id": "nm0104809",
        "known_for_department": "Acting",
        "name": "Luis Brandoni",
        "place_of_birth": "Buenos Aires City, Buenos Aires, Argentina",
        "popularity": 0.1305,
        "profile_path": "/dGW0WpAgEfExaMdt63sQ3r21HAG.jpg"
    }
}