{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fi7gBF2nfIGWF9MuOhuEr6rkgBQ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 18183,
                "original_language": "es",
                "original_title": "Como agua para chocolate",
                "overview": "Tita is passionately in love with Pedro, but her controlling mother forbids her from marrying him. When Pedro marries her sister, Tita throws herself into her cooking and discovers she can transfer her emotions through the food she prepares, infecting all who eat it with her intense heartbreak.",
                "popularity": 2.4756,
                "poster_path": "/itwUdMqLmPfhtGJ44hiDxkqZhiq.jpg",
                "release_date": "1992-04-16",
                "title": "Like Water for Chocolate",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 532,
                "character": "Tita",
                "credit_id": "52fe47669251416c75097f45",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Луми Кавасос",
            "Luz María Cavazos",
            "Luz Maria Cavazos"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nLumi Cavazos (born December 21, 1968) is a Mexican actress who won the Best Actress awards at the Tokyo Film Festival, and Brazil’s Festival de Gramado for her portrayal of \"Tita\" in the 1993 adaptation of Laura Esquivel’s Mexican novel, Like Water for Chocolate. The film grabbed the attention of US film critics and moviegoers, and facilitated her entry into the American film industry. She subsequently relocated to Los Angeles.\n\nBorn in Monterrey, Cavazos began her acting career at the age of 15, and made her film debut in Busi Cortes’ 1988 El Secreto de Romalia. She has acted in numerous Mexican films and television series since then, and has also done a fair amount of work in the U.S., appearing in such television dramas as \"Sugar Town\". Cavazos is sometimes credited as \"Rosita Lumi Cavazos\".\n\nDescription above from the Wikipedia article Lumi Cavazos, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1968-12-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 74940,
        "imdb_id": "nm0004816",
        "known_for_department": "Acting",
        "name": "Lumi Cavazos",
        "place_of_birth": "Monterrey, Nuevo León, México",
        "popularity": 0.244,
        "profile_path": "/tYSFZAIZzaQ3klvFga8DWq8olPX.jpg"
    }
}