{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rN1OKiEp8gNQ9RB6GeZeqOqVsjk.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 26371,
                "original_language": "en",
                "original_title": "Maurice",
                "overview": "After his lover rejects him, Maurice attempts to come to terms with his sexuality within the restrictiveness of Edwardian society.",
                "popularity": 2.1471,
                "poster_path": "/4MI2y8XViPrDiKs1p0QC4bTeZzf.jpg",
                "release_date": "1987-09-18",
                "title": "Maurice",
                "video": false,
                "vote_average": 7.625,
                "vote_count": 573,
                "character": "Dr. Jowitt",
                "credit_id": "5d8a04ab172d7f000d4dee04",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nPhilip \"Phil\" Fox (Edinburgh) is an English film and television actor, known particularly for comic roles. His appearances include Genie in the House, Maurice, People Like Us, Waking the Dead, Maxwell, Midsummer Murders and Foyle's War. He also appeared in the film Venus alongside Peter O'Toole.\n\nHe has also appeared in many children's programmes and has a long association with producer Clive Doig, who cast him in the children's shows Eureka, The Album, Eat Your Words and See It Saw It.\n\nHe has also appeared in very many productions for BBC Radio 4, most notably in a dramatisation of the Terry Pratchett books Mort and Small Gods.\n\nFox played the character Baldrick in the unbroadcast pilot of the Blackadder series, before being replaced by Tony Robinson in the role for the series itself.\n\nDescription above from the Wikipedia article Philip Fox (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 75056,
        "imdb_id": "nm0289194",
        "known_for_department": "Acting",
        "name": "Philip Fox",
        "place_of_birth": null,
        "popularity": 0.1542,
        "profile_path": null
    }
}