{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8G6HCS82vNxgg5wp7oBDSk32XpF.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 558,
                "original_language": "en",
                "original_title": "Spider-Man 2",
                "overview": "Peter Parker is going through a major identity crisis. Burned out from being Spider-Man, he decides to shelve his superhero alter ego, which leaves the city suffering in the wake of carnage left by the evil Doc Ock. In the meantime, Parker still can't act on his feelings for Mary Jane Watson, a girl he's loved since childhood. A certain anger begins to brew in his best friend Harry Osborn as well...",
                "popularity": 8.9995,
                "poster_path": "/aGuvNAaaZuWXYQQ6N2v7DeuP6mB.jpg",
                "release_date": "2004-06-25",
                "title": "Spider-Man 2",
                "video": false,
                "vote_average": 7.295,
                "vote_count": 15734,
                "character": "Elevator Passenger",
                "credit_id": "55ddf2a79251417456003007",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Harry Magee 'Hal' Sparks III (born September 25, 1969) is an American actor, comedian, musician, political commentator, and television personality. He is known for his contributions to VH1, hosting E!'s Talk Soup, and his roles as Michael Novotny on the American TV series Queer as Folk, Donald Davenport in Lab Rats, and as the voice of Tak in Tak and the Power of Juju television series and video games.\n\nAfter a successful run with Second City, he began performing at numerous comedy clubs including The Improv, The Comedy Store, The Laugh Factory and at Comic Relief's American Comedy Festival. For five seasons, he co-starred as Michael on the hit series Queer as Folk. His numerous television appearances include VH1s hit pop culture series I Love the 70s/80s/90s, The Tonight Show, Larry King Live, Charlie Rose, Good Morning America, The View, Politically Incorrect, The Late, Late Show and Hollywood Squares.",
        "birthday": "1969-09-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 75316,
        "imdb_id": "nm0005452",
        "known_for_department": "Acting",
        "name": "Hal Sparks",
        "place_of_birth": "Cincinnati, Ohio, USA",
        "popularity": 0.4332,
        "profile_path": "/sxmESxUf1nFEwheqXAtYDUMJP2s.jpg"
    }
}