{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mujUrk2diGe5vRCb3kdpHZeobRs.jpg",
                "genre_ids": [
                    53
                ],
                "id": 6145,
                "original_language": "en",
                "original_title": "Fracture",
                "overview": "A husband is on trial for the attempted murder of his wife, in what is seemingly an open/shut case for the ambitious district attorney trying to put him away. However, there are surprises for both around every corner, and, as a suspenseful game of cat-and-mouse is played out, each must manipulate and outwit the other.",
                "popularity": 9.9234,
                "poster_path": "/qNen8x5gaikjIg9CFihgxYcJwQe.jpg",
                "release_date": "2007-04-19",
                "title": "Fracture",
                "video": false,
                "vote_average": 7.261,
                "vote_count": 4093,
                "character": "Evidence Room Cop",
                "credit_id": "615ca2a5d144430088cbf0be",
                "order": 48
            },
            {
                "adult": false,
                "backdrop_path": "/7HlX7R8yTSlxqmzMxVemsOEkAfo.jpg",
                "genre_ids": [
                    18
                ],
                "id": 401104,
                "original_language": "en",
                "original_title": "To the Bone",
                "overview": "A young woman dealing with anorexia meets an unconventional doctor who challenges her to face her condition and embrace life.",
                "popularity": 3.7831,
                "poster_path": "/pkdxhdB3dRUqazqoy9lzUvhayjc.jpg",
                "release_date": "2017-01-22",
                "title": "To the Bone",
                "video": false,
                "vote_average": 7.212,
                "vote_count": 3539,
                "character": "Lobo",
                "credit_id": "5949adb0c3a36861db000aa8",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Retta Sirleaf",
            "Marietta Sirleaf",
            "Marietta Sangai Sirleaf"
        ],
        "biography": "Marietta Sirleaf, better known simply as Retta, is an American stand-up comedian and actress. She is mainly known for her starring role as Donna Meagle on NBC's Parks and Recreation. She has appeared in several films and television shows, and has performed stand-up on Comedy Central's Premium Blend.\n\nRetta is from New Jersey, and graduated from Duke University in Durham, North Carolina. She started working in the pharmaceutical research field before moving to Los Angeles, California, to pursue a career in comedy.Retta started performing stand-up comedy in 1996, although she said she did not start \"earning money\" until 1998, when she started touring on the college circuit. Retta said she used to get \"really nauseated\" before a performance, but that the feeling passed with experience.Retta has said her stand-up material tends to be slightly embellished stories from her regular everyday life, family, and friends. She has also made jokes about her obesity. Retta has stated she would give up stand-up comedy for a full-time acting career if possible: \"I'm not married to stand-up, just because it's a road thing. It's very lonely with all the traveling.",
        "birthday": "1978-07-12",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.celebritytalent.net/sampletalent/16264/retta/",
        "id": 75318,
        "imdb_id": "nm0802876",
        "known_for_department": "Acting",
        "name": "Retta",
        "place_of_birth": "New Jersey, U.S.",
        "popularity": 0.674,
        "profile_path": "/bIo8tjdn48wIPEdcJ0UCqqTzClV.jpg"
    }
}