{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ftNimlo6fP4WKRMWnF1ghX4fPUy.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 6620,
                "original_language": "en",
                "original_title": "Sabrina",
                "overview": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work – busily running the family corporate empire, he has no time for a wife and family. David is all play – technically he is employed by the family business, but never shows up for work, spends all his time entertaining, and has been married and divorced three times. Meanwhile, Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who goes away to Paris for two years, and returns to capture David's attention, while falling in love with Linus.",
                "popularity": 3.8978,
                "poster_path": "/86ix9wBxiMAaISt4HpmXQm6Mlym.jpg",
                "release_date": "1954-09-01",
                "title": "Sabrina",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 1294,
                "character": "Spiller's Girlfriend (uncredited)",
                "credit_id": "561155989251410d80004a8c",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marian Ellen Ross"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMarion Ross (born October 25, 1928) is an American actress best known for her role as Marion Cunningham on the ABCtelevision series, Happy Days from 1974 to 1984.Born Marian Ross in Watertown in Carver County in southern Minnesota, the daughter of Ellen (née Hamilton) and Gordon Ross,she lived in Waconia and then moved to Willmar and eventually to Albert Lea, Minnesota.At the age of 13, she changed the spelling of her name from \"Marian\" to \"Marion\" because she thought it would look better on a marquee. After completing her sophomore year in high school, she moved to Minneapolis, Minnesota, and worked as an au pair while studying drama at the MacPhail Center for the Arts, and attending Southwest High School. A year later, her family moved to San Diego, California.She graduated from Point Loma High School in San Diego.Ross enrolled in San Diego State University,where she was named the school's most outstanding actress. After graduation in 1950, she performed in summer theater in La Jolla, California. The director was impressed by her talent, and recommended that she try for work in films.",
        "birthday": "1928-10-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 75355,
        "imdb_id": "nm0005385",
        "known_for_department": "Acting",
        "name": "Marion Ross",
        "place_of_birth": "Watertown, Carver County, Minnesota, USA",
        "popularity": 1.1635,
        "profile_path": "/eZpOYvFoJnej8n7aKSi2LVvvlQu.jpg"
    }
}