{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vzavBt9c6v4zBaGiwQDO21aNQG9.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 11046,
                "original_language": "en",
                "original_title": "Where Eagles Dare",
                "overview": "World War II is raging, and an American general has been captured and is being held hostage in the Schloss Adler, a Bavarian castle that's nearly impossible to breach. It's up to a group of skilled Allied soldiers to liberate the general before it's too late.",
                "popularity": 6.8612,
                "poster_path": "/dnyiVS4Ad4w4rfS4Bm1YalEdonx.jpg",
                "release_date": "1968-12-04",
                "title": "Where Eagles Dare",
                "video": false,
                "vote_average": 7.514,
                "vote_count": 928,
                "character": "Carpenter",
                "credit_id": "52fe43eb9251416c75022f9b",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vincent Martin Ball"
        ],
        "biography": "Vincent Martin Ball OAM (born 4 December 1923) is an Australian-born retired character actor of radio, stage and screen, active in the industry for nearly 55 years (with a brief return) firstly in Britain and then his native Australia. He has also authored a number of books.\n\nHe is best known for film roles in British and Australian films and TV movies, including A Town Like Alice, Breaker Morant, Phar Lap, Muriel's Wedding and The Man Who Sued God. He appeared in numerous TV roles, primarily in cameo guest roles, but had recurring roles in serials like Rush, The Young Doctors, A Country Practice and Home and Away.\n\nVincent Ball has also worked variously in theatre, including Shakespeare, with productions of Henry IV and Romeo and Juliet and a musical based on Charles Dickens famous novel Great Expectations.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1923-12-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 75395,
        "imdb_id": "nm0050482",
        "known_for_department": "Acting",
        "name": "Vincent Ball",
        "place_of_birth": "Wee Waa, New South Wales, Australia",
        "popularity": 0.4898,
        "profile_path": "/jIKae3BQSyZ1IKdsHc7eT2IPYDy.jpg"
    }
}