{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dLL90vskYFn1S89RZp5TUguK9wl.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 4982,
                "original_language": "en",
                "original_title": "American Gangster",
                "overview": "Loosely based on the criminal career of Frank Lucas, a gangster from La Grange, North Carolina, who smuggled heroin into the United States on American service planes returning from the Vietnam War, before being detained by a task force led by Newark Detective Richie Roberts.",
                "popularity": 7.5255,
                "poster_path": "/8sV6nWuKczuXRt0C6EWoXqJAj6G.jpg",
                "release_date": "2007-11-02",
                "title": "American Gangster",
                "video": false,
                "vote_average": 7.591,
                "vote_count": 5725,
                "character": "Alfonso Abruzzo",
                "credit_id": "52fe43ebc3a36847f80783ff",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/ihdFypo7MyfJvDSjK7Sbnsjhu8H.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 109424,
                "original_language": "en",
                "original_title": "Captain Phillips",
                "overview": "The true story of Captain Richard Phillips and the 2009 hijacking by Somali pirates of the US-flagged MV Maersk Alabama, the first American cargo ship to be hijacked in two hundred years.",
                "popularity": 5.8353,
                "poster_path": "/2x8ida0rHokUv80Ah4eBNb2eXas.jpg",
                "release_date": "2013-10-10",
                "title": "Captain Phillips",
                "video": false,
                "vote_average": 7.538,
                "vote_count": 7173,
                "character": "Captain Frank Castellano",
                "credit_id": "52fe4ab5c3a36847f81dd52d",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/syapU4X3vYBCdARyAOtz3g90hMt.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1900,
                "original_language": "en",
                "original_title": "Traffic",
                "overview": "An exploration of the United States of America's war on drugs from multiple perspectives. For the new head of the Office of National Drug Control Policy, the war becomes personal when he discovers his well-educated daughter is abusing cocaine within their comfortable suburban home. In Mexico, a flawed, but noble policeman agrees to testify against a powerful general in league with a cartel, and in San Diego, a drug kingpin's sheltered trophy wife must learn her husband's ruthless business after he is arrested, endangering her luxurious lifestyle.",
                "popularity": 5.291,
                "poster_path": "/v6YrfR1e2OUAYbXrJ7hv3EiGNcg.jpg",
                "release_date": "2000-12-27",
                "title": "Traffic",
                "video": false,
                "vote_average": 7.081,
                "vote_count": 2261,
                "character": "Tigrillo / Obregón Assassin",
                "credit_id": "5f84717125b955003529db24",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yul Vázquez",
            "Yul Vasquez",
            "이얼 바즈퀫즈"
        ],
        "biography": "Yul Vázquez was born in Cuba. He is an actor and he is married to Linda Larkin. He has appeared as “Bob” in the Seinfeld episodes “The Soup Nazi”, “The Sponge” and “The Puerto Rican Day”.\n\nYUL VÁZQUEZ has appeared in over thirty films including “The A-Team” (2010) with Liam Neeson, John Sayles' Amigo, Steven Soderbergh’s two-part epic “Che” (2008), “The Take” (2008), “American Gangster” (2007- SAG Award nomination, Outstanding Cast), “Music Within” (2007), \"War of the Worlds\" (2005), “Bad Boys 2” (2003), \"Traffic\" (2000- Winner, SAG Award, Outstanding Cast), and \"Runaway Bride\" (1999). An original member of LAByrinth Theater Company, Vazquez has appeared in countless LAB productions, including Stephen Adly Guirgis’ “The Last Days of Judas Iscariot”, directed by Phillip Seymour Hoffman. Other theater includes Terrence McNally’s “The Stendhal Syndrome” at Primary Stages With Isabella Rossellini, and Eduardo Machado’s “The Floating Island Plays” at Mark Taper Forum. Upcoming feature films include “Fugly!” with John Leguizamo, “Salvation Boulevard” with Pierce Brosnan and \"The Missing Person\", which premiered at the 2009 Sundance Film Festival. Vazquez will be returning to the stage in the Broadway premiere of \"Motherf**ker With The Hat\" which also boasts the talents of Bobby Cannavale, Annabella Sciorra and comic Chris Rock (previews March 22, 2011).\n\nYul Vázquez currently serves as co-Artistic Director of LAByrinth Theater Company with Stephen Adly Guirgis & Mimi O'Donnell in New York City. In 2010 Yul Vazquez founded mechanizedmules. A film production company with Ed Vassallo, Rick Rodgers and Robert Leaver. Their first short film F--K premiered at the Tribeca Film Festival in spring of 2010. They are currently in production for their first feature film which is shot in Sugar Hill section of New York City - surrounding the last active graveyard in Manhattan. Trinity Cemetery between 152nd and 155th street on the west side of Manhattan.",
        "birthday": "1965-03-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://yulvazquez.com",
        "id": 75604,
        "imdb_id": "nm0891485",
        "known_for_department": "Acting",
        "name": "Yul Vazquez",
        "place_of_birth": "La Havana, Cuba",
        "popularity": 0.6126,
        "profile_path": "/chAxqgeJVoRoQukw7zRYgtlo4KI.jpg"
    }
}