{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oyatchDPpS4I9jpIIezFJGrmXcR.jpg",
                "genre_ids": [
                    18
                ],
                "id": 499,
                "original_language": "fr",
                "original_title": "Cléo de 5 à 7",
                "overview": "Agnès Varda eloquently captures Paris in the sixties with this real-time portrait of a singer set adrift in the city as she awaits test results of a biopsy. A chronicle of the minutes of one woman’s life, Cléo from 5 to 7 is a spirited mix of vivid vérité and melodrama, featuring a score by Michel Legrand and cameos by Jean-Luc Godard and Anna Karina.",
                "popularity": 2.995,
                "poster_path": "/oelBStY4xpguaplRv15P3Za7Xsr.jpg",
                "release_date": "1962-04-11",
                "title": "Cléo from 5 to 7",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 727,
                "character": "Florence 'Cléo' Victoire",
                "credit_id": "52fe424ac3a36847f8012c65",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Denise Marie Renée Marchand",
            "Коринн Маршан"
        ],
        "biography": "Blonde Corrine Marchand began her career as a vocalist, singing in nightclubs, operettas and revues. In addition, she was a successful photographic model who eventually made her motion picture debut as an oriental dancer in Cadet Rousselle (1954). After several years playing minor parts, she hit the big time as the sad, pensive titular protagonist of Agnès Varda's Cléo from 5 to 7 (1962). In the role of the beautiful, vain and superstitious Parisian pop singer Cléo Victoire who confronts her mortality, Marchand was spot-on casting and gave a performance which is still regarded as iconic in the French New Wave cinema of the sixties. 'Cleo' was further enhanced by Marchand's charming rendition of Michel Legrand's \"Sans Toi\", \"La Joyeuse\" and \"La Menteuse\". The actress never had another role to match this, despite significant leads in several international and French productions like Nunca pasa nada (1963), The Hour of Truth (1965), Les Sultans (1966), the Italo western Man from Nowhere (1966), the dour Charles Bronson thriller Rider on the Rain (1970) and the rollicking gangland crime drama Borsalino (1970).\n\nAside from her work as an actress, Marchand developed a lucrative side project as an apiarist, following her graduation from the Charenton School of Beekeeping",
        "birthday": "1931-12-04",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.newwavefilm.com/french-new-wave-encyclopedia/corinne-marchand.shtml",
        "id": 7565,
        "imdb_id": "nm0545378",
        "known_for_department": "Acting",
        "name": "Corinne Marchand",
        "place_of_birth": "Paris, France",
        "popularity": 0.2001,
        "profile_path": "/8I4ZleBGGTCJ5DAWy8W9TRyfBaB.jpg"
    }
}