{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wP0NGOGf2PG4lHXHWEqFW0kBOye.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 799766,
                "original_language": "en",
                "original_title": "Better Man",
                "overview": "Follow Robbie Williams' journey from childhood, to being the youngest member of chart-topping boyband Take That, through to his unparalleled achievements as a record-breaking solo artist – all the while confronting the challenges that stratospheric fame and success can bring.",
                "popularity": 5.5975,
                "poster_path": "/fbGCmMp0HlYnAPv28GOENPShezM.jpg",
                "release_date": "2024-12-06",
                "title": "Better Man",
                "video": false,
                "vote_average": 7.737,
                "vote_count": 658,
                "character": "Chris Briggs",
                "credit_id": "644a496da0be280521de7d53",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/s72jkxT7xPbfGxnE1lETq5OywvY.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 283552,
                "original_language": "en",
                "original_title": "The Light Between Oceans",
                "overview": "A lighthouse keeper and his wife living off the coast of Western Australia raise a baby they rescue from an adrift rowboat.",
                "popularity": 3.456,
                "poster_path": "/c9S6VKZPllNgdxBUuI3GYJiqcKO.jpg",
                "release_date": "2016-09-02",
                "title": "The Light Between Oceans",
                "video": false,
                "vote_average": 7.072,
                "vote_count": 1381,
                "character": "Sergeant Vernon Knuckey",
                "credit_id": "575f60389251415e1b00088b",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tony Hayes"
        ],
        "biography": "Anthony Hayes  (born 21 September 1977) is an Australian actor, best known for his role as Jack McLeod in the acclaimed Australian series McLeod's Daughters. Apart from acting in numerous films and television shows, he also wrote, directed and produced the films Ten Empty (2008), New Skin (2002) and Sweet Dreams (2002). Ten Empty had its World Premiere at the Sydney Film Festival (2008). The screenplay was nominated for 2007 Queensland Premier's Literary Awards and 2008 Victorian Premier's Literary Award. New Skin (2002) won the Dendy Award at the 2002 Sydney Film Festival and won Hayes an IF Award as best emerging director. Sweet Dreams (2002) was voted most popular film by the audience at the St Kilda Film Festival in 2003. Hayes also earned AFI and Film Critics Circle award nominations for The Boys. Hayes received AFI and Film Critics Circle award nominations for best supporting actor in The Square (2009), and won for Look Both Ways (2005) and Suburban Mayhem (2006). He is a co-founder of Rogue Stars Productions with fellow actors Brendan Cowell and Leland Kean in 1999. Joel Edgerton nicknamed him \"The King of Western Grit\" during the shoorting of The Square, The moniker later became the name of a Facebook page, with a collection of movie posters with Hayes' face on them.\n\nDescription above from the Wikipedia article Anthony Hayes, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1977-09-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 75711,
        "imdb_id": "nm0370892",
        "known_for_department": "Acting",
        "name": "Anthony Hayes",
        "place_of_birth": "Brisbane, Queensland, Australia",
        "popularity": 0.3251,
        "profile_path": "/pmCzIvd6o15bhmzTZGg45QWKGUn.jpg"
    }
}