{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rAksPS6LjBONzY84szQBz5gGej6.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 566525,
                "original_language": "en",
                "original_title": "Shang-Chi and the Legend of the Ten Rings",
                "overview": "Shang-Chi must confront the past he thought he left behind when he is drawn into the web of the mysterious Ten Rings organization.",
                "popularity": 11.387,
                "poster_path": "/d08HqqeBQSwN8i8MEvpsZ8Cb438.jpg",
                "release_date": "2021-09-01",
                "title": "Shang-Chi and the Legend of the Ten Rings",
                "video": false,
                "vote_average": 7.512,
                "vote_count": 9951,
                "character": "Old Lady on Bus",
                "credit_id": "6669872ea609ee28edbb1ce6",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nLynette Curran is an Australian actress best known for her roles in Australian television series and films. Between 1967 and 1974 she was a regular in soap opera Bellbird. She also acted in the film version of the serial, Country Town (1971).\n\nShe started acting in the theatre in 1964. Theatre work includes The Country Wife, Rookery Nook, Richard II, Just Between Ourselves, and Ashes for the Melbourne Theatre Company. She also played in Steaming for the Seymour Centre in Sydney. Early film roles included Alvin Purple (1973), Caddie (1976), Heatwave (1982). In the late 1970s she made further television appearances, including roles in soap opera Number 96 (in 1976), and in police procedurals Bluey and Cop Shop. Curran was a recurring cast member of soap opera The Restless Years (1977-1981), playing the scheming Jean Stafford. She won a Sammy Award for her role in Australian Broadcasting Corporation series Spring and Fall.\n\nLater roles include feature films The Delinquents, Somersault, and Japanese Story. On television she played Brenda Jackson in the Love My Way, and acted in Underbelly: The Golden Mile.\n\nDescription above from the Wikipedia article Lynette Curran, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1945-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 75710,
        "imdb_id": "nm0192852",
        "known_for_department": "Acting",
        "name": "Lynette Curran",
        "place_of_birth": " Australia",
        "popularity": 0.3485,
        "profile_path": "/iwLuFWwGJc1DL5Yg80Azyr9yg20.jpg"
    }
}