{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fYuWuPZyXSc3s0iPIZ4ZWpEremy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 514439,
                "original_language": "en",
                "original_title": "Breakthrough",
                "overview": "Tragedy strikes when a woman named Joyce's son falls through the ice on a frozen lake and is trapped underwater for over 15 minutes. After being rushed to the hospital, the 14-year-old boy continues to fight for his life as Joyce, her husband and their pastor stay by his bedside and pray for a miracle.",
                "popularity": 5.1141,
                "poster_path": "/lUd2FNC8cMCcHyRMNZtVC48p3xH.jpg",
                "release_date": "2019-04-10",
                "title": "Breakthrough",
                "video": false,
                "vote_average": 7.647,
                "vote_count": 1121,
                "character": "Paula Noble",
                "credit_id": "5ab9e3efc3a36871d200fb58",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/qjhcTGnjxYJqwBGlDzZkYWmne6e.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 614409,
                "original_language": "en",
                "original_title": "To All the Boys: Always and Forever",
                "overview": "Senior year of high school takes center stage as Lara Jean returns from a family trip to Korea and considers her college plans — with and without Peter.",
                "popularity": 2.9588,
                "poster_path": "/iepqdM52f4w75fNcvgRF5QoIAjm.jpg",
                "release_date": "2021-02-12",
                "title": "To All the Boys: Always and Forever",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1998,
                "character": "Mr. Kavinsky's Wife",
                "credit_id": "60268af09d2b63003f68d14a",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lisa Anne Durupt",
            "Lisa Ann Durupt"
        ],
        "biography": "Originally from Winnipeg, Manitoba, Lisa Durupt has established herself as fierce, funny, and fearless talent in film and television.\n\nA talented ice hockey player growing up, she earned a scholarship to an American university until surgery postponed her arrival. On a whim, she registered at the University of Winnipeg and after attending a local performance of A Chorus Line for her theatre class, Lisa traded sports for the arts and went on to study theatre at the University of Winnipeg and the Canadian College of Performing Arts.\n\nLisa's natural athleticism gave her a natural entry into the film industry as a dancer and stunt performer. Following early appearances in films like Shall We Dance and The Lazarus Project, Lisa was cast by Canadian comedy veteran Mark McKinney on the series, Less Than Kind, as the temperamental Shandra. Lisa's unfiltered energy and gift for ad-libbing over four seasons of the show was highlighted by a Gemini Award nomination in 2010 for Best Individual Performance in a Comedy Program or Series and a Leo Award nomination for Best Performance in a Music, Comedy, or Variety Program or Series in 2013.\n\nAfter a string of appearances across film and television projects such as The Pastor's Wife, The Color of Rain, Run for Your Life, and Supernatural, Lisa Durupt won her most substantial cinematic role thus far as the overly competitive sister of Sonja Bennett in Preggoland, a performance that earned Lisa her second Leo Award nomination in 2015 for Best Supporting Performance by a Female in a Motion Picture.\n\nWhile she continues to work steadily on film, Lisa is presently enjoying another steady run on television as Andrea Todd - sister to Alison Sweeney's Hannah Swensen - on Murder She Baked, the Hallmark Channel screen adaptations of the best-selling mystery novel series of the same name.",
        "birthday": "1981-03-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 75821,
        "imdb_id": "nm2120507",
        "known_for_department": "Acting",
        "name": "Lisa Durupt",
        "place_of_birth": "Winnipeg, Manitoba, Canada",
        "popularity": 0.234,
        "profile_path": "/2utVhkZBCac31x32owWntUmfieQ.jpg"
    }
}