{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7NzsBCM8cj53yLEPWYhN0YfGZG.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1630,
                "original_language": "en",
                "original_title": "The People vs. Larry Flynt",
                "overview": "Larry Flynt is the hedonistically obnoxious, but indomitable, publisher of Hustler magazine. The film recounts his struggle to make an honest living publishing his girlie magazine and how it changes into a battle to protect the freedom of speech for all people.",
                "popularity": 2.7647,
                "poster_path": "/sAgHn7ys6TiVXBDTZ0UBEjinIUk.jpg",
                "release_date": "1996-12-25",
                "title": "The People vs. Larry Flynt",
                "video": false,
                "vote_average": 6.963,
                "vote_count": 1166,
                "character": "Althea Leasure",
                "credit_id": "52fe4306c3a36847f8034b75",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/aH5QhlVu7uMnLO9P432IcP8FyCI.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1850,
                "original_language": "en",
                "original_title": "Man on the Moon",
                "overview": "The story of the life and career of eccentric avant-garde comedian, Andy Kaufman.",
                "popularity": 3.8544,
                "poster_path": "/msOZS07xRIFnapwp3fprGbKEAfT.jpg",
                "release_date": "1999-12-22",
                "title": "Man on the Moon",
                "video": false,
                "vote_average": 7.247,
                "vote_count": 1869,
                "character": "Lynne Margulies",
                "credit_id": "52fe431ac3a36847f803a87b",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/30UGnraRdbZl4a8vcfYJPIzvzjM.jpg",
                "genre_ids": [
                    99,
                    10402,
                    10770
                ],
                "id": 319075,
                "original_language": "en",
                "original_title": "Cobain: Montage of Heck",
                "overview": "Hailed as one of the most innovative and intimate documentaries of all time, experience Kurt Cobain like never before in the only ever fully authorized portrait of the famed music icon. Academy Award nominated filmmaker Brett Morgen expertly blends Cobain's personal archive of art, music, never seen before movies, animation and revelatory interviews from his family and closest friends.",
                "popularity": 1.404,
                "poster_path": "/d0DgEvMNrGGlUXqyQ7HJbgnIxO7.jpg",
                "release_date": "2015-03-23",
                "title": "Cobain: Montage of Heck",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 717,
                "character": "Self",
                "credit_id": "54c41749c3a36878fb005c78",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/5ORjzDMq26GI82COSnJngXm5Kww.jpg",
                "genre_ids": [
                    99,
                    18,
                    35
                ],
                "id": 469019,
                "original_language": "en",
                "original_title": "Jim & Andy: The Great Beyond",
                "overview": "Offbeat documentarian Chris Smith provides a behind-the-scenes look at how Jim Carrey adopted the persona of idiosyncratic comedian Andy Kaufman on the set of Man on the Moon.",
                "popularity": 1.1685,
                "poster_path": "/kKzopOFXz9YfsCTqg3XpF0GoypX.jpg",
                "release_date": "2017-09-05",
                "title": "Jim & Andy: The Great Beyond",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 702,
                "character": "Self",
                "credit_id": "5a0fa71692514138e401fed7",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "考特妮·洛夫"
        ],
        "biography": "Courtney Michelle Love (née Harrison; born July 9, 1964) is an American singer, guitarist, songwriter, and actress. A figure in the alternative and grunge scenes of the 1990s, her career has spanned four decades. She rose to prominence as the lead vocalist and rhythm guitarist of the alternative rock band Hole, which she formed in 1989. Love has drawn public attention for her uninhibited live performances and confrontational lyrics, as well as her highly publicized personal life following her marriage to Nirvana frontman Kurt Cobain. In 2020, NME named her one of the most influential singers in alternative culture of the last 30 years.\n\nBorn to countercultural parents in San Francisco, Love had an itinerant childhood, but was primarily raised in Portland, Oregon, where she played in a series of short-lived bands and was active in the local punk scene. After briefly being in a juvenile hall, she spent a year living in Dublin and Liverpool before returning to the United States and pursuing an acting career. She appeared in supporting roles in the Alex Cox films Sid and Nancy (1986) and Straight to Hell (1987) before forming the band Hole in Los Angeles with guitarist Eric Erlandson. The group received critical acclaim from underground rock press for their 1991 debut album, produced by Kim Gordon, while their second release, Live Through This (1994), was met with critical accolades and multi-platinum sales. In 1995, Love returned to acting, earning a Golden Globe Award nomination for her performance as Althea Leasure in Miloš Forman's The People vs. Larry Flynt (1996), which established her as a mainstream actress. The following year, Hole's third album, Celebrity Skin (1998), was nominated for three Grammy Awards.\n\nLove continued to work as an actress into the early 2000s, appearing in big-budget pictures such as Man on the Moon (1999) and Trapped (2002), before releasing her first solo album, America's Sweetheart, in 2004. The subsequent several years were marred with publicity surrounding Love's legal troubles and drug relapse, which resulted in a mandatory lockdown rehabilitation sentence in 2005 while she was writing a second solo album. That project became Nobody's Daughter, released in 2010 as a Hole album but without the former Hole lineup. Between 2014 and 2015, Love released two solo singles and returned to acting in the network series Sons of Anarchy and Empire. In 2020, she confirmed she was writing new music. Love has also been active as a writer; she co-created and co-wrote three volumes of a manga, Princess Ai, between 2004 and 2006, and wrote a memoir, Dirty Blonde: The Diaries of Courtney Love (2006).\n\nDescription above from the Wikipedia article Courtney Love, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1964-07-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 7621,
        "imdb_id": "nm0001482",
        "known_for_department": "Acting",
        "name": "Courtney Love",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.2907,
        "profile_path": "/lIb3gMM1LoE53mHYnMWooBH4mDJ.jpg"
    }
}