{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k3PqsPLkKLDyjZupZ6gqZHPxMv3.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 54138,
                "original_language": "en",
                "original_title": "Star Trek Into Darkness",
                "overview": "When the crew of the Enterprise is called back home, they find an unstoppable force of terror from within their own organization has detonated the fleet and everything it stands for, leaving our world in a state of crisis.  With a personal score to settle, Captain Kirk leads a manhunt to a war-zone world to capture a one man weapon of mass destruction. As our heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Kirk has left: his crew.",
                "popularity": 5.4208,
                "poster_path": "/7XrRkhMa9lQ71RszzSyVrJVvhyS.jpg",
                "release_date": "2013-05-05",
                "title": "Star Trek Into Darkness",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 9342,
                "character": "Thomas Harewood",
                "credit_id": "54691d2ceaeb816b48001896",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Noel Anthony Clarke",
            "Noel Anthony Clark",
            "노엘 클라크"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nNoel Anthony Clarke (born 6 December 1975) is an English actor, director and screenwriter from London. He is best known for playing Wyman Norris in Auf Wiedersehen, Pet and Mickey Smith in Doctor Who. Clarke appeared in and wrote the screenplay for Kidulthood and wrote, directed and starred in the sequel, Adulthood, which gained £1,209,319 from the opening weekend of its release. Clarke studied Media at the University of North London before going on to take acting classes at London’s Actors Centre. Clarke won a BAFTA Orange Rising Star Award in 2009.\n\nDescription above from the Wikipedia article Noel Clarke, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1975-12-06",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.noelclarkeofficial.com",
        "id": 76242,
        "imdb_id": "nm0164929",
        "known_for_department": "Acting",
        "name": "Noel Clarke",
        "place_of_birth": "London, England, UK",
        "popularity": 0.2829,
        "profile_path": "/52vN94YqyTlRTAIGwLmkz6ORMww.jpg"
    }
}