{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ziC23LkMYj8gToQQYQGWSGJCLNF.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 82690,
                "original_language": "en",
                "original_title": "Wreck-It Ralph",
                "overview": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
                "popularity": 15.0327,
                "poster_path": "/zWoIgZ7mgmPkaZjG0102BSKFIqQ.jpg",
                "release_date": "2012-11-01",
                "title": "Wreck-It Ralph",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 12695,
                "character": "Wynnchel (voice)",
                "credit_id": "52fe486b9251416c9108bce9",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nAdam Carolla (born May 27, 1964) is an American radio personality, television host, comedian, and actor. He currently hosts The Adam Carolla Show, a talk show distributed as a podcast on the ACE Broadcasting Network.\n\nCarolla is also known as being the co-host of the radio show Loveline from 1995 to 2005 (and its television incarnation on MTV from 1996 to 2000), as the co-host of the television program The Man Show (1999–2004), and as the co-creator and performer on the television program Crank Yankers (2002–2007).\n\nIn November 2010 Carolla's book In Fifty Years We'll All Be Chicks debuted on the New York Times Best Seller List for hardcover non-fiction.\n\nDescription above from the Wikipedia article Adam Carolla, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1964-05-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 76245,
        "imdb_id": "nm0004805",
        "known_for_department": "Acting",
        "name": "Adam Carolla",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.4268,
        "profile_path": "/47k9w6HRLnGeU0gVtMeTPJs3ief.jpg"
    }
}