{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qBayL198ACrAVX9ixzFPYtqvxQX.jpg",
                "genre_ids": [
                    27
                ],
                "id": 764,
                "original_language": "en",
                "original_title": "The Evil Dead",
                "overview": "In 1979, a group of college students find a Sumerian Book of the Dead in an old wilderness cabin they've rented for a weekend getaway.",
                "popularity": 5.8375,
                "poster_path": "/54C1qdaiSijIU5NeNb4WsPJdNkG.jpg",
                "release_date": "1981-10-15",
                "title": "The Evil Dead",
                "video": false,
                "vote_average": 7.276,
                "vote_count": 4227,
                "character": "Fake Shemp",
                "credit_id": "66186be3af3da6016317fc12",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3336,
                "character": "Fake Shemp",
                "credit_id": "5f809b16d861af0039826db1",
                "order": 33
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3336,
                "credit_id": "671db981fefd1e05100061a0",
                "department": "Writing",
                "job": "Writer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ivan Mitchell Raimi"
        ],
        "biography": "Ivan Mitchell Raimi (born June 21, 1956) is an American emergency medicine physician and screenwriter, and a brother of filmmaker Sam Raimi and actor Ted Raimi. Ivan works as an emergency physician in Chicago, travelling to Los Angeles occasionally to work in Hollywood.\n\nIvan M. Raimi was born in Royal Oak, Michigan. He is the third of five children born to Celia Barbara (née Abrams), who owned lingerie shops, and Leonard Ronald Raimi, who owned home furnishing stores. Ivan was raised in Conservative Judaism, and his ancestors emigrated from Russia and Hungary. His sister remains in Michigan. He is a graduate of Michigan State University and received his medical degree from the Des Moines University medical school in 1984. Raimi then completed an emergency medicine residency at the Southside Medical Center. He is dually board certified by the American Board of Internal Medicine and the American Osteopathic Board of Emergency Medicine.\n\nRaimi sometimes collaborates on projects with brothers Sam Raimi and Ted Raimi, and his work Army of Darkness is the sequel to the horror films The Evil Dead and Evil Dead II. He also co-wrote the comic book adaptation of Army for Dark Horse Comics. His work in the entertainment industry has been sparse due to his primary career as a doctor.\n\nPrior to these successes, Dr. Raimi also contributed to several of the films that his brother Sam had made in his early career. Some of these were amateur efforts produced in suburban Michigan; some of them were professional theatrical efforts like Easy Wheels (though the script was heavily altered from the one the Raimis submitted). They also worked together on The Nutt House, which was, again, heavily altered—so much so that all those who worked on the script used pseudonyms. Raimi was credited as \"Alan Smithee, Sr.\"\n\nRaimi also co-wrote Darkman, a collaboration with Sam that also featured Ted. He created the short-lived television series Spy Game and co-wrote the stories and screenplays for Spider-Man 3 and Drag Me to Hell, both projects directed by Sam Raimi and featuring Ted Raimi.\n\nDescription above from the Wikipedia article Ivan Raimi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1956-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 7629,
        "imdb_id": "nm0706898",
        "known_for_department": "Writing",
        "name": "Ivan Raimi",
        "place_of_birth": "Michigan, USA",
        "popularity": 0.198,
        "profile_path": "/zM7aGM5d9mFOz1GDU4bbuW3Wds7.jpg"
    }
}