{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gSFkUGrgCSDDQpsQ6HbrEQ41tMl.jpg",
                "genre_ids": [
                    12,
                    37,
                    18
                ],
                "id": 11943,
                "original_language": "en",
                "original_title": "Jeremiah Johnson",
                "overview": "A mountain man who wishes to live the life of a hermit becomes the unwilling object of a long vendetta by Indians when he proves to be the match of their warriors in one-to-one combat on the early frontier.",
                "popularity": 9.786,
                "poster_path": "/732cOohUbdH3FCo7lPbYVtbgUot.jpg",
                "release_date": "1972-09-10",
                "title": "Jeremiah Johnson",
                "video": false,
                "vote_average": 7.285,
                "vote_count": 644,
                "character": "Crazy Woman",
                "credit_id": "52fe44a59251416c7503c237",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/p2U4wScUValTXnvikXy7kfQNDsH.jpg",
                "genre_ids": [
                    18,
                    9648,
                    53
                ],
                "id": 891,
                "original_language": "en",
                "original_title": "All the President's Men",
                "overview": "During the 1972 elections, two reporters' investigation sheds light on the controversial Watergate scandal that compels President Nixon to resign from his post.",
                "popularity": 9.3472,
                "poster_path": "/qwdcIdiTAk8iANsJEK2JmrYQx5o.jpg",
                "release_date": "1976-04-09",
                "title": "All the President's Men",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 1928,
                "character": "Carolyn Abbott",
                "credit_id": "63a04dcdbe6d8800d9cd29fa",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Allyn McLerie"
        ],
        "biography": "Allyn Ann McLerie (December 1, 1926 - May 21, 2018) was a Canadian-born, Brooklyn-reared actress, singer, and dancer who worked with many Golden Age musical theatre's major choreographers, including George Balanchine, Agnes de Mille, and Jerome Robbins.  McLerie made her Broadway debut as a teenager in Kurt Weill's One Touch of Venus.  She went on to replace Sono Osato as Ivy in On the Town, then created the role of Amy Spettigue in the 1948 Broadway production of Where's Charley? (Theatre World Award).  Her other Broadway credits include Miss Liberty,  the drama Time Limit, Redhead (understudying Gwen Verdon), and West Side Story. McLerie also danced as a guest soloist with American Ballet Theatre during its 1950-51 European and South American tour.\n\nMcLerie's best-known film appearances are as Amy in Where's Charley? (1952),  Katie Brown in Calamity Jane (1953), Shirley in They Shoot Horses, Don't They? (1969) and as The Crazy Woman in Jeremiah Johnson (1972). Other film work includes Words and Music (1948) and The Desert Song (1952).  She enjoyed a long career as a character actress on television, making frequent guest appearances on shows such as Bonanza, The Waltons, The Love Boat, Barney Miller, Benson, Hart to Hart, St. Elsewhere, and Dynasty, among many others. She played Miss Janet Reubner, Tony Randall's assistant, on The Tony Randall Show from 1976-1978.  McLerie played the recurring role of Arthur Carlson's wife, Carmen on WKRP in Cincinnati (1978–82). She may be best-remembered as Florence Bickford, the title character's mother on The Days and Nights of Molly Dodd from 1987-1991. Her last role was on an episode of Brooklyn Bridge in 1993.\n\nDescription above from the Wikipedia article Allyn Ann McLerie, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1926-12-01",
        "deathday": "2018-05-21",
        "gender": 1,
        "homepage": null,
        "id": 76382,
        "imdb_id": "nm0572885",
        "known_for_department": "Acting",
        "name": "Allyn Ann McLerie",
        "place_of_birth": "Grand-Mère, Quebec, Canada",
        "popularity": 0.5165,
        "profile_path": "/nQjx4EpAkg00mYVdMSFg5fEQMP.jpg"
    }
}