{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aYcnDyLMnpKce1FOYUpZrXtgUye.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 274,
                "original_language": "en",
                "original_title": "The Silence of the Lambs",
                "overview": "Clarice Starling is a top student at the FBI's training academy.  Jack Crawford wants Clarice to interview Dr. Hannibal Lecter, a brilliant psychiatrist who is also a violent psychopath, serving life behind bars for various acts of murder and cannibalism.  Crawford believes that Lecter may have insight into a case and that Starling, as an attractive young woman, may be just the bait to draw him out.",
                "popularity": 3.9428,
                "poster_path": "/uS9m8OBk1A8eM9I042bx8XXpqAq.jpg",
                "release_date": "1991-02-14",
                "title": "The Silence of the Lambs",
                "video": false,
                "vote_average": 8.347,
                "vote_count": 17103,
                "character": "Roden",
                "credit_id": "52fe4230c3a36847f800ae81",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/9BrhCgffilZPr3VOnDAKP9vBrU1.jpg",
                "genre_ids": [
                    18,
                    36,
                    10770
                ],
                "id": 21634,
                "original_language": "en",
                "original_title": "Prayers for Bobby",
                "overview": "Bobby Griffith was his mother's favorite son, the perfect all-American boy growing up under deeply religious influences in Walnut Creek, California. Bobby was also gay. Struggling with a conflict no one knew of, much less understood, Bobby finally came out to his family.",
                "popularity": 3.3916,
                "poster_path": "/1viFwXluAettogGDsTrSUUg29lZ.jpg",
                "release_date": "2009-01-24",
                "title": "Prayers for Bobby",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 599,
                "character": "Reverend Whitsell",
                "credit_id": "52fe4422c3a368484e01168b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/lPLTLCBn39Wiy1RPQLB9xOKyF2v.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 9798,
                "original_language": "en",
                "original_title": "Enemy of the State",
                "overview": "The life of labor lawyer and dedicated family man Robert 'Bobby' Dean is turned upside down after a chance meeting with a college buddy while holiday shopping. Unbeknownst to Dean, he's just been burdened with a videotape of a congressman's assassination. Hot on the trail of this tape is a ruthless group of National Security Agents commanded by a belligerently ambitious NSA official named Reynolds. Using satellite surveillance, bugs, and other sophisticated snooping devices, the NSA infiltrates every facet of Dean's existence, tracing each physical and digital footprint he leaves while also framing him for murder. With the help of the mysterious Brill, he attempts to throw the NSA off his trail and prove his innocence.",
                "popularity": 5.9231,
                "poster_path": "/x9pXrMKLsBGGOFyyZ0Gwt9YpVub.jpg",
                "release_date": "1998-11-20",
                "title": "Enemy of the State",
                "video": false,
                "vote_average": 7.056,
                "vote_count": 4033,
                "character": "Shaffer",
                "credit_id": "52fe452fc3a36847f80c0fc3",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/xmWBhzDODSmYKON4HMmB0UyQknc.jpg",
                "genre_ids": [
                    80,
                    27,
                    53
                ],
                "id": 11454,
                "original_language": "en",
                "original_title": "Manhunter",
                "overview": "FBI Agent Will Graham, who retired after catching Hannibal Lecter, returns to duty to engage in a risky cat-and-mouse game with Lecter to capture a new killer.",
                "popularity": 0.2123,
                "poster_path": "/6rb24x39vV8n5301IelC8rCPJTH.jpg",
                "release_date": "1986-08-14",
                "title": "Manhunter",
                "video": false,
                "vote_average": 7.017,
                "vote_count": 1437,
                "character": "Jimmy Price",
                "credit_id": "58cdeca59251415a45014def",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/vyrCniZsrXZAW08eECKIp1BMLPh.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 50646,
                "original_language": "en",
                "original_title": "Crazy, Stupid, Love.",
                "overview": "Cal Weaver is living the American dream. He has a good job, a beautiful house, great children and a beautiful wife, named Emily. Cal's seemingly perfect life unravels, however, when he learns that Emily has been unfaithful and wants a divorce. Over 40 and suddenly single, Cal is adrift in the fickle world of dating. Enter, Jacob Palmer, a self-styled player who takes Cal under his wing and teaches him how to be a hit with the ladies.",
                "popularity": 7.0883,
                "poster_path": "/p4RafgAPk558muOjnBMHhMArjS2.jpg",
                "release_date": "2011-07-29",
                "title": "Crazy, Stupid, Love.",
                "video": false,
                "vote_average": 7.27,
                "vote_count": 8887,
                "character": "Cal's Boss",
                "credit_id": "5c358a520e0a2654b5d9ecaf",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/7Gzsn4yiwMSXvYcbWXsoDhq8QO2.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 632322,
                "original_language": "en",
                "original_title": "All My Life",
                "overview": "It was a chance meeting started by one of Sol’s friends trying to chat up Jennifer. However, in the end, it was those two who hit it off. Sol enjoyed Jen’s smile, her effort, and how silly she could be. Jen enjoyed Sol’s cooking, his athleticism, and that he would join her in fun moments. As you can imagine, love bloomed, and things got serious. Jen’s investment in Sol led to her pushing him to follow his dreams and even move in to save money. Sol’s investment in Jen well, it led to him proposing. But what started as a liver tumor grew into full-on cancer, so with a diagnosis of 6 months to live, Sol and Jennifer try to make the best of it.",
                "popularity": 3.556,
                "poster_path": "/xoKZ4ZkVApcTaTYlGoZ3J8xcIzG.jpg",
                "release_date": "2020-10-23",
                "title": "All My Life",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 500,
                "character": "Dr. Alan Mendelson",
                "credit_id": "687dc4bbcf7126cd5af7693e",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Daniel Eugene Butler is an American playwright and actor known for his role as Bob \"Bulldog\" Briscoe on the TV series Frasier.\n\nButler was born in Huntington, Indiana and raised in Fort Wayne; the son of Shirley, a homemaker, and Andrew Butler, a pharmacist. Openly gay, he starred in Terrence McNally's 1989 play The Lisbon Traviata and wrote an Off Broadway play about his life, The Only Thing Worse You Could Have Told Me..., which derives its title from a comment Butler's father allegedly made when Dan came out to him.\n\nThough Butler never hid his homosexuality, he disclosed it publicly on Entertainment Tonight in 1994 during his run as a swaggering heterosexual on Frasier.\n\nHis partner is acting teacher and director, Richard Waterhouse.",
        "birthday": "1954-12-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 76470,
        "imdb_id": "nm0124873",
        "known_for_department": "Acting",
        "name": "Dan Butler",
        "place_of_birth": "Huntington, Indiana, USA",
        "popularity": 0.5766,
        "profile_path": "/6RcrSFeqZooY4YZouS2HX5iMUay.jpg"
    }
}