{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pBdQ4iorzRV2G38mdS6rzrmUfMA.jpg",
                "genre_ids": [
                    28,
                    10752
                ],
                "id": 840326,
                "original_language": "fi",
                "original_title": "Sisu",
                "overview": "When an ex-soldier who discovers gold in the Lapland wilderness tries to take the loot into the city, German soldiers led by a brutal SS officer battle him.",
                "popularity": 10.0574,
                "poster_path": "/zehhtcLHnTOE0lw9rLTIRsJeeW2.jpg",
                "release_date": "2022-09-09",
                "title": "Sisu",
                "video": false,
                "vote_average": 7.411,
                "vote_count": 2438,
                "character": "Bruno",
                "credit_id": "6149c6669a9f9a002c3a6222",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/cuodmX7wuVDciUH8LdSFEqoTzIy.jpg",
                "genre_ids": [
                    53,
                    80,
                    28
                ],
                "id": 70670,
                "original_language": "no",
                "original_title": "Hodejegerne",
                "overview": "An accomplished headhunter risks everything to obtain a valuable painting owned by a former mercenary.",
                "popularity": 3.1474,
                "poster_path": "/k5DQqsb9T8djkTAOdwNCBBBHrtK.jpg",
                "release_date": "2011-08-26",
                "title": "Headhunters",
                "video": false,
                "vote_average": 7.247,
                "vote_count": 1288,
                "character": "Roger Brown",
                "credit_id": "52fe4808c3a368484e0e62c9",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/9pubUbDX3eKB6ZuKxbFgv4cBZrz.jpg",
                "genre_ids": [
                    18,
                    12,
                    878
                ],
                "id": 286217,
                "original_language": "en",
                "original_title": "The Martian",
                "overview": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.",
                "popularity": 11.0576,
                "poster_path": "/3ndAx3weG6KDkJIRMCi5vXX6Dyb.jpg",
                "release_date": "2015-09-30",
                "title": "The Martian",
                "video": false,
                "vote_average": 7.689,
                "vote_count": 20427,
                "character": "Alex Vogel",
                "credit_id": "547c8ad89251412d70003329",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Aksel Hennie (born 29 October 1975) is a Norwegian actor, director and writer. He has acted in a number of successful Norwegian movies, and has received several awards.\n\nHennie grew up in Lambertseter in Oslo. In his late teens he was sentenced for graffiti, and became an outcast in the community for confessing to the police. This personal story contributed much of the background for the movie Uno. The conviction against Hennie was in fact one of the first such cases in Norway.\n\nHennie was admitted to the Norwegian National Academy of Theatre after applying four times. He graduated in 2001, and has since acted both at Teatret Vårt in Molde (2001–2002) and at Oslo Nye Teater (2002–), where he has been in plays such as Hamlet, and Kvinnen som giftet seg med en kalkun (English: The woman who married a turkey).\n\nHis main success, however, has been as a film actor. He made his debut starring in the feature film Jonny Vang in 2003. Though the director, Jens Lien, originally thought Hennie was too young for the role, the actor convinced him he was the right man for the film. The same year he also acted in the movies Buddy and Ulvesommer, and the next year he made his debut as a director and writer with the movie Uno, in which he also acted. For this film Hennie, and his co-star Nicolai Cleve Broch, went into hard physical training for six months to perform convincingly as bodybuilders.\n\nHe won the Amanda Award – the main Norwegian film award – for \"Best Direction\" for the movie Uno in 2005, and that same year he was also among the nominees for \"Best Actor\" and \"Best Film\". He also won an Amanda award as \"Best Actor\" for the movie Jonny Vang in 2003. He was named one of European films \"Shooting Stars\" by European Film Promotion in 2004. In 2001 he was also named \"Theatre talent of the year\" by the newspaper Dagbladet. In 2008 Hennie starred in the movie Max Manus, where he played the role of the Norwegian war hero by that name. The movie had a large budget by Norwegian standards, and was met with great expectations. His next upcoming international film is Age of Heroes, a world war 2 movie primarily shot in Norway starring Sean Bean and Danny Dyer.\n\nDescription above from the Wikipedia article Aksel Hennie, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1975-10-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 76547,
        "imdb_id": "nm0377336",
        "known_for_department": "Acting",
        "name": "Aksel Hennie",
        "place_of_birth": "Oslo, Norway",
        "popularity": 0.3161,
        "profile_path": "/sceuNjVXtsHOS3cn0MsLfZRkAQx.jpg"
    }
}