{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iVk4mVKwNE66JbBcoDwcYFvuUXM.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 68734,
                "original_language": "en",
                "original_title": "Argo",
                "overview": "As the Iranian revolution reaches a boiling point, a CIA 'exfiltration' specialist concocts a risky plan to free six Americans who have found shelter at the home of the Canadian ambassador.",
                "popularity": 4.5663,
                "poster_path": "/m5gPWFZFIp4UJFABgWyLkbXv8GX.jpg",
                "release_date": "2012-10-11",
                "title": "Argo",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 8597,
                "character": "Jon Titterton",
                "credit_id": "52fe47a1c3a368484e0d1c21",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Wade Sullivan"
        ],
        "biography": "Sullivan grew up in Longview, Texas, an east Texas town of 70,000 people. He was an imaginative and social child early on in life, his curiosity eventually led him to the stage where he performed in one-act plays at Spring Hill High and proved to be a natural in front of live audiences. Upon high school graduation in 1996. He was offered a theater scholarship at Kilgore Junior College but instead, he accepted an academic scholarship to Baylor University and majored in business, graduating in 2000. During college, he performed in plays, was a member of Delta Tau Delta fraternity, and played one year of football. His talent for acting landed him roles in stage productions by the Baylor theater department. Though never a formal student of acting, much of Sullivan's postgraduate years have been dedicated to small budget films working closely with friends on both sides of the camera.\n\nDavid starred as \"Abe\" in the 2004 independent film Primer, which won the Grand Jury Prize at the 2004 Sundance Film Festival. The movie was filmed in Dallas in 2001, but spent two years in editing and post-production. Since the debut of Primer, Sullivan has moved to Los Angeles to pursue a career as an actor. He has appeared in several television shows including Joey and Big Love, and filmed several movies.\n\nPrimer was Sullivan's first official casting call, and his first leading role in a feature film.",
        "birthday": "1977-04-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 76625,
        "imdb_id": "nm1503383",
        "known_for_department": "Acting",
        "name": "David Sullivan",
        "place_of_birth": "Tyler, Texas, USA",
        "popularity": 0.2088,
        "profile_path": "/vUdSFwbtQJnmvdXgUKq7O6M1FoU.jpg"
    }
}