{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rahJyvdMruvqUmSLWRQKYS57mx8.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 562,
                "original_language": "en",
                "original_title": "Die Hard",
                "overview": "NYPD cop John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when, minutes after he arrives at her offices Christmas Party, the entire building is overtaken by a group of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down.",
                "popularity": 10.081,
                "poster_path": "/aJCpHDC6RoGz7d1Fzayl019xnxX.jpg",
                "release_date": "1988-07-15",
                "title": "Die Hard",
                "video": false,
                "vote_average": 7.801,
                "vote_count": 11674,
                "character": "Holly Gennaro McClane",
                "credit_id": "52fe4252c3a36847f8015447",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/cDtefl7KGnKrDziEUXetMnztvqr.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1573,
                "original_language": "en",
                "original_title": "Die Hard 2",
                "overview": "One year after his heroics in Los Angeles, John McClane is an off-duty cop who is the wrong guy in the wrong place at the wrong time. On a snowy Christmas Eve, as he waits for his wife's plane to land at Washington Dulles International Airport, terrorists take over the air traffic control system in a plot to free a South American army general and drug smuggler being flown into the US to face drug charges. It's now up to McClane to take on the terrorists, while coping with an inept airport police chief, an uncooperative anti-terrorist squad, and the life of his wife and everyone else trapped in planes circling overhead.",
                "popularity": 9.5858,
                "poster_path": "/lDFO7D4MdbhjOwaPwe18QG69Rt0.jpg",
                "release_date": "1990-07-03",
                "title": "Die Hard 2",
                "video": false,
                "vote_average": 6.959,
                "vote_count": 6088,
                "character": "Holly McClane",
                "credit_id": "52fe42ffc3a36847f8032a37",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Бонні Беделіа",
            "بانی بدلیا"
        ],
        "biography": "Bonnie Bedelia (born Bonnie Bedelia Culkin; March 25, 1948) is an American actress. After beginning her career in theatre in the 1960s, Bedelia starred in the CBS daytime soap opera Love of Life and made her film debut in The Gypsy Moths. Bedelia subsequently appeared in the films They Shoot Horses, Don't They?, Lovers and Other Strangers, Heart Like a Wheel, The Prince of Pennsylvania, Die Hard, Presumed Innocent, and Needful Things.\n\nFor her television work, Bedelia has earned two Emmy Awards nominations. From 2001 to 2004, Bedelia played the lead role in the Lifetime television drama series The Division. She later starred as family matriarch Camille Braverman in the NBC drama series Parenthood (2010–2015).\n\nDescription above from the Wikipedia article Bonnie Bedelia, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1948-03-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 7673,
        "imdb_id": "nm0000889",
        "known_for_department": "Acting",
        "name": "Bonnie Bedelia",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.3576,
        "profile_path": "/2dCd7HGOfmn4x7v97EcNIwy12io.jpg"
    }
}