{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xlIxMddSdqyxfY02CilOK4VKWR8.jpg",
                "genre_ids": [
                    10402,
                    18,
                    36
                ],
                "id": 14410,
                "original_language": "en",
                "original_title": "Notorious",
                "overview": "\"Notorious\" is the story of Christopher Wallace. Through raw talent and sheer determination, Wallace transforms himself from Brooklyn street hustler (once selling crack to pregnant women) to one of the greatest rappers of all time: The Notorious B.I.G. Follow his meteoric rise to fame and his refusal to succumb to expectations - redefining our notion of \"The American Dream.\"",
                "popularity": 2.0686,
                "poster_path": "/62NsZPgueSiE8y7dqtU3FSLFwYw.jpg",
                "release_date": "2009-01-16",
                "title": "Notorious",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 748,
                "character": "Christopher 'Biggie' Wallace",
                "credit_id": "52fe45f09251416c75067a1f",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gravy",
            "Jamal 'Gravy' Woolard"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJamal Woolard (born July 8, 1975) is an American rapper and actor best known for portraying The Notorious B.I.G. in the biopic Notorious.\n\nWoolard, like Christopher Wallace (The Notorious B.I.G.), is from Brooklyn, specifically L.G., Lafayette Gardens. In real life he raps under the name \"Gravy\". He is featured in the song \"Untouchable\" by Tupac Shakur on the Pac's Life album.\n\nWoolard was previously known for being shot in the buttocks near radio station Hot 97 in 2006 and giving an interview on the Funkmaster Flex show directly afterwards. His music was later banned from play at the station as a result of a policy that bans \"music by any artist who is involved in an altercation at the station.\"\n\nOn January 16, 2009 he was attending the opening of the film Notorious in Greensboro, North Carolina when a person was shot at approximately 9:00 p.m. The theater was evacuated and closed. The victim was treated at a nearby hospital and released.\n\nDescription above from the Wikipedia article Jamal Woolard, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1975-07-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 76821,
        "imdb_id": "nm2946456",
        "known_for_department": "Acting",
        "name": "Jamal Woolard",
        "place_of_birth": "Brooklyn, New York",
        "popularity": 2.3061,
        "profile_path": "/aQQAuEeRgpJF5XCinGieG7RxSt7.jpg"
    }
}