{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zZvtZZXRnZ4Tdcs0QEWaZZcIWy8.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 567,
                "original_language": "en",
                "original_title": "Rear Window",
                "overview": "A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder.",
                "popularity": 6.1933,
                "poster_path": "/ILVF0eJxHMddjxeQhswFtpMtqx.jpg",
                "release_date": "1954-08-01",
                "title": "Rear Window",
                "video": false,
                "vote_average": 8.349,
                "vote_count": 6829,
                "character": "Lars Thorwald",
                "credit_id": "52fe4253c3a36847f8015811",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raymond William Stacy Burr",
            "Рэймонд Бёрр",
            "Рэймонд Уильям Стейси Берр",
            "Рэймонд Барр"
        ],
        "biography": "Raymond William Stacey Burr was a Canadian actor, primarily known for his title roles in the television dramas Perry Mason and Ironside. His early acting career included roles on Broadway, radio, television and in film, usually as the villain. He won two Emmy Awards in 1959 and 1961 for the role of Perry Mason, which he played for nine seasons between 1957 and 1966. His second hit series, Ironside, earned him six Emmy nominations, and two Golden Globe nominations. He is also known for his role as Steve Martin in both Godzilla, King of the Monsters! and Godzilla 1985.\n\nIn addition to acting, Burr owned an orchid business and had begun to grow a vineyard. He was a collector of wines and art, and was very fond of cooking.\n\nAfter his death from cancer in 1993, Burr's personal life came into question as details of his known biography appeared to be unverifiable. Gradually, it was revealed that Burr had possibly contrived a life story that hid his homosexuality.",
        "birthday": "1917-05-21",
        "deathday": "1993-09-12",
        "gender": 2,
        "homepage": null,
        "id": 7685,
        "imdb_id": "nm0000994",
        "known_for_department": "Acting",
        "name": "Raymond Burr",
        "place_of_birth": "New Westminster, British Columbia, Canada",
        "popularity": 1.0298,
        "profile_path": "/gsmckogOXPIk6lce2qnNMAFF901.jpg"
    }
}