{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2wS8pMZgvzq7kaZb5LHX54poQnA.jpg",
                "genre_ids": [
                    18,
                    27
                ],
                "id": 381283,
                "original_language": "en",
                "original_title": "mother!",
                "overview": "A couple's relationship is tested when uninvited guests arrive at their home, disrupting their tranquil existence.",
                "popularity": 4.1136,
                "poster_path": "/fjny9chXPx69ln1LMJxbwi5yHMt.jpg",
                "release_date": "2017-09-13",
                "title": "mother!",
                "video": false,
                "vote_average": 6.967,
                "vote_count": 6867,
                "character": "Maiden",
                "credit_id": "59b10b04c3a36824430295b9",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ロランス・ルブーフ",
            "لارنس لبوئف"
        ],
        "biography": "Laurence Charlotte Leboeuf (born December 13, 1985) is a Canadian actress. Leboeuf was born on December 13, 1985, in Montreal, Quebec, the daughter of actors Marcel Leboeuf and Diane Lavallée. She went to École Notre-Dame-de-Grâce for elementary and later on, she went to Villa Maria for high school.\n\nShe made her acting debut as Évelyne Boivin in the French Canadian television series Virginie.[citation needed] Later, she played Louise Lavigueur in the Quebec television series Les Lavigueur, la vraie histoire, and more recently as Apple in Turbo Kid.\n\nShe won the Prix Jutra for Best Supporting Actress at the 10th Jutra Awards, and received a Genie Award nomination for Best Supporting Actress at the 28th Genie Awards, for her performance in the 2007 film My Daughter, My Angel (Ma fille mon ange).[citation needed] She has also received Canadian Screen Award nominations for Best Supporting Actress in a Drama Series for 19-2 at the 3rd Canadian Screen Awards and the 4th Canadian Screen Awards, and Québec Cinéma nominations for Best Actress at the 17th Jutra Awards for The Little Queen (La petite reine) and at the 18th Quebec Cinema Awards for Turbo Kid.\n\nAt the 10th Canadian Screen Awards in 2022, she won the award for Best Actress in a Drama Series for her performance as Magalie Leblanc in Transplant.",
        "birthday": "1985-12-13",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.laurenceleboeuf.com",
        "id": 76877,
        "imdb_id": "nm0495799",
        "known_for_department": "Acting",
        "name": "Laurence Leboeuf",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.9025,
        "profile_path": "/tbsbBn7A6tFag0eAJjH0NbnS1MX.jpg"
    }
}