{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mQC9OxFBGKJmk4tgzpmKO1nIZx5.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 1786,
                "original_language": "fr",
                "original_title": "Au revoir les enfants",
                "overview": "Au revoir les enfants tells a heartbreaking story of friendship and devastating loss concerning two boys living in Nazi-occupied France. At a provincial Catholic boarding school, the precocious youths enjoy true camaraderie—until a secret is revealed. Based on events from writer-director Malle’s own childhood, the film is a subtle, precisely observed tale of courage, cowardice, and tragic awakening.",
                "popularity": 3.3695,
                "poster_path": "/lXP90Vx7OcviBfbbokcaG6zVnPG.jpg",
                "release_date": "1987-10-07",
                "title": "Au Revoir les Enfants",
                "video": false,
                "vote_average": 7.524,
                "vote_count": 685,
                "character": "Father Michel",
                "credit_id": "52fe4315c3a36847f8038f07",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/7hcoMi2AMRvPC7YnGm41k3Wcgvy.jpg",
                "genre_ids": [
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 10795,
                "original_language": "fr",
                "original_title": "Ne le dis à personne",
                "overview": "A man receives a mysterious email appearing to be from his wife, who was murdered years earlier. As he frantically tries to find out whether she's alive, he finds himself being implicated in her death.",
                "popularity": 4.1153,
                "poster_path": "/fr2wEeO1H8dzx6EDfzYTRBIvZaE.jpg",
                "release_date": "2006-11-01",
                "title": "Tell No One",
                "video": false,
                "vote_average": 7.229,
                "vote_count": 1449,
                "character": "Eric Levkowitch",
                "credit_id": "52fe43b89251416c7501b859",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/eWYrrdCKd4bjOKB9DB0HtRUhI1o.jpg",
                "genre_ids": [
                    18
                ],
                "id": 5528,
                "original_language": "fr",
                "original_title": "Les Choristes",
                "overview": "In 1940s France, a new teacher at a school for disruptive boys gives hope and inspiration.",
                "popularity": 6.0653,
                "poster_path": "/hUl7gSvkGygyk9wt3zy5NqpC5bb.jpg",
                "release_date": "2004-03-17",
                "title": "The Chorus",
                "video": false,
                "vote_average": 7.731,
                "vote_count": 2507,
                "character": "Rachin",
                "credit_id": "52fe440cc3a36847f807f4f7",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/Ng3bVep7dL8qQiWhWQlSo2OvpZ.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 25205,
                "original_language": "fr",
                "original_title": "Le Concert",
                "overview": "A former world-famous conductor of the Bolshoï orchestra, known as \"The Maëstro\", Andreï Filipov had seen his career publicly broken by Leonid Brezhnev for hiring Jewish musicians and now works cleaning the concert hall where he once directed. One day, he intercepts an official invitation from the prestigious Théâtre du Châtelet. Through a series of mad antics, he reunites his old orchestra, now composed of old alcoholic musicians, and flies to perform in Paris and complete the Tchaikovsky concerto interrupted 30 years earlier. For the concerto, he engages a young violin soloist with whom he has an unexpected connection.",
                "popularity": 2.4686,
                "poster_path": "/nMIDVIq7p2mcvolG93FH4Ku3aYJ.jpg",
                "release_date": "2009-11-04",
                "title": "The Concert",
                "video": false,
                "vote_average": 7.237,
                "vote_count": 514,
                "character": "Olivier Morne Duplessis",
                "credit_id": "52fe44bdc3a368484e034351",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "François Berleand"
        ],
        "biography": "François Berléand (born April 22, 1952) is a French actor.\n\nHe plays Gilles Triquet, the officer manager and equivalent of David Brent in Le Bureau, the French version of The Office, produced by Canal+. He also appeared in the 2002 film The Transporter as the French commissaire named Tarconi, an active and honest police officer who is an acquaintance of Frank Martin (Jason Statham). He reprised the role in the sequels Transporter 2 and Transporter 3 and the TV series.\n\nBerléand was born in Paris, France. The son of a Russian-Armenian father and a French mother, until the age of eleven he found his childhood traumatic after being told by his father that Berléand was the son of the Invisible Man.\n\nWhile studying at business school, he trained as an actor, somewhat against his will; his first stage role was in a play called Sur une plage de l'Ouest (On a beach in the West). After graduation, he enrolled in drama classes with Tania Balachova and then met Daniel, a director under whose auspices he worked from 1974 to 1981, participating in a dozen productions, mainly of contemporary classics.\n\nBerléand began his film career in 1978 with supporting roles in successful comedies throughout the 1980s. After a series of highly acclaimed supporting roles, including My Small Business for which he won the César for best actor in a supporting role in 2000, he won his first major role in the film My Idol by Guillaume Canet which brought his name and face to the wider public. For this, Berléand thanks his former girlfriend, actress-director Nicole Garcia.\n\nIn Martin et Léa, he plays a police inspector, a role he went on to perform many times on screen (La Balance, Les mois d'avril sont meurtriers (based on the novel The Devil's Home on Leave by Derek Raymond), Marche à l'ombre (Walking in the Shade), The Bait, The Death the Chinese, Fred, The Smile of the Clown, Ne le dis à personne (Tell No One), Transporter 1, 2, and 3) thanks in part to a cold, distant, and piercing gaze. Berléand often plays military characters (The Hostage of Europe, Stella, Les Milles, Captain Conan, The Prince of the Pacific); he has also played a detective (Follow This Plane), pastor (Au revoir les enfants) and psychiatrist in Seventh Heaven, the film that really showed his talents to the public in late 1997.\n\nHe released a book about his childhood in 2006, Le fils de l'homme invisible (The son of the invisible man).\n\nBerléand was in a relationship with French actress, film director and screenwriter Nicole Garcia for twelve years.\n\nHe has been in a long-term relationship with Alexia Stresi; their twins Adèle and Lucy were born in December 2008.\n\nHe is also the father of two grown children, Martin (born 1978) and Fanny (born 1983). He is the grandfather of Elios (born 2013), son of Martin.\n\nDescription above from the Wikipedia article François Berléand, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1952-04-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 7693,
        "imdb_id": "nm0075710",
        "known_for_department": "Acting",
        "name": "François Berléand",
        "place_of_birth": "Paris, France",
        "popularity": 0.6489,
        "profile_path": "/5TDYSUfCj8vaG5sqJXUU06Cvafa.jpg"
    }
}