{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nC3IjYhUgZWgfKfFX0ygMigFwgc.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 14537,
                "original_language": "ja",
                "original_title": "切腹",
                "overview": "Down-on-his-luck veteran Tsugumo Hanshirō enters the courtyard of the prosperous House of Iyi. Unemployed, and with no family, he hopes to find a place to commit seppuku—and a worthy second to deliver the coup de grâce in his suicide ritual. The senior counselor for the Iyi clan questions the ronin’s resolve and integrity, suspecting Hanshirō of seeking charity rather than an honorable end. What follows is a pair of interlocking stories which lay bare the difference between honor and respect, and promises to examine the legendary foundations of the Samurai code.",
                "popularity": 3.9948,
                "poster_path": "/5konZnIbcAxZjP616Cz5o9bKEfW.jpg",
                "release_date": "1962-09-15",
                "title": "Harakiri",
                "video": false,
                "vote_average": 8.433,
                "vote_count": 1114,
                "character": "Miho Tsugumo",
                "credit_id": "52fe45fd9251416c750695dd",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Сима Ивасьта",
            "Сима Ивасита",
            "شیما ایواشیتا",
            "Shima Iwashita"
        ],
        "biography": "Shima Shinoda, better known as Shima Iwashita (born January 3, 1941, in Tokyo, Japan) is a Japanese actress. She was married to film director Shinoda Masahiro. She won the award for best actress at the 2nd Hochi Film Award for Ballad of Orin.\n\nIn junior high school, she aspired to become a psychiatrist, but gave up on that dream when she was 16-17 years old and suffered from childhood rheumatism and was hospitalized for a long time. To divert her energy , she appeared in the 1958 NHK drama Bus Street Back. This was the beginning of her acting career. She made her film debut two years later in 1960.\n\nIn 1999, she launched her brand \"Kimono Shima\" with kimono manufacturer Kyoto Marubeni, and made her debut as a kimono designer. In 2004, she was awarded the Purple Ribbon Medal. In 2012 , she was awarded the Order of the Rising Sun, Gold Rays with Rosette.",
        "birthday": "1941-01-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 76976,
        "imdb_id": "nm0412615",
        "known_for_department": "Acting",
        "name": "Shima Iwashita",
        "place_of_birth": "Tokyo, Tokyo Prefecture, Japan",
        "popularity": 1.0282,
        "profile_path": "/1dMsifeO8GoAbA3ycEGYni3w0E1.jpg"
    }
}