{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nC3IjYhUgZWgfKfFX0ygMigFwgc.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 14537,
                "original_language": "ja",
                "original_title": "切腹",
                "overview": "Down-on-his-luck veteran Tsugumo Hanshirō enters the courtyard of the prosperous House of Iyi. Unemployed, and with no family, he hopes to find a place to commit seppuku—and a worthy second to deliver the coup de grâce in his suicide ritual. The senior counselor for the Iyi clan questions the ronin’s resolve and integrity, suspecting Hanshirō of seeking charity rather than an honorable end. What follows is a pair of interlocking stories which lay bare the difference between honor and respect, and promises to examine the legendary foundations of the Samurai code.",
                "popularity": 3.9948,
                "poster_path": "/5konZnIbcAxZjP616Cz5o9bKEfW.jpg",
                "release_date": "1962-09-15",
                "title": "Harakiri",
                "video": false,
                "vote_average": 8.433,
                "vote_count": 1114,
                "character": "Kageyu Saito",
                "credit_id": "52fe45fd9251416c750695d9",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Рэнтаро Микуни",
            "三國 連太郎",
            "佐藤 政雄",
            "三国连太郎",
            "さとう まさお",
            "みくに れんたろう",
            "Rentarō Mikuni"
        ],
        "biography": "Rentaro Mikuni (三國 連太郎, Mikuni Rentarō, born January 20, 1923) was a Japanese actor from Gunma Prefecture. He appeared in over 150 films since making his screen debut in 1951, and won three Japanese Academy Awards for Best Actor, and a further seven nominations. He also won two Blue Ribbon Awards for Best Actor, in 1960 and in 1989. Kōichi Satō is his son.\n\nDescription above from the Wikipedia article Rentaro Mikuni, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1923-01-20",
        "deathday": "2013-04-14",
        "gender": 2,
        "homepage": null,
        "id": 76975,
        "imdb_id": "nm0586733",
        "known_for_department": "Acting",
        "name": "Rentaro Mikuni",
        "place_of_birth": "Ota, Gunma Prefecture, Japan",
        "popularity": 0.5937,
        "profile_path": "/kSET9YM6lC5on7W6jUH8XBn9pH.jpg"
    }
}