{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f5XOH9b9oV7yzIqhKDEXtDx0uz9.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 16553,
                "original_language": "en",
                "original_title": "Little Manhattan",
                "overview": "Ten-year-old Gabe was just a normal kid growing up in Manhattan until Rosemary Telesco walked into his life, actually into his karate class. But before Gabe can tell Rosemary how he feels, she tells him she will not be going to public school any more. Gabe has a lot more to learn about life, love, and girls.",
                "popularity": 1.8491,
                "poster_path": "/z0RNI1NMtsvLsuTo1rWZfNHVs1z.jpg",
                "release_date": "2005-09-26",
                "title": "Little Manhattan",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 730,
                "character": "TV Cowgirl",
                "credit_id": "5fdf5e37a0b690003fa242aa",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "제스 웨이슬러",
            "ジェス・ワイクスラー",
            "潔絲·威克斯勒",
            "جس وایسلر"
        ],
        "biography": "Jessica \"Jess\" Weixler (born June 8, 1981) is an American actress, best known to date as the lead in the comedy-horror film Teeth and the comedy The Big Bad Swim. She graduated in 1999 from Atherton High School in Louisville, Kentucky, where she also attended the Walden Theatre Conservatory Program and was in The River City Players acting group and in the Chamber Singers choral group and was voted \"most talented\", and then attended Juilliard.\n\nShe was nominated for a Breakthrough Award at the Gotham Awards in 2007 and won the Special Jury Prize in Dramatic category For a juicy and jaw-dropping performance at the Sundance Film Festival in 2007 both for her role in Teeth. She also appeared in the TV series Law & Order: Criminal Intent. In January 2009, she was named by New York Magazine as the \"New Indie Queen\" of the year and one of the fourteen \"New Yorkers you need to know.\" She currently lives in Carroll Gardens, Brooklyn, New York.\n\nDescription above from the Wikipedia article Jess Weixler, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1981-06-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 76999,
        "imdb_id": "nm1422176",
        "known_for_department": "Acting",
        "name": "Jess Weixler",
        "place_of_birth": "Louisville, Kentucky, USA",
        "popularity": 0.6321,
        "profile_path": "/2X0PjIXMLPjm7opUGEq8X5lvqjV.jpg"
    }
}