{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dsqlBtXS5DJBrFYTIYJuSD5YatF.jpg",
                "genre_ids": [
                    35
                ],
                "id": 179150,
                "original_language": "fr",
                "original_title": "Réalité",
                "overview": "A wanna-be director is given 48 hours by a producer to find the best groan of pain, worthy of an Oscar, as the only condition to back his film.",
                "popularity": 1.8685,
                "poster_path": "/l6aty0lfqsTefZ5xduwT7D44N1q.jpg",
                "release_date": "2015-02-18",
                "title": "Reality",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 532,
                "character": "Awards Hostess",
                "credit_id": "60bea1b34bfa54005757eb9b",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "록산느 메스퀴다",
            "ロキサーヌ・メスキダ"
        ],
        "biography": "Roxane Mesquida (born 1 October 1981) is a French actress.\n\nBorn in Marseille, Bouches-du-Rhône, France, Mesquida grew up in Le Pradet though, a little town located between Hyères and Toulon in the Var département. She was discovered at the age of 13, while walking on a road in her region, by the director Manuel Pradal who was in the middle of the casting process for his movie Marie Baie des Anges (Mary from the Bay of Angels with Vahina Giocante and Emmanuelle Béart) at the time. She took part in the shooting during the next summer after their encounter.\n\nIn 1998, she played in L'École de la chair by Benoît Jacquot and crossed paths with the controversial director who would make her well-known and, according to Mesquida, who made her learn her craft: Catherine Breillat. First they collaborated in À ma sœur! (Fat Girl), then in Sex Is Comedy, and they worked together again during the spring of 2006 on Une vieille Maîtresse with Asia Argento.\n\nShe wanted to go to Art School (the Beaux-Arts) but finally abandoned the idea to pursue her career in acting. She is still passionate about the Arts and often visits museums. Her favourite painting is The Scream by Norwegian expressionist painter Edvard Munch.\n\nAmong actors of her generation, she admires Romain Duris and Scarlett Johansson but her absolute idol is Romy Schneider and she says she has seen all her movies.\n\nShe says she is fiercely opposed to the idea of ever becoming financially dependent to cinéma and that she'd rather do baby-sitting than accept a role in a commercial movie she would not like.\n\nDescription above from the Wikipedia article Roxane Mesquida, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1981-10-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 7706,
        "imdb_id": "nm0581953",
        "known_for_department": "Acting",
        "name": "Roxane Mesquida",
        "place_of_birth": "Marseille, France",
        "popularity": 1.6664,
        "profile_path": "/zMj3cn2mK7691lg88eIBZK7EVKx.jpg"
    }
}