{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vVk0HV9HAqvvSfWiNGjpsOekLBS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 2567,
                "original_language": "en",
                "original_title": "The Aviator",
                "overview": "A biopic depicting the life of filmmaker and aviation pioneer Howard Hughes from 1927 to 1947, during which time he became a successful film producer and an aviation magnate, while simultaneously growing more unstable due to severe obsessive-compulsive disorder.",
                "popularity": 7.0791,
                "poster_path": "/lx4kWcZc3o9PaNxlQpEJZM17XUI.jpg",
                "release_date": "2004-12-17",
                "title": "The Aviator",
                "video": false,
                "vote_average": 7.22,
                "vote_count": 5558,
                "character": "Jean Harlow",
                "credit_id": "539c53ffc3a36810da002304",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "No Doubt",
            "グウェン・ステファニー",
            "グウェン・ルネイ・ステファニー"
        ],
        "biography": "Gwen Renée Stefani is an American singer, songwriter, fashion designer, and actress. She is a co-founder and the lead vocalist of the band No Doubt that experienced major success after their breakthrough studio album Tragic Kingdom (1995) along with various successful singles, including \"Just a Girl\", \"Don't Speak\", \"Hey Baby\", and \"It's My Life\". During the band's hiatus, Stefani embarked on a solo pop career in 2004 by releasing her debut studio album Love. Angel. Music. Baby. Inspired by pop music from the 1980s, the album was met with both critical and commercial success. It spawned three commercially successful singles: \"What You Waiting For?\", \"Rich Girl\", and \"Hollaback Girl\". The latter reached number one on the Billboard Hot 100 chart while also becoming the first US download to sell one million copies. In 2006, Stefani released her second studio album The Sweet Escape. The album produced two successful singles: \"Wind It Up\" and the album's title track \"The Sweet Escape\". Her third solo album, This Is What the Truth Feels Like (2016), became her first solo album to reach number one on the Billboard 200 chart.",
        "birthday": "1969-10-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 77070,
        "imdb_id": "nm0005461",
        "known_for_department": "Acting",
        "name": "Gwen Stefani",
        "place_of_birth": "Fullerton, California, USA",
        "popularity": 0.3078,
        "profile_path": "/pZDg9B0SFPCzfPCgYDKfROFzsBP.jpg"
    }
}