{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ncWUcY7ihZ2co7vqUCHqwF6t9us.jpg",
                "genre_ids": [
                    53,
                    18
                ],
                "id": 296098,
                "original_language": "en",
                "original_title": "Bridge of Spies",
                "overview": "During the Cold War, the Soviet Union captures U.S. pilot Francis Gary Powers after shooting down his U-2 spy plane. Sentenced to 10 years in prison, Powers' only hope is New York lawyer James Donovan, recruited by a CIA operative to negotiate his release. Donovan boards a plane to Berlin, hoping to win the young man's freedom through a prisoner exchange. If all goes well, the Russians would get Rudolf Abel, the convicted spy who Donovan defended in court.",
                "popularity": 5.9643,
                "poster_path": "/fmOOjHAQzxr0c1sfcY4qkiSRBH6.jpg",
                "release_date": "2015-10-15",
                "title": "Bridge of Spies",
                "video": false,
                "vote_average": 7.236,
                "vote_count": 7031,
                "character": "FBI Agent #2",
                "credit_id": "569281c8c3a3684cfc00252a",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/fGBJEfGjHmhg7nLAT0Jkcv9qV5e.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 43347,
                "original_language": "en",
                "original_title": "Love & Other Drugs",
                "overview": "Maggie is an alluring free spirit who won't let anyone – or anything – tie her down. But she meets her match in Jamie, whose relentless and nearly infallible charm serves him well with the ladies and the cutthroat world of pharmaceutical sales. Maggie and Jamie's evolving relationship takes them both by surprise, as they find themselves under the influence of the ultimate drug: love.",
                "popularity": 10.4795,
                "poster_path": "/wZLM2uKJRYNchLmiCIjosX0rXy8.jpg",
                "release_date": "2010-11-04",
                "title": "Love & Other Drugs",
                "video": false,
                "vote_average": 7.043,
                "vote_count": 5366,
                "character": "Homeless Man",
                "credit_id": "5ab29eebc3a3681cff00ba37",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brian Hutchinson"
        ],
        "biography": "Brian Hutchison is an American actor based in New York City. He has appeared on such network shows as The Gilded Age, The Equalizer, Blue Bloods, Madam Secretary, Chicago Med, Jessica Jones, Elementary, Law & Order: Special Victims Unit, Godfather of Harlem, The Sinner, FBI: Most Wanted and Lisey's Story.\n\nHe has appeared on and off Broadway in several shows including Downstate, Exit the King with Geoffrey Rush, Looped opposite Valerie Harper, and Man and Boy with Frank Langella. Hutchison has also performed at major regional theaters throughout the United States.\n\nIn 2018, Hutchison played the part of Alan in the Tony Award-winning revival of The Boys in the Band on Broadway. Directed by Joe Mantello, the cast included Jim Parsons, Zachary Quinto, Matt Bomer, Andrew Rannells, Tuc Watkins, Charlie Carver, Robin de Jesus, and Michael Benjamin Washington. The full cast reprised their roles in a movie version of the play that was filmed in 2019 and released on Netflix in September 2020.\n\nIn addition to acting, Hutchison is also a SOVA and Audie award-winning narrator who has recorded over 300 audio books for Audible. He is also a professional photographer, specializing in shooting publicity head shots for other actors. His portfolio also includes a wide range of candid portraits, landscapes and architectural detail.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 77093,
        "imdb_id": "nm0404427",
        "known_for_department": "Acting",
        "name": "Brian Hutchison",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.5823,
        "profile_path": "/6mQfVeJ7fYBbcBLn3bVF0VxhGNx.jpg"
    }
}