{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x5948QrtMqvnf2OBP9ESpdmONQa.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 3870,
                "original_language": "it",
                "original_title": "Novecento",
                "overview": "The epic tale of a class struggle in twentieth century Italy, as seen through the eyes of two childhood friends on opposing sides.",
                "popularity": 2.6247,
                "poster_path": "/deWzfCC59tmtEQvKSmflDe14FvR.jpg",
                "release_date": "1976-08-28",
                "title": "1900",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 657,
                "character": "Regina",
                "credit_id": "52fe43a5c3a36847f80648a3",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/uaEfEkb2tjl4hN1oaSyzcxt4cEg.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 439,
                "original_language": "it",
                "original_title": "La dolce vita",
                "overview": "Episodic journey of journalist Marcello who struggles to find his place in the world, torn between the allure of Rome's elite social scene and the stifling domesticity offered by his girlfriend, all the while searching for a way to become a serious writer.",
                "popularity": 4.2869,
                "poster_path": "/2KU52apQyvyZuPsqEGMcWb4BKu2.jpg",
                "release_date": "1960-02-05",
                "title": "La Dolce Vita",
                "video": false,
                "vote_average": 8.066,
                "vote_count": 1955,
                "character": "Laura",
                "credit_id": "5e9933249defda001abccc3c",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ラウラ・ベッティ",
            "Laura Trombetti"
        ],
        "biography": "Laura Betti (née Trombetti; 1 May 1927 – 31 July 2004) was an Italian actress known particularly for her work with directors Federico Fellini, Pier Paolo Pasolini and Bernardo Bertolucci. She had a long friendship with Pasolini and made a documentary about him in 2001.\n\nBetti became famous for portraying bizarre, grotesque, eccentric, unstable or maniacal roles, like Regina in Bernardo Bertolucci's 1900, Anna the medium in Twitch of the Death Nerve, Giovanna la pazza in Woman Buried Alive, hysterical Rita Zigai in Sbatti il mostro in prima pagina, Therese in Private Vices, Public Virtues, Emilia the servant in Pier Paolo Pasolini's Teorema for which she won the Volpi Cup for Best Actress, and Mildred the protagonist's wife in Mario Bava's Hatchet for the Honeymoon.\n\nBorn Laura Trombetti in Casalecchio di Reno, near Bologna, she grew up to be interested in singing. She first worked professionally in the arts as a jazz singer and moved to Rome.\n\nBetti made her film debut in Federico Fellini's La Dolce Vita (1960). In 1963, she became a close friend of the poet and movie director Pier Paolo Pasolini. Under his direction, she proved a wonderful talent and played in seven of his films, including La ricotta (1963), Teorema (Theorem, 1968), his 1972 version of The Canterbury Tales, in which she played the Wife of Bath; and his controversial Salo (1975) (\"120 Days of Sodom\").\n\nIn 1976, Betti portrayed Regina, a cruel and eroto-maniacal fascist in Bernardo Bertolucci's Novecento (1900). She also played Miss Blandish in his Last Tango in Paris (1972), though her single scene was deleted.\n\nIn 1973 she dubbed the voice of the Devil for the Italian version of William Friedkin's The Exorcist.\n\nFrom the 1960s, Betti dedicated much of her time to literature and politics. She became the muse for a number of leading political and literary figures in Italy and came to personify the revolutionary and Marxist era of 1970s Italy.\n\nIn 2001, she made a documentary about Pasolini, Pier Paolo Pasolini e la ragione di un sogno. She also donated her papers related to their long friendship along with more than 1000 volumes and many documents connected to Pasolini to the archives of the Fondazione Cineteca di Bologna, thus creating the Centro Studi Archivio Pier Paolo Pasolini. This Centro, strongly wanted by Betti, owns also thousands of photograph and all the works of Pasolini: poetry, literature, cinema and journalism. After her death in 2004 her brother Sergio Trombetti has donated all the personal documents of her career to the Centro that has absorbed them under the name Fondo Laura Betti.\n\nSource: Article \"Laura Betti\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1927-05-01",
        "deathday": "2004-07-31",
        "gender": 1,
        "homepage": null,
        "id": 7710,
        "imdb_id": "nm0079341",
        "known_for_department": "Acting",
        "name": "Laura Betti",
        "place_of_birth": "Casalecchio di Reno, Emilia-Romagna, Italy",
        "popularity": 0.1869,
        "profile_path": "/7fQu63Y9LDvAKLGVprtvVBGTbi1.jpg"
    }
}