{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tRKTlMoTsAhYpuq19V8Wk3RFY4O.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11005,
                "original_language": "en",
                "original_title": "Awakenings",
                "overview": "Dr. Malcolm Sayer, a shy research physician, uses an experimental drug to \"awaken\" the catatonic victims of a rare disease. Leonard is the first patient to receive the controversial treatment. His awakening, filled with awe and enthusiasm, proves a rebirth for Sayer too, as the exuberant patient reveals life's simple but unutterably sweet pleasures to the introverted doctor.",
                "popularity": 6.4556,
                "poster_path": "/9gztZXuHLG6AJ0fgqGd7Q43cWRI.jpg",
                "release_date": "1990-12-04",
                "title": "Awakenings",
                "video": false,
                "vote_average": 7.775,
                "vote_count": 2687,
                "character": "Rolando",
                "credit_id": "52fe43e09251416c75021a3b",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nDexter Gordon (February 27, 1923 – April 25, 1990) was an American jazz tenor saxophonist and an Academy Award-nominated actor (Round Midnight, Warner Bros, 1986). He is regarded as one of the first and most important musicians to adapt the bebop musical language of people like Charlie Parker, Dizzy Gillespie, and Bud Powell to the tenor saxophone. His studio and live performance career were both extensive and multifaceted, spanning over 50 years in recorded jazz history.\n\nGordon's height was 6 feet 6 inches (198 cm), and so consequently he was also known as \"Long Tall Dexter\" and \"Sophisticated Giant.\" He played a Conn 10M 'Ladyface' tenor until it was stolen in a Paris airport in 1961. He then switched over to a Selmer Mark VI. His saxophone was fitted with an Otto Link metal mouthpiece, which can be seen in various photos. Gordon died on April 25, 1990 in Philadelphia, Pennsylvania. The Official Dexter Gordon Website is the authoritative online source for research and information on the life and music of Dexter Gordon.\n\nDescription above from the Wikipedia article Dexter Gordon, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1923-02-27",
        "deathday": "1990-04-25",
        "gender": 2,
        "homepage": null,
        "id": 77135,
        "imdb_id": "nm0330143",
        "known_for_department": "Acting",
        "name": "Dexter Gordon",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.0621,
        "profile_path": "/uXZ3KegarfYWQ7ANQq7hFKbXpg2.jpg"
    }
}