{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4CLZ8P4kZNBLR06n1NdxxWKnFRp.jpg",
                "genre_ids": [
                    99,
                    36
                ],
                "id": 13016,
                "original_language": "en",
                "original_title": "Zeitgeist",
                "overview": "A documentary examining possible historical and modern conspiracies surrounding Christianity, the 9/11 terrorist attacks, and the Federal Reserve bank.",
                "popularity": 0.8843,
                "poster_path": "/4eJQJ3tvnNO7CdxXT5awnd9ovGX.jpg",
                "release_date": "2007-06-01",
                "title": "Zeitgeist",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 504,
                "character": "Self (voice) (archive sound)",
                "credit_id": "65aed864aad9c2010903eb70",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Melvin Hicks",
            "Γουίλιαμ Μέλβιν Χικς",
            "William Melvin \"Bill\" Hicks"
        ],
        "biography": "William Melvin \"Bill\" Hicks (December 16, 1961 – February 26, 1994) was an American stand-up comedian and satirist. His humor challenged mainstream beliefs, aiming to \"enlighten people to think for themselves.\" Hicks used a ribald approach to express his material, describing himself as \"Chomsky with dick jokes.\" His jokes included general discussions about society, religion, politics, philosophy and personal issues. Hicks' material was often deliberately controversial and steeped in dark comedy. In both his stand-up performances, and during interviews, he often criticized consumerism, superficiality, mediocrity and banality within the media and popular culture, describing them as oppressive tools of the ruling class, meant to \"keep people stupid and apathetic.\"\n\nHicks died of pancreatic cancer, which had spread to his liver, in 1994 at the age of 32. In the years after his death, his work and legacy achieved significant admiration and acclaim, of numerous comedians, writers, actors and musicians alike. He was listed as the 19th greatest stand-up comedian of all time by Comedy Central in 2004, and 6th greatest in 2007 and 4th greatest by Channel 4 in 2010.",
        "birthday": "1961-12-16",
        "deathday": "1994-02-26",
        "gender": 2,
        "homepage": "http://www.billhicks.com",
        "id": 77193,
        "imdb_id": "nm0382805",
        "known_for_department": "Acting",
        "name": "Bill Hicks",
        "place_of_birth": "Valdosta, Georgia, USA",
        "popularity": 0.1564,
        "profile_path": "/lAn7eqeUo5L8d5Fgu3IlHIiPq9z.jpg"
    }
}