{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nvxrQQspxmSblCYDtvDAbVFX8Jt.jpg",
                "genre_ids": [
                    35,
                    878
                ],
                "id": 646380,
                "original_language": "en",
                "original_title": "Don't Look Up",
                "overview": "Two astronomers go on a media tour to warn humankind of a planet-killing comet hurtling toward Earth. The response from a distracted world: Meh.",
                "popularity": 8.3244,
                "poster_path": "/th4E1yqsE8DGpAseLiUrI60Hf8V.jpg",
                "release_date": "2021-12-08",
                "title": "Don't Look Up",
                "video": false,
                "vote_average": 7.068,
                "vote_count": 8788,
                "character": "Don't Look Up'er",
                "credit_id": "64d7eed0bf31f201cd4f80d5",
                "order": 99
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Wes was born in Arlington, Virginia, and is an acting student of the late George Robert Allen. He is married to his high school sweetheart Kim Barrett, and is the father of three boys.\n\nWes started as an actor and comedian with stand up, improvisation and sketch comedy, and has worked in radio, TV, film and video games.\n\nWes was the last co-host to the legendary Wolfman Jack, writing and performing sketch comedy on the Wolfman's live weekly radio program for the last two years of the radio icon's life. Wes has written and performed many parody songs for radio, some of which have appeared nationally on The Doctor Demento Show. He had morning radio programs on WHFS FM and WXTR FM in Washington, DC.\n\nAs an early and longtime member of the Washington based comedy troupe Gross National Product, Wes parlayed his knack for impressions into political parody. Wes did edgier, nonpolitical comedy with his own DC based troupe, Fresh Victims, where the Washington Post praised his \"alarmingly acute impressions\" and called him \"an endless font of inventive energy.\" Washingtonian Magazine said that \"Johnson suggests the spirit of John Belushi inhabiting the frame of Jackie Gleason.\"\n\nWes is a frequently heard voice on many video games, most notably The Elder Scroll series , Fallout Series, and Star Trek: Legacy for Bethesda Softworks. He recently voiced an Mag'Har Orc Noble in World of Warcraft.\n\nWes has won writing awards from the Wisconsin Screenwriters Forum, The America's Best Screenplay Contest, and was part of the Emmy Award winning writing staff for the ensemble comedy program \"Crabs\" on Maryland Public Television.\n\nHe was the last PA Announcer for the Washington Bullets, the first PA Announcer for the Washington Wizards, announces for the WTT pro tennis team the Washington Kastles and has been the arena voice of the Stanley Cup Champion Washington Capitals since 2000.\n\nWes was the writer and cartoonist of \"Joe Fan,\" which appeared in every issue of SportsFan Magazine, and \"Martini 'N Clyde,\" which ran daily for two years in the Washington Times.\n\n- IMDb Mini Biography By: Aaron",
        "birthday": "1961-06-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 77246,
        "imdb_id": "nm0426432",
        "known_for_department": "Acting",
        "name": "Wes Johnson",
        "place_of_birth": "Arlington, Virginia",
        "popularity": 0.0679,
        "profile_path": "/s2HduWJO5jChcaA5Yof4IwuTPWx.jpg"
    }
}