{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "U.S. Army Ranger",
                "credit_id": "52fe44e2c3a36847f80afca7",
                "order": 7
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "credit_id": "5e7a6d68c8a2d40017249d6e",
                "department": "Crew",
                "job": "Additional Music"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul Albert Anka (born July 30, 1941) is a Canadian-American singer, songwriter and actor. He is best known for his signature hit songs including \"Diana\", \"Lonely Boy\", \"Put Your Head on My Shoulder\", and \"(You're) Having My Baby\". Anka also wrote the theme for The Tonight Show Starring Johnny Carson; one of Tom Jones' biggest hits, \"She's a Lady\"; and the English lyrics to Claude François and Jacques Revaux's music for Frank Sinatra's signature song \"My Way\", which has been recorded by many, including Elvis Presley. He co-wrote three songs with Michael Jackson: \"This Is It\" (originally titled \"I Never Heard\") \"Love Never Felt So Good\", and \"Don't Matter to Me\", which became posthumous hits for Jackson in 2009, 2014, and 2018, respectively.\n\nAnka was born in Ottawa, Ontario, to Camelia (née Tannis) and Andrew Emile \"Andy\" Anka Sr., who owned a restaurant called the Locanda. His parents were both of Lebanese descent. His father came to Canada from Bab Tuma, Damascus, Syria, and his mother was an immigrant from Lebanon. His mother died when he was 18.\n\nAnka sang with the St. Elias Antiochian Orthodox Cathedral choir under the direction of Frederick Karam, with whom he studied music theory. He studied piano with Winnifred Rees. He attended Fisher Park High School, where he was part of a vocal trio called the Bobby Soxers.\n\nPaul Anka recorded his first single, \"I Confess\", when he was 14. In 1956, with $100 given to him by his uncle, he went to New York City where he auditioned for Don Costa at ABC Records, singing what was widely believed to be a lovestruck verse he had written to a former babysitter. In an interview with NPR's Terry Gross in 2005, he stated that it was to a girl at his church whom he hardly knew. The resulting song \"Diana\" brought Anka stardom as it went to No. 1 on the Canadian and US music charts. \"Diana\" is one of the best selling singles ever by a Canadian recording artist. He followed up with four songs that made it into the Top 20 in 1958, including \"It's Time to Cry\", which hit No. 4 and \"(All of a Sudden) My Heart Sings\", which reached No. 15, making him (at 17) one of the biggest teen idols of the time. He toured Britain, then Australia with Buddy Holly. Anka also wrote \"It Doesn't Matter Anymore\" – a song written for Holly, which Holly recorded just before he died in 1959. Anka stated shortly afterward: \"It Doesn't Matter Anymore\" has a tragic irony about it now, but at least it will help look after Buddy Holly's family. I'm giving my composer's royalty to his widow – it's the least I can do.\" ...\n\nSource: Article \"Paul Anka\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1941-07-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 77260,
        "imdb_id": "nm0001912",
        "known_for_department": "Acting",
        "name": "Paul Anka",
        "place_of_birth": "Ottawa, Ontario, Canada",
        "popularity": 0.5237,
        "profile_path": "/8Qx0tMaYEPAWkUOwOnsnm4lZad5.jpg"
    }
}