{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u8wmr8QCowIYXUxVeZYSPWVbB9P.jpg",
                "genre_ids": [
                    18,
                    10752,
                    9648
                ],
                "id": 46738,
                "original_language": "fr",
                "original_title": "Incendies",
                "overview": "A mother's last wishes send twins Jeanne and Simon on a journey to Middle East in search of their tangled roots. Adapted from Wajdi Mouawad's acclaimed play, Incendies tells the powerful and moving tale of two young adults' voyage to the core of deep-rooted hatred, never-ending wars and enduring love.",
                "popularity": 7.0724,
                "poster_path": "/yH6DAQVgbyj72S66gN4WWVoTjuf.jpg",
                "release_date": "2010-09-17",
                "title": "Incendies",
                "video": false,
                "vote_average": 8.097,
                "vote_count": 3009,
                "character": "Nawal",
                "credit_id": "52fe470ac3a36847f812058b",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "לובנה אזאבל",
            "루브나 아자발"
        ],
        "biography": "Lubna Azabal is a Belgian actress, born in Brussels to a Moroccan father and a Spanish mother. After studing at the Conservatoire royal of Brussels, she began a theatrical career in Belgium. In 1997, she took her first film role when Belgian film-maker Vincent Lannoo chose her to act beside Olivier Gourmet in his short film J'adore le cinéma. She performs in both French and Arabic films. She was raised trilingual (French, Spanish and Berber). She also speaks fluent English and Arabic.\n\nHer most widely known role is in the 2005 Golden Globe-winning Palestinian political thriller, Paradise Now. She can also be spotted in a smaller role in Ridley Scott's recent film Body of Lies.\n\nAzabal won the Black Pearl Award 2010 (Abu Dhabi Film Festival) for Best Actress for her role in the film Incendies. She also won the Genie Award for Best Performance by an Actress in a Leading Role at the 31st Genie Awards.",
        "birthday": "1973-08-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 77498,
        "imdb_id": "nm0044073",
        "known_for_department": "Acting",
        "name": "Lubna Azabal",
        "place_of_birth": "Bruxelles, Belgium",
        "popularity": 0.7727,
        "profile_path": "/qjsoXqKJPnmoMs1eyeTLBKKShYQ.jpg"
    }
}