{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oM5mMTGBqsmMJO3l5tkQdQ0Xujm.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    12
                ],
                "id": 10112,
                "original_language": "en",
                "original_title": "The Aristocats",
                "overview": "When Madame Adelaide Bonfamille leaves her fortune to Duchess and her children—Bonfamille’s beloved family of cats—the butler plots to steal the money and kidnaps the legatees, leaving them out on a country road. All seems lost until the wily Thomas O’Malley Cat and his jazz-playing alley cats come to the aristocats’ rescue.",
                "popularity": 6.7864,
                "poster_path": "/1BVOSmQUhphMgnTxnXyfQ9tL1Sc.jpg",
                "release_date": "1970-12-24",
                "title": "The Aristocats",
                "video": false,
                "vote_average": 7.293,
                "vote_count": 5222,
                "character": "Chinese Cat (voice)",
                "credit_id": "52fe432a9251416c75005ea5",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/lNmIAX1IuPIEPMHhLBEm4wmhYX0.jpg",
                "genre_ids": [
                    12,
                    16,
                    18,
                    10751
                ],
                "id": 10948,
                "original_language": "en",
                "original_title": "The Fox and the Hound",
                "overview": "When a feisty little fox named Tod is adopted into a farm family, he quickly becomes friends with a fun and adorable hound puppy named Copper. Life is full of hilarious adventures until Copper is expected to take on his role as a hunting dog -- and the object of his search is his best friend!",
                "popularity": 6.2985,
                "poster_path": "/aC3k6XBaYnulGSkK8263ABjU3Md.jpg",
                "release_date": "1981-07-10",
                "title": "The Fox and the Hound",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3354,
                "character": "Boomer (voice)",
                "credit_id": "52fe43d79251416c750203b3",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/19lyrve8NcorainRPLXELTDVnA2.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12
                ],
                "id": 250480,
                "original_language": "en",
                "original_title": "The Many Adventures of Winnie the Pooh",
                "overview": "Whether we’re young or forever young at heart, the Hundred Acre Wood calls to that place in each of us that still believes in magic. Join pals Pooh, Piglet, Kanga, Roo, Owl, Rabbit, Tigger and Christopher Robin as they enjoy their days together and sing their way through adventures.",
                "popularity": 3.214,
                "poster_path": "/2xwaFVLv5geVrFd81eUttv7OutF.jpg",
                "release_date": "1977-03-11",
                "title": "The Many Adventures of Winnie the Pooh",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1103,
                "character": "Tigger (voice)",
                "credit_id": "578f2dd592514108480148d4",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Wilchinsky"
        ],
        "biography": "Born Paul Wilchinsky on December 21, 1922, the son of Sol and Clara Wilchinsky, Paul Winchell grew up to be the most beloved ventriloquist of American children. Ironically, as famous as Paul was, his dummy, Jerry Mahoney, was probably more famous. Not since Edgar Bergen and Charlie McCarthy in the previous two decades had a ventriloquist and his dummy known equal celebrity.\n\nEntering the spotlight on the Edward Bowes \"Original Amateur Hour\" (1948), he began working soon after in a review show in which Major Bowes would showcase the winners of his radio program. He started his television career on the CBS program The Bigelow Show (1948) in 1948; The Paul Winchell Show (1950), originally called \"The Spiedel Show,\" in 1950; and, finally, the best-known of his shows Winchell-Mahoney Time (1965). With a clubhouse premise, his dummies Jerry Mahoney and Knucklehead Smiff--another of Paul's characters--as the clubhouse leaders, and the music of the bandleader Milton Delugg. A new innovation of Winchell's was to replace the dummy's hands with those of puppeteers who were hidden behind the dummies in a crate. Winch also played many serous dramatic roles on television without his dummy sidekicks.\n\nWhat may be even more famous is that he created the voice of Tigger for the Walt Disney Company's \"Winnie The Pooh\" motion-picture series, based on the famous books by A.A. Milne. He played the role behind the scenes until 1999, when he was replaced by Jim Cummings, who also voiced Pooh from the time that Sterling Holloway died. He was also the voice of many other world-famous cartoon characters.\n\nA little-known fact about Winchell is that he was one of the original inventors of an artificial heart--years before the first successful transplant with such of a device--an automobile that runs on battery power, a method for breeding tilapia, and many other inventions that are still around today.\n\n- IMDb Mini Biography By: MeanDean",
        "birthday": "1922-12-21",
        "deathday": "2005-06-24",
        "gender": 2,
        "homepage": null,
        "id": 77548,
        "imdb_id": "nm0934593",
        "known_for_department": "Acting",
        "name": "Paul Winchell",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.888,
        "profile_path": "/aZjzqTlzhBpcXogubUP8wcPE4Da.jpg"
    }
}