{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xTl1KkHSnMIYnYMukoAQUOewcrY.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 2502,
                "original_language": "en",
                "original_title": "The Bourne Supremacy",
                "overview": "A CIA operation to purchase classified Russian documents is blown by a rival agent, who then shows up in the sleepy seaside village where Bourne and Marie have been living. The pair run for their lives and Bourne, who promised retaliation should anyone from his former life attempt contact, is forced to once again take up his life as a trained assassin to survive.",
                "popularity": 8.6875,
                "poster_path": "/g09UIYfShY8uWGMGP3HkvWp8L8n.jpg",
                "release_date": "2004-07-23",
                "title": "The Bourne Supremacy",
                "video": false,
                "vote_average": 7.325,
                "vote_count": 7795,
                "character": "Irena Neski",
                "credit_id": "52fe435bc3a36847f804e127",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/fJeOpfzQSkzESNPmEXpyNLMmOtI.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 12093,
                "original_language": "sv",
                "original_title": "Lilja 4-ever",
                "overview": "In a struggling post-Soviet community, Lilya a teenage girl is abandoned when her mother moves to the United States with her boyfriend. Facing neglect and poverty, she meets Andrei, who offers her a job in Sweden, giving her hope for a better life — and a journey that will change everything.",
                "popularity": 4.6129,
                "poster_path": "/5i1uhvcdv2Iogx0Bb1znvUmkCvN.jpg",
                "release_date": "2002-08-23",
                "title": "Lilya 4-ever",
                "video": false,
                "vote_average": 7.626,
                "vote_count": 606,
                "character": "Lilja",
                "credit_id": "52fe44b39251416c7503de9d",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Oksana Akin'shina",
            "Oxana Alexandrowna Akinschina",
            "オクサナ・アキンシナ"
        ],
        "biography": "Oksana Akinshina was born in Leningrad, Russian SFSR, Soviet Union (now Saint Petersburg, Russia), where she currently lives. Her father was a car mechanic and her mother an accountant. She has a younger sister. Starting acting at age 12, Akinshina was discovered by Sergei Bodrov, Jr., and she made her screen début in the Russian crime film Sisters (2001), Bodrov's own directorial début.Her second film, Lilya 4-Ever (2001), earned her a 2002 European Film Award nomination for Best Actress. She lost, however, to the eight actresses of the film 8 Women (2002), directed by François Ozon. For her role in Lilya 4-Ever, she also received the award for Best Actress in Leading Role from the Guldbagge Awards, Sweden's national film awards.Since then Akinshina has acted in the films Het Zuiden, directed by Martin Koolhoven, and The Bourne Supremacy (2004), directed by Paul Greengrass.  From 2007 to 2010, Akinshina was married to businessman Dmitry Litvinov, with whom she has a son, Filip Litvinov, born 2 June 2009. In 2012, she remarried to film producer Archil Gelovani. On 15 January 2013, Akinshina gave birth to her second son Konstantin, and on 29 January 2017, she gave birth to a daughter.",
        "birthday": "1987-04-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 77667,
        "imdb_id": "nm0968541",
        "known_for_department": "Acting",
        "name": "Oksana Akinshina",
        "place_of_birth": "Leningrad, Russian SFSR, USSR [now St. Petersburg, Russia]",
        "popularity": 0.9655,
        "profile_path": "/1OyynbiwrYcKatc1ghESlCGGZef.jpg"
    }
}