{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lewYqqt8epnjFhEOIIIINX9Z8EE.jpg",
                "genre_ids": [
                    12,
                    35,
                    18
                ],
                "id": 463257,
                "original_language": "en",
                "original_title": "The Peanut Butter Falcon",
                "overview": "A down-on-his-luck crab fisherman embarks on a journey to get a young man with Down syndrome to a professional wrestling school in rural North Carolina and away from the retirement home where he’s lived for the past two and a half years.",
                "popularity": 2.9311,
                "poster_path": "/qyQcRGvdW3VtxHR4fSDgPOePEip.jpg",
                "release_date": "2019-08-09",
                "title": "The Peanut Butter Falcon",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 1512,
                "character": "Jacob",
                "credit_id": "5d6156f854f6eb00159b85ef",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cactus Jack",
            "Dude Love",
            "Mankind",
            "Cactus Jack Manson",
            "Nicholas Foley",
            "Nicolas Foley"
        ],
        "biography": "Michael \"Mick\" Foley is a retired American professional wrestler and author, currently signed to WWE under its \"Legends\" program as an ambassador. Foley worked for several wrestling promotions including WWE, WCW, ECW, TNA, and NWA, as well as in Japan. A key figure of the Attitude Era and regarded as one of the greatest wrestlers in history, Foley participated in WrestleMania's main events in 1999 and 2000 and was inducted into the WWE Hall of Fame in 2013.\n\nFoley wrestled under various personas: Cactus Jack, Mankind, and Dude Love, collectively known as the \"Three Faces of Foley.\" Notably, he entered the 1998 Royal Rumble three times under these different personas. Foley is a four-time world champion and an 11-time world tag team champion. His Hell in a Cell match against The Undertaker is remembered as one of the greatest and most controversial matches of all time, cementing his reputation as \"The Hardcore Legend\" due to his brutal and physical wrestling style.",
        "birthday": "1969-06-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 77763,
        "imdb_id": "nm0284201",
        "known_for_department": "Acting",
        "name": "Mick Foley",
        "place_of_birth": "Long Island, New York, USA",
        "popularity": 0.3457,
        "profile_path": "/DHUA9BWpNlue1Wk4eIk2r9zjUF.jpg"
    }
}