{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aCURY1tNUkvrNnjw5qYJXTUp7z.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 33602,
                "original_language": "en",
                "original_title": "Temple Grandin",
                "overview": "A biopic of Temple Grandin, an autistic American who has become one of the leading scientists in humane livestock handling.",
                "popularity": 3.2461,
                "poster_path": "/gQhQ6yEkUkDDo1zugpq46PJN8xZ.jpg",
                "release_date": "2010-02-06",
                "title": "Temple Grandin",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 511,
                "character": "Don Micheals",
                "credit_id": "52fe45279251416c9102941f",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/dxXhdYuQyuMPX0lCEo6LhCv69Xq.jpg",
                "genre_ids": [
                    18
                ],
                "id": 13416,
                "original_language": "en",
                "original_title": "Friday Night Lights",
                "overview": "A small, turbulent town in Texas obsesses over their high school football team to an unhealthy degree. When the star tailback, Boobie Miles, is seriously injured during the first game of the season, all hope is lost, and the town's dormant social problems begin to flare up. It is left to the inspiring abilities of new coach Gary Gaines to instill in the other team members -- and, by proxy, the town itself -- a sense of self-respect and honor.",
                "popularity": 3.6545,
                "poster_path": "/8HIqpOgqShRc3TAleabnYispDl1.jpg",
                "release_date": "2004-10-08",
                "title": "Friday Night Lights",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 594,
                "character": "Reporter",
                "credit_id": "62ebe76f8566d2005a48a8a0",
                "order": 79
            },
            {
                "adult": false,
                "backdrop_path": "/jBz16NsAeKjpHNznl1EHlcr704P.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9571,
                "original_language": "en",
                "original_title": "Dazed and Confused",
                "overview": "The adventures of a group of Texas teens on their last day of school in 1976, centering on student Randall Floyd, who moves easily among stoners, jocks and geeks. Floyd is a star athlete, but he also likes smoking weed, which presents a conundrum when his football coach demands he sign a \"no drugs\" pledge.",
                "popularity": 3.7057,
                "poster_path": "/msG9awbLhVZwv1Eh9Ge7SofMexW.jpg",
                "release_date": "1993-09-24",
                "title": "Dazed and Confused",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 2142,
                "character": "Pickford's Dad",
                "credit_id": "62fd13807cffda0092ddebab",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nRichard Henry Wilde Dillard (born 11 October 1937) is an American poet, author, critic, and translator.\n\nBorn in Roanoke, Virginia, Dillard is best known as a poet. He is also highly-regarded as a writer of fiction and critical essays, as well as one of the screenwriters for the cult classic Frankenstein Meets the Space Monster.He received his Bachelor of Arts degree from Roanoke College and went on to receive of a Master of Arts (1959) and the Ph. D. (1965) from the University of Virginia. While at the University of Virginia he was both a Woodrow Wilson and a DuPont Fellow. He is considered something of an institution at Hollins University where he has been teaching creative writing, literature, and film studies since 1964. Dillard has been the editor of the Hollins Critic since 1996. He also served as the vice president of the Film Journal from 1973-1980.\n\nHe is the winner of numerous awards for his writing including the Academy of American Poets Prize, the O. B. Hardison, Jr. Poetry Prize, and the Hanes Award for Poetry. In 2007, he was awarded the George Garrett Award for Service to Contemporary Literature by the Association of Writers & Writing Programs. Dillard influenced many contemporary writers including both his ex-wives Annie Dillard and Cathryn Hankla. Others include the likes of Henry S. Taylor, Lee Smith, Lucinda MacKethan, Anne Jones, Rosanne Coggeshall, Wyn Cooper, Jill McCorkle, Madison Smartt Bell, and Julia Johnson.\n\nDescription above from the Wikipedia article Richard Dillard, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1937-10-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 77859,
        "imdb_id": "nm0226844",
        "known_for_department": "Acting",
        "name": "Richard Dillard",
        "place_of_birth": "Roanoke, Virginia, USA",
        "popularity": 0.3151,
        "profile_path": "/6vwLd6Y1xZwEtO2xRAEcpGUCBJm.jpg"
    }
}