{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1WKtWXw6yfi5yGknLSvmJLhLa0R.jpg",
                "genre_ids": [
                    99,
                    18,
                    10751
                ],
                "id": 62320,
                "original_language": "fr",
                "original_title": "Home",
                "overview": "In 200,000 years of existence, man has upset the balance on which the Earth had lived for 4 billion years. Global warming, resource depletion, species extinction: man has endangered his own home. But it is too late to be pessimistic: humanity has barely ten years left to reverse the trend, become aware of its excessive exploitation of the Earth's riches, and change its consumption pattern.",
                "popularity": 1.299,
                "poster_path": "/2Ph0vzTiORSSlYjsXLFM1OZHkI8.jpg",
                "release_date": "2009-06-03",
                "title": "Home",
                "video": false,
                "vote_average": 7.802,
                "vote_count": 523,
                "character": "Narrator (french voice)",
                "credit_id": "52fe4678c3a368484e09281b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Žaks Gamblins"
        ],
        "biography": "Jacques Gamblin is a French actor. He studied at the Centre dramatique de Caen (Caen Dramatic Arts Centre).\n\nOriginally, Jacques Gamblin was not destined to act. As a professional technician in a theater company, he came to contact with acting. He then studied at the Comédie de Caen and took his first steps as an actor on stage in Brittany, Totem Theatre in Saint-Brieuc, before joining the National Theatre, directed by Pierre de Rennes Debauche. Then he tried his luck in Paris, carefully choosing his roles and he made his film debut in 1985.\n\nIn theatre, Jacques Gamblin worked with many directors such as Pierre Claude Yersin, Michel Dubois, Jeanne Champagne, Philippe Adrien, Alfredo Arias, Charles Tordjman, Jean-Louis Martinelli, Gildas Bourdet, and Anne Bourgeois.\n\nHe is also the author of plays such as The Touch Hardware and hip (1997).\n\nSource: Article \"Jacques Gamblin\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1957-11-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 77860,
        "imdb_id": "nm0303826",
        "known_for_department": "Acting",
        "name": "Jacques Gamblin",
        "place_of_birth": "Granville, Manche, France",
        "popularity": 0.1628,
        "profile_path": "/yUf8mLiFtIwfgreb5ozp5qGDt7h.jpg"
    }
}