{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ioQYjcRnU54ir5ltgyS7k53zw5x.jpg",
                "genre_ids": [
                    18,
                    10751,
                    10402,
                    10749
                ],
                "id": 15121,
                "original_language": "en",
                "original_title": "The Sound of Music",
                "overview": "In the years before the Second World War, a tomboyish postulant at an Austrian abbey is hired as a governess in the home of a widowed naval captain with seven children, and brings a new love of life and music into the home.",
                "popularity": 9.0195,
                "poster_path": "/c6CrUZypAsBCaRWX0M3RVRDbhNS.jpg",
                "release_date": "1965-03-29",
                "title": "The Sound of Music",
                "video": false,
                "vote_average": 7.726,
                "vote_count": 3443,
                "character": "Mother Abbess",
                "credit_id": "52fe463b9251416c75071a5b",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mary Margaret Wood",
            "Mary Margaret \"Peggy\" Wood"
        ],
        "biography": "Mary Margaret Wood was an American actress of stage, film, and television. She is best remembered for her performance as the title character in the CBS television series Mama, for which she was nominated for a Primetime Emmy Award for Outstanding Lead Actress in a Drama Series; her starring role as Naomi, Ruth's mother-in-law, in The Story of Ruth; and her final screen appearance as Mother Abbess in The Sound of Music, for which she was nominated for an Academy Award and a Golden Globe Award.\n\nWood studied voice in France with the legendary soprano Emma Calve - the greatest exponent of the role of CARMEN in the first half of the 20th century. Upon returning to the U.S., Wood was an early member of the Actors' Equity Association, spending nearly 50 years on the stage, beginning in the chorus and becoming known as a Broadway singer and star. She made her stage debut in 1910, as part of the chorus for Naughty Marietta. In 1917, she starred in Maytime, in which she introduced the song \"Will You Remember\". She starred in several other musicals before playing the role of Portia in a 1928 production of The Merchant of Venice. From the late 1920s until the late 1930s, Wood had lead roles in musicals staged in London and New York. She was chosen by Noel Coward to star in the original London production of his wildly successful operetta BITTER SWEET.\n\nIn 1941, she starred in the New York premiere of Blithe Spirit.  Wood did not star in many films. Her few film appearances include roles in Jalna, A Star is Born, Call It a Day, The Housekeeper's Daughter, The Bride Wore Boots, Magnificent Doll, and Dream Girl. From 1949 to 1957, she played matriarch Marta Hansen in the popularTV series Mama. She co-starred with comedian Imogene Coca on Broadway in The Girls in 509. In October 1963, she and Ruth Gates appeared in a one-act play, Opening Night, which played in off-Broadway. Wood portrayed Fanny Ellis, a once famous star who prepares for a performance; the play lasted 47 performances. Ruth Gates was Aunt Jenny on the \"Mama\" series with Wood.\n\nShe returned to movies in the 1960 CinemaScope production The Story of Ruth in a co-starring role, as what she referred to in her own book as a \"blonde, blue-eyed Jewess\".\n\nHer final screen appearance was as the gentle, wise Mother Abbess in The Sound of Music, for which she was nominated for the Academy Award for Best Supporting Actress and the Golden Globe Award for Best Supporting Actress - Motion Picture. She was thrilled to be in the movie although she knew that she could no longer sing \"Climb Ev'ry Mountain\". She was dubbed (for singing) by Margery McKay. In her autobiography, Marni Nixon, who appeared in the film as Sister Sophia, said Peggy especially liked McKay's singing voice because she sounded as Peggy did in her younger days.\n\nIn 1969, Wood joined the cast of the ABC-TV soap, One Life to Live as Dr. Kate Nolan and had a recurring role until the end of the year.\n\nHer first autobiography, How Young You Look, was published by Farrar and Rinehart in 1941. An update, Arts and Flowers, appeared in 1963. She also wrote a biography of actor John Drew, Jr., as well as a novel called The Star Wagon and was a co-author of a play called Miss Quis.\n\nWood received numerous awards for her theatrical work and for a while was president of the American National Theater and Academy.",
        "birthday": "1892-02-09",
        "deathday": "1978-03-18",
        "gender": 1,
        "homepage": null,
        "id": 77895,
        "imdb_id": "nm0939931",
        "known_for_department": "Acting",
        "name": "Peggy Wood",
        "place_of_birth": "Brooklyn [now in New York City], New York, USA",
        "popularity": 0.6743,
        "profile_path": "/n6vfEUjEF5lFeTcEyaFPChO2EQl.jpg"
    }
}