{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tKi5HYDSuxP4I26fxyF2UVvAtLa.jpg",
                "genre_ids": [
                    35,
                    80,
                    28
                ],
                "id": 90,
                "original_language": "en",
                "original_title": "Beverly Hills Cop",
                "overview": "Fast-talking, quick-thinking Detroit street cop Axel Foley has bent more than a few rules and regs in his time, but when his best friend is murdered, he heads to sunny Beverly Hills to work the case like only he can.",
                "popularity": 5.0898,
                "poster_path": "/eBJEvKkhQ0tUt1dBAcTEYW6kCle.jpg",
                "release_date": "1984-12-05",
                "title": "Beverly Hills Cop",
                "video": false,
                "vote_average": 7.202,
                "vote_count": 4373,
                "character": "Jenny Summers",
                "credit_id": "52fe4216c3a36847f8002f0f",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/8Xb0LfbdrS2pwDYyMkUiawzbGBu.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 2623,
                "original_language": "en",
                "original_title": "An Officer and a Gentleman",
                "overview": "Zack Mayo is an aloof, taciturn man who aspires to be a navy pilot. Once he arrives at training camp for his 13-week officer's course, Mayo runs afoul of abrasive, no-nonsense drill Sergeant Emil Foley. Mayo is an excellent cadet, but a little cold around the heart, so Foley rides him mercilessly, sensing that the young man would be prime officer material if he weren't so self-involved. Zack's affair with a working girl is likewise compromised by his unwillingness to give of himself.",
                "popularity": 4.059,
                "poster_path": "/69adZbLeRk5TNQ3e0008dMnde9p.jpg",
                "release_date": "1982-07-28",
                "title": "An Officer and a Gentleman",
                "video": false,
                "vote_average": 7.019,
                "vote_count": 1146,
                "character": "Casey Seeger",
                "credit_id": "52fe4360c3a36847f804fc41",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lisa Marie Eilbacher",
            "لیزا ایلباکر"
        ],
        "biography": "Lisa Marie Eilbacher (born May 5, 1956) is an American retired actress. She is best known for her roles as Jenny Summers - Axel Foley's friend in Beverly Hills Cop and as Casey Seeger, the cadet who couldn't make it over the wall on the obstacle course in An Officer and a Gentleman (1982). She said the hardest part of playing that role was pretending she was out of shape, because she was an avid body builder.\n\nShe spent her most formative years in Paris then moved to Beverly Hills, California with her family,  when she was seven. In true Hollywood fashion, she was spotted by a talent agent while out walking with her mother. It wasn't long before the little girl who spoke French began perfecting her English in television commercials and on such TV westerns as Wagon Train (1957), Gunsmoke (1955), Laredo (1965) and Bonanza (1959).\n\nAmong her credits as a teenager and after graduating from high school, she starred in The Hardy Boys/Nancy Drew Mysteries (1977), and, since those early days, has had prominent parts in countless series and television films including Deadly Intentions (1985), The Ordeal of Patty Hearst (1979), The War Between Men and Women (1972), a motion picture starring Jack Lemmon and Barbara Harris, Love for Rent (1979), To Race the Wind (1980) and This House Possessed (1981).\n\nHer roles in miniseries include The Winds of War (1983) opposite Robert Mitchum and Monte Carlo (1986) with Malcolm McDowell. She auditioned for the role of Princess Leia in Star Wars: Episode IV - A New Hope (1977).",
        "birthday": "1956-05-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 779,
        "imdb_id": "nm0002060",
        "known_for_department": "Acting",
        "name": "Lisa Eilbacher",
        "place_of_birth": "Dhahran, Saudi Arabia",
        "popularity": 1.0647,
        "profile_path": "/tYbOrII1dXzNauGSbMlAZRyRUWT.jpg"
    }
}