{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bAdIO0Jt886Ad1eY9bDXXeCpXsV.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 2028,
                "original_language": "en",
                "original_title": "Say Anything...",
                "overview": "Lloyd, an eternal optimist, seeks to capture the heart of Diane, an unattainable high school beauty and straight-A student. He surprises just about everyone-including himself-when she returns the sentiment. But Diane's over-possessive, divorced Dad disapproves and it's going to take more than just the power of love to conquer all.",
                "popularity": 12.1068,
                "poster_path": "/nkucKciFGSRalw6dJtsglWqOXMC.jpg",
                "release_date": "1989-04-14",
                "title": "Say Anything...",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1044,
                "character": "Mimi",
                "credit_id": "63060dfabb070d007c54bb20",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Wilson Phillips"
        ],
        "biography": "Gilliam Chynna Phillips (born February 12, 1968) is an American singer and actress, known for being a member of Wilson Phillips and for being the daughter of The Mamas & the Papas' band members John and Michelle Phillips and the half-sister of actress Mackenzie Phillips, Bijou Phillips, Jeffrey Phillips, Tamerlane Phillips, and Austin Hines.\n\nPhillips began her career in acting. She appeared in films such as 1987's Some Kind of Wonderful, 1988's Caddyshack II, 1989's Say Anything and as the title character Roxanne Pulitzer in the 1989 television biopic Roxanne: The Prize Pulitzer.\n\nIn 1995, she returned to acting appearing as Kim MacAfee in the television movie Bye Bye Birdie. In 2004, she voiced the character of Kitty along with her husband William Baldwin as Johnny 13 in Danny Phantom.",
        "birthday": "1968-02-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 77940,
        "imdb_id": "nm0680307",
        "known_for_department": "Acting",
        "name": "Chynna Phillips",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.244,
        "profile_path": "/8SsxRAxbN8BgEpAT7En48rV1wlS.jpg"
    }
}