{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4KJSPoZwJ1TAIaTueDxtkmo5wE1.jpg",
                "genre_ids": [
                    12,
                    36
                ],
                "id": 70667,
                "original_language": "no",
                "original_title": "Kon-Tiki",
                "overview": "The true story about legendary explorer Thor Heyerdahl and his epic crossing of the Pacific on a balsa wood raft in 1947, in an effort to prove it was possible for South Americans to settle in Polynesia in pre-Columbian times.",
                "popularity": 2.2517,
                "poster_path": "/tphF7lJZys5ij9BHivbxsqmPiOo.jpg",
                "release_date": "2012-08-24",
                "title": "Kon-Tiki",
                "video": false,
                "vote_average": 6.902,
                "vote_count": 785,
                "character": "Herman Watzinger",
                "credit_id": "52fe4808c3a368484e0e61d3",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/exPxtvZYNxpt6xTCPYYkCVyquh5.jpg",
                "genre_ids": [
                    53,
                    28,
                    35,
                    80
                ],
                "id": 252822,
                "original_language": "no",
                "original_title": "Kraftidioten",
                "overview": "Upstanding community leader Nils has just won an award for \"Citizen of the Year\" when he learns the news that his son has died of a heroin overdose. Suspecting foul play, Nils begins to investigate, and soon finds himself at the center of an escalating underworld gang war between Serbian drug dealers and a sociopathic criminal mastermind known only as “The Count.”",
                "popularity": 2.1943,
                "poster_path": "/ujlJLvzWRh2hR0UoHypv9QLZ2os.jpg",
                "release_date": "2014-02-21",
                "title": "In Order of Disappearance",
                "video": false,
                "vote_average": 6.904,
                "vote_count": 642,
                "character": "Geir",
                "credit_id": "52fe4e569251416c9112e49b",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anders Baasmo"
        ],
        "biography": "Anders Baasmo Christiansen, born 29 January 1976 is a Norwegian actor from Hamar, Norway.\n\nHe earned his breakthrough in 2003 when he received the Amanda-price for his performance in the Norwegian picture Buddy.\n\nHe also won the TV award Gullruten in 2007 for his portrait of Henrik Ibsen in the TV-series An immortal man (\"En udødelig mann\") on NRK.\n\nChristiansen graduated from the Norwegian Acting Academy in 2000. He started his professional career at the Trøndelag Teater in Trondheim, Norway. Later he joined the Det Norske Teatret in Oslo.\n\nHe has also starred in the Swedish 2007 picture Arn – The Knight Templar, and its sequel Arn – The Kingdom at Road's End from 2008.\n\nIn 2008 he won Norway's most prestigious actor's award, the Heddaprisen, for his interpretation of Hamlet. He then became the first actor to collect an Amanda, a Gullruten and a Hedda award.\n\nHe will be receiving the Shooting Stars Award, the annual acting award for up-and-coming actors by European Film Promotion, at the Berlin International Film Festival 2010.\n\nDescription above from the Wikipedia article Anders Baasmo Christiansen, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1976-01-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 77976,
        "imdb_id": "nm0471601",
        "known_for_department": "Acting",
        "name": "Anders Baasmo Christiansen",
        "place_of_birth": "Hamar, Norway",
        "popularity": 0.4038,
        "profile_path": "/lscnOAUqyja8BHQACtjWCOTOKG7.jpg"
    }
}