{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3w2YSii9wQZsKKucAYwVxzOwm7s.jpg",
                "genre_ids": [
                    12,
                    35,
                    10752
                ],
                "id": 11589,
                "original_language": "en",
                "original_title": "Kelly's Heroes",
                "overview": "A misfit group of World War II American soldiers goes AWOL to rob a bank behind German lines.",
                "popularity": 3.4907,
                "poster_path": "/hleMxFKSC42yT0TClS4G29HV11n.jpg",
                "release_date": "1970-06-22",
                "title": "Kelly's Heroes",
                "video": false,
                "vote_average": 7.344,
                "vote_count": 757,
                "character": "1st Sgt. Mulligan (Artillerly Unit)",
                "credit_id": "52fe44619251416c75032be1",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Demosthenes Savalas",
            "Demosthenes"
        ],
        "biography": "Greek-American actor George Savalas is best remembered for co-starring on his elder brother (Telly Savalas)'s popular television detective show Kojak (1973) (1973-78). He played Detective Stavros to Telly's Kojak, changed his middle name later in life from \"Nicholas\" to \"Demosthenes\" and was billed as simply Demosthenes in the end credits to avoid confusion with the elder Savalas.\n\nGeorge Savalas served in the Pacific during WWII and was a decorated U.S. Navy gunner. He learned his craft at Columbia University's School of Drama. Before making it to the small screen, he was an accomplished stage actor and acting instructor. He was, briefly, the drummer for the Clyde McCoy Big Band. He got his start on the Dick Powell Theater, and went on to guest star on other series. He appeared in several films including Genghis Khan (1965) and Kelly's Heroes (1970). After \"Kojak\" ended, he recorded a Top-10 Greek language record and toured with his band at many major venues including Carnegie Hall. Savalas later returned to his first love, the stage, and appeared in many off-Broadway plays. He died of leukemia in 1985, aged 60, and was survived by his wife and their six children (five sons and one daughter).",
        "birthday": "1924-12-05",
        "deathday": "1985-10-02",
        "gender": 2,
        "homepage": null,
        "id": 78091,
        "imdb_id": "nm0767419",
        "known_for_department": "Acting",
        "name": "George Savalas",
        "place_of_birth": "Bronx, New York, USA",
        "popularity": 0.2948,
        "profile_path": "/6LldftjuRCfldm56DOVEUump48j.jpg"
    }
}