{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/egKntJKzEL6HgalIyQ0Q5cMmDOA.jpg",
                "genre_ids": [
                    53,
                    80,
                    9648
                ],
                "id": 65754,
                "original_language": "en",
                "original_title": "The Girl with the Dragon Tattoo",
                "overview": "Disgraced journalist Mikael Blomkvist investigates the disappearance of a weary patriarch's niece from 40 years ago. He is aided by the pierced, tattooed, punk computer hacker named Lisbeth Salander. As they work together in the investigation, Blomkvist and Salander uncover immense corruption beyond anything they have ever imagined.",
                "popularity": 5.7149,
                "poster_path": "/8bokS83zGdhaXgN9tjidUKmAftW.jpg",
                "release_date": "2011-12-14",
                "title": "The Girl with the Dragon Tattoo",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 7286,
                "character": "Miriam Wu",
                "credit_id": "52fe4718c3a368484e0b4c7d",
                "order": 60
            },
            {
                "adult": false,
                "backdrop_path": "/7KsqfXDECZMryX1Rv4RKsT7SIjQ.jpg",
                "genre_ids": [
                    28,
                    35,
                    80,
                    53
                ],
                "id": 390043,
                "original_language": "en",
                "original_title": "The Hitman's Bodyguard",
                "overview": "The world’s top bodyguard gets a new client, a hitman who must testify at the International Court of Justice. They must put their differences aside and work together to make it to the trial on time.",
                "popularity": 5.362,
                "poster_path": "/5CGjlz2vyBhW5xHW4eNOZIdgzYq.jpg",
                "release_date": "2017-08-16",
                "title": "The Hitman's Bodyguard",
                "video": false,
                "vote_average": 6.892,
                "vote_count": 6418,
                "character": "Amelia Roussel",
                "credit_id": "56f863019251417105001330",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ελοντί Γιουνγκ",
            "Élodie Yung",
            "الودی یانگ",
            "الودی یونگ"
        ],
        "biography": "Élodie Yung (French: [elɔdi juŋ]; born 22 February 1981) is a French actress. She is best known for her roles as Elektra Natchios in the 2016 second season of the Marvel Cinematic Universe Netflix series Daredevil and The Defenders, as well as Thony De La Rosa on the 2022 Fox series The Cleaning Lady.\n\nYung was born in Paris on 22 February 1981. Her father is Cambodian and her mother is French. She grew up in Seine-Saint-Denis. Her father enrolled her in karate classes at age 9, and she eventually became a black belt in her late teens. Yung earned a law degree at the University of Paris with the intention of becoming a judge. However, at the age of 29, she instead pursued acting at the London Academy of Music and Dramatic Art.\n\nYung began acting in 2002, in the French television series La vie devant nous, and made her film debut as the female lead Tsu in 2004's Les fils du vent. She followed this with a performance as gang lord Tao in District 13: Ultimatum.\n\nYung returned to TV for the first three seasons of the successful police series Les Bleus with Clémentine Célarié.\n\nYung appeared briefly in the 2011 film The Girl with the Dragon Tattoo as Miriam Wu, a romantic interest of Lisbeth Salander, and followed this with roles as the ninja Jinx in 2013's G.I. Joe: Retaliation and Gods of Egypt (2016), as the goddess Hathor. In 2016 she also starred as Amelia Roussel in the action comedy The Hitman's Bodyguard alongside Ryan Reynolds and Samuel L. Jackson.\n\nYung's breakthrough performance was Elektra Natchios in season 2 of Daredevil in 2016. She reprised the role in 2017 in The Defenders. In 2020, Yung played the role of Catherine in the Disney+ film Secret Society of Second-Born Royals.\n\nIn 2022, Yung began starring as Thony in the Fox crime drama series The Cleaning Lady. The show was renewed for its fourth season in 2024, with Yung set to return.\n\nIn August 2018, Yung gave birth to a daughter with actor Jonathan Howard.\n\nDescription above from the Wikipedia article Élodie Yung, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1981-02-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 78147,
        "imdb_id": "nm1392388",
        "known_for_department": "Acting",
        "name": "Elodie Yung",
        "place_of_birth": "Paris, France",
        "popularity": 1.8078,
        "profile_path": "/oRs65jexRkX8D4GRsHj5sb7E9Mx.jpg"
    }
}