{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6LrSj1vsYALVLTf2RCCfJFWimM7.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 575,
                "original_language": "de",
                "original_title": "Das Experiment",
                "overview": "20 volunteers agree to take part in a seemingly well-paid experiment advertised by the university. It is supposed to be about aggressive behavior in an artificial prison situation. A journalist senses a story behind the ad and smuggles himself in among the test subjects. They are randomly divided into prisoners and guards. What seems like a game at the beginning soon turns into bloody seriousness.",
                "popularity": 1.8131,
                "poster_path": "/mfxXel8k2UWkgJ4MIsvVBsqnvFp.jpg",
                "release_date": "2001-03-08",
                "title": "The Experiment",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1140,
                "character": "Dr. Jutta Grimm",
                "credit_id": "52fe4254c3a36847f8015dab",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "آندریا ساوتزکی"
        ],
        "biography": "Andrea Sawatzki (born 23 February 1963 in Kochel am See) is a German actress. Since 2002 she has starred in the Hessischer Rundfunk version of the popular television crime series Tatort as police inspector Charlotte Sänger.\n\nShe also gained some international prominence as a co-actor in the German movies Bandits and Das Experiment.\n\nSawatzki is the daughter of a nurse and a journalist. She has lived with actor Christian Berkel since 1997. The couple has two sons and lives in Berlin.\n\nAfter studying at the Neue Münchner Schauspielschule (Munich acting school) and doing an internship at the Munich Kammerspiele, Sawatzky played in theaters in Stuttgart, Wilhelmshaven and Munich from 1988 to 1992. Her first movie role was in Faust – der Film in 1988, directed by Dieter Dorn. In 1997, she became known to a broader audience through the movie Die Apothekerin in which she played Alma Siebert. She made her breakthrough as one of the best known German actresses with her role as Chief Inspector Charlotte Sänger in the Tatort series from 2001 to 2009.\n\nMoreover, she acted in successful movies such as Bandits, Late Show, Leo und Claire and Das Experiment. She appeared in several TV series and TV movies such as Der König von St. Pauli (\"The King of St. Pauli\") and Die Manns, both praised by critics. She posed for a spread in Playboy magazine in 2003.\n\nSawatzki read for audio books as, for example, for the series TV-Kommissare lesen Krimis the story Die Maus in der Ecke and the novel Glennkill. In 2007, Sawatzki was godmother of the Deutscher Kinderpreis (German Children's Award).\n\nDescription above from the Wikipedia article Andrea Sawatzki, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1963-02-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 7823,
        "imdb_id": "nm0768058",
        "known_for_department": "Acting",
        "name": "Andrea Sawatzki",
        "place_of_birth": "Kochel am See, Germany",
        "popularity": 0.2906,
        "profile_path": "/jwRdbYNDuXcB2r5jR9jSa5g2Dox.jpg"
    }
}