{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/shqLeIkqPAAXM8iT6wVDiXUYz1p.jpg",
                "genre_ids": [
                    16,
                    14,
                    10751
                ],
                "id": 12429,
                "original_language": "ja",
                "original_title": "崖の上のポニョ",
                "overview": "When Sosuke, a young boy who lives on a clifftop overlooking the sea, rescues a stranded goldfish named Ponyo, he discovers more than he bargained for. Ponyo is a curious, energetic young creature who yearns to be human, but even as she causes chaos around the house, her father, a powerful sorcerer, schemes to return Ponyo to the sea.",
                "popularity": 8.7085,
                "poster_path": "/yp8vEZflGynlEylxEesbYasc06i.jpg",
                "release_date": "2008-07-19",
                "title": "Ponyo",
                "video": false,
                "vote_average": 7.75,
                "vote_count": 4542,
                "character": "Yoshie (voice)",
                "credit_id": "52fe44df9251416c75043ee7",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "奈良岡 朋子"
        ],
        "biography": "Tomoko Naraoka (奈良岡 朋子 Naraoka Tomoko, born December 1, 1929) is a Japanese actress and narrator. The daughter of a painter, she was born in Komagome, Hongō (present-day Bunkyo), in the city of Tokyo, Japan. She graduated from Joshibi University of Art and Design.\n\nNaraoka debuted as a cinema actress in the 1949 film Chijin no Ai, based on the novel Naomi. In 1981 she appeared in Rengō Kantai (lit. \"Combined Fleet\", United States title: The Imperial Navy). She also appeared in Torajirō Sarada Kinenbi (a 1988 movie in the long-running Otoko wa Tsurai yo series) as well as eight films in the Tsuribaka Nisshi series. Naraoka has appeared in several NHK Taiga dramas. Her first was the 1969 Ten to Chi to, in the role of the wife of Uesugi Sadazane. She portrayed Kita no Mandokoro (the wife of Toyotomi Hideyoshi) in Haru no Sakamichi (1971). Her next Taiga drama appearance was in 1976 in Kaze to Kumo to Niji to. She narrated the 1986 Inochi and 1989 Kasuga no Tsubone. She is the narrator of the 2008 drama Atsuhime. Other noteworthy narration roles include the 1983 serialized morning television drama Oshin. She also narrated Onna wa Dokyō (1992) and Haru Yo Koi (1994–1995). A nonfiction voice role was in the series Kiwameru: Nihon no Bi to Kokoro.",
        "birthday": "1929-12-01",
        "deathday": "2023-03-23",
        "gender": 1,
        "homepage": null,
        "id": 78356,
        "imdb_id": "nm0621235",
        "known_for_department": "Acting",
        "name": "Tomoko Naraoka",
        "place_of_birth": "Komagome, Hongo Ward, Tokyo City, Tokyo Prefecture, Japan",
        "popularity": 0.4334,
        "profile_path": "/yDm0C5VLUZ616Gg20d4aNsWYurO.jpg"
    }
}