{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k3PqsPLkKLDyjZupZ6gqZHPxMv3.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 54138,
                "original_language": "en",
                "original_title": "Star Trek Into Darkness",
                "overview": "When the crew of the Enterprise is called back home, they find an unstoppable force of terror from within their own organization has detonated the fleet and everything it stands for, leaving our world in a state of crisis.  With a personal score to settle, Captain Kirk leads a manhunt to a war-zone world to capture a one man weapon of mass destruction. As our heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Kirk has left: his crew.",
                "popularity": 5.4208,
                "poster_path": "/7XrRkhMa9lQ71RszzSyVrJVvhyS.jpg",
                "release_date": "2013-05-05",
                "title": "Star Trek Into Darkness",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 9342,
                "character": "Additional Voices (voice)",
                "credit_id": "546927ee22136e68c9001cbb",
                "order": 75
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Arlen Alexander Escarpeta "
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nArlen Alexander Escarpeta (born April 9, 1981) is a Belizean actor.\n\nIn 2004, Escarpeta earned critical acclaim for his breakout film role as an honor student caught with a handgun at school in the independent drama American Gun. The film, which premiered at the Toronto Film Festival, also starred Forrest Whitaker, Marcia Gay Harden and Donald Sutherland. The following year, he co-starred with Matthew McConaughey and Matthew Fox in McG's true-life drama We Are Marshall, about the aftermath of the 1970 plane crash that killed Marshall University's football team.\n\nEscarpeta was more recently seen in David Wain's comedy, The Ten, which premiered at the 2007 Sundance Film Festival. He had earlier appeared in Carls Franklin's coutroom thriller High Crimes, starring Morgan Freeman and Ashely Judd.\n\nEscarpeta first gained attention on the small screen when he starred in the NBC series American Dreams. He played Sam Walker, a young black man dealing with the changing times of the turbulent '60s. His television work also includes guest roles in on such series as Law &amp; Order: Special Victims Unit, Without A Trace, Cold Case, Judging Amy, ER, The Shield, Boomtown, 7th Heaven and Boston Public.\n\nIn 2009 he played Lawrence, in the horror slasher Friday the 13th. Arlen follows Friday the 13th with leading roles in several features. He next stars in the drama Roslyn, followed by Preston Whitmore's Dough Boys. He also stars as a young LAPD officer on patrol during the racial gang war in the drama 818, on which Escarpeta also serves co-producer. Escarpeta has also been cast in Final Destination 5, the fifth film in the hit horror franchise.",
        "birthday": "1981-04-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 78432,
        "imdb_id": "nm0260224",
        "known_for_department": "Acting",
        "name": "Arlen Escarpeta",
        "place_of_birth": "Belize, Central America",
        "popularity": 0.7435,
        "profile_path": "/yQHVE1Nm8MAJ2r3MzZ7XflRjKb8.jpg"
    }
}