{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ieux01445tYkzGdAukUFiYZiDNn.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 41411,
                "original_language": "fr",
                "original_title": "La Rafle",
                "overview": "A faithful retelling of the 1942 \"Vel' d'Hiv Roundup\" and the events surrounding it.",
                "popularity": 3.512,
                "poster_path": "/9osPoGTddZZfMUzFDs82n57y2wQ.jpg",
                "release_date": "2010-03-10",
                "title": "The Round Up",
                "video": false,
                "vote_average": 7.546,
                "vote_count": 1025,
                "character": "Hélène Timonier",
                "credit_id": "52fe45c7c3a36847f80d9fe1",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Isabelle Gélinas (born October 13, 1963) is a French-Canadian actress.\n\nIsabelle Gélinas was born in Montreal, Quebec. She began her training course at the Cours Florent before joining the CNSAD where she took classes with teachers such as Pierre Vial, Daniel Mesguich and especially Michel Bouquet. Her beginnings in the occupation were not without difficulties, and she was often qualified as \"too young\", \"too mature\" and even \"not modern enough\". She had a hard time finding her place in the acting field. She began her career (1982–86) in the theater, playing in several dramas of Molière with Jean Davy as the director.\n\nIn 1986, her participation in the short film Triple sec with Suzanne Flon and André Dussollier gave her the opportunity to begin a film career. She had a real change in 1988 when she was featured in the comedy film Suivez cet avion (1989) with Lambert Wilson and in the drama film Chouans! (2009) with Philippe Noiret. She also began at the same time a television career featuring in several films mostly directed by Caroline Huppert. She then played in the drama films Mado poste restante (1989), Louis, the Child King (1992), Drôles d'oiseaux (1993), and in the comedy films À l'heure où les grands fauves vont boire (1993) and Regarde-moi quand je te quitte (1993). At the second part of the decade, she featured in two successful films playing supporting roles: Didier (1997) with Jean-Pierre Bacri and Alain Chabat, and Paparazzi (1998) with Vincent Lindon and Patrick Timsit. She played in television films of different fields such as Moi, Général de Gaulle (1990), J'ai deux amours (1996) and Chaos technique (1997).\n\nThe following decade, she played in a few comedy films such as Les gens en maillot de bain ne sont pas (forcément) superficiels (2001), Ne quittez pas (2003), Cherche fiancé tous frais payés (2005) and Ça se soigne? (2008). She has focused her career on television and theater, including many television fictions like Le Piège du Père Noël (2005), the trilogy of Inséparables (2005–06) with Michel Boujenah, but also Frappes interdites (2005) and Passés troubles (2006). She plays since 2007 one of the main roles in the comedy series Fais pas ci, fais pas ça.\n\nSource: Article \"Isabelle Gélinas\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1963-10-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 78475,
        "imdb_id": "nm0350746",
        "known_for_department": "Acting",
        "name": "Isabelle Gélinas",
        "place_of_birth": "Montreal, Canada",
        "popularity": 0.1209,
        "profile_path": "/xdoOUJxr1RoCVsBxSNObftAvBGr.jpg"
    }
}