{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sI6uCeF8mUlZx22mFfHSi9W3XQ9.jpg",
                "genre_ids": [
                    10749,
                    18,
                    35
                ],
                "id": 843527,
                "original_language": "en",
                "original_title": "The Idea of You",
                "overview": "40-year-old single mom Solène begins an unexpected romance with 24-year-old Hayes Campbell, the lead singer of August Moon, the hottest boy band on the planet. As they begin a whirlwind romance, it isn't long before Hayes' superstar status poses unavoidable challenges to their relationship, and Solène soon discovers that life in the glare of his spotlight might be more than she bargained for.",
                "popularity": 15.7829,
                "poster_path": "/Y5P4Q3q8nrruZ9aD3wXeJS2Plg.jpg",
                "release_date": "2024-05-02",
                "title": "The Idea of You",
                "video": false,
                "vote_average": 7.353,
                "vote_count": 1764,
                "character": "Graham Norton",
                "credit_id": "65e76e282afb250131d5c3c6",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/rQaHA74pevnGsxcKGaoZVGWe9TC.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    14,
                    18
                ],
                "id": 508442,
                "original_language": "en",
                "original_title": "Soul",
                "overview": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.",
                "popularity": 10.8093,
                "poster_path": "/pEz5aROvfy5FBW1OTlrDO3VryWO.jpg",
                "release_date": "2020-12-25",
                "title": "Soul",
                "video": false,
                "vote_average": 8.104,
                "vote_count": 10932,
                "character": "Moonwind (voice)",
                "credit_id": "5f8746afa8067300393fc709",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "그레이엄 노튼"
        ],
        "biography": "Graham William Walker, better known by his stage name Graham Norton, is an Irish TV and radio presenter, comedian, and actor. He is a five-time BAFTA TV Award winner for his comedy chat show The Graham Norton Show. Previously shown on BBC Two, it took the prestigious Friday night slot on BBC One from Jonathan Ross in 2010.\n\nHe also presents on BBC Radio 2 and is the BBC television commentator of the Eurovision Song Contest, which led Hot Press to describe him as \"the 21st century's answer to Terry Wogan\". Norton is known for his innuendo-laden dialogue and flamboyant presentation style. In 2012, he sold his production company, So Television, to ITV for around £17 million.",
        "birthday": "1963-04-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 78577,
        "imdb_id": "nm0636218",
        "known_for_department": "Acting",
        "name": "Graham Norton",
        "place_of_birth": "Clondalkin, South Dublin, Ireland",
        "popularity": 0.4055,
        "profile_path": "/zndDiPrNXtbxGLVhFhSlpCkaHIH.jpg"
    }
}