{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x7y8ezKtU1vRInk0dmbvDoKgJ8u.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 2898,
                "original_language": "en",
                "original_title": "As Good as It Gets",
                "overview": "Melvin Udall, a cranky, bigoted, obsessive-compulsive writer of romantic fiction, is rude to everyone he meets, including his gay neighbor, Simon. After Simon is brutally attacked and hospitalized, Melvin finds his life turned upside down when he has to look after Simon's dog. In addition, Carol, the only waitress at the local diner who will tolerate him, leaves work to care for her chronically ill son, making it impossible for Melvin to eat breakfast.",
                "popularity": 5.5237,
                "poster_path": "/xXxuJPNUDZ0vjsAXca0O5p3leVB.jpg",
                "release_date": "1997-12-19",
                "title": "As Good as It Gets",
                "video": false,
                "vote_average": 7.397,
                "vote_count": 3930,
                "character": "Cafe 24 Waitress",
                "credit_id": "55c8d7fcc3a36804a0000a22",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Rebekah Jordan"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nRebekah Johnson, also credited as Rebekah Jordan or Rebekah, is an American singer-songwriter and actress from Ohio. She wrote the song \"Beautiful Disaster\" for Kelly Clarkson who loved the song so much she put it on both her first two albums. In 1998, she released \"Remember to Breathe\" on Elektra Records, the radio singles were \"Sin So Well\" and \"Hey Genius\". Rebekah sought and was eventually granted a release from the label due to creative differences. She signed with J Records briefly, but did not complete or release an album. In 2005, Rebekah, under the name Rebekah Jordan, financed, produced and released her new CD independently through her own Tea Party Records. The 6 song EP, titled \"The Trouble With Fiction\" includes 5 original songs and what is becoming a signature interpretation of the Stevie Nicks classic, \"Dreams\". Rebekah enlisted the help of musicians that played with her on stage to play for the recording. Butch on drums and percussion (from The Eels, Rufus Wainwright, Tracy Chapman), John Ballinger on guitar and clarinet (from Rufus Wainwright) and Jessica Catron on cello. In 2006, along with Butch, John Ballinger and Jessica Catron, Rebekah formed a new band, \"Dreaming Ferns\". Rebekah has had important roles in two films, Barry Levinson's Liberty Heights and in the 2003 gay romantic drama Latter Days where she sings two themes: Another Beautiful Day and Tuesday 3:00am.\n\nDescription above from the Wikipedia article Rebekah Johnson, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1976-09-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 78596,
        "imdb_id": "nm0426041",
        "known_for_department": "Acting",
        "name": "Rebekah Johnson",
        "place_of_birth": "Ohio, USA",
        "popularity": 0.1186,
        "profile_path": "/oCsz5J5giL1BJ7eU4fjA48vAfhi.jpg"
    }
}