{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ywWva4trKw7f3wtbz81Fe3FnrtC.jpg",
                "genre_ids": [
                    12,
                    18,
                    37
                ],
                "id": 581,
                "original_language": "en",
                "original_title": "Dances with Wolves",
                "overview": "Wounded Civil War soldier John Dunbar tries to commit suicide—and becomes a hero instead. As a reward, he's assigned to his dream post, a remote junction on the Western frontier, and soon makes unlikely friends with the local Sioux tribe.",
                "popularity": 8.3759,
                "poster_path": "/hw0ZEHAaTqTxSXGVwUFX7uvanSA.jpg",
                "release_date": "1990-03-30",
                "title": "Dances with Wolves",
                "video": false,
                "vote_average": 7.842,
                "vote_count": 4467,
                "character": "Ten Bears",
                "credit_id": "52fe4255c3a36847f8016357",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/sAiTihJ8bjEqg8nYUIlTQUnVXuj.jpg",
                "genre_ids": [
                    37,
                    12
                ],
                "id": 2023,
                "original_language": "en",
                "original_title": "Hidalgo",
                "overview": "Set in 1890, this is the story of a Pony Express courier who travels to Arabia to compete with his horse, Hidalgo, in a dangerous race for a massive contest prize, in an adventure that sends the pair around the world...",
                "popularity": 5.2524,
                "poster_path": "/iGzENlBPYJEFWZnye4t3nqWSSp1.jpg",
                "release_date": "2004-02-04",
                "title": "Hidalgo",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1271,
                "character": "Chief Eagle Horn",
                "credit_id": "52fe432dc3a36847f8040453",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/kGlEhkmFaGUvhBvLvhhq9i9OOXX.jpg",
                "genre_ids": [
                    10402,
                    18,
                    36
                ],
                "id": 10537,
                "original_language": "en",
                "original_title": "The Doors",
                "overview": "The story of the famous and influential 1960s rock band and its lead singer and composer, Jim Morrison.",
                "popularity": 3.445,
                "poster_path": "/x1LM3dzGuG6xOz0aT2e71o11vhu.jpg",
                "release_date": "1991-03-01",
                "title": "The Doors",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1506,
                "character": "Shaman",
                "credit_id": "577894edc3a36832b00003b9",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kanghi Duta",
            "Floyd Westerman",
            "Floyd Red Crow Westerman"
        ],
        "biography": "Floyd Red Crow Westerman (August 17, 1936 – December 13, 2007) was a Dakota Sioux musician, political activist, and actor. He was known for years as a renaissance man, for his many talents, dedication and passion. A member of the Dakota (Sioux) nation, he was an accomplished actor on the big and small screen for over 20 years, a political advocate for indigenous and environmental causes worldwide and a popular singer/songwriter, performing with such stars as Willie Nelson, Bonnie Raitt, Don Henley and Kris Kristofferson to name just a few.\n\nRed Crow’s last endeavor again merged his own life experiences with his distinctive brand of artistry. With his most recent series of bronze sculptures, he beautifully recreated the most sacred spiritual Lakota/Dakota “Sacred Pipe,” as well as busts of the greatest, most influential leaders in Native American history. Legendary heroes Sitting Bull, Geronimo and Chief Joseph, who led their nations against persecution and the devastating invasion of their land in the mid-19th century, compose an ideal triumvirate on which part of this collectible art is based.\n\nThe pieces were personally sculpted by Red Crow in an impressionistic medium before being bronzed to create a fine patina glow. Upon completion, they were autographed by Red Crow, and given an official authentication number. The busts of the famous Native American leaders, which stand approximately 1-1/2 feet high, were handcrafted to match the pose of a corresponding historical photograph. One noteworthy characteristic of these busts is the leaders’ eyes, to which Floyd gave particular attention, because in his words, “The eyes are key to the spirit of each of these men. “Plus, they are of course, the window to their soul.”",
        "birthday": "1936-08-17",
        "deathday": "2007-12-13",
        "gender": 2,
        "homepage": "https://floydredcrowwesterman.com",
        "id": 7862,
        "imdb_id": "nm0922671",
        "known_for_department": "Acting",
        "name": "Floyd \"Red Crow\" Westerman",
        "place_of_birth": "South Dakota, USA",
        "popularity": 0.2034,
        "profile_path": "/pJFB7xCPy2PntmPKBg5d3UDVXAA.jpg"
    }
}