{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2wS8pMZgvzq7kaZb5LHX54poQnA.jpg",
                "genre_ids": [
                    18,
                    27
                ],
                "id": 381283,
                "original_language": "en",
                "original_title": "mother!",
                "overview": "A couple's relationship is tested when uninvited guests arrive at their home, disrupting their tranquil existence.",
                "popularity": 4.1136,
                "poster_path": "/fjny9chXPx69ln1LMJxbwi5yHMt.jpg",
                "release_date": "2017-09-13",
                "title": "mother!",
                "video": false,
                "vote_average": 6.967,
                "vote_count": 6867,
                "character": "Drunkard",
                "credit_id": "59b10863c3a3682e6402b847",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Hidgen"
        ],
        "biography": "Robert Higden is a Canadian actor best known for his portrayal of the absent-minded vice-principal, Mr. Noseworthy, on the popular YTV series Radio Active.  He has appeared in over 30 feature films including: The Reagans opposite Judy Davis, Battlefield Earth opposite John Travolta, Gleason opposite Brad Garrett, The Human Stain opposite Gary Sinise, and Taking Lives, opposite Angelina Jolie.\n\nAs a founding member of Montreal’s On the Spot, Robert has been performing improv for well over a decade. He was even chosen to compete on the Montreal team in the Just For Laughs Improv Tournament for several years running.\n\nAs a director, he has received a Gemini nomination for his work on the CBC series Edible Incredible, as well as a Canadian Comedy Award nomination for his work on Radio Active. (He often stage directed episodes he wasn’t in.)\n\nAs for writing, much of Robert’s work has been for sketch comedy shows and for his own stand up routines, but he has also written for TV, and has 4 feature length screenplays under his belt, which he is currently shopping around.  And of course, he continues to make his own films which have won him best short in the Actra shorts festival two years in a row, and best film in ASM’s 48 Hour Film Festival, 3 out of the 6 times he has entered.",
        "birthday": "1958-04-13",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.reisler.ca/reisler-talent-men-Robert-Higden.html",
        "id": 78687,
        "imdb_id": "nm0383280",
        "known_for_department": "Acting",
        "name": "Robert Higden",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 1.3156,
        "profile_path": "/42r4Ci5Og3PBQevpLKMqe2CNyvF.jpg"
    }
}