{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sPMBiyjTco4JdKojlfGIz5Wd0jC.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10757,
                "original_language": "hi",
                "original_title": "कभी ख़ुशी कभी ग़म",
                "overview": "Years after his father disowns his adopted brother for marrying a woman of lower social standing, a young man goes on a mission to reunite his family.",
                "popularity": 4.6308,
                "poster_path": "/12BvYKueY0eruZuTYIextEZaCC.jpg",
                "release_date": "2001-12-14",
                "title": "Kabhi Khushi Kabhie Gham",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 572,
                "character": "Rohan Raichand",
                "credit_id": "52fe43b09251416c7501a3bd",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "هریتیک روشن"
        ],
        "biography": "Hrithik Roshan is an Indian actor who appears in Bollywood films.  After having appeared in films as a child actor in the 1980s, Roshan made his film debut in a leading role in Kaho Naa... Pyaar Hai (2000) for which Roshan earned his Filmfare Awards for Best Actor and Best Male Debut. In 2001, he went on to appear in the melodrama Kabhi Khushi Kabhie Gham..., which became India's highest-grossing film in the overseas market and his biggest commercial success to date.\n\nFollowing through with several unnoticed performances from 2002–03, he starred in the commercially successful Koi... Mil Gaya and its sequel Krrish, both of which won him numerous Best Actor awards.Roshan received his third Filmfare Award for Best Actor in 2006 for his performance in the action film Dhoom 2. He later received critical acclaim for his performance in Jodhaa Akbar, for which he received his first international award at the Golden Minbar International Film Festival. These accomplishments have established him as a leading contemporary actor of Hindi cinema.",
        "birthday": "1974-01-10",
        "deathday": null,
        "gender": 2,
        "homepage": "https://hrxbrand.com/",
        "id": 78749,
        "imdb_id": "nm0004335",
        "known_for_department": "Acting",
        "name": "Hrithik Roshan",
        "place_of_birth": "Mumbai, Maharashtra, India",
        "popularity": 0.9575,
        "profile_path": "/5O7WrWe84WDFj7td64NVsobtHf3.jpg"
    }
}