{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nCl5KzxUs4rVVlAdixDf4r5AbbZ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 887,
                "original_language": "en",
                "original_title": "The Best Years of Our Lives",
                "overview": "It's the hope that sustains the spirit of every GI: the dream of the day when he will finally return home. For three WWII veterans, the day has arrived. But for each man, the dream is about to become a nightmare.",
                "popularity": 6.1356,
                "poster_path": "/gd5EoAU4MM57sW3vlWxJ0NMM8cV.jpg",
                "release_date": "1946-12-25",
                "title": "The Best Years of Our Lives",
                "video": false,
                "vote_average": 7.79,
                "vote_count": 694,
                "character": "Cliff Scully",
                "credit_id": "52fe4287c3a36847f80261f5",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/cap8458wFeRCJSKxL758dI82TRK.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 15794,
                "original_language": "en",
                "original_title": "White Heat",
                "overview": "A psychopathic criminal with a mother complex makes a daring break from prison and then leads his old gang in a chemical plant payroll heist. After the heist, events take a crazy turn.",
                "popularity": 4.9266,
                "poster_path": "/v7cPOHKKZI9qChi7HDUxNIhEcLR.jpg",
                "release_date": "1949-09-02",
                "title": "White Heat",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 506,
                "character": "'Big Ed' Somers",
                "credit_id": "52fe467d9251416c75079fa3",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Стив Кокран",
            "Robert Alexander Cochran"
        ],
        "biography": "He is perhaps best remembered for his role of Big Ed Somers, the power hungry gangster pal of James Cagney in \"White Heat\" (1949). Born Robert Alexander Cochran in Eureka, California, he was the son of a California lumberjack, who moved the family to Wyoming in the 1920s, where Cochran grew to adulthood. After graduating from the University of Wyoming in 1939, Cochran began working steadily as a Wyoming cowboy, while developing his acting skills working in summer stock and regional theaters and gradually moving on to Broadway. In 1945, he signed with MGM, and for the next several years, played mostly secondary roles as gangsters or boxers. He made his film debut with \"Boston Blackie Booked on Suspicion\" (1945) and quickly followed with \"Wonder Man\" (1945). Released from his contract in 1948, he returned to Broadway where he worked with Mae West; the next year he signed on with Warner Brothers, where he earned leading roles in such films as \"The Damned Don't Cry\" (1950), \"Highway 301\" (1950) and \"Tomorrow is Another Day\" (1951). Warner Brothers often had him playing the villain in several of its western films, such as \"Dallas\" (1950), and \"Back to God's Country\" (1953). With the end of his contract in 1953, he began his own film company, Robert Alexander Productions, while also freelancing for other studios and moving on to guest star roles on television shows. He would show up in such television shows as Death Valley Days, Burke's Law, The Untouchables, Naked City, The Twilight Zone, Route 66, and The Virginian. A notorious womanizer, Cochran was married and divorced three times, and was often in the Hollywood tabloids reportedly having affairs with such actresses as Mae West, Jayne Mansfield, Joan Crawford, Merle Oberon, Ida Lupino and Mamie Van Doren. Cochran died under mysterious circumstances. In May 1965, Cochran had revived his production company, and together with three women, whom he had hired as his assistants, boarded his 40-foot yacht to travel to Central and South America to look for filming locations. On June 25, 1965, the yacht drifted into Port Champerico, Guatemala, with three alive but very distraught women aboard and the body of Steve Cochran, who had died ten days earlier. The women did not know how to operate the boat, and were dependent upon its drifting to shore after his death. There were numerous rumors of murder and poisoning, and actress / former lover Merle Oberon used her influence to push for further police investigation, but no evidence of foul play was ever determined. The official cause of his death was given as Acute Infectious Edema (lung infection).",
        "birthday": "1917-05-25",
        "deathday": "1965-06-15",
        "gender": 2,
        "homepage": null,
        "id": 78792,
        "imdb_id": "nm0168215",
        "known_for_department": "Acting",
        "name": "Steve Cochran",
        "place_of_birth": "Eureka, California",
        "popularity": 0.2499,
        "profile_path": "/pQu49oRFMm1iDvQfAHsbw3mzRQG.jpg"
    }
}