{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y1giivdsGLyo1LCvlsL6mLKyTZ7.jpg",
                "genre_ids": [
                    53,
                    18,
                    9648
                ],
                "id": 1018,
                "original_language": "en",
                "original_title": "Mulholland Drive",
                "overview": "Blonde Betty Elms has only just arrived in Hollywood to become a movie star when she meets an enigmatic brunette with amnesia. Meanwhile, as the two set off to solve the second woman's identity, filmmaker Adam Kesher runs into ominous trouble while casting his latest project.",
                "popularity": 9.3955,
                "poster_path": "/x7A59t6ySylr1L7aubOQEA480vM.jpg",
                "release_date": "2001-06-06",
                "title": "Mulholland Drive",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 6652,
                "character": "Gene",
                "credit_id": "52fe42e5c3a36847f802aeff",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "William \"Billy\" Ray Cyrus (born August 25, 1961) is an American country music singer, songwriter and actor, who helped make country music a worldwide phenomenon. He has released eleven studio albums since 1992, released 38 singles, best known for his Number One single \"Achy Breaky Heart\", that became the first single ever to achieve triple Platinum status in Australia and the 1992's best selling single in the same country. Thanks to the video of this hit, there was the explosion of the linedance into the mainstream, becoming a worldwide craze. Cyrus, a multi-platinum selling recording artist, has scored a total of eight top-ten singles on the Billboard Country Songs chart. His most successful album to date is the debut of Some Gave All, which has been certified 9× Multi-Platinum in the United States and is the longest time spent by a debut artist at Number One on the Billboard 200 (17 consecutive weeks) and most consecutive chart-topping weeks in the SoundScan era. It's the only album (from any genre) in the SoundScan era to log 17 consecutive weeks at Number One and is also the top-ranking debut album by a male country artist. It ranked 43 weeks in the top 10, a total topped by only one country album in history, Ropin' The Wind by Garth Brooks. Some Gave All was also the first debut album to enter at the number 1 in the Billboard Country Albums. The album has also sold more than 20 million copies worldwide and is the Best selling debut album of all time for a solo male artist. Some Gave All was also the best selling album of the 1992 in the US with 4,832,000 copies. In his career, he has released 29 charted singles, of which 15 charted in the Top 40. From 2001 to 2004, Cyrus starred in the television show Doc. The show was about a country doctor who moved from Montana to New York City. In late 2005, he began to co-star in the Disney Channel series Hannah Montana with his daughter Miley Cyrus. The series finale aired on January 16, 2011. In 2010, it was announced that he and his son Trace Cyrus would take part in a new Syfy reality series called UFO: Unbelievably Freakin' Obvious.\n\nDescription above from the Wikipedia article Billy Ray Cyrus, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1961-08-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 78887,
        "imdb_id": "nm0004854",
        "known_for_department": "Acting",
        "name": "Billy Ray Cyrus",
        "place_of_birth": "Flatwoods, Kentucky, USA",
        "popularity": 0.4722,
        "profile_path": "/ly0Ejh5micQppq2L6UJvbl8Y674.jpg"
    }
}