{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uif5fUshJrXyyDzfpzp1DLw3N0S.jpg",
                "genre_ids": [
                    27,
                    53,
                    9648
                ],
                "id": 539,
                "original_language": "en",
                "original_title": "Psycho",
                "overview": "When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother.",
                "popularity": 8.4504,
                "poster_path": "/yz4QVqPx3h1hD1DfqqQkCq3rmxW.jpg",
                "release_date": "1960-06-22",
                "title": "Psycho",
                "video": false,
                "vote_average": 8.422,
                "vote_count": 10504,
                "character": "Tom Cassidy",
                "credit_id": "52fe424fc3a36847f8014271",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/3q35nBLCIdEbxYfsr7D5ocYQXKz.jpg",
                "genre_ids": [
                    18,
                    10751,
                    14
                ],
                "id": 1585,
                "original_language": "en",
                "original_title": "It's a Wonderful Life",
                "overview": "A holiday favourite for generations...  George Bailey has spent his entire life giving to the people of Bedford Falls.  All that prevents rich skinflint Mr. Potter from taking over the entire town is George's modest building and loan company.  But on Christmas Eve the business's $8,000 is lost and George's troubles begin.",
                "popularity": 6.3809,
                "poster_path": "/bSqt9rhDZx1Q7UZ86dBPKdNomp2.jpg",
                "release_date": "1946-12-20",
                "title": "It's a Wonderful Life",
                "video": false,
                "vote_average": 8.272,
                "vote_count": 4589,
                "character": "Sam Wainwright",
                "credit_id": "52fe4301c3a36847f803357d",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/bXPKTWAuRO8Mu5rLCORFagX0YZ1.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 574,
                "original_language": "en",
                "original_title": "The Man Who Knew Too Much",
                "overview": "A couple vacationing in Morocco with their young son accidentally stumble upon an assassination plot. When the child is kidnapped to ensure their silence, they have to take matters into their own hands to save him.",
                "popularity": 3.4537,
                "poster_path": "/gy8YBRjCQRIT9x9G9F5fpnFD4xw.jpg",
                "release_date": "1956-05-16",
                "title": "The Man Who Knew Too Much",
                "video": false,
                "vote_average": 7.456,
                "vote_count": 1476,
                "character": "Taxidermist (uncredited)",
                "credit_id": "56c8b2f99251411738003c68",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Francis Healey Albertson",
            "Frankie"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nFrancis Healey Albertson (February 2, 1909 – February 29, 1964) was an American character actor who made his debut in a minor part in Hollywood at age thirteen. He had supporting roles in films such as It's a Wonderful Life (1946) and Psycho (1960).  Albertson made well over 100 appearances (1923–1964) in movies and television. In his early career he often sang and danced in such films as Just Imagine (1930) and A Connecticut Yankee (1931). He was featured in Alice Adams (1935) as the title character's brother, and in Room Service (1938) he played opposite the Marx Brothers. He served in the U.S. Army Air Forces' First Motion Picture Unit making training films during World War II. As he aged he moved from featured roles to supporting and character parts—in his later career he can be seen as Sam Wainwright, the businessman fond of saying \"Hee-Haw\" in the movie It's a Wonderful Life (1946).\n\nAlbertson portrayed future U.S. President Theodore Roosevelt in the 1956 episode \"Rough Rider\" of the CBS western television series My Friend Flicka. He guest starred in the early NBC western series The Californians and twice in the David Janssen crime drama Richard Diamond, Private Detective.\n\nHe was cast in 1959 and 1962 in different roles on Walter Brennan's sitcom The Real McCoys. In 1960, he appeared as General Devery in the episode \"Strange Encounter\" of the ABC/Warner Brothers western series Colt .45.\n\nIn 1960, he played the wealthy rancher Tom Cassidy at the beginning of Psycho (1960) who provides the $40,000 in cash that Janet Leigh's character later steals. In the 1960-61 television season, he played the character Mr. Cooper in five episodes of the CBS sitcom Bringing Up Buddy, starring Frank Aletter. In 1964, Albertson was cast as Jim O'Neal in the episode \"The Death of a Teacher\" of the NBC education drama Mr. Novak. One of his final screen appearances was as \"Sam,\" the bewildered mayor of Sweet Apple, Ohio, in the 1963 film musical Bye Bye Birdie.\n\nHis last appearance was on The Andy Griffith Show, in which he played a Marine commander completing an inspection. The episode aired on May 19, 1964, three months after Albertson died.",
        "birthday": "1909-02-02",
        "deathday": "1964-02-29",
        "gender": 2,
        "homepage": null,
        "id": 78902,
        "imdb_id": "nm0007214",
        "known_for_department": "Acting",
        "name": "Frank Albertson",
        "place_of_birth": "Fergus Falls, Minnesota, USA",
        "popularity": 0.2917,
        "profile_path": "/sT9JZ8GgHgunZS4PWIDX6wMoIS7.jpg"
    }
}