{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rLm66DbLwxHeRB34oJ1mhsu0urc.jpg",
                "genre_ids": [
                    27,
                    53,
                    18
                ],
                "id": 11167,
                "original_language": "en",
                "original_title": "Peeping Tom",
                "overview": "Loner Mark Lewis works at a film studio during the day and, at night, takes racy photographs of women. Also he's making a documentary on fear, which involves recording the reactions of victims as he murders them. He befriends Helen, the daughter of the family living in the apartment below his, and he tells her vaguely about the movie he is making.",
                "popularity": 2.1133,
                "poster_path": "/kM4AfLIlbcuRZ621vYjyeBFkuba.jpg",
                "release_date": "1960-05-16",
                "title": "Peeping Tom",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 846,
                "character": "Don Jarvis",
                "credit_id": "52fe44069251416c750265c7",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/iiusvOLB4ytkZ6FSFMlGHvt33uW.jpg",
                "genre_ids": [
                    10751,
                    14,
                    35
                ],
                "id": 252,
                "original_language": "en",
                "original_title": "Willy Wonka & the Chocolate Factory",
                "overview": "When eccentric candy man Willy Wonka promises a lifetime supply of sweets and a tour of his chocolate factory to five lucky kids, penniless Charlie Bucket seeks the golden ticket that will make him a winner.",
                "popularity": 6.5103,
                "poster_path": "/vmpsZkrs4Uvkp9r1atL8B3frA63.jpg",
                "release_date": "1971-06-29",
                "title": "Willy Wonka & the Chocolate Factory",
                "video": false,
                "vote_average": 7.478,
                "vote_count": 3764,
                "character": "Mr. Teevee (uncredited)",
                "credit_id": "57ed85f8c3a3686d0c0003be",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lawrence Michael Andrew Goodliffe"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nLawrence Michael Andrew Goodliffe (1 October 1914 – 20 March 1976) was an English actor best known for playing suave roles such as doctors, lawyers and army officers. He was also sometimes cast in working class parts.\n\nGoodliffe was born in Bebington, Cheshire (now Merseyside), the son of a vicar, and educated at St Edmund's School, Canterbury, and Keble College, Oxford. He started his career in repertory theatre in Liverpool before moving on to the Royal Shakespeare Company in Stratford upon Avon. He joined the British Army at the beginning of World War II, and received a commission as a Second Lieutenant in the Royal Warwickshire Regiment in February 1940. He was wounded in the leg and captured at the Battle of Dunkirk. Goodliffe was incorrectly listed as killed in action, and even had his obituary published in a newspaper. He was to spend the rest of the war a prisoner in Germany.\n\nWhilst in captivity he produced and acted in (and in some cases wrote) many plays and sketches to entertain fellow prisoners. These included two productions of William Shakespeare's Hamlet, one in Tittmoning and the other in Eichstätt, in which he played the title role. He also produced the first staging of Noel Coward's Post Mortem at Eichstätt. A full photographic record of these productions exists.\n\nAfter the war he resumed his professional acting career. As well as appearing in the theatre he worked in film and television. He appeared in The Wooden Horse in 1950 and in other POW films. His best known film was A Night to Remember (1958) in which he played Thomas Andrews, builder of the RMS Titanic. His best known television series was Sam (1973–75) in which he played an unemployed Yorkshire miner. He also appeared with John Thaw and James Bolam in the 1967 television series Inheritance.\n\nSuffering from depression, Goodliffe had a breakdown in 1976 during the period that he was rehearsing for a revival of Equus. He committed suicide a few days later by leaping from a hospital fire escape, whilst a patient at the Atkinson Morley Hospital in Wimbledon, London.\n\nDescription above from the Wikipedia article Michael Goodliffe,  licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1914-10-01",
        "deathday": "1976-03-20",
        "gender": 2,
        "homepage": null,
        "id": 78940,
        "imdb_id": "nm0328982",
        "known_for_department": "Acting",
        "name": "Michael Goodliffe",
        "place_of_birth": "Bebington, Cheshire, England",
        "popularity": 0.2014,
        "profile_path": "/aPDwK1N12VSUFAnIBob5orfucL6.jpg"
    }
}