{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lewYqqt8epnjFhEOIIIINX9Z8EE.jpg",
                "genre_ids": [
                    12,
                    35,
                    18
                ],
                "id": 463257,
                "original_language": "en",
                "original_title": "The Peanut Butter Falcon",
                "overview": "A down-on-his-luck crab fisherman embarks on a journey to get a young man with Down syndrome to a professional wrestling school in rural North Carolina and away from the retirement home where he’s lived for the past two and a half years.",
                "popularity": 2.8596,
                "poster_path": "/qyQcRGvdW3VtxHR4fSDgPOePEip.jpg",
                "release_date": "2019-08-09",
                "title": "The Peanut Butter Falcon",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 1512,
                "character": "Sam",
                "credit_id": "5d6c83b3924ce50011db7c5b",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jake Roberts",
            "The Snake",
            "Fred Platt",
            "El Diablo",
            "The Texan",
            "Jake “The Snake” Roberts",
            "Aurelian Smith Jr."
        ],
        "biography": "Aurelian Smith Jr., better known by the ring name Jake \"The Snake\" Roberts, is an American actor and professional wrestler currently signed to All Elite Wrestling (AEW).s a second-generation American professional wrestler, the son of former wrestler Aurelian \"Grizzly\" Smith. He is best known by his ring name of Jake \"The Snake\" Roberts, and often brought snakes into the ring, including a boa constrictor named Damien and even a de-venomed cobra, named Lucifer.\n\nRoberts is best known for his two stints in the World Wrestling Federation—the first between 1986 and 1992, and the second between 1996 and 1997—though he also wrestled in the National Wrestling Alliance in 1983, World Championship Wrestling in 1992, and the Mexico-based Asistencia Asesoría y Administración between 1993 and 1994 and again in 1997. He appeared in Extreme Championship Wrestling during the summer of 1997, and has made sporadic appearances for Total Nonstop Action Wrestling from 2006 through 2008.\n\nThroughout his career he was known for his intense and cerebral promos, his dark charisma, his extensive use of psychology in his matches, and has been credited as inventor of the DDT maneuver. Roberts was also one of the subjects of the 1999 documentary film Beyond the Mat.\n\nDescription above from the Wikipedia article Jake Roberts, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1955-05-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 79027,
        "imdb_id": "nm0731195",
        "known_for_department": "Acting",
        "name": "Aurelian Smith Jr.",
        "place_of_birth": "Gainesville, Texas, USA",
        "popularity": 0.7559,
        "profile_path": "/28Pb1wjuxcEZ1chCwf60kbq86It.jpg"
    }
}