{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vyrCniZsrXZAW08eECKIp1BMLPh.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 50646,
                "original_language": "en",
                "original_title": "Crazy, Stupid, Love.",
                "overview": "Cal Weaver is living the American dream. He has a good job, a beautiful house, great children and a beautiful wife, named Emily. Cal's seemingly perfect life unravels, however, when he learns that Emily has been unfaithful and wants a divorce. Over 40 and suddenly single, Cal is adrift in the fickle world of dating. Enter, Jacob Palmer, a self-styled player who takes Cal under his wing and teaches him how to be a hit with the ladies.",
                "popularity": 6.8766,
                "poster_path": "/p4RafgAPk558muOjnBMHhMArjS2.jpg",
                "release_date": "2011-07-29",
                "title": "Crazy, Stupid, Love.",
                "video": false,
                "vote_average": 7.27,
                "vote_count": 8891,
                "character": "Claire",
                "credit_id": "54d1e7f2c3a3687388001fe6",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/nsWgxQrDcTVhSGzAu5kVlw64XB1.jpg",
                "genre_ids": [
                    10749,
                    35,
                    10770,
                    10402
                ],
                "id": 35558,
                "original_language": "en",
                "original_title": "Starstruck",
                "overview": "Pop star Christopher Wilde has fame, fortune and a big-budget Hollywood movie awaiting him. But after meeting Jessica Olson, a down-to-earth girl from the Midwest, he is faced with following his heart or doing what's best for his career.",
                "popularity": 3.9363,
                "poster_path": "/kuyJuNiiZvu5iNr8Dgv5y75v1uc.jpg",
                "release_date": "2010-02-14",
                "title": "Starstruck",
                "video": false,
                "vote_average": 7.027,
                "vote_count": 1209,
                "character": "Barbara Olson",
                "credit_id": "5659a3c99251410daf0035f4",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nElizabeth Anna Halcyon \"Beth\" Littleford (born July 17, 1968) is an American actress, comedienne, and television personality. She is perhaps best known for being one of the original correspondents on the popular Comedy Central satirical news series The Daily Show from 1996 to 2000, she is also known by Tripp`s mother Beth Campbell from \"I`m in The Band\".\n\nLittleford was born in Nashville, Tennessee, the daughter of Jackie, a professor, and Philip O. Littleford, a cardiologist and inventor. She lives in Los Angeles, California with her husband, Rob Fox, and their son, Jackson Oliver Fox, born July 30, 2005. She has guest-starred on numerous television programs during the late 1990s and 2000s such as Spin City (where she had a multi-year occasional role), The West Wing, Family Guy, and Frasier. Littleford was also a celebrity commentator on VH1's I Love the 80s Strikes Back in 2003, I Love the 90s in 2004, I Love the 90s: Part Deux in 2005, I Love the New Millennium and The Great Debate in 2009. She was the female lead on the short-lived Fox seriesMethod and Red, and also starred as Ben Tennyson's mother Sandra in Ben 10: Race Against Time, and reprised role again in the Ben 10: Alien Force episode 20 and in Ben 10: Ultimate Alien. Most recently, Littleford appeared in TV commercials for Laughing Cow cheese and a hotel chain. She currently stars in the Disney XD original show I'm in the Band, the 2010 Disney channel movie, Starstruck (2010 film), and plays Suzanne Berger on MTV's The Hard Times of RJ Berger .\n\nDescription above from the Wikipedia article Beth Littleford, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1968-07-17",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 79024,
        "imdb_id": "nm0514719",
        "known_for_department": "Acting",
        "name": "Beth Littleford",
        "place_of_birth": "Nashville, Tennessee, USA",
        "popularity": 0.2373,
        "profile_path": "/oFvUrZNH76UAEji9E0IhHPLIPdy.jpg"
    }
}