{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xbjOkrAaT4CAIrNJ38oQSBomHvg.jpg",
                "genre_ids": [
                    16,
                    27,
                    28,
                    878
                ],
                "id": 133121,
                "original_language": "ja",
                "original_title": "バイオハザード ダムネーション",
                "overview": "U.S. federal agent Leon S. Kennedy sneaks into the \"East Slavic Republic\" to verify rumors that Bio-Organic Weapons (BOWs) are being used in the country's civil war, which the U.S. and Russia are making preparations to jointly intervene in. Right after his infiltration, the U.S. government orders him to leave immediately. Determined to uncover the truth, Leon ignores the order and enters the battlefield to end the chain of tragedies caused by the BOWs.",
                "popularity": 5.2583,
                "poster_path": "/zkHSURVCrt7rpvDDgUXO75CV1v4.jpg",
                "release_date": "2012-09-25",
                "title": "Resident Evil: Damnation",
                "video": false,
                "vote_average": 6.891,
                "vote_count": 940,
                "character": "Svetlana Belikova (voice)",
                "credit_id": "52fe4ba7c3a368484e1934f7",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Melinda Wendee Lee"
        ],
        "biography": "Melinda Wendee Lee (born February 20, 1960) is an American voice actress.While she has done voice work for many video games as well as several episodes in the Power Rangers franchise, she is particularly prolific in the dubbing of anime. As of April 2009, with 223 credits to her name, she has more credits in this medium than any other English voice-over actor. According to her interview on the Magic Knight Rayearth DVDs, she started doing voices at school, and got in trouble for it.\n\nLee is also experienced in ADR directing. Currently, both she and Kirk Thornton are directing the ADR process for Bleach. Her noted roles include Faye Valentine on Cowboy Bebop, Takeru \"T.K.\" Takaishi on Digimon Adventure, Haruhi Suzumiya on The Melancholy of Haruhi Suzumiya and Konata Izumi on Lucky ☆ Star.",
        "birthday": "1960-02-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 79051,
        "imdb_id": "nm0283253",
        "known_for_department": "Acting",
        "name": "Wendee Lee",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.1706,
        "profile_path": "/ojPHjXFtUhh7PlBNAAu0fiv5h5z.jpg"
    }
}