{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a3eYLIK5eYSHAJTtOy9PdciVjxx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 28580,
                "original_language": "en",
                "original_title": "The Lost Weekend",
                "overview": "Don Birnam, a long-time alcoholic, has been sober for ten days and appears to be over the worst... but his craving has just become more insidious. Evading a country weekend planned by his brother and girlfriend, he begins a four-day bender that just might be his last - one way or another.",
                "popularity": 2.7569,
                "poster_path": "/8ggIOoCzt8xT2ePl8DdlRtXgcOh.jpg",
                "release_date": "1945-11-29",
                "title": "The Lost Weekend",
                "video": false,
                "vote_average": 7.628,
                "vote_count": 629,
                "character": "Gloria",
                "credit_id": "52fe45a3c3a368484e066639",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Doris Rita Smith",
            "Дорис Даулинг"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nDoris Dowling (May 15, 1923 – June 18, 2004) was an American actress of film, stage and television.  After her time as a chorus-girl on Broadway, Detroit-born Doris Dowling followed her elder sister Constance to Hollywood. Her first credited film role was that of Gloria, barfly and drinking companion to fellow alcoholic Ray Milland in the 1945 film The Lost Weekend. She next appeared in The Blue Dahlia, which starred Alan Ladd and Veronica Lake. As post-war work became more scarce, she emigrated to Italy to revive her career, as her sister had done.\n\nIn Italy, Dowling starred in several acclaimed films including Bitter Rice. She appeared in Orson Welles's European production of Othello  in 1952, playing Bianca. Upon returning to the US, much of her work was  in theatre and on television. She appeared in such television shows as Alfred Hitchcock Presents, Bonanza, Perry Mason, The Andy Griffith Show, and, late in her career, The Incredible Hulk, Kojak and finally, The Dukes of Hazzard in 1984. She also co-starred with Bob Cummings and Julie Newmar in the sitcom My Living Doll.\n\nIn 1973, Dowling shared an Outer Critics Circle award for her performance in a revival of The Women on Broadway.\n\nPersonal life\n\nDowling dated Billy Wilder and married three times. She was band leader Artie Shaw's 7th wife, by whom she had a son, Jonathan. Her other husbands were Robert F. Blumofe (1956–1959) and Leonard B. Kaufman (1960 until her death in 2004).",
        "birthday": "1923-05-15",
        "deathday": "2004-06-18",
        "gender": 1,
        "homepage": null,
        "id": 79248,
        "imdb_id": "nm0235835",
        "known_for_department": "Acting",
        "name": "Doris Dowling",
        "place_of_birth": "Detroit, Michigan, USA",
        "popularity": 0.1691,
        "profile_path": "/8sibfhAVgRuADjHocdfcgeUtHop.jpg"
    }
}