{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a3eYLIK5eYSHAJTtOy9PdciVjxx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 28580,
                "original_language": "en",
                "original_title": "The Lost Weekend",
                "overview": "Don Birnam, a long-time alcoholic, has been sober for ten days and appears to be over the worst... but his craving has just become more insidious. Evading a country weekend planned by his brother and girlfriend, he begins a four-day bender that just might be his last - one way or another.",
                "popularity": 2.7569,
                "poster_path": "/8ggIOoCzt8xT2ePl8DdlRtXgcOh.jpg",
                "release_date": "1945-11-29",
                "title": "The Lost Weekend",
                "video": false,
                "vote_average": 7.628,
                "vote_count": 629,
                "character": "Nat the Bartender",
                "credit_id": "52fe45a3c3a368484e066635",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Howard Silverblatt",
            "Howard DaSilva",
            "Howard DaSylva"
        ],
        "biography": "Howard da Silva (born Howard Silverblatt, May 4, 1909 – February 16, 1986) was an American actor, director and musical performer on stage, film, television and radio. He was cast in dozens of productions on the New York stage, appeared in more than two dozen television programs, and acted in more than fifty feature films. Adept at both drama and musicals on the stage, he originated the role of Jud Fry in the original 1943 run of the Rodgers and Hammerstein musical Oklahoma!, and also portrayed the prosecuting attorney in the 1957 stage production of Compulsion. Da Silva was nominated for a 1960 Tony Award as Best Featured Actor in a Musical for his work in Fiorello!, a musical about New York City mayor LaGuardia. In 1961, da Silva directed Purlie Victorious, by Ossie Davis.",
        "birthday": "1909-05-04",
        "deathday": "1986-02-16",
        "gender": 2,
        "homepage": null,
        "id": 79247,
        "imdb_id": "nm0196247",
        "known_for_department": "Acting",
        "name": "Howard Da Silva",
        "place_of_birth": "Cleveland, Ohio, USA",
        "popularity": 0.1924,
        "profile_path": "/pHLybgdBcZcMDtxSM1J4xs8zKh4.jpg"
    }
}