{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/esIoQw7VaykfHsw6fx2VltZ1R7U.jpg",
                "genre_ids": [
                    27,
                    9648,
                    14
                ],
                "id": 16093,
                "original_language": "en",
                "original_title": "Carnival of Souls",
                "overview": "Mary Henry ends up the sole survivor of a fatal car accident through mysterious circumstances. Trying to put the incident behind her, she moves to Utah and takes a job as a church organist. But her fresh start is interrupted by visions of a fiendish man. As the visions begin to occur more frequently, Mary finds herself drawn to the deserted carnival on the outskirts of town. The strangely alluring carnival may hold the secret to her tragic past.",
                "popularity": 2.2313,
                "poster_path": "/9ddPGH7kMe81xznwIKCt17VFUPi.jpg",
                "release_date": "1962-11-02",
                "title": "Carnival of Souls",
                "video": false,
                "vote_average": 6.93,
                "vote_count": 506,
                "character": "Mary Henry",
                "credit_id": "52fe46a29251416c7507e7af",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Candace Hilligoss (born August 14, 1935, Huron, South Dakota) is an American actress.\n\nAfter three years at the University of Iowa, she came to New York City to study acting at the American Theatre Wing and made her professional debut in summer stock in Pennsylvania. She acted at the Cape Cod Playhouse, appeared in a touring production of Idiot's Delight with Nina Foch, performed in television programs produced in New York, and danced at the Copacabana nightclub.\n\nShe is best-known for her portrayal of Mary Henry, a church organist haunted by specters, in Carnival of Souls (1962), a low-budget horror film that has developed a cult following. She also appeared in The Curse of the Living Corpse (1964).\n\nDescription above from the Wikipedia article Candace Hilligoss, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1935-08-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 79298,
        "imdb_id": "nm0385010",
        "known_for_department": "Acting",
        "name": "Candace Hilligoss",
        "place_of_birth": "Huron, South Dakota, USA",
        "popularity": 0.1456,
        "profile_path": "/2snLWDrBcNfkOIf0f8TlBG404eV.jpg"
    }
}