{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ubICMSUij3ntP9BjnQsV3rTVnAF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 783,
                "original_language": "en",
                "original_title": "Gandhi",
                "overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
                "popularity": 4.3456,
                "poster_path": "/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
                "release_date": "1982-12-01",
                "title": "Gandhi",
                "video": false,
                "vote_average": 7.557,
                "vote_count": 2390,
                "character": "Colin's Mother",
                "credit_id": "55f7633cc3a3685c9c000440",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Эвис Баннедж"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nAvis Bunnage (22 April 1923, Manchester, England, UK – 4 October 1990, England) was a British actress of film, stage and television.\n\nShe attended Manley Park Municipal School and Chorlton Central School in Manchester. She worked as a secretary and a nursery teacher before deciding to become an actress. She gained stage experience in rep and made her first professional appearance at Chorlton Rep Theatre in Manchester in 1947. Most notably, she appeared as Veronica, the wife of Rigsby, in Rising Damp, for one episode. Bunnage was a member of Joan Littlewood's Theatre Workshop company at the Theatre Royal Stratford East. There she created the role of Helen, the mother in A Taste of Honey, her first West End role when the play transferred to Wynndems Theatre, and also a role in Oh, What a Lovely War! at Stratford East, which also transferred to Wyndams Theatre. When Avis was on holiday from this production for two weeks, her role was taken over by Danny La Rue. Among her other roles for Theatre Workshop were Mrs. Lovitt in Christopher Bond's play Sweeny Todd (the basis for the Sondheim musical), and the title role in a play about the music hall legend Marie Lloyd. In the early years of Coronation Street she played Lucile Hewitt's auntie. She was in the musical Billy at the Theatre Royal Drury Lane, playing the mother of 'Billy Liar'. She played Golda in Fiddler on the Roof, opposite Alfie Bass, at Her Majesty's Theatre in London.\n\nMarried to Derek Orchard, she died in Thorpe Bay, Southend-on-Sea, Essex, aged 67.\n\nDescription above from the Wikipedia article Avis Bunnage, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1923-04-22",
        "deathday": "1990-10-04",
        "gender": 1,
        "homepage": null,
        "id": 79356,
        "imdb_id": "nm0120517",
        "known_for_department": "Acting",
        "name": "Avis Bunnage",
        "place_of_birth": "Manchester, England, UK",
        "popularity": 0.1837,
        "profile_path": "/fgGWKda5acSLOTsq5jLnuzTz4hH.jpg"
    }
}