{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rjXK74vrvmFMN0vuFw3TViZ18Ha.jpg",
                "genre_ids": [
                    16,
                    10749,
                    12,
                    18,
                    14
                ],
                "id": 204436,
                "original_language": "fr",
                "original_title": "Jack et la mécanique du cœur",
                "overview": "In Scotland 1874, Jack is born on the coldest day ever. Because of the extreme cold, his heart stops beating. The responsible midwife in Edinburgh finds a way to save him by replacing his heart with a clock. So he lives and remains under the midwife's protective care. But he must not get angry or excited because that endangers his life by causing his clock to stop working. Worse than that, when he grows up, he has to face the fact he cannot fall in love because that too could stop his delicate heart.",
                "popularity": 2.3296,
                "poster_path": "/ZSrU2mvlzM5Jr30XtKCU1fziIj.jpg",
                "release_date": "2014-02-05",
                "title": "Jack and the Cuckoo-Clock Heart",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 738,
                "character": "Arthur (voice)",
                "credit_id": "59f47ee4c3a3682017010fdc",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Arthur Higelin",
            "Arthur H"
        ],
        "biography": "Arthur Higelin (born 27 March 1966), better known under his stage name Arthur H, is a French pianist, songwriter and singer. He is best known in France for his live performances—four of his albums were recorded live.\n\nHe is the son of the French singer Jacques Higelin and Nicole Courtois, and half brother of singers Izïa Higelin and stage and film actor, theatre director and music video director Kên Higelin.\n\nAfter traveling in the West Indies, he studied music in Boston before returning to Paris and developing his eclectic but highly personal musical style, drawing on such influences as Thelonious Monk, Serge Gainsbourg, the Sex Pistols, jazz, blues, Middle Eastern music and the tango. He first performed in 1988 in clubs in Paris, as leader of a trio with bassist Brad Scott and drummer Paul Jothy.\n\nHis first album, Arthur H (1990), combined rhythmic experimentation and bal-musette elements with a vocal style which has been compared to Tom Waits. He toured widely around this time, particularly in France and Japan, adding a fourth band member, Jon Handelsman (saxophone), and produced a second album, Bachibouzouk (1992). In early 1993, he did a six-week season at the Magic Mirrors, an antique circus big top, which was later put on as a touring show and recorded on the live album En chair et en os.\n\nIn 1996, he released the album Trouble Fête, following which he performed a season at the Gymnase in Paris. The live album Fête Trouble (1997) included some tracks from these shows as well as others recorded on tour in Africa. He toured the United States and Canada in 1998.\n\nIn 2000, he wrote the soundtrack for Michel Couvelard's film, Inséparables, before touring in Asia and Canada. His next album, Pour Madame X (2000), featured the touring band of Nicolas Repac (guitar), Brad Scott (double bass) and Laurent Robin (drums).\n\nIn 2001, he took part in the show Le Cabaret Imprudent with \"Le Cirque Cahin-caha\". The following year, he released the album Piano Solo, recorded live in a studio and mainly consisting of solo interpretations of earlier songs. This was followed by a band album, Négresse Blanche (2003), comprising tracks dedicated to the memory of famous women such as Marilyn Kaddish and Bo Derek.\n\nIn 2005, a planned tour of China was cancelled, and he returned to the studio to record the album Adieu Tristesse. This was the most commercially successful of his career, and included several duets, one with his father and another, \"Est-ce que tu aimes?\", with the musician -M- (Matthieu Chedid). He subsequently toured widely in France, Lebanon and Canada.\n\nIn 2006, he published a book, Onirique attaque, containing lyrics, reflections and photographs. He also composed the soundtrack for the film L'homme qui rêvait d'un enfant, directed by Delphine Gleize. The soundtrack was performed by an ensemble of children from a local music school.\n\nThe album Show Time, issued late in 2006, was recorded live on tour and includes duets with Matthieu Chedid, Pauline Croze, Lhasa de Sela and Jacques Higelin. In June 2008 he released the album L'Homme du Monde, which won the award of Pop/Rock Album of the Year 2009 at La Victoire de la Musique. ...\n\nSource: Article \"Arthur H\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1966-03-27",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.arthur-h.net/",
        "id": 79553,
        "imdb_id": "nm0351685",
        "known_for_department": "Acting",
        "name": "Arthur H.",
        "place_of_birth": "Paris, France",
        "popularity": 0.0379,
        "profile_path": "/juiUJ0LLZ20ll0uS83fNLX4r557.jpg"
    }
}