{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bHjrGR0Fzn4QEBhvjiwdyMPaYVH.jpg",
                "genre_ids": [
                    18,
                    9648,
                    27
                ],
                "id": 1813,
                "original_language": "en",
                "original_title": "The Devil's Advocate",
                "overview": "Aspiring Florida defense lawyer Kevin Lomax accepts a job at a New York law firm. With the stakes getting higher every case, Kevin quickly learns that his boss has something far more evil planned.",
                "popularity": 10.8501,
                "poster_path": "/5ZzBGpxy55OQzHxKVY11IpY6a0o.jpg",
                "release_date": "1997-10-17",
                "title": "The Devil's Advocate",
                "video": false,
                "vote_average": 7.471,
                "vote_count": 6394,
                "character": "Tiffany",
                "credit_id": "58f23107c3a3682ede00a50e",
                "order": 45
            },
            {
                "adult": false,
                "backdrop_path": "/ww9pokP6M6gp2Iu0o3sT5B7eN66.jpg",
                "genre_ids": [
                    12,
                    18,
                    10749
                ],
                "id": 547,
                "original_language": "en",
                "original_title": "The Horse Whisperer",
                "overview": "The mother of a severely traumatized daughter enlists the aid of a unique horse trainer to help the girl's equally injured horse.",
                "popularity": 9.1472,
                "poster_path": "/ptkDeHY2mRJVyNRyxb9TgyAjTYs.jpg",
                "release_date": "1998-02-01",
                "title": "The Horse Whisperer",
                "video": false,
                "vote_average": 6.897,
                "vote_count": 1144,
                "character": "Member of Magazine Staff",
                "credit_id": "58f231419251412fb500ad61",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gloria Henry",
            "Gloria L. Henry"
        ],
        "biography": "Gloria Lynne Henry was born in Detroit. Her acting career started very early as she has been performing on stage since the age of eight. After receiving her B.F.A. in theater arts at Wayne State University in Detroit, Gloria helped to create a children's' theater program at Detroit's Attic theater. She has also traveled with the international group 'Up With People', on its European tour and performed in Equity playhouses across the United States.\n\nHer first experience in front of the camera was in a small role in the TV movie Bare Essence (1982), but it was not until 1994 when she got recognition from Horror/Sci-Fi fans worldwide after co-starring in Phantasm III: Lord of the Dead (1994). Don Coscarelli gave her the role of Rocky mainly because of her tough look and the fact that she was a student of the martial arts. To date, it remains as her most important cinematic performance and even nowadays she keeps going to Horror conventions and Phantasm reunions to meet her numerous fans.\n\nSince her appearance in Phantasm III: Lord of the Dead (1994), Gloria had a couple of brief roles in The Devil's Advocate (1997) and in The Horse Whisperer (1998). More recently, she's been working in a variety of national commercials.\n\nIn addition to her acting work, Gloria has also performed as lead singer in the critically acclaimed funk/rock band 'Chatter', which was originally formed by her cousin Brian Hardgroove, who has extensive music credits.\n\nGloria Lynne Henry currently resides in Los Angeles with her husband and son.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 79581,
        "imdb_id": "nm0377840",
        "known_for_department": "Acting",
        "name": "Gloria Lynne Henry",
        "place_of_birth": "Detroit, Michigan, USA",
        "popularity": 0.0143,
        "profile_path": "/oltO7ytuIwTKsoZfNq56I2p5Lyt.jpg"
    }
}