{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bFntIQxWBwtzYAFc68xF1GKAfiv.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 17979,
                "original_language": "en",
                "original_title": "A Christmas Carol",
                "overview": "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
                "popularity": 8.9377,
                "poster_path": "/goHDZUnqZJ7FN4h48Qh6MzJNExl.jpg",
                "release_date": "2009-11-04",
                "title": "A Christmas Carol",
                "video": false,
                "vote_average": 6.892,
                "vote_count": 4727,
                "character": "Fat Cook / Portly Gentleman #2 / Business Man #3 (voice)",
                "credit_id": "52fe47589251416c75096041",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/9hWiNbvLR3nPDanTdEWOc4EeBGp.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 704,
                "original_language": "en",
                "original_title": "A Hard Day's Night",
                "overview": "Capturing John Lennon, Paul McCartney, George Harrison and Ringo Starr in their electrifying element, 'A Hard Day's Night' is a wildly irreverent journey through this pastiche of a day in the life of The Beatles during 1964. The band have to use all their guile and wit to avoid the pursuing fans and press to reach their scheduled television performance, in spite of Paul's troublemaking grandfather and Ringo's arrest.",
                "popularity": 2.2603,
                "poster_path": "/6Ulsccp2VkaVU5qbya3bxm9JG4x.jpg",
                "release_date": "1964-07-07",
                "title": "A Hard Day's Night",
                "video": false,
                "vote_average": 7.332,
                "vote_count": 708,
                "character": "Adrian (uncredited)",
                "credit_id": "59f4de229251414cfd01a38e",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джулиан Холлоуэй"
        ],
        "biography": "Julian Holloway (June 24, 1944 - February 16, 2025) was a British actor. For over six decades, he enjoyed a long and varied career on stage and screen.  The son of comedic actor and singer Stanley Holloway and chorus dancer Violet Lane, he made his theatrical debut in London's West End in \"All Square\" (1963). Other West End credits include Christopher Hampton's first play \"When Did You Last See My Mother?\", Colin Spencer's \"Spitting Image\", replacing Michael Gambon in Alan Ayckbourn's trilogy \"The Norman Conquests\", and a revival of \"Arsenic And Old Lace\".  He performed in many of the \"Carry On\" films, starting with Follow That Camel (1967).\n\nAround 1970, Holloway began to work primarily in television, including guest roles in Elizabeth R., The New Avengers, Doctor Who, and Rumpole of the Bailey. He also continued to work in theater as a director and producer. In the early 1990s, Holloway moved to California, where he would appear in American programs such as Beverly Hills, 90210 and Remember WENN. In 1993, he made his Broadway debut in a revival of \"My Fair Lady\" (playing the role of Alfred P. Doolittle originated by his father). Later film appearances included A Christmas Carol (2009) and The Rum Diary (2011).\n\nHolloway also established himself as a prolific voice actor, notably as a regular in the series James Bond Jr. (1991), Where's Waldo (1991), Captain Zed And The Zee Zone (1991 - 1992), and Father of the Pride (2004 - 2005).  He had a recurring role as the voice of Death in Cartoon Network's Regular Show (2011 - 2017) and as Prime Minister Almec Star Wars: The Clone Wars (2008-2020). Holloway also performed as a vocal artist for several video games, such as Pirates of the Caribbean: At World's End (2007) and Star Wars: The Old Republic (2011).\n\nHolloway was briefly married to actress Zena Walker in 1971. In 1976, he had a brief relationship with Tessa Dahl, daughter of Patricia Neal and Roald Dahl. The relationship produced one daughter, the author and former model Sophie Dahl. He was later married to voice over artist and actress Debbie Wheeler from 1991 until their divorce in 1996. Holloway died on February 16, 2025, aged 80.",
        "birthday": "1944-06-24",
        "deathday": "2025-02-16",
        "gender": 2,
        "homepage": null,
        "id": 79635,
        "imdb_id": "nm0391327",
        "known_for_department": "Acting",
        "name": "Julian Holloway",
        "place_of_birth": "Watlington, Oxfordshire, England, UK",
        "popularity": 0.3723,
        "profile_path": "/jSyFsNIRvibQ9LKqAfJ4yIRuHaT.jpg"
    }
}