{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a8IFeO1BMn4QEfLsf41Ml7LodyC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 72570,
                "original_language": "en",
                "original_title": "The Vow",
                "overview": "Happy young married couple Paige and Leo are, well, happy. Then a car accident puts Paige into a life-threatening coma. Upon awakening she has lost the previous five years of memories, including those of her beloved Leo, her wedding, a confusing relationship with her parents, or the ending of her relationship with her ex-fiance. Despite these complications, Leo endeavors to win her heart again and rebuild their marriage.",
                "popularity": 7.0617,
                "poster_path": "/y5GUXzTvt7kSQbdQrSvbYNoa8HB.jpg",
                "release_date": "2012-02-05",
                "title": "The Vow",
                "video": false,
                "vote_average": 7.236,
                "vote_count": 4143,
                "character": "Rose",
                "credit_id": "613cd79cd7107e008e32b0e5",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/yvbXGWjg30sj7rohEZvSe90jSJC.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 396371,
                "original_language": "en",
                "original_title": "Molly's Game",
                "overview": "Molly Bloom, a young skier and former Olympic hopeful becomes a successful entrepreneur (and a target of an FBI investigation) when she establishes a high-stakes, international poker game.",
                "popularity": 5.7926,
                "poster_path": "/in43bQ7k0ttr666IPP94IlbQbTR.jpg",
                "release_date": "2017-12-07",
                "title": "Molly's Game",
                "video": false,
                "vote_average": 7.146,
                "vote_count": 3847,
                "character": "Leah",
                "credit_id": "592ab7a2c3a36877df062da5",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rachel Alice Marie Skarsten",
            "Рэйчел Скарстен"
        ],
        "biography": "Rachel Skarsten (born 23 April 1985) is a Canadian actress best known for her roles as Dinah Lance / Black Canary on the WB series Birds of Prey, Tamsin in the Syfy series Lost Girl, Elizabeth I of England in Reign, and Beth Kane / Alice in Batwoman.  Skarsten was born in Toronto, Ontario, Canada, on April 23, 1985. She is fluent in Norwegian and English. She graduated from Queen's University in Kingston, Ontario, with a double degree in English Literature and Classical Studies.\n\nSkarsten began her acting career in theatre, appearing in several productions with the Royal Alexandra Theatre in Toronto. She made her television debut in 2002, with a starring role in the WB series Birds of Prey. She played Dinah Lance / Black Canary, a superhero who fights crime with her teammates, Oracle and Huntress. The series lasted for one season.\n\nIn 2010, Skarsten was cast as Tamsin in the Syfy series Lost Girl. Tamsin is a Fae who is half-human and half-Succubus. She is a powerful and dangerous creature who is often at odds with the main character, Bo Dennis. The series ran for five seasons.\n\nIn 2013, Skarsten was cast as Elizabeth I of England in the CW series Reign. Elizabeth is the Queen of England and a complex and powerful figure. Skarsten received critical acclaim for her performance, and she was nominated for a Canadian Screen Award for Best Actress in a Drama Series. The series ran for four seasons.\n\nIn 2019, Skarsten was cast as Beth Kane / Alice in the The CW series Batwoman. Beth is the twin sister of Kate Kane, who becomes Batwoman. Alice is a villain who is obsessed with Kate and seeks revenge on her. The series ran for three seasons.",
        "birthday": "1985-04-23",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.rachelskarsten.com",
        "id": 80018,
        "imdb_id": "nm0803896",
        "known_for_department": "Acting",
        "name": "Rachel Skarsten",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.8439,
        "profile_path": "/baBNWNO0IiIVC3w9QqZPH0U9CJM.jpg"
    }
}