{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lAaAtQ5b8iX9JeG6QUq4RM1paKD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10435,
                "original_language": "en",
                "original_title": "Chaplin",
                "overview": "An aged Charlie Chaplin narrates his life to his autobiography's editor, including his rise to wealth and comedic fame from poverty, his turbulent personal life and his run-ins with the FBI.",
                "popularity": 2.9824,
                "poster_path": "/Aeltt5tl02zrEj4GoMynHc94lWG.jpg",
                "release_date": "1992-12-17",
                "title": "Chaplin",
                "video": false,
                "vote_average": 7.438,
                "vote_count": 1131,
                "character": "Sydney Chaplin",
                "credit_id": "547789f3c3a368530f000893",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/bAtFhmRHp0f6aHqj1UGTZoPcmQo.jpg",
                "genre_ids": [
                    18,
                    35,
                    53
                ],
                "id": 930564,
                "original_language": "en",
                "original_title": "Saltburn",
                "overview": "Struggling to find his place at Oxford University, student Oliver Quick finds himself drawn into the world of the charming and aristocratic Felix Catton, who invites him to Saltburn, his eccentric family's sprawling estate, for a summer never to be forgotten.",
                "popularity": 11.0519,
                "poster_path": "/zGTfMwG112BC66mpaveVxoWPOaB.jpg",
                "release_date": "2023-11-16",
                "title": "Saltburn",
                "video": false,
                "vote_average": 6.973,
                "vote_count": 2636,
                "character": "Duncan",
                "credit_id": "634225cab18f32007ce7e752",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul Rhys (born 19 December 1963) is a Welsh actor with an extensive career in theatre, radio, television and film.  Rhys was born in Neath to working-class Catholic parents, Kathryn Ivory and Richard Charles Rhys, a labourer. He is of part-Irish descent on his mother's side. From the age of ten, he bred and trained horses, becoming a highly accomplished rider. A committed punk during his youth, Rhys sang in several bands. His first acting job was playing Liverpudlian judo expert Ralph in John Godber's hit play Bouncers, before leaving for London, where he qualified for his Equity card by singing jazz standards at lunchtime for Peter Boizot's Pizza Express and Kettners.\n\nRhys received a Bernard Shaw Scholarship to study at RADA. In the first term he was spotted by Philip Prowse and was invited to perform in Oscar Wilde's A Woman of No Importance at the Glasgow Citizens Theatre, playing the illegitimate son, Gerald. He also appeared as Dean Swift in Julien Temple's film Absolute Beginners. Rhys completed his education at RADA by winning the William Pole prize and the Bancroft Gold Medal.\n\nHis next film role was in Franklin J. Schaffner's Lionheart. After a brief spell at the Royal Shakespeare Company he played opposite Colin Firth in Richard Eyre's award-winning film Tumbledown. Soon after this, he appeared in Vincent & Theo, directed by American film director Robert Altman, as Vincent van Gogh's younger brother Theo van Gogh. Continuing the theme of famous brothers, Paul then played Sydney Chaplin opposite Robert Downey Jr.'s Charlie Chaplin in Richard Attenborough's Chaplin. He went on to play Massis in Alan Bennett's 102 Boulevard Haussmann. He then appeared opposite Peter O'Toole in Rebecca's Daughters. A series of films then followed including From Hell, Food of Love, Love Lies Bleeding, Becoming Colette and Hellraiser: Deader. He appears as Talleyrand in Ridley Scott's 2023 epic Napoleon, and as Duncan in Emerald Fennell's Saltburn.\n\nRunning parallel to Rhys's film work has been a diverse and notable television career, working in leading roles with directors such as Mike Hodges, Stephen Frears, Sir Richard Eyre, Philip Martin, Christopher Morahan, Tom Vaughan, Edward Hall, Harry Bradbeer in productions including Tumbledown, A Dance to the Music of Time, The Heroes, Ghosts, Gallowglass, The Healer, Anna Karenina, The Deal, Beethoven, The Ten Commandments, Borgia, Luther and Spooks. In 2008 Rhys appeared in the series Agatha Christie's Poirot. In 2014, he played the lead as traitor Aldrich Ames, in The Assets miniseries, then as King George III in Turn: Washington's Spies and as Sir John Conroy in Victoria. He has made a minor industry out of playing vampires: Being Human (as Ivan); as Vlad, the Prince of Wallachia aka Dracula in seasons 1–3 of the 2015 series Da Vinci's Demons; and as Andrew Hubbard in two seasons of the 2020–2021 hit, A Discovery of Witches. In 2023, he appears as Tommy in the BBC film, Men Up.",
        "birthday": "1963-12-19",
        "deathday": null,
        "gender": 2,
        "homepage": "https://pantheon.world/profile/person/Paul_Rhys",
        "id": 80365,
        "imdb_id": "nm0722631",
        "known_for_department": "Acting",
        "name": "Paul Rhys",
        "place_of_birth": "Neath, Glamorgan, Wales, UK",
        "popularity": 0.4171,
        "profile_path": "/l7uc38oZGMQbbq7WqE8rKn9xZJr.jpg"
    }
}