{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gH8pdqF9H3xzYjtSrz4xZt1rLpJ.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 9799,
                "original_language": "en",
                "original_title": "The Fast and the Furious",
                "overview": "Dominic Toretto is a Los Angeles street racer suspected of masterminding a series of big-rig hijackings. When undercover cop Brian O'Conner infiltrates Toretto's iconoclastic crew, he falls for Toretto's sister and must choose a side: the gang or the LAPD.",
                "popularity": 1.072,
                "poster_path": "/gqY0ITBgT7A82poL9jv851qdnIb.jpg",
                "release_date": "2001-06-22",
                "title": "The Fast and the Furious",
                "video": false,
                "vote_average": 6.997,
                "vote_count": 10403,
                "character": "Big Rig Driver (uncredited)",
                "credit_id": "58e59d20c3a36872f6033c89",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kevin Tod Smith"
        ],
        "biography": "Kevin Smith, born Kevin Todd Smith on March 16, 1963, in Auckland, New Zealand, was an actor best known for his role as Ares in the television series \"Hercules: The Legendary Journeys.\" He developed an interest in acting at a young age and pursued a career in the entertainment industry.\n\nSmith's breakthrough came when he was cast as the mischievous and manipulative god of war, Ares, in \"Hercules: The Legendary Journeys,\" which aired from 1995 to 1999. His portrayal of Ares made him a fan favorite, and he became a recurring character in the series. Smith's on-screen chemistry with Kevin Sorbo, who played the lead role of Hercules, contributed to the show's success.\n\nOutside of his work on \"Hercules,\" Smith also made appearances as Ares in the spin-off series \"Xena: Warrior Princess\" and in the made-for-television movies based on both shows. His portrayal of Ares showcased his talent for balancing charm, charisma, and villainous tendencies, making him a memorable presence in the world of Greek mythology-themed television.\n\nTragically, Kevin Smith's life was cut short when he suffered a fatal fall during a film production in China on February 15, 2002, at the age of 38. His untimely death was mourned by fans and colleagues alike, as he had left an indelible mark on the \"Hercules\" and \"Xena\" franchises with his memorable performance as Ares.",
        "birthday": "1963-03-16",
        "deathday": "2002-02-15",
        "gender": 2,
        "homepage": null,
        "id": 80406,
        "imdb_id": "nm0808963",
        "known_for_department": "Acting",
        "name": "Kevin Smith",
        "place_of_birth": "Auckland, New Zealand",
        "popularity": 0.3403,
        "profile_path": "/ofD6H52wDnkuGHNwT9T41IOxq9s.jpg"
    }
}