{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uD6AG36ykWAwKfSrLBuaVmpRC0.jpg",
                "genre_ids": [
                    16,
                    28
                ],
                "id": 217993,
                "original_language": "en",
                "original_title": "Justice League: War",
                "overview": "The world is under attack by an alien armada led by the powerful Apokoliptian, Darkseid. A group of superheroes consisting of Superman, Batman, Wonder Woman, The Flash, Green Lantern, Cyborg, and Shazam must set aside their differences and gather together to defend Earth.",
                "popularity": 3.2858,
                "poster_path": "/pdNprWYdgcB8z4FLD3BhRmhEys1.jpg",
                "release_date": "2014-01-21",
                "title": "Justice League: War",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1119,
                "character": "Pinstriped Loudmouth (voice)",
                "credit_id": "5a1a0140c3a3680b9a0350bc",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/cVqwzMSNPS4vgUDlXlSYoWOmGsI.jpg",
                "genre_ids": [
                    14,
                    16,
                    10751,
                    12,
                    35,
                    9648,
                    27
                ],
                "id": 615774,
                "original_language": "en",
                "original_title": "Scooby-Doo! Return to Zombie Island",
                "overview": "Scooby-Doo and his pals win an all-expense paid vacation and embark on a trip of a lifetime to a tropical paradise. Their destination however, turns out to be Zombie Island. As soon as they arrive, they realize the place looks strangely familiar and is reminiscent of a trip they took years ago, in which they became wrapped up in a mystery involving zombies. The gang soon learns that their trip to paradise comes with a price when the zombies re-emerge and attack their hotel. Will Scooby-Doo and the Mystery Inc. gang finally solve the mystery behind Zombie Island?",
                "popularity": 5.3564,
                "poster_path": "/vd0oIoWhEm8o7EpS0kV7RaV0Flf.jpg",
                "release_date": "2019-09-03",
                "title": "Scooby-Doo! Return to Zombie Island",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 942,
                "character": "Lead Cat Person / Narrator (voice)",
                "credit_id": "5d734b9912777800142845a5",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nRoger Rose is an American voice actor and former VH1 VJ, known for his voice-work in many animated cartoons. Happy Feet, Rugrats, Scooby Doo, The Grim Adventures of Billy and Mandy and Quack Pack are a few of examples of his previous work. He also narrates documentaries for Animal Planet.\n\nHe was raised in Wilmette, Illinois. He is the son of Hilly Rose, a radio personality in Los Angeles, and Sondra B. Gair, a pioneer radio interviewer with Chicago Public Radio. His brother was Judd Rose, of NBC. His first voice role was in the original Jetsons series in 1962, while his first live role was in an episode of Buck Rogers in the 25th Century. He auditioned at Rod Roddy's podium in 2004 for the announcing job on television's longest running game show, The Price Is Right, and was the announcer for the show's 6000th aired episode.\n\nHe starred in Ski Patrol (1990) and produced and acted in Comic Book: The Movie (2004). He voices on-air promo's for most Major Television networks. He voiced both the Dark Fiend Charles the 3rd and Aquatic Terror Gran Bruce in the video game Viewtiful Joe (2003). Some of his notable anime roles include several minor characters of Zatch Bell!. He also did the voice of Garbel of Manicuria on Bobobo-bo Bo-bobo. He currently is doing promos for TV shows such as Ugly Betty and Hannah Montana \"NCIS\" \"Big Bang\". He has also done a David Letterman impression on several animated series, such as Tiny Toons and Animaniacs. Most recently in 2008, he voiced Doctor Strange on The Super Hero Squad Show and Superman on Batman: The Brave and the Bold.\n\nHe is married and has two daughters, and two cats named Charlie and Oliver and a dog named \"Lenny\".\n\nHe can be heard on WLS-TV in Chicago.\n\nDescription above from the Wikipedia article Roger Rose, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1958-08-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 8049,
        "imdb_id": "nm0741648",
        "known_for_department": "Acting",
        "name": "Roger Rose",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2642,
        "profile_path": "/huGiGhkcHFhtT027UyWy9tbO8IW.jpg"
    }
}