{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aheSIG4h3JNxWeDvdb1NxKzgjaM.jpg",
                "genre_ids": [
                    36,
                    10752,
                    18,
                    12
                ],
                "id": 967,
                "original_language": "en",
                "original_title": "Spartacus",
                "overview": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
                "popularity": 6.2092,
                "poster_path": "/r0Fgg1GyZgzokaiw2HFQv3oPaL2.jpg",
                "release_date": "1960-10-13",
                "title": "Spartacus",
                "video": false,
                "vote_average": 7.54,
                "vote_count": 2262,
                "character": "Slave (uncredited)",
                "credit_id": "5601f0b2c3a368552f0004bb",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/hSRb0YhB4TaeIKgZtQbFuY3l0XM.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 143,
                "original_language": "en",
                "original_title": "All Quiet on the Western Front",
                "overview": "When a group of idealistic young men join the German Army during the Great War, they are assigned to the Western Front, where their patriotism is destroyed by the harsh realities of combat.",
                "popularity": 4.1542,
                "poster_path": "/1wZUB08igw8iLUgF1r4T6aJD65b.jpg",
                "release_date": "1930-04-29",
                "title": "All Quiet on the Western Front",
                "video": false,
                "vote_average": 7.741,
                "vote_count": 862,
                "character": "Detering",
                "credit_id": "5909997b9251411cde00b6bc",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Herold R. Goodwin",
            "Herold Goodwin",
            "Herald Goodwin",
            "Harald Goodwin"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nHarold Goodwin (December 1, 1902 – July 12, 1987) was an American film actor who performed in over 225 films.\n\nBorn in Peoria, Illinois, Goodwin began his film career while still in his teens in the 1915 film short Mike's Elopement. One of his most popular roles of the silent era was that of Ted Brown in the 1927 Buster Keaton comedy College. Goodwin followed up with a role in another Keaton film The Cameraman in 1928 opposite Keaton and actress Marceline Day. He worked steadily through the silent film era and transitioned into the talkie era as a popular character actor. One of his most notable roles of the era was that of Detering in the 1930 Lewis Milestone directed World War I drama All Quiet on the Western Front.\n\nIn his later years, Goodwin mainly acted in the Western film genre and often worked as a stuntmen for film studios. In the 1960s, Goodwin made many guest appearances of the NBC television series Daniel Boone starring Fess Parker and Ed Ames.\n\nGoodwin made his last film appearance in the low-budget horror film The Boy Who Cried Werewolf before retiring from the film industry. He died in Woodland Hills, Los Angeles, California, USA in 1987 after being shot for adultery.",
        "birthday": "1902-12-01",
        "deathday": "1987-07-12",
        "gender": 2,
        "homepage": null,
        "id": 80545,
        "imdb_id": "nm0329467",
        "known_for_department": "Acting",
        "name": "Harold Goodwin",
        "place_of_birth": "Peoria, Illinois, USA",
        "popularity": 0.1539,
        "profile_path": "/iBjhsEdnsSs9Ll14rgKrSl33iff.jpg"
    }
}