{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hKrrCigPFmhv1bg5IJl9nzjEaN4.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 631,
                "original_language": "en",
                "original_title": "Sunrise: A Song of Two Humans",
                "overview": "A married farmer falls under the spell of a slatternly woman from the city, who tries to convince him to drown his wife.",
                "popularity": 3.3885,
                "poster_path": "/oj8ZW8jKXBSs8F1e5iWsTUeXSJW.jpg",
                "release_date": "1927-11-04",
                "title": "Sunrise: A Song of Two Humans",
                "video": false,
                "vote_average": 7.836,
                "vote_count": 850,
                "character": "Dance Hall Manager (uncredited)",
                "credit_id": "56428f9c9251410a47000196",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/nVpp3ZcIFtJJ3fJp65eJczehIN8.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 3063,
                "original_language": "en",
                "original_title": "Duck Soup",
                "overview": "Rufus T. Firefly is named president/dictator of bankrupt Freedonia and declares war on neighboring Sylvania over the love of wealthy Mrs. Teasdale.",
                "popularity": 2.3339,
                "poster_path": "/31t63plEGKHhYuuCpC9bFWO9SBS.jpg",
                "release_date": "1933-11-12",
                "title": "Duck Soup",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 816,
                "character": "Mrs. Teasdale's Butler (uncredited)",
                "credit_id": "568ff1c2c3a3683246002702",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/r18vpGFsNf6n984x4KdJmAAWKkP.jpg",
                "genre_ids": [
                    18,
                    27
                ],
                "id": 136,
                "original_language": "en",
                "original_title": "Freaks",
                "overview": "A circus' beautiful trapeze artist agrees to marry the leader of side-show performers, but his deformed friends discover she is only marrying him for his inheritance.",
                "popularity": 4.6606,
                "poster_path": "/fX2Wxd0W9E7eVClUd8kJTfennoV.jpg",
                "release_date": "1932-01-01",
                "title": "Freaks",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 1237,
                "character": "Hans' Butler (uncredited)",
                "credit_id": "5e61ed9f357c00001932e717",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sydney Bracey ",
            "Sidney Bracy ",
            "Sid Bracy",
            "Sydney Bracy",
            "Sidney Alfred Dunn"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nSidney Bracey (18 December 1877 – 5 August 1942) was an Australian-born American actor. After a stage career in Australia, on Broadway and in Britain, he appeared in 321 films between 1909 and 1942.\n\nBracey was born in Melbourne, Victoria, with the name Sidney Bracy, later changing the spelling of his last name. He was the son of Welsh tenor Henry Bracy and English actress Clara T. Bracy. His aunt was actress and dancer Lydia Thompson.\n\nHe began his stage career in Australia in the 1890s, with J. C. Williamson's comic opera companies. On Broadway, in 1900, he appeared as the tenor lead, Yussuf, in the first American production of The Rose of Persia at Daly's Theatre in New York. He then moved to England, appearing as Moreno in the Edwardian musical comedy hit The Toreador at the Gaiety Theatre, London in June 1901. He next joined the D'Oyly Carte Opera Company on tour in Britain, playing Terence O'Brian in The Emerald Isle from September 1901 to May 1902. He then left the D'Oyly Carte, continuing his stage career in Britain. He appeared in Amorelle at London's Comedy Theatre in 1904, The Winter's Tale in 1904–05, and A Persian Princess at Queen's Theatre in 1909.\n\nBack on Broadway, in 1912, he played as Sir Guy of Gisborne in a revival of Reginald de Koven's Robin Hood at the New Amsterdam Theatre, followed by Rob Roy at the Liberty Theatre in 1913. He then moved into film acting, making first silent films and then \"talkies\", until his death in 1942. Early in his film career, he wrote and directed a silent movie called Sid Nee's Finish, (Thanhouser Company (1914), in which he played the title character. In 1916, he changed the spelling of his last name to \"Bracey\". Silent film authority Diane MacIntyre gave this description of him: \"Bracey, a stately looking character man, was in big demand for authority like roles; such as movie directors, bosses and, most of the time, the most respectable and poised butler in all of Hollywood. He was thin, dark haired and had an earnest, yet sober, face that could break into a look of wide-eyed exasperation.\"\n\nBracy died in Hollywood, California on 5 August 1942, aged 64.",
        "birthday": "1877-12-17",
        "deathday": "1942-08-05",
        "gender": 2,
        "homepage": null,
        "id": 80546,
        "imdb_id": "nm0102718",
        "known_for_department": "Acting",
        "name": "Sidney Bracey",
        "place_of_birth": "Melbourne, Victoria, Australia",
        "popularity": 2.3225,
        "profile_path": "/g8ZJZVGVqa5Hn8sEsLjkIKjTVv9.jpg"
    }
}