{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fMQGVBk0ZyzxMQOBGkUazCkvMMR.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 38408,
                "original_language": "en",
                "original_title": "Life As We Know It",
                "overview": "After a disastrous first date for caterer Holly and network sports director Messer, all they have in common is a dislike for each other and their love for their goddaughter Sophie. But when they suddenly become all Sophie has in this world, Holly and Messer must set their differences aside. Juggling careers and social calendars, they'll have to find common ground while living under the same roof.",
                "popularity": 2.8541,
                "poster_path": "/zLzS2aOqKsS0QvEaY6SfBw4VBqh.jpg",
                "release_date": "2010-10-02",
                "title": "Life As We Know It",
                "video": false,
                "vote_average": 6.905,
                "vote_count": 3195,
                "character": "Janine Groff",
                "credit_id": "56a4b02bc3a36838930065a7",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "사라 번즈",
            "سارة بيرنز"
        ],
        "biography": "Sarah Burns is an American film and television actress and comedian, best known for playing Krista on HBO's Enlightened.\n\nBorn on Long Island, New York, Burns has performed improvisational comedy regularly at the Upright Citizens Brigade Theatre in New York City\n\nBurns is known for her appearances in comedic films and television series. Her film roles include Anne in Slow Learners (2015) opposite Adam Pally, Hailey in I Love You, Man (2009), Harper in Going the Distance (2010) and Janine Groff in Life as We Know It (2010).\n\nShe has also appeared in television productions including Damage Control (one episode; 2005), Flight of the Conchords (one episode; 2007), Party Down (one episode; 2010) and Ben and Kate (one episode; 2012). She had a costarring role in the short film Cried Suicide (2010), which was screened at the 2010 Tribeca Film Festival. Her short film \"The First Step\" (2012) premiered at the 2013 Seattle International Film Festival.\n\nShe appears as part of a recurring cast of sketch players for the Comedy Central television series Drunk History, which premiered in July 2013. In 2015, Burns was a series regular in second season of the FX comedy series Married. Burns was cast as Assistant District Attorney Emily Sinclair in Season Two of the show How to Get Away With Murder.\n\nIn 2009, Entertainment Weekly named her one of the \"25 Funniest Actresses in Hollywood\". In June 2013, Entertainment Weekly named Burns one of \"15 Actresses We're Rooting For\" as part of its \"Emmy Watch\".\n\nIn 2016, Burns appeared as Margie Turley in the Lorne Michaels-produced Brother Nature. In 2017, Burns appeared as Gabrielle in the HBO original miniseries Big Little Lies and in the Netflix series Wet Hot American Summer: Ten Years Later.\n\nIn 2020, Burns appeared as Kaylie in the Netflix film Desperados as well as a major role in the Netflix series Aunty Donna's Big Ol' House of Fun.",
        "birthday": "1981-07-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 80592,
        "imdb_id": "nm1901220",
        "known_for_department": "Acting",
        "name": "Sarah Burns",
        "place_of_birth": "Long Island, New York, USA",
        "popularity": 0.9027,
        "profile_path": "/jiugINKLg7JHTHknwpXTVapZaQD.jpg"
    }
}