{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tKRUCk2yARbAADLwwwrir6F5gpa.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 121986,
                "original_language": "en",
                "original_title": "Frances Ha",
                "overview": "An aspiring dancer moves to New York City and becomes caught up in a whirlwind of flighty fair-weather friends, diminishing fortunes and career setbacks.",
                "popularity": 6.0796,
                "poster_path": "/jrq1NoKvsxWCcffVOjegiYwloFN.jpg",
                "release_date": "2013-05-17",
                "title": "Frances Ha",
                "video": false,
                "vote_average": 7.35,
                "vote_count": 1728,
                "character": "Benji",
                "credit_id": "52fe4a73c3a368484e153efb",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/2T4bqHgYfzXNQoALJsvhW40kDTg.jpg",
                "genre_ids": [
                    10749,
                    18,
                    36
                ],
                "id": 167073,
                "original_language": "en",
                "original_title": "Brooklyn",
                "overview": "In 1950s Ireland and New York, young Eilis Lacey has to choose between two men and two countries.",
                "popularity": 2.46,
                "poster_path": "/cs7W8j5lI7qzRW6tKSj9p1Q0Ze7.jpg",
                "release_date": "2015-10-20",
                "title": "Brooklyn",
                "video": false,
                "vote_average": 7.312,
                "vote_count": 3168,
                "character": "Maurizio Fiorello",
                "credit_id": "53d14a690e0a265e0100cd0c",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "迈克尔·泽根",
            "Michael Zegen"
        ],
        "biography": "Michael Jonathan Zegen (born February 20, 1979) is an American actor. He is best known for his roles in the television series Rescue Me (2004–2011), Boardwalk Empire (2011–2014), and The Marvelous Mrs. Maisel (2017–2023).\n\nZegen was born to a teacher mother and a lawyer father, and lived in Glen Rock, New Jersey, before moving to nearby Ridgewood when he was five. He has two brothers. He is Jewish. His mother was born in Austria in a displaced persons' camp, and his maternal grandparents were Holocaust survivors from Ukraine and Poland. He attended Ridgewood High School, where he was active in the school's theater program. Zegen is a 2001 graduate of Skidmore College.\n\nHis role on Rescue Me began as a recurring character in seasons 1–3, playing the nephew of series lead Tommy Gavin (Denis Leary). In seasons 5–6, he was promoted to the main cast when his character began probationary firefighter school to become a firefighter.\n\nIn 2010, Zegen was cast as gangster Bugsy Siegel for the second, third, and fifth season of the HBO series, Boardwalk Empire. In 2011, Zegen, along with James Ransone, was cast in supporting roles in the HBO comedy series How To Make It In America. In mid-2011, Zegen was cast in a recurring guest role in the second season of the AMC series The Walking Dead. In 2014 he created the role of Liam off-Broadway in the dark comedy Bad Jews. Zegan made his Broadway debut in A View from the Bridge in 2015. In 2017, Zegen played Joel Maisel in The Marvelous Mrs. Maisel. For the role he has won two Outstanding Performance by an Ensemble in a Comedy Series awards from the Screen Actors Guild. He returned to Broadway in 2021 to star in Trouble in Mind by Alice Childress.",
        "birthday": "1979-02-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 80661,
        "imdb_id": "nm1652433",
        "known_for_department": "Acting",
        "name": "Michael Zegen",
        "place_of_birth": "Ridgewood, New Jersey, Stati Uniti",
        "popularity": 0.5161,
        "profile_path": "/8fq9xIPOyYgIY7Y5Pgk4RyC0L8l.jpg"
    }
}