{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/AoWW2J4PoDe0IPuCVQOk50QFS4D.jpg",
                "genre_ids": [
                    18
                ],
                "id": 16804,
                "original_language": "ja",
                "original_title": "おくりびと",
                "overview": "Daigo, a cellist, is laid off from his orchestra and moves with his wife back to his small hometown where the living is cheaper. Thinking he’s applying for a job at a travel agency he finds he’s being interviewed for work with departures of a more permanent nature – as an undertaker’s assistant.",
                "popularity": 3.849,
                "poster_path": "/mms4nMZuPYOyEengRxCaEk7SXMd.jpg",
                "release_date": "2008-09-13",
                "title": "Departures",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 868,
                "character": "Yuriko Kamimura",
                "credit_id": "52fe46ed9251416c750881dd",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/tb0uo01w2kDHiQwTszsLlSusAm4.jpg",
                "genre_ids": [
                    28,
                    878,
                    27
                ],
                "id": 315011,
                "original_language": "ja",
                "original_title": "シン・ゴジラ",
                "overview": "When a massive, gilled monster emerges from the deep and tears through the city, the government scrambles to save its citizens.  A rag-tag team of volunteers cuts through a web of red tape to uncover the monster's weakness and its mysterious ties to a foreign superpower.  But time is not on their side - the greatest catastrophe to ever befall the world is about to evolve right before their very eyes.",
                "popularity": 7.8246,
                "poster_path": "/jPNShaWZMpVF0iQ7j1dvTuZLD20.jpg",
                "release_date": "2016-07-29",
                "title": "Shin Godzilla",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1446,
                "character": "Reiko Hanamori : Minister of Defense",
                "credit_id": "570f2da092514102b3001ec0",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kimiko Yo was born in Yokohama, a city just south of Tokyo to a Japanese mother and Taiwanese father on the 12th of May 1956. Her cousin was actress Bunjaku Han. She became active in front of the camera in 1987 and has been a feature of Japanese television and cinema ever since. She had begun acting on the theatre stage in 1976. Audiences may mostly know her for her supporting role in Shin Gojira, as a sympathetic colleague in the 2008 films Departures, which won an Oscar, and kind wife and waitress in Ramen Girl, but she has almost 200 credits to her name. These include an abnormal neighbour in The Drugstore girl and serene presence in Café Lumière where she was directed by a Taiwanese director in Japan. Dear Doctor (2009) propelled her name forward in Japan and was an award winner. She has several Japan Academy prizes to her name. Like most celebrities she pushes products and has done commercials for telephone companies, shampoos and cosmetics manufacturers. Yo is married to a man who at the time was a NHK employee in 2006 and is managed by the Alpha Agency.",
        "birthday": "1956-05-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 80864,
        "imdb_id": "nm0948263",
        "known_for_department": "Acting",
        "name": "Kimiko Yo",
        "place_of_birth": "Yokohama, Kanagawa, Japan",
        "popularity": 0.873,
        "profile_path": "/g1NZGtCzJKpqgdjNbNYaKBPyYRw.jpg"
    }
}