{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jD0mmfqPRpvJUaPdpLl1vMj38CA.jpg",
                "genre_ids": [
                    36,
                    18,
                    10752
                ],
                "id": 284689,
                "original_language": "en",
                "original_title": "Testament of Youth",
                "overview": "Testament of Youth is a powerful story of love, war and remembrance, based on the First World War memoir by Vera Brittain, which has become the classic testimony of that war from a woman’s point of view. A searing journey from youthful hopes and dreams to the edge of despair and back again, it’s a film about young love, the futility of war and how to make sense of the darkest times.",
                "popularity": 5.3153,
                "poster_path": "/a6kFsaDCulCLfYHmKLDKTYaddM4.jpg",
                "release_date": "2015-01-16",
                "title": "Testament of Youth",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 771,
                "character": "Geoffrey",
                "credit_id": "59023fd9c3a36840ed002cf1",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/uVlUu174iiKhsUGqnOSy46eIIMU.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 402431,
                "original_language": "en",
                "original_title": "Wicked",
                "overview": "In the land of Oz, ostracized and misunderstood green-skinned Elphaba is forced to share a room with the popular aristocrat Glinda at Shiz University, and the two's unlikely friendship is tested as they begin to fulfill their respective destinies as Glinda the Good and the Wicked Witch of the West.",
                "popularity": 16.6828,
                "poster_path": "/2E1x1qcHqGZcYuYi4PzVZjzg8IV.jpg",
                "release_date": "2024-11-20",
                "title": "Wicked",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 2406,
                "character": "Fiyero",
                "credit_id": "675aaf18b9445da4de06c559",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jonny Bailey",
            "조너선 베일리",
            "โจนาธาน ไบลีย์",
            "جاناتان بیلی"
        ],
        "biography": "Jonathan Stuart Bailey (born 25 April 1988) is an English actor known for his dramatic, comedic, and musical roles on stage and screen. He is the recipient of a Laurence Olivier Award, a Critics' Choice Television Award, as well as a Primetime Emmy Award nomination.\n\nBailey began his career as a child actor in Royal Shakespeare Company productions, and by eight, he was performing as Gavroche in a West End production of Les Misérables. He has since starred in contemporary plays such as South Downs in 2012, The York Realist in 2018, and Cock in 2022; in classical plays like the Royal National Theatre's Othello in 2013 and Chichester Festival Theatre's King Lear in 2017; as well as in musicals, namely the London revival of The Last Five Years in 2016 and the West End gender-swapped revival of Company, for which he won the Laurence Olivier Award for Best Actor in a Supporting Role in a Musical in 2019.\n\nOn screen, Bailey starred in the action-adventure series Leonardo (2011–2012) and the musical-comedy Groove High (2012–2013) before becoming known for his roles in the crime drama Broadchurch (2013–2015), the satire W1A (2014–2017), and the comedy Crashing (2016). He gained international recognition for his starring role in the Regency romance series Bridgerton (2020–present). Bailey's role in the romantic drama miniseries Fellow Travelers (2023) won him a Critics' Choice Television Award for Best Supporting Actor and a nomination for a Primetime Emmy Award for Outstanding Supporting Actor. He has since played Fiyero in the musical fantasy film Wicked (2024).\n\nDescription above from the Wikipedia article Jonathan Bailey, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1988-04-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 80860,
        "imdb_id": "nm0047332",
        "known_for_department": "Acting",
        "name": "Jonathan Bailey",
        "place_of_birth": "Wallingford, Oxfordshire, England, UK",
        "popularity": 1.6194,
        "profile_path": "/kMtZtavkXIXYA0CnhaWqbNo6uFV.jpg"
    }
}