{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u218sykbUQIh6EWtTdJzguU5LcG.jpg",
                "genre_ids": [
                    18
                ],
                "id": 16858,
                "original_language": "en",
                "original_title": "All That Jazz",
                "overview": "Joe Gideon is at the top of the heap, one of the most successful directors and choreographers in musical theater. But he can feel his world slowly collapsing around him - his obsession with work has almost destroyed his personal life, and only his bottles of pills keep him going.",
                "popularity": 2.5928,
                "poster_path": "/culCEdj4srLljefgn4XKd6k3C5t.jpg",
                "release_date": "1979-12-16",
                "title": "All That Jazz",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 544,
                "character": "Audrey Paris",
                "credit_id": "52fe46f09251416c7508886f",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nLeland Palmer (born June 16, 1945, Port Washington, New York) is an American actress, dancer, and singer who has appeared on stage, in motion pictures, and on television. She appeared on Broadway in Bajour, A Joyful Noise, Hello, Dolly!, Applause, and Pippin. Palmer received two Tony Award nominations: in 1967 for featured actress in a musical (Miss Jimmie in A Joyful Noise), and in 1973 for actress in a musical (Fastrada in Pippin).\n\nHer U.S. television appearances include guest roles on Love, American Style; Laverne & Shirley; and Rhoda. She was also a regular on Dinah Shore's summer variety television show, Dinah and Her New Best Friends in 1976. To motion-picture audiences, Palmer is known best for Bob Fosse's All That Jazz (1979), in which she played Audrey Paris, a character believed to be modeled on Fosse's wife, Gwen Verdon.\n\nPalmer is known now as Linda Posner. Although she no longer performs, she continues to work with community theatres in California. She most recently served as choreographer of 42nd Street Moon-San Francisco's production of Irma La Douce.\n\nDescription above from the Wikipedia article Leland Palmer (actress), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1945-06-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 80927,
        "imdb_id": "nm0658336",
        "known_for_department": "Acting",
        "name": "Leland Palmer",
        "place_of_birth": "Port Washington, New York, U.S.",
        "popularity": 0.1879,
        "profile_path": "/YJKhptxL9dHdWY7nVKsAA9fe5r.jpg"
    }
}