{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sd4xN5xi8tKRPrJOWwNiZEile7f.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    10751
                ],
                "id": 920,
                "original_language": "en",
                "original_title": "Cars",
                "overview": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters.",
                "popularity": 11.6067,
                "poster_path": "/u4G8EkiIBZYx0wEg2xDlXZigTOZ.jpg",
                "release_date": "2006-06-08",
                "title": "Cars",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 14591,
                "character": "Harv (voice) (UK version)",
                "credit_id": "679d6d5bb06437a4ee26181b",
                "order": 86
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jeremy Charles Robert Clarkson ",
            "杰里米·克拉克森"
        ],
        "biography": "Jeremy Charles Robert Clarkson (born 11 April 1960) is an English broadcaster, journalist and writer who specialises in motoring. He is best known for his role on the BBC TV show Top Gear along with co-presenters Richard Hammond and James May. He also writes weekly columns for The Sunday Times and The Sun.\n\nFrom a career as a local journalist in Northern England, Clarkson rose to public prominence as a presenter of the original format of Top Gear in 1988. Since the mid-1990s Clarkson has become a recognised public personality, regularly appearing on British television presenting his own shows and appearing as a guest on other shows. As well as motoring, Clarkson has produced programmes and books on subjects such as history and engineering. From 1998 to 2000 he also hosted his own chat show, Clarkson.\n\nHis opinionated but humorous tongue-in-cheek writing and presenting style has often generated much public reaction to his viewpoints. His actions both privately and as a Top Gear presenter have also sometimes resulted in criticism from the media, politicians, pressure groups and the public.\n\nDespite the criticism levelled against him, Clarkson has also generated a significant following from the public at large, being credited as a major factor in the resurgence of Top Gear as one of the most popular shows on the BBC.",
        "birthday": "1960-04-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 81113,
        "imdb_id": "nm0165087",
        "known_for_department": "Acting",
        "name": "Jeremy Clarkson",
        "place_of_birth": "Doncaster, South Yorkshire, England, UK",
        "popularity": 0.4367,
        "profile_path": "/8tnYaTYfbSzmGyHeEeBCoNUzCdZ.jpg"
    }
}