{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wb34q3VgzHgL8frVMywrN3wXmqx.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 747,
                "original_language": "en",
                "original_title": "Shaun of the Dead",
                "overview": "Shaun lives a supremely uneventful life, which revolves around his girlfriend, his mother, and, above all, his local pub. This gentle routine is threatened when the dead return to life and make strenuous attempts to snack on ordinary Londoners.",
                "popularity": 6.5673,
                "poster_path": "/dgXPhzNJH8HFTBjXPB177yNx6RI.jpg",
                "release_date": "2004-04-09",
                "title": "Shaun of the Dead",
                "video": false,
                "vote_average": 7.537,
                "vote_count": 8874,
                "character": "Jonny Buckland",
                "credit_id": "5baa33a4c3a36839fe0180e7",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Coldplay ",
            "Jonathan Mark Buckland",
            "Jonny Buckland"
        ],
        "biography": "Jonathan Mark Buckland (born 11 September 1977) is an English-born Welsh musician and songwriter best known as the lead guitarist and co-founder of the rock band Coldplay. Raised in Pantymwyn, he began to play guitar from an early age, being influenced by acts such as the Stone Roses, My Bloody Valentine and U2. Noted for sparse and delicate arrangements, he uses the slide bar and delay pedal with a stylistic chiming and ringing timbre that led to comparisons with the Edge.\n\nBuckland has a degree in astronomy and mathematics at University College London, where he formed Coldplay with Chris Martin, Guy Berryman and Will Champion. The group signed with Parlophone in 1999, finding global fame through the release of Parachutes (2000) and subsequent records. He won seven Grammy Awards and nine Brit Awards as part of Coldplay. The band have sold over 100 million albums worldwide as of 2021,[a] making them the most successful group of the 21st century.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1977-09-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 81131,
        "imdb_id": "nm1363136",
        "known_for_department": "Acting",
        "name": "Jon Buckland",
        "place_of_birth": "Islington, London, England, UK",
        "popularity": 0.1769,
        "profile_path": "/vrBNUEH06BGkQ9bihe2VRJUj4Mz.jpg"
    }
}