{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/OfH6y4NfYpzHcA67nwT5TjhSzJ.jpg",
                "genre_ids": [
                    18,
                    10749,
                    9648
                ],
                "id": 17057,
                "original_language": "en",
                "original_title": "In a Lonely Place",
                "overview": "A violent screenwriter and a female neighbor fall in love after she clears him of murder, but she begins to have second thoughts.",
                "popularity": 2.1395,
                "poster_path": "/vbdgtwzLOpE6MppZlyYChMagvQq.jpg",
                "release_date": "1950-05-17",
                "title": "In a Lonely Place",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 619,
                "character": "Brub Nicolai",
                "credit_id": "52fe47029251416c7508ae8f",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Frank Andrew Lovejoy Jr. (March 28, 1912 – October 2, 1962) was an American actor in radio, film, and television. He is perhaps best remembered for appearing in the film noir The Hitch-Hiker and for starring in the radio drama Night Beat.\n\nLovejoy was born in the Bronx, New York City, and grew up in New Jersey. He worked on Wall Street as a teenager, but the Great Depression of 1929 cost him his job. He then turned to acting, appearing in touring companies throughout the Northeast. He made his Broadway debut in 1934 in the play They Knew What They Wanted.\n\nLovejoy began his radio career in the early 1940s, appearing on such shows as Gang Busters and This Is Your FBI. He also starred in the radio drama Night Beat, which ran from 1949 to 1955.\n\nLovejoy made his film debut in 1948 in the film Black Bart. He went on to appear in over 50 films, including In a Lonely Place (1950), The Hitch-Hiker (1953), Strategic Air Command (1955), and Goodbye, My Fancy (1956).\n\nLovejoy also had a successful television career. He starred in the series Man Against Crime (1956-1957) and Meet McGraw (1957-1962).\n\nLovejoy died of a heart attack in New York City in 1962, at the age of 50. He was posthumously awarded a star on the Hollywood Walk of Fame in 1960.",
        "birthday": "1912-03-28",
        "deathday": "1962-10-02",
        "gender": 2,
        "homepage": null,
        "id": 81179,
        "imdb_id": "nm0522481",
        "known_for_department": "Acting",
        "name": "Frank Lovejoy",
        "place_of_birth": "Bronx, New York, USA",
        "popularity": 0.2304,
        "profile_path": "/pAcMS3JSpbqLdTQJ9JbXa0cLp7N.jpg"
    }
}