{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/OfH6y4NfYpzHcA67nwT5TjhSzJ.jpg",
                "genre_ids": [
                    18,
                    10749,
                    9648
                ],
                "id": 17057,
                "original_language": "en",
                "original_title": "In a Lonely Place",
                "overview": "A violent screenwriter and a female neighbor fall in love after she clears him of murder, but she begins to have second thoughts.",
                "popularity": 2.1395,
                "poster_path": "/vbdgtwzLOpE6MppZlyYChMagvQq.jpg",
                "release_date": "1950-05-17",
                "title": "In a Lonely Place",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 619,
                "character": "Capt. Lochner",
                "credit_id": "52fe47029251416c7508ae93",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nCarl Benton Reid (August 14, 1893 – March 16, 1973) was an American actor. He achieved fame on the Broadway stage in 1939 as Oscar Hubbard, one of Regina Giddens's (Tallulah Bankhead) greedy, devious brothers in the play The Little Foxes, and made his film debut reprising his role opposite Bette Davis in the 1941 film version. He also appeared in several Shakespeare plays on Broadway, and in the original production of Eugene O'Neill's The Iceman Cometh, as Harry Slade.\n\nHis stern, cold demeanor quickly stereotyped him in villainous, and/or unpleasant characters, although he could play a sympathetic role, as he did occasionally in such films as the 1957 TV-movie version of The Pied Piper of Hamelin. Here he played the Mayor of Hamelout, who unsuccessfully requests help from the Mayor of Hamelin (Claude Rains), when Hamelout is the victim of a flood. The flood leads to the famous plague of rats which invade Hamelin, and set the main plot in motion. He played the American Admiral, who is leading the peace talks between the Americans and Chinese during the Korean War in MGM's Pork Chop Hill. Reid made four guest appearances on Perry Mason during the show's nine-year run between 1957-66. His last two roles came in 1966; as the judge in the film version of Madame X and as Claude Townsend in the TV series The F.B.I.",
        "birthday": "1893-08-13",
        "deathday": "1973-03-16",
        "gender": 2,
        "homepage": null,
        "id": 81180,
        "imdb_id": "nm0717203",
        "known_for_department": "Acting",
        "name": "Carl Benton Reid",
        "place_of_birth": "Lansing, Michigan, USA",
        "popularity": 0.2769,
        "profile_path": "/zDGCLn7eljHSjqR5amJew33rl9c.jpg"
    }
}