{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/OfH6y4NfYpzHcA67nwT5TjhSzJ.jpg",
                "genre_ids": [
                    18,
                    10749,
                    9648
                ],
                "id": 17057,
                "original_language": "en",
                "original_title": "In a Lonely Place",
                "overview": "A violent screenwriter and a female neighbor fall in love after she clears him of murder, but she begins to have second thoughts.",
                "popularity": 2.1395,
                "poster_path": "/vbdgtwzLOpE6MppZlyYChMagvQq.jpg",
                "release_date": "1950-05-17",
                "title": "In a Lonely Place",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 619,
                "character": "Lloyd Barnes",
                "credit_id": "52fe47029251416c7508aea7",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Morris Nussbaum",
            "Morris Winslow Ankrum",
            "Morrie Ankrum",
            "Morri Ankrum",
            "Stephen Morris"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMorris Ankrum (born Morris Nussbaum, August 28, 1896 – September 2, 1964) was an American radio, television and film character actor.\n\nBefore signing with Paramount Pictures in the 1930s, Nussbaum had already changed his last name to Ankrum. Upon signing with the studio, he chose to use the name \"Stephen Morris\" before changing it to Morris Ankrum in 1939.\n\nAnkrum's stern visage and sharply defined features helped cast him in supporting roles as stalwart authority figures, including scientists, military men (particularly army officers), judges and even psychiatrists in more than 150 films, mostly B movies. One standout role was in Metro-Goldwyn-Mayer's production of Tennessee Johnson (1942), a biographical film about Andrew Johnson, the 17th U.S. president. As Sen. Jefferson Davis, Ankrum movingly addresses the United States Senate upon his resignation to lead the Confederate States of America as that republic's first—and only—president. Ankrum's film career was extensive and spanned 30 years. His credits were largely concentrated in the western and science-fiction genres.\n\nAnkrum appeared in such westerns as Ride 'Em Cowboy in 1942, Vera Cruz opposite Gary Cooper and Burt Lancaster, Apache (1954), and Cattle Queen of Montana with Barbara Stanwyck and Ronald Reagan.\n\nIn the sci-fi genre, he appeared in Rocketship X-M (1950), Flight to Mars (1951), as a Martian, Red Planet Mars (1952), playing the United States Secretary of Defense; the cult classic Invaders From Mars (1953), playing a United States Army officer; and as an Army general in Earth vs. the Flying Saucers (1956). In 1957 he played a psychiatrist in the cult sci-fi classic Kronos and had military-officer roles in Beginning of the End and The Giant Claw.",
        "birthday": "1896-08-28",
        "deathday": "1964-09-02",
        "gender": 2,
        "homepage": null,
        "id": 81182,
        "imdb_id": "nm0030194",
        "known_for_department": "Acting",
        "name": "Morris Ankrum",
        "place_of_birth": "Danville, Illinois, USA",
        "popularity": 0.3666,
        "profile_path": "/pFgtE39bKKjpz1aluBq9v4ED2IT.jpg"
    }
}