{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/OfH6y4NfYpzHcA67nwT5TjhSzJ.jpg",
                "genre_ids": [
                    18,
                    10749,
                    9648
                ],
                "id": 17057,
                "original_language": "en",
                "original_title": "In a Lonely Place",
                "overview": "A violent screenwriter and a female neighbor fall in love after she clears him of murder, but she begins to have second thoughts.",
                "popularity": 2.1395,
                "poster_path": "/vbdgtwzLOpE6MppZlyYChMagvQq.jpg",
                "release_date": "1950-05-17",
                "title": "In a Lonely Place",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 619,
                "character": "Ted Barton",
                "credit_id": "52fe47029251416c7508aeab",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Brooks",
            "William Brooks Ching"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nWilliam Ching, also credited as William Brooks, Bill Ching and William Brooks Ching (born 2 October 1913, St. Louis, Missouri - died 1 July 1989, Tustin, California) was a United States character actor who appeared in almost 20 films and on television during the later 1940s and throughout the 1950s. By the early 21st century Ching was most widely noted for his supporting role in Rudolph Maté's 1950 film noir drama D.O.A. as Halliday, who slips \"luminous poison\" into the drink of an accountant visiting San Francisco for the weekend, along with his role as the overbearing boyfriend of Katharine Hepburn's character in George Cukor's 1952 Tracy-Hepburn comedy Pat and Mike.\n\nChing began his career as a professional singer, appearing in musical comedies such as Rodgers and Hammerstein's Allegro (1947). His first film role was in 1946. He signed with Republic Pictures in 1947 and for the next dozen years acted mostly in westerns and dramas. His last major acting credit was in a 1959 episode of the television series 77 Sunset Strip.\n\nWilliam Ching died of congestive heart failure in 1989 at the age of 75 and is buried at Fairhaven Memorial Park in Santa Ana, California.\n\nDescription above from the Wikipedia article William Ching, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1913-10-02",
        "deathday": "1989-07-01",
        "gender": 2,
        "homepage": null,
        "id": 81183,
        "imdb_id": "nm0157893",
        "known_for_department": "Acting",
        "name": "William Ching",
        "place_of_birth": "Saint Louis, Missouri, USA",
        "popularity": 0.1433,
        "profile_path": "/noGb3EWltYBssnHFmpGbflokgsi.jpg"
    }
}