{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8482,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Hopper Girl (uncredited)",
                "credit_id": "52fe4384c3a36847f805a02f",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mary Frances Gifford",
            "Mary Gifford"
        ],
        "biography": "Frances Gifford had a somewhat unorthodox introduction to the movie  business. Born and raised in Long Beach, California, she had no ambition  to be an actress, and in fact had applied to UCLA when, at age 16, she  and a friend got to visit the Samuel Goldwyn Studios, where they watched  a movie being shot. A studio exec saw her and asked if she would take a  screen test. She did, the studio was impressed with the result and put  her under contract. Nothing much came of it, however, other than bit  parts, and she moved to RKO. Nothing much happened there, either. She  had married actor James Dunn and decided to retire, which she did, in 1938. Off the screen for almost two years, she got a small part in Mr. Smith Goes to Washington (1939), and her career began to revive. She was signed by Paramount,  which soon loaned her to Republic, where she made the film she is  probably most remembered for: the serial Jungle Girl (1941), based on an Edgar Rice Burroughs story.\n\nUnfortunately, her career never really took off, and she bounced around among several  studios. In 1948 she was involved in an auto accident in which she  received severe head injuries. Although she seemed to recover  physically, her career took a nosedive, and she made her last film in  1953. In 1958 newspaper stories reported that as a result of the  injuries sustained in the accident, she was admitted to a California  state mental hospital. Nothing further was heard from her or about her  until 1983, when a writer for a film magazine found her in Pasadena. She  had apparently fully overcome her physical and mental problems and was  working for the city library. She died of emphysema in Pasadena in 1994.",
        "birthday": "1920-12-07",
        "deathday": "1994-01-15",
        "gender": 1,
        "homepage": null,
        "id": 81282,
        "imdb_id": "nm0317519",
        "known_for_department": "Acting",
        "name": "Frances Gifford",
        "place_of_birth": "Long Beach, California, USA",
        "popularity": 0.1277,
        "profile_path": "/99Z58yMy9KRKFaRAVZ0Oq3WgOxM.jpg"
    }
}