{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k8sH3RyFg1G4fHN0k9QNoHk8i4E.jpg",
                "genre_ids": [
                    53,
                    18,
                    9648,
                    80
                ],
                "id": 13528,
                "original_language": "en",
                "original_title": "Gaslight",
                "overview": "A newlywed fears she's going mad when strange things start happening at the family mansion.",
                "popularity": 2.535,
                "poster_path": "/gXKszCl5Q1KrgWRWpPcqn94CP58.jpg",
                "release_date": "1944-05-04",
                "title": "Gaslight",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 515,
                "character": "General Huddleston",
                "credit_id": "5f4e50c5b2681f0031e4456b",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Iver Edmund de Breon MacLaverty",
            "Edmond Breon",
            "Edmond Bréon"
        ],
        "biography": "Edmund Breon (12 December 1882 – 24 June 1953) was a Scottish film and stage actor. He appeared in 131 films between 1907 and 1952.\n\nBorn Iver Edmund de Breon MacLaverty in Hamilton, South Lanarkshire, he began in John Hare's touring company and later played on the West End stage and in Glasgow, gaining prominence. According to his grandson, Breon \"started out at the turn of the century doing silent pictures in France. Vampire movies\", so it is reasonably certain that MacLaverty is indeed the actor who appeared under the name Edmond Bréon in many Gaumont films 1907-1922 including, most famously, playing the part of Inspector Juve for Louis Feuillade in the ground-breaking Fantômas series. He did also appear in a small part in the 1915-1916 Feuillade series Les vampires, although this is not, as his grandson supposes, a horror film.\n\nHe returned to Britain where he made the film A Little Bit of Fluff (1928), then went to Canada in 1929 and worked on the land.\n\nA year later he emigrated to the United States and gained his first big American film part in The Dawn Patrol (1930). Breon appeared in a mixture of British and American films over the following two decades. He also appeared on stage in the West End production of the comedy Spring Meeting in 1938.\n\nA 1949 newspaper article noted that Breon's \"career has been interrupted by serious illness and an accident which kept him idle for two years.\"\n\nBreon died in his native Scotland on June 24, 1953.",
        "birthday": "1882-12-11",
        "deathday": "1953-06-24",
        "gender": 2,
        "homepage": null,
        "id": 81291,
        "imdb_id": "nm0107631",
        "known_for_department": "Acting",
        "name": "Edmund Breon",
        "place_of_birth": "Hamilton, Scotland, UK",
        "popularity": 0.1346,
        "profile_path": "/uR49CwS2gV2DtNGzrwo0juPBFNt.jpg"
    }
}