{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/42mSR48e4h6Zp5BkTUyWPYsAA1X.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1883,
                "original_language": "en",
                "original_title": "Malcolm X",
                "overview": "A tribute to the controversial black activist and leader of the struggle for black liberation. He hit bottom during his imprisonment in the '50s, he became a Black Muslim and then a leader in the Nation of Islam. His assassination in 1965 left a legacy of self-determination and racial pride.",
                "popularity": 7.2691,
                "poster_path": "/o2s9ow0uRRm1BcF3teznk5twd90.jpg",
                "release_date": "1992-11-18",
                "title": "Malcolm X",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1773,
                "character": "Brother Earl",
                "credit_id": "57c9e9c292514155ac000fa9",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJames McDaniel (born March 25, 1958; Washington, D.C.) is an American stage, film and television actor. He is best known for playing Lt. Arthur Fancy on the television show NYPD Blue. He also played a police officer in the ill-fated 1990 series Cop Rock, and a close advisor to activist Malcolm X in the 1992 film Malcolm X. He also played Sgt. Jesse Longford in the ABC television series Detroit 1-8-7.\n\nMcDaniel won a 1995 Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series, NYPD Blue, and won the 2006 Daytime Emmy Award for Outstanding Performer in a Children/Youth/Family Special, \"Edge of America\".\n\nMcDaniel was in the same acting company at SUNY Purchase with actor Jay O. Sanders.\n\nDescription above from the Wikipedia article James McDaniel, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1958-03-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 81372,
        "imdb_id": "nm0005206",
        "known_for_department": "Acting",
        "name": "James McDaniel",
        "place_of_birth": "Washington, D.C., USA",
        "popularity": 0.2981,
        "profile_path": "/faoSNK7MQxYQA0ZNTOBPxiVr5AT.jpg"
    }
}