{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3zCPI4JFc54xvLaJ71oI2KoP3az.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53
                ],
                "id": 1949,
                "original_language": "en",
                "original_title": "Zodiac",
                "overview": "The Zodiac murders cause the lives of Paul Avery, David Toschi and Robert Graysmith to intersect.",
                "popularity": 7.951,
                "poster_path": "/6YmeO4pB7XTh8P8F960O1uA14JO.jpg",
                "release_date": "2007-03-02",
                "title": "Zodiac",
                "video": false,
                "vote_average": 7.528,
                "vote_count": 11041,
                "character": "Lab Tech Dagitz",
                "credit_id": "5f29d1f8c7176d0039bf0282",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "جیسون وایلز"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nJason Austin Wiles (born April 25, 1970) is an American actor known for his role in the TV series Third Watch. Wiles was born in Kansas City, Missouri, U.S., and raised in Lenexa, Kansas where he attended Holy Trinity Catholic School. He found employment with the local Park and Rec department, having passed up the opportunity to play college football. In 1990, Wiles began to pursue an interest in film-making, working on the set of the film Mr. and Mrs. Bridge, filming on location in Kansas City. Not long after, the Stephen King tele-movie, Sometimes They Come Back, came to town and he worked on the crew as well as appearing in scenes as an extra. After forming some connections while working on these films, Wiles ventured to Los Angeles where he appeared in commercials before landing the lead in an after-school special. In 1994, he had a part in the Bon Jovi music video \"Always\". In 1995, Wiles made the first of 32 appearances in Beverly Hills, 90210 as Colin Robbins, a role which gained him some note in Hollywood. He also appeared in Windrunner: A Spirited Journey starring Margot Kidder and Russell Means. In 1999, Wiles successfully auditioned for the role of Maurice 'Bosco' Boscorelli in the drama Third Watch; Wiles appeared in all six seasons of the show from 1999-2005. Recently, Wiles has begun to try his hand at directing and writing as well as theatre. In the summer of 2002, he appeared in the Cape Playhouse production of Mass Appeal alongside Malachy McCourt, and in 2003 he was in Imua! Theatre Company's production of Safe which was co-written and directed by fellow Third Watch star Anthony Ruivivar. Upon completion of the final season of Third Watch, Wiles began work on his independent film Lenexa, 1 Mile (2006) which he wrote and also directed. Wiles has recently appeared alongside Geena Davis and Donald Sutherland in the TV series Commander in Chief. He also played a soldier in the new series Army Wives. He appeared in two episodes. His upcoming projects include directing, producing and writing a 2008 movie called Play Dead. He also had a small part in the 2007 movie Zodiac. Jason also played in a short scene in 2009's Horror thriller remake of The Stepfather. He is currently a regular on NBC's drama-suspense television show, Persons Unknown. Wiles performed a role as guest-star on Law &amp; Order: SVU on October 20th, 2010.",
        "birthday": "1970-04-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 81373,
        "imdb_id": "nm0005556",
        "known_for_department": "Acting",
        "name": "Jason Wiles",
        "place_of_birth": "Kansas City - Missouri - USA",
        "popularity": 0.5559,
        "profile_path": "/e0XIAjLnanYR1GYgfs3hNlibtUi.jpg"
    }
}