{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1WRwy3EDc2LVtwauzIMMGVJLEI5.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9787,
                "original_language": "en",
                "original_title": "Lords of Dogtown",
                "overview": "The radical true story behind three teenage surfers from Venice Beach, California, who took skateboarding to the extreme and changed the world of sports forever. Stacy Peralta, Tony Alva and Jay Adams are the Z-Boys, a bunch of nobodies until they create a new style of skateboarding that becomes a worldwide phenomenon. But when their hobby becomes a business, the success shreds their friendship.",
                "popularity": 12.3584,
                "poster_path": "/k2NiPfydLSwmk28C6qpvpJPuqtq.jpg",
                "release_date": "2005-06-03",
                "title": "Lords of Dogtown",
                "video": false,
                "vote_average": 7.102,
                "vote_count": 773,
                "character": "Dr. Angelo Gamboa (uncredited)",
                "credit_id": "610ed602706b9f0030e414bf",
                "order": 77
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Риф Карим"
        ],
        "biography": "Reef Karim, an actor, writer and television host, has dedicated his life to the portrayal of the human condition. As an accomplished artist in feature film, television and online media, Reef can be seen playing a wide range of diverse roles in both comedy & drama, ethnicity and tone. He often utilizes his skills in improvisational acting, sketch comedy and dance to bring life to the characters he develops. Reef won the SASA award for best actor for his portrayal of Kartik in the feature film, Flavors. He was also voted one of People Magazine's Sexiest Men Alive for his acting prowess in both Hollywood & Bollywood feature films, his technical consulting in television and films and for his advocacy and philanthropy in communication and service to others. Additionally, Reef works as a writer/consultant (ABC's Private Practice, Laurel Canyon, Reef Madness), a television host on various networks and is a frequent guest expert on national news shows and daytime/nighttime programming because of his background as both a performer and a physician with a specialty in neuroscience, mental health, addiction & personal transformation. Reef appears regularly on CNN International & Domestic and is well known in the media with appearances on: Oprah, ABC World News, Larry King Live, Dr. Oz, Dr. Phil, Anderson Cooper 360, Nightline, Today, Good Morning America, Chelsea Lately and many others. Reef hosted the television show \"Broken Minds\" on the Discovery Network and hosted the forensic cult show \"House of Clues\" on Court/Tru TV. He additionally guest hosted the popular radio show \"Loveline\" with Adam Corolla and guest hosted KFI news in Los Angeles. Reef Karim is all about self expression. He believes that laughter really is the best medicine and as such, has studied improv for years and performs stand up at comedy clubs all over Los Angeles. With improv and performance training, he's had the opportunity to act, write and dance in many Hollywood and Bollywood movies playing lead and supporting characters and he's worked as the medical consultant on big movies and television shows including: Private Practice, Alias, Bourne Identity and many others. He started a production company that focuses on developing content for new media and broadcast television entitled: MadLab Media. The good doctor is also a highly sought after international speaker and thought leader on creativity and personal transformation. Dr. Reef Karim co-authored the dating book \"Why Does He Do That? Why Does She Do That?\" and his expertise and research has been published in prestigious medical journals including \"The International Journal of Neuroscience\" and \"The Journal of Addiction Medicine.\"",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 81677,
        "imdb_id": "nm1195056",
        "known_for_department": "Acting",
        "name": "Reef Karim",
        "place_of_birth": null,
        "popularity": 0.0071,
        "profile_path": "/ys9uPfrKR7KMKgCnVPT8V2FeXMT.jpg"
    }
}