{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mDu3nkdjzkJ9loy3QyppGcLjaI7.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11321,
                "original_language": "en",
                "original_title": "Seven Pounds",
                "overview": "An IRS agent with a fateful secret embarks on an extraordinary journey of redemption by forever changing the lives of seven strangers.",
                "popularity": 4.0379,
                "poster_path": "/85zUipgVy2QbvAJ6djZXYaGckMv.jpg",
                "release_date": "2008-12-18",
                "title": "Seven Pounds",
                "video": false,
                "vote_average": 7.606,
                "vote_count": 6977,
                "character": "Ben's Brother",
                "credit_id": "52fe44259251416c7502a681",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Brown ",
            "Μάικλ Ίλι",
            "마이클 엘리",
            "مایکل ایلی"
        ],
        "biography": "Michael Brown (born August 3, 1973), professionally known as Michael Ealy, was born on August 3, 1973 in Silver Spring, Maryland. He attended SpringbrookHigh School and the University of Maryland, College Park. Ealy started his acting career in the late-1990s, appearing in a number of off-Broadway stage productions. Among his first film roles were Bad Company and Kissing Jessica Stein. His breakout role came in 2002's Barbershop, in which he plays reformed street thug Ricky Nash, a role that he reprised in the 2004 sequel, Barbershop 2: Back in Business. In 2003, he played the role of Slap Jack in the second installment of the Fast and the Furious film series, 2 Fast 2 Furious. Later in 2004, Ealy appeared in Never Die Alone with DMX. In 2005, Ealy co-starred in the telefilm version of Their Eyes Were Watching God, produced by Oprah Winfrey and Quincy Jones, and starring Academy Award-winning actress HalleBerry. The same year, he starred in the independent film Jellysmoke, directed by Mark Banning. He starred in the Showtime television series Sleeper Cell and Sleeper Cell: American Terror. On December 14, 2006, Ealy was nominated for a Golden Globe Award for his role in Sleeper Cell: American Terror in the category Best Performance by an Actor in a Mini-Series or Motion Picture Made for Television. In December 2008 he was featured in the movie Seven Pounds alongside Will Smith as Ben Thomas. He also starred as CIA Field Officer Marshall Vogel in the ABC television series FlashForward. In 2010 Ealy starred in the action-thriller Takers and in the drama For Colored Girls. Also in 2010, Ealy signed on to play an attorney, Derrick Bond in the TV series, The Good Wife.",
        "birthday": "1973-08-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 8177,
        "imdb_id": "nm1013003",
        "known_for_department": "Acting",
        "name": "Michael Ealy",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 1.3928,
        "profile_path": "/rOaJMKiy2JcwhRuJZ977kOvFQRS.jpg"
    }
}