{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ecZ6MQ3Y63dtn35km6odO0e39aQ.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 763,
                "original_language": "en",
                "original_title": "Braindead",
                "overview": "When a Sumatran rat-monkey bites Lionel Cosgrove's mother, she's transformed into a zombie and begins killing (and transforming) the entire town while Lionel races to keep things under control.",
                "popularity": 3.689,
                "poster_path": "/pa39D8TQs6aNw3hiUs4jLjHVUB0.jpg",
                "release_date": "1992-08-13",
                "title": "Braindead",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1744,
                "character": "Vet",
                "credit_id": "63ddbcc38741c40099b3b96c",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/hwPnxzIgQFfXl5zP0Yh8bViCMzf.jpg",
                "genre_ids": [
                    14,
                    12,
                    28
                ],
                "id": 57158,
                "original_language": "en",
                "original_title": "The Hobbit: The Desolation of Smaug",
                "overview": "The Dwarves, Bilbo and Gandalf have successfully escaped the Misty Mountains, and Bilbo has gained the One Ring. They all continue their journey to get their gold back from the Dragon, Smaug.",
                "popularity": 12.9588,
                "poster_path": "/xQYiXsheRCDBA39DOrmaw1aSpbk.jpg",
                "release_date": "2013-12-11",
                "title": "The Hobbit: The Desolation of Smaug",
                "video": false,
                "vote_average": 7.573,
                "vote_count": 13643,
                "character": "Spider",
                "credit_id": "5c8ea0220e0a2612f556edfc",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brian Sergent (born 29 December 1959) is a comedian, writer and actor born and based in Wellington, New Zealand\n\nSergent's acting career began at age 15 playing Lionel in the soap opera, Close to Home.\n\nIn television Sergent is known for playing Eric Grady on Outrageous Fortune, the New Zealand Prime Minister on Flight of the Conchords, and Harold in The Lost Children. One of his most popular characters, cabin steward Gavin Soper, appeared on the Pulp Comedy television series.\n\nSergent has a strong association with Circa Theatre in Wellington. He performed in The Duchess of Malfi (1982), Travels with My Aunt (1997) and Take a Chance on Me (2001).\n\nSergent's film credits include Peter Jackson's Meet the Feebles, Braindead and Lord of the Rings, Absent Without Leave, Via Satellite, the lead role as Marty in The Shirt and Jonah in Eagle vs. Shark.\n\nRadio listeners are quite familiar with Sergent's reading of short stories, novels and radio plays on Radio New Zealand where he is still actively involved.\n\nSergent has won multiple Chapman Tripp Theatre Awards for acting and writing. In 1992 he won Male Actor of the Year for his performances as Lenny in The Homecoming at the Circa Theatre and Alfredo Traps in A Dangerous Game at the BATS Theatre. In 1994, he won Best Male Actor in a Supporting Role for his performance of Gary Peter Lefkowitz in I Hate Hamlet at the Circa. In 2004, Prior to the opening of his first play, the New Zealand Listener described Sergent as \"New Zealand's greatest comic actor\" He won the award for Outstanding New Playwright of the Year for his play The Love of Humankind. In 2008 Radio New Zealand broadcast for the first of many times, Sergent's first radio play, \"Madness You Can Trust.\"\n\nAfter taking a break from the show for nearly three years, Sergent returned to Outrageous Fortune as Eric in the second to last episode of the fifth season.\n\nSergent has been a stand-up Comedian and sketch writer since his debut in 1979",
        "birthday": "1959-12-29",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.nzonscreen.com/profile/brian-sergent",
        "id": 81878,
        "imdb_id": "nm0785082",
        "known_for_department": "Acting",
        "name": "Brian Sergent",
        "place_of_birth": "Wellington, New Zealand",
        "popularity": 0.1081,
        "profile_path": "/3qlmNIsNNtSMUkLuLnoGQhuG71j.jpg"
    }
}