{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xGiqZw1AJJ6BZRNUT1XVBMBofnr.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 802,
                "original_language": "en",
                "original_title": "Lolita",
                "overview": "Humbert Humbert is a middle-aged British novelist who is both appalled by and attracted to the vulgarity of American culture. When he comes to stay at the boarding house run by Charlotte Haze, he soon becomes obsessed with Lolita, the woman's teenaged daughter.",
                "popularity": 4.6978,
                "poster_path": "/8Puqbeh0D95DpXFWep1rmH78btu.jpg",
                "release_date": "1962-06-13",
                "title": "Lolita",
                "video": false,
                "vote_average": 7.316,
                "vote_count": 2152,
                "character": "Man",
                "credit_id": "5ebe83fcbc8abc0022c408ab",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Terence E. Kilburn",
            "Terence Kilburn",
            "Terrence Kilburn",
            "Terrance Kilburn",
            "Terence Kilbourne"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nTerence E. Kilburn (born 25 November 1926), known for his acting work prior to 1953 as Terry Kilburn, is an English-American actor. Born in London, he moved to Hollywood in the U.S. at the age of 10, and is best known for his roles as a child actor, in films such as A Christmas Carol (1938) and Goodbye, Mr. Chips (1939) in the late 1930s and the early 1940s.\n\nKilburn was born in West Ham, Essex, in Greater London in 1926, to working-class parents. He did some unpaid acting as a young child, and an agent encouraged him to go to Hollywood. Kilburn and his mother immigrated to the U.S. in 1937, and his father arrived the following year. A talent scout for MGM discovered him rehearsing for Eddie Cantor's radio show, and he was cast in the British-set film Lord Jeff (1938).\n\nKnown for his innocent, dreamy, doe-eyed look, Kilburn achieved fame at the age of 11 portraying Tiny Tim in the 1938 Metro-Goldwyn-Mayer film version of A Christmas Carol, and also as four generations of the Colley family in Goodbye, Mr. Chips (1939). He also played leading roles in two films which starred Freddie Bartholomew: Lord Jeff (1938) and Swiss Family Robinson (1940). He was featured in The Adventures of Sherlock Holmes (1939) with Basil Rathbone.\n\nIn addition to Lord Jeff (1938), Kilburn worked alongside Mickey Rooney in Andy Hardy Gets Spring Fever (1939), A Yank at Eton (1942), and National Velvet (1944). In 1946 he was in Black Beauty. In his early 20s, in 1947 and 1948, he was in four back-to-back Bulldog Drummond films, as Seymour, a reporter; and in 1950 he had small roles in two seagoing films.\n\nAfter high school, Kilburn concentrated on stage work, and studied drama at UCLA. He made his Broadway debut, credited as Terrance Kilburn, as Eugene Marchbanks in a 1952 revival of George Bernard Shaw's Candida. He thereafter remained committed to live performances, as both actor and director.\n\nAfter 1952 he was credited on screen as Terence Kilburn. His final feature film role was a small part in Lolita (1962). Between 1951 and 1969, he was also in nearly a dozen teleplays, television movies, and television series episodes.",
        "birthday": "1926-11-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 81933,
        "imdb_id": "nm0452953",
        "known_for_department": "Acting",
        "name": "Terry Kilburn",
        "place_of_birth": "West Ham, Essex, Greater London, England, UK",
        "popularity": 0.1818,
        "profile_path": "/kp8eIhg3QPkIeeVUPSsA7tqrvcD.jpg"
    }
}