{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uyUdNIzl3FWBRxqeVK4ZQKdGGUS.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 582,
                "original_language": "de",
                "original_title": "Das Leben der Anderen",
                "overview": "In 1984 East Berlin, dedicated Stasi officer Gerd Wiesler begins spying on a famous playwright and his actress-lover Christa-Maria. Wiesler becomes unexpectedly sympathetic to the couple, and faces conflicting loyalties when his superior takes a liking to Christa-Maria.",
                "popularity": 5.0081,
                "poster_path": "/cVUDMnskSc01rdbyH0tLATTJUdP.jpg",
                "release_date": "2006-03-23",
                "title": "The Lives of Others",
                "video": false,
                "vote_average": 8.035,
                "vote_count": 3880,
                "character": "Gerd Wiesler",
                "credit_id": "52fe4256c3a36847f801640f",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/79SBe1bU30Dy6QPwJ2KQ3LTr1lr.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 10234,
                "original_language": "de",
                "original_title": "Funny Games",
                "overview": "Two psychotic young men take a mother, father, and son hostage in their vacation cabin and force them to play sadistic \"games\" with one another for their own amusement.",
                "popularity": 2.1214,
                "poster_path": "/vUJxLlRGM6KfXQDeAHqyMyhrI59.jpg",
                "release_date": "1997-08-23",
                "title": "Funny Games",
                "video": false,
                "vote_average": 7.313,
                "vote_count": 1937,
                "character": "Georg",
                "credit_id": "52fe43469251416c7500a371",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Friedrich Hans Ulrich Mühe"
        ],
        "biography": "Friedrich Hans Ulrich Mühe (20 June 1953 – 22 July 2007) was a German film, television and theatre actor. He played the role of Hauptmann (Captain) Gerd Wiesler in the Oscar-winning film Das Leben der Anderen (The Lives of Others, 2006), for which he received the award for Best Performance by an Actor in a Leading Role, Gold, at Germany's most prestigious film awards, the Deutscher Filmpreis (German Film Awards); and the Best Actor Award at the 2006 European Film Awards.\n\nCuriously, events in Mühe's life were mirrored by the plot of the film, as he allegedly discovered in a Stasi file compiled on him that he had been under surveillance by his second wife, Jenny Gröllmann. Gröllmann denied this, and after an acrimonious and highly-publicized court case she succeeded in obtaining an injunction to prevent Mühe from repeating the allegation in a book.\n\nAfter leaving school, Mühe was employed as a construction worker and a border guard at the Berlin Wall. He then turned to acting, and from the late 1970s into the 1980s appeared in numerous plays, becoming a star of the Deutsches Theater in East Berlin. He was active in politics and denounced Communist rule in East Germany in a memorable address at the Alexanderplatz demonstration on 4 November 1989 shortly before the fall of the Berlin Wall. After German reunification he continued to appear in a large number of films, television programmes and theatre productions. In Germany he was particularly known for playing the lead role of Dr. Robert Kolmaar in the long-running forensic crime series Der letzte Zeuge (The Last Witness, 1998–2007).\n\nDescription above from the Wikipedia article Ulrich Mühe, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1953-06-20",
        "deathday": "2007-07-22",
        "gender": 2,
        "homepage": null,
        "id": 8196,
        "imdb_id": "nm0618057",
        "known_for_department": "Acting",
        "name": "Ulrich Mühe",
        "place_of_birth": "Grimma, Germany",
        "popularity": 0.432,
        "profile_path": "/kdqKmnaBDDT0cwTE2C3fKDJrF8D.jpg"
    }
}