{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4s2d3xdyqotiVNHTlTlJjrr3q0H.jpg",
                "genre_ids": [
                    12,
                    10751,
                    16,
                    28,
                    35
                ],
                "id": 177572,
                "original_language": "en",
                "original_title": "Big Hero 6",
                "overview": "A special bond develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.",
                "popularity": 17.3989,
                "poster_path": "/2mxS4wUimwlLmI1xp6QW6NSU361.jpg",
                "release_date": "2014-10-24",
                "title": "Big Hero 6",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 16089,
                "character": "Tadashi Hamada (voice)",
                "credit_id": "542e4682c3a36859d8001a94",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/tVH1qEFyKiCpP6kNDFyXKW2Tiif.jpg",
                "genre_ids": [
                    18,
                    9648,
                    53
                ],
                "id": 768362,
                "original_language": "en",
                "original_title": "Missing",
                "overview": "When her mother disappears while on vacation in Colombia with her new boyfriend, June’s search for answers is hindered by international red tape. Stuck thousands of miles away in Los Angeles, June creatively uses all the latest technology at her fingertips to try and find her before it’s too late. But as she digs deeper, her digital sleuthing raises more questions than answers... and when June unravels secrets about her mom, she discovers that she never really knew her at all.",
                "popularity": 3.859,
                "poster_path": "/wEOUYSU5Uf8J7152PT6jdb5233Y.jpg",
                "release_date": "2023-01-19",
                "title": "Missing",
                "video": false,
                "vote_average": 7.418,
                "vote_count": 1159,
                "character": "Agent Park",
                "credit_id": "606df65de1ad790058e53af5",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Daniel Phillip Henney"
        ],
        "biography": "Daniel Henney was born in Carson City, Michigan, to a Korean adoptee mother and Philip Henney, his American father of Irish descent. Daniel Henney started modeling in the U.S. in 2001 and worked in France, Italy, Hong Kong and Taiwan while attending college. After his debut in South Korea with an advertisement for the Amore Pacific's cosmetic \"Odyssey Sunrise\", he became a spokesperson for commercials with Jun Ji-hyun for Olympus cameras and Kim Tae-hee for Daewoo Electronics's Klasse air conditioners. Despite speaking no Korean, Henney became a household name through the South Korean hit TV drama, My Lovely Sam Soon, aka My Name is Kim Sam Soon. He played the role of Dr. Henry Kim, a surgeon who is devotedly in love with Hee-jin (played by Jung Ryeo-won). Sam Soon was the most popular Korean drama in 2005; although Henney was starring as the supporting actor, his performance and look was widely noticed. Henney then starred in another drama “Spring Waltz” in 2006. He later learned the language and appeared on a few variety shows, such as Family Outing. Henney was a part of an academic scandal in which many sources stated that he had an Economics degree from the University of Illinois at Chicago, while in actuality he had no college degree. Henney starred in his first feature film in Korea, \"Seducing Mr. Perfect.\" His second film, \"My Father,\" won multiple awards in South Korea and was actually the first time in that country's history that a foreigner swept all the major cinema awards in the Best New Actor category. In 2009, he portrayed Agent Zero in the film X-Men Origins: Wolverine. In the fall season of 2009, he played \"Dr. David Lee\" in the CBS television drama Three Rivers. In 2010, Henney returned to South Korea television for KBS2's The Fugitive: Plan B, alongside Rain and actress Lee Na-young. Henney is signed with DNA Models in New York under the celebrity-division.",
        "birthday": "1979-11-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 82093,
        "imdb_id": "nm2024644",
        "known_for_department": "Acting",
        "name": "Daniel Henney",
        "place_of_birth": "Carson City, Michigan, USA",
        "popularity": 0.9861,
        "profile_path": "/elAolohpUG5nS99EZxHZjd44DsS.jpg"
    }
}