{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/DztBnZaqmla2sGUW9s8AyOmskT.jpg",
                "genre_ids": [
                    18
                ],
                "id": 14,
                "original_language": "en",
                "original_title": "American Beauty",
                "overview": "Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation with his daughter's attractive friend.",
                "popularity": 9.2546,
                "poster_path": "/wby9315QzVKdW9BonAefg8jGTTb.jpg",
                "release_date": "1999-09-15",
                "title": "American Beauty",
                "video": false,
                "vote_average": 8.005,
                "vote_count": 12548,
                "character": "Angela Hayes",
                "credit_id": "52fe420ec3a36847f80007e3",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mena Süvari",
            "مینا سوواری"
        ],
        "biography": "Mena Alexandra Suvari (born February 13, 1979) is an American actress, producer, fashion designer, and model. She's best known for her roles as Angela Hayes in American Beauty, Heather in the American Pie film series, Coty Pierce in Kiss the Girls, Edie on HBO's Six Feet Under (for which she earned a Screen Actors Guild nomination), Francesca Bonacieux in The Musketeer (2001), Joanne in Beauty Shop, Annie Huttinger in Rumor Has It..., Isabella on the second season of NBC's Chicago Fire, Maria Abascal on WEtv's South of Hell, and Kathleen on Paramount's dramedy American Woman.\n\nAfter beginning her career as a model and guest-starring on several television shows, she made her film debut in the 1997 drama Nowhere. She rose to international prominence with her appearances in the critically acclaimed drama American Beauty (1999), for which she received a BAFTA nomination for Best Supporting Actress.\n\nHer other notable film credits include Slums of Beverly Hills (1998), The Rage: Carrie 2 (1999), Loser (2000), Sugar & Spice (2001), Sonny (2002), Spun (2003), Trauma (2004), Domino (2005), Factory Girl (2006), Brooklyn Rules, Stuck (both 2007), Day of the Dead (2008), and You May Not Kiss the Bride (2010). She also portrayed Elizabeth Short in the anthology series American Horror Story: Murder House (2011), and reprised the part in American Horror Story: Apocalypse (2018).  She has been a model for Lancôme cosmetics and print ads for Lancôme Paris Adaptîve, as well as a long-time supporter and activist for the Starlight Children's Foundation and the African Medical and Research Foundation. She is married and has one child.\n\nDescription above from the Wikipedia article Mena Suvari, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1979-02-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 8211,
        "imdb_id": "nm0002546",
        "known_for_department": "Acting",
        "name": "Mena Suvari",
        "place_of_birth": "Newport, Rhode Island, USA",
        "popularity": 1.4581,
        "profile_path": "/xjqKvy0bos02oSKNYzC4mxLbQ0W.jpg"
    }
}