{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xlIxMddSdqyxfY02CilOK4VKWR8.jpg",
                "genre_ids": [
                    10402,
                    18,
                    36
                ],
                "id": 14410,
                "original_language": "en",
                "original_title": "Notorious",
                "overview": "\"Notorious\" is the story of Christopher Wallace. Through raw talent and sheer determination, Wallace transforms himself from Brooklyn street hustler (once selling crack to pregnant women) to one of the greatest rappers of all time: The Notorious B.I.G. Follow his meteoric rise to fame and his refusal to succumb to expectations - redefining our notion of \"The American Dream.\"",
                "popularity": 2.6405,
                "poster_path": "/62NsZPgueSiE8y7dqtU3FSLFwYw.jpg",
                "release_date": "2009-01-16",
                "title": "Notorious",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 748,
                "character": "Record Executive at Party",
                "credit_id": "52fe45f09251416c75067a91",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 3366,
                "character": "African (uncredited)",
                "credit_id": "566db0dcc3a36833b600b99f",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Momo Dione"
        ],
        "biography": "Momo Dione was born in Riyadh, Saudi Arabia. He is of Guinean and Senegalese descent. His father is a Guinean diplomat and his mother is an entrepreneur specializing in event production and African fashion. Before reaching high school, the actor/filmmaker had already seen a great deal of the world. He came to the United States in 1993 when his father was appointed to the Guinea mission in New York City. While doing plays in elementary school on Roosevelt Island, he realized that acting was his true passion. He began auditioning for projects while in high school. But playing basketball and football, being class president for three consecutive terms, prom king, and carrying a heavy academic load left him with little time to follow his heart. He graduated from Yonkers International Baccalaureate High School in 2004. He has since been featured in plays, TV shows, commercials, music videos, student films, independent films, and feature films. Some of his credits are \"Law & Order: Criminal Intent\", \"Across the Universe\", \"Notorious\", the upcoming \"Restless City\" premiering at the 2011 Sundance Film Festival and several commercials. He is a graduate of the All Stars Project/Youth Onstage/Castillo Theater youth development acting programs. Momo was a member of the original cast and co-author of the All Stars Projects' original production of \"Our City.\" He's also posed for paintings by Afro-American painter Kehinde Wiley. He is bi-coastal; living in Los Angeles and New York. Frequent travel is a way of life for Mohamed. He co-owns Caramel Cappuccino films, a production company that writes films that articulate relevant issues of life and relationship in under-served or under acknowledged communities with aims of producing them. He enjoys horseback riding, opera, Congolese soukous, sports, and anything that has to do with cinema. Dione is constantly auditioning and working on new projects in search of the role that will allow him to make his mark in the Hollywood and Broadway markets...and then the world.",
        "birthday": "1986-02-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 82159,
        "imdb_id": "nm2023513",
        "known_for_department": "Acting",
        "name": "Mohamed Dione",
        "place_of_birth": "Riyadh, Saudi Arabia",
        "popularity": 0.7987,
        "profile_path": "/48SnWOxyQMtJFN7nIUn5paDrbn8.jpg"
    }
}