{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/m0ObOaJBerZ3Unc74l471ar8Iiy.jpg",
                "genre_ids": [
                    28,
                    14
                ],
                "id": 547016,
                "original_language": "en",
                "original_title": "The Old Guard",
                "overview": "Four undying warriors who've secretly protected humanity for centuries become targeted for their mysterious powers just as they discover a new immortal.",
                "popularity": 9.6649,
                "poster_path": "/cjr4NWURcVN3gW5FlHeabgBHLrY.jpg",
                "release_date": "2020-07-09",
                "title": "The Old Guard",
                "video": false,
                "vote_average": 7.123,
                "vote_count": 4553,
                "character": "Celeste",
                "credit_id": "5f0423d8d2b209003aa57e0f",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Olivia Ross was born in Paris and is a British-French actress. She studied acting at the Guildhall School of Music and Drama in London. She began her theater career at Shakespeare's Globe Theater. Previously, she starred in the French film TOUT EST PARDONNÉ directed by Mia Hansen-Løve.\n\nSeveral supporting roles in French film productions followed, including JE L'AIMAIS (2009) and THE FATHER OF MY CHILDREN (2009), as well as EDEN - LOST IN MUSIC (2014) directed by Mia Hansen-Løve and PERSONAL SHOPPER (2016) directed by Olivier Assayas. In 2015, Ross played the role of Mathilde Perrucci in the miniseries North Bend and the following year she starred as Mademoiselle Bourienne in the miniseries War and Peace. She took the lead role in the drama SOUFFLER PLUS FORT QUE LA MER (2016) directed by Marine Place. She then played Nadia in the award-winning series \"Killing Eve\". In the first season of the television series \"Knightfall\" (2017 - 2019), she played the female lead of Queen Joan of France. Recently, she finished filming the Canal+ original series production \"Les Sentinelles\". Olivia Ross will appear in the new film WHITE BIRD by Marc Forster, which will be released in the fall of 2023.",
        "birthday": "1992-04-28",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.ubba.eu/fiche/actrice/olivia-ross?lng=en",
        "id": 82183,
        "imdb_id": "nm2684840",
        "known_for_department": "Acting",
        "name": "Olivia Ross",
        "place_of_birth": "Paris, Ile-de-France, France",
        "popularity": 0.3727,
        "profile_path": "/5CSTFYU5WrhTqhN9ewN6NWDxOcc.jpg"
    }
}