{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qHI1IYj7QlLSCwHRzkL62X175s.jpg",
                "genre_ids": [
                    18
                ],
                "id": 73,
                "original_language": "en",
                "original_title": "American History X",
                "overview": "Derek Vineyard is paroled after serving 3 years in prison for killing two African-American men. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.",
                "popularity": 7.533,
                "poster_path": "/x2drgoXYZ8484lqyDj7L1CEVR4T.jpg",
                "release_date": "1998-07-01",
                "title": "American History X",
                "video": false,
                "vote_average": 8.335,
                "vote_count": 12034,
                "character": "Sweeney",
                "credit_id": "52fe4213c3a36847f8002193",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "اوری بروکس"
        ],
        "biography": "Avery Franklin Brooks is an American actor, director, singer, narrator and educator. He is best known for his television roles as Captain Benjamin Sisko on Star Trek: Deep Space Nine, as Hawk on Spenser: For Hire and its spinoff A Man Called Hawk, and as Dr. Bob Sweeney in the Academy Award–nominated film American History X.  Brooks was born in Evansville, Indiana, and raised in Gary, Indiana. He attended Oberlin College, where he studied music and theater. After graduating from Oberlin, he moved to New York City to pursue his acting career.\n\nBrooks's first professional acting role was in the play \"The Great White Hope\" in 1970. He went on to appear in a number of Broadway productions, including \"The Wiz\" and \"A Chorus Line\". He also starred in the television miniseries \"Roots\" in 1977.\n\nIn 1993, Brooks was cast as Captain Benjamin Sisko on Star Trek: Deep Space Nine. The series ran for seven seasons, and Brooks's performance as Sisko was critically acclaimed. He won a Saturn Award for Best Actor on Television in 1995.\n\nAfter Star Trek: Deep Space Nine ended, Brooks continued to work in television and film. He starred in the series \"Shark\" from 2006 to 2008, and he appeared in the films \"American History X\" and \"The Score\".\n\nBrooks is also a talented singer and musician. He has released two albums, \"Song of My People\" and \"The Way I Feel\". He is also a gifted director, and he has directed a number of theater productions and television episodes.",
        "birthday": "1948-10-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 822,
        "imdb_id": "nm0000984",
        "known_for_department": "Acting",
        "name": "Avery Brooks",
        "place_of_birth": "Evansville, Indiana, USA",
        "popularity": 0.7814,
        "profile_path": "/86G3ePzkKiFhGnVNiZLPd058P0d.jpg"
    }
}