{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3i6H4cVfvWh55sN1iXyeb8Q50nY.jpg",
                "genre_ids": [
                    80,
                    28,
                    18
                ],
                "id": 877,
                "original_language": "en",
                "original_title": "Scarface",
                "overview": "In 1920s Chicago, Italian immigrant and notorious thug, Antonio 'Tony' Camonte, aka Scarface, shoots his way to the top of the mobs while trying to protect his sister from the criminal life.",
                "popularity": 3.0024,
                "poster_path": "/y4E5oRiHMTFkEB12IIcpbKbKzDW.jpg",
                "release_date": "1932-04-09",
                "title": "Scarface",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 634,
                "character": "Blonde at Paradise Club",
                "credit_id": "56ec417ac3a3682259002bcd",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harlean Harlow Carpenter",
            "Harlean Carpenter",
            "Джин Харлоу"
        ],
        "biography": "Jean Harlow (born Harlean Harlow Carpenter; March 3, 1911 – June 7, 1937) was an American actress. Known for her portrayal of \"bad girl\" characters, she was the leading sex symbol of the early 1930s and one of the defining figures of the pre-Code era of American cinema. Often nicknamed the \"Blonde Bombshell\" and the \"Platinum Blonde\", Harlow was popular for her \"Laughing Vamp\" screen persona. Though her screen persona changed dramatically during her career, one constant was her sense of humor. She was given superior movie roles to show off her looks and nascent comedic talent. Harlow was in the film industry for only nine years, but she became one of the biggest stars in the US, whose image in the public eye has endured. Harlow was consistently voted one of the strongest box office draws in the United States from 1933 onward, often surpassing that of MGM's top leading ladies, such as Greta Garbo, Joan Crawford and Norma Shearer. Her movies also continued to make huge profits at the box office even during the middle of the Depression. In 1999, the American Film Institute ranked Harlow No. 22 on its greatest female screen legends of classical Hollywood cinema list.",
        "birthday": "1911-03-03",
        "deathday": "1937-06-07",
        "gender": 1,
        "homepage": "https://www.jeanharlow.com/",
        "id": 82315,
        "imdb_id": "nm0001318",
        "known_for_department": "Acting",
        "name": "Jean Harlow",
        "place_of_birth": "Kansas City, Missouri, USA",
        "popularity": 0.2626,
        "profile_path": "/b24q0sPGmSvZFIvz1mbCzWu11sq.jpg"
    }
}