{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9mbXZSLINbwNQateHLGRhtaZzZB.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    10402
                ],
                "id": 11176,
                "original_language": "en",
                "original_title": "The Muppet Movie",
                "overview": "The Muppets gather to watch their newly-finished big-budget rich-and-famous feature film: a talent agent persuades Kermit the Frog to leave the swamp to pursue a career in Hollywood. On his way there, he meets a bear, a pig, a whatever (his future muppet crew), and some special celebrity guest stars, while being chased by the desperate owner of a frog-leg restaurant!",
                "popularity": 2.977,
                "poster_path": "/8LUjnIW5ph6pHoXDE3Zg4iVi6BV.jpg",
                "release_date": "1979-06-22",
                "title": "The Muppet Movie",
                "video": false,
                "vote_average": 7.229,
                "vote_count": 657,
                "character": "Ice Cream Vendor",
                "credit_id": "52fe44099251416c75026ad7",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/67HggiWaP9ZLv5sPYmyRV37yAJM.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 13,
                "original_language": "en",
                "original_title": "Forrest Gump",
                "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
                "popularity": 15.8646,
                "poster_path": "/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg",
                "release_date": "1994-06-23",
                "title": "Forrest Gump",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 28632,
                "character": "Self - in Vietnam (archive footage) (uncredited)",
                "credit_id": "6717893f45cd6762235897c3",
                "order": 148
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leslie Townes Hope"
        ],
        "biography": "Leslie Townes \"Bob\" Hope KBE, KC*SG, KSS was an American comedian, actor, and entertainer. With a career that spanned nearly 80 years, Hope appeared in more than 70 short and feature films—54 in which he starred. These included a series of seven Road to... musical comedy films with Bing Crosby as Hope's top-billed partner.\n\nIn addition to hosting the Academy Awards show 19 times, more than any other host, Hope appeared in many stage productions and television roles and wrote 14 books. The song \"Thanks for the Memory\" was his signature tune.\n\nHope was born in the Eltham district of southeast London. He arrived in the United States with his family at the age of four, and grew up near Cleveland, Ohio. After a brief stint in the late 1910s as a boxer, Hope began his career in show business in the early 1920s, initially as a comedian and dancer on the vaudeville circuit, before acting on Broadway. Hope began appearing on radio and in films starting in 1934. He was praised for his comedic timing, specializing in one-liners and rapid-fire delivery of jokes that were often self-deprecating. He helped establish modern American stand-up comedy.\n\nBetween 1941 and 1991, Hope made 57 tours for the United Service Organizations (USO), entertaining active duty U.S. military personnel around the world. In 1997, the United States Congress passed a bill that made Hope an honorary veteran of the U.S. Armed Forces. Hope appeared in numerous television specials for NBC during his career and was one of the first users of cue cards.\n\nHope retired from public life in 1998 and died on July 27, 2003, at the age of 100.",
        "birthday": "1903-05-29",
        "deathday": "2003-07-27",
        "gender": 2,
        "homepage": null,
        "id": 82388,
        "imdb_id": "nm0001362",
        "known_for_department": "Acting",
        "name": "Bob Hope",
        "place_of_birth": "Eltham, London, England, UK",
        "popularity": 0.8387,
        "profile_path": "/4TNYeks5q1dNKszFxOmL4pCjEvn.jpg"
    }
}