{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pfseUmw5wH67YOgkPURnFmwUd6z.jpg",
                "genre_ids": [
                    28
                ],
                "id": 17809,
                "original_language": "zh",
                "original_title": "精武英雄",
                "overview": "Chen returns to his school when he finds out that his martial arts teacher has died. When he learns that his school students are harassed by some hooligans, he gears himself up to save them.",
                "popularity": 4.2096,
                "poster_path": "/Aqa1Yuog2OFrduwSffxZc2w4Tnk.jpg",
                "release_date": "1994-12-22",
                "title": "Fist of Legend",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 566,
                "character": "Mitsuko Yamada",
                "credit_id": "52fe47499251416c75093f9b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Shinobu Nakayama (Nakayama Shinobu , born January 18, 1973) is an actress and a former J-pop singer. She was born in Tokyo, Japan, and released her first single on 2 November 1988. Her final release as a J-pop artist was on 1 March 1991. She was a member of the short-lived idol groups Nanatsuboshi and Rakutenshi. She is the younger sister of actress Miho Nakayama.\n\nBest known for her role of Mayumi Nagamine in Gamera: Guardian of the Universe (1995) and Gamera 3: Incomplete Struggle (1999), Shinobu Nakayama like her older sister, Miho Nakayama, started out her career as a musician. Unfortunately, Nakayama could never quite attain the same popularity of her older sister as a solo artist, but became successful when she joined a music group called Rakutenshi. In the early 1990s Shinobu Nakayama started a career in acting, again following in the footsteps of her older sister. Her career finally started going after she landed a role in the Jet Li movie Fist of Legend, a remake of the Bruce Lee film Chinese Connection. Shortly afterwards she got the part of Mayumi Nagamine in Gamera: Guardian of the Universe (1995), which lead to playing that same character four years later in Gamera 3: Incomplete Struggle (1999).\n\nDescription above from the Wikipedia article Shinobu Nakayama, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1973-01-18",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.office-muse.co.jp",
        "id": 82396,
        "imdb_id": "nm0620429",
        "known_for_department": "Acting",
        "name": "Shinobu Nakayama",
        "place_of_birth": "Koganei, Tokyo Prefecture, Japan",
        "popularity": 1.0398,
        "profile_path": "/dCm2REQb3TJglF2aZMyVwfBJWdd.jpg"
    }
}