{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bXPKTWAuRO8Mu5rLCORFagX0YZ1.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 574,
                "original_language": "en",
                "original_title": "The Man Who Knew Too Much",
                "overview": "A couple vacationing in Morocco with their young son accidentally stumble upon an assassination plot. When the child is kidnapped to ensure their silence, they have to take matters into their own hands to save him.",
                "popularity": 3.1649,
                "poster_path": "/gy8YBRjCQRIT9x9G9F5fpnFD4xw.jpg",
                "release_date": "1956-05-16",
                "title": "The Man Who Knew Too Much",
                "video": false,
                "vote_average": 7.456,
                "vote_count": 1476,
                "character": "Edward Drayton",
                "credit_id": "52fe4254c3a36847f8015c87",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bernard James Miles"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nBernard James Miles, Baron Miles, CBE (27 September 1907–14 June 1991) was an English character actor, writer and director. He opened the Mermaid Theatre in London in 1959, the first new theatre opened in the City of London since the 17th century.\n\nMiles was born in Uxbridge, Middlesex and attended Bishopshalt School in Hillingdon. While his parents were respectively a farm labourer and a cook, he was educated at Pembroke College, Oxford. He entered the theatre in the 1930s, soon appearing in films. Like many actors, he featured prominently in the patriotic cinema during the Second World War, including classics of the genre such as In Which We Serve and One of Our Aircraft Is Missing. He also had an uncredited role in the WWII classic The First of the Few, released in the US as Spitfire.\n\nHis typical persona as an actor was as a countryman, with a strong accent typical of the Hertfordshire and Buckinghamshire counties. He was also, after Robert Newton, the actor most associated with the part of Long John Silver, which he played in a British TV version of Treasure Island, and in an annual performance at the Mermaid commencing in the winter of 1961-62. Actors in the annual theatrical productions included Spike Milligan as Ben Gunn, and, in the 1968 production, Barry Humphries as Long John Silver. It was Miles who, impressed by the talent of John Antrobus originally commissioned him to write a play of some sort. This led to Antrobus collaborating with Milligan to produce a one-act play called The Bed Sitting Room, which was later adapted to a longer play, and staged by Miles at The Mermaid on 31 January 1963, with both critical and commercial success.\n\nHe had a pleasant rolling bass-baritone voice that worked well in theatre and film, as well as being much in demand for voice-overs. As a performer, he was most well known for a series of comic monologues, often given in a rural dialect. These were recorded and sold as record albums, which were quite popular. Some of his comic monologues are currently available on youtube.com.\n\nMiles was made a Commander of the British Empire (CBE) in 1953, was knighted in 1969, and was granted a life peerage as Baron Miles, of Blackfriars in the City of London in 1979. He was only the second British actor ever to be given a peerage (the first was Laurence Olivier).\n\nMiles's written works include \"The British Theatre\" (1947), \"God's Brainwave\" (1972), and \"Favorite Tales from Shakespeare\" (1972). In 1981, he co-authored the book Curtain Calls with J.C. Trewin.\n\nHe died in Yorkshire.\n\nHis daughters are the actress Sally Miles and the artist Bridget Miles. His son John Miles was a Grand Prix Driver in the late 1960s and early 1970s with the Lotus team.\n\nDescription above from the Wikipedia article Bernard Miles, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1907-09-27",
        "deathday": "1991-06-14",
        "gender": 2,
        "homepage": null,
        "id": 8239,
        "imdb_id": "nm0587061",
        "known_for_department": "Acting",
        "name": "Bernard Miles",
        "place_of_birth": "Uxbridge, Hillingdon, Middlesex, England, UK",
        "popularity": 0.2219,
        "profile_path": "/wcg0mbHJEU7IXK5lihpMXEVy0jn.jpg"
    }
}