{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9Ebn8atCcGk5OZrx4xmoTobAxoh.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 1581,
                "original_language": "en",
                "original_title": "The Holiday",
                "overview": "Two women, one American and one British, swap homes at Christmastime following bad breakups. Each woman finds romance with a local man but realizes that the imminent return home may end the relationship.",
                "popularity": 7.1835,
                "poster_path": "/h1ITOpvJN3Tw4Sy60w2QTfYMvdd.jpg",
                "release_date": "2006-12-05",
                "title": "The Holiday",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 5347,
                "character": "Girl in Bar (uncredited)",
                "credit_id": "64dadc21bf31f201c94fbcea",
                "order": 66
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Leanne Wilson (born 1980) is a well known British television actress.\n\nWilson grew up in Hertfordshire with her younger brother Matt, and sister, Olivia. She attended the Knights Templar School in Baldock, Hertfordshire. As a girl Wilson was determined to be an actress, and she attended drama classes in the evenings and at weekends at the Sylvia Young Theatre School in London.\n\nHer big break came as Jess Brown in the American sci-fi series Tracker, appearing in 8 episodes between 2001-2. She appeared in 20 episodes of the BBC day-time medical drama series Doctors in 2001, but her best known role is that of Claire Guildford in 90 episodes of the BBC One medical drama Casualty. She appeared in the BBC's Stars in Fast Cars as herself in 2005, presented an award at the Disney Awards and made a couple of appearances on GMTV. After leaving Casualty Wilson guest starred in Channel 4's comedy series Peep Show in 2007. She has also appeared in numerous commercials and is currently pursuing her acting career in Los Angeles.\n\nShe appeared in the films Is Harry on the Boat  in 2000, and The Holiday in 2006. Wilson married her partner Keith Whallett in 2006.\n\nWilson was voted into 70th place in FHM's 100 Sexiest Women in the World in 2005.  In 2009 Wilson appeared in 18 episodes of the comedy TV series Workshop. She has filmed a pilot for a new sit-com called T.V or Not T.V, is shooting an episode of The Anthony Falcon Show and has appeared in Better Off Ted (2010) for NBC/FOX and House (2011).  Description above from the Wikipedia article Leanne Wilson, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1980-12-27",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.holby.tv/leanne-wilson/",
        "id": 82390,
        "imdb_id": "nm1057213",
        "known_for_department": "Acting",
        "name": "Leanne Wilson",
        "place_of_birth": "Hitchin, Hertfordshire",
        "popularity": 0.1188,
        "profile_path": "/a6Z8cq2nZP7DSOMrDuqS2oF1Jo7.jpg"
    }
}