{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bXPKTWAuRO8Mu5rLCORFagX0YZ1.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 574,
                "original_language": "en",
                "original_title": "The Man Who Knew Too Much",
                "overview": "A couple vacationing in Morocco with their young son accidentally stumble upon an assassination plot. When the child is kidnapped to ensure their silence, they have to take matters into their own hands to save him.",
                "popularity": 3.1649,
                "poster_path": "/gy8YBRjCQRIT9x9G9F5fpnFD4xw.jpg",
                "release_date": "1956-05-16",
                "title": "The Man Who Knew Too Much",
                "video": false,
                "vote_average": 7.456,
                "vote_count": 1476,
                "character": "Val Parnell",
                "credit_id": "52fe4254c3a36847f8015c8b",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Allan Mowbray",
            "Alfred Ernest Allen"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nAlan Mowbray MM, (18 August 1896 - 25 March 1969), was an English stage and film actor who found success in Hollywood. Born Alfred Ernest Allen in London, England, he served with distinction the British Army in World War I, being awarded the Military Medal for bravery. He began as a stage actor, making his way to the United States where he appeared in Broadway plays and toured the country as part of a theater troupe. As Alan Mowbray, he made his motion picture debut in 1931, going on to a career primarily as a character actor in more than 140 films including the sterling butler role in the comedy Merrily We Live, and playing the title role in the TV series The Adventures of Colonel Flack. During World War II, he made a memorable appearance as the Devil in the Hal Roach propaganda comedy The Devil with Hitler. He appeared in some two dozen guest roles on various television series. Mowbray was a founding member of the Screen Actors Guild, with outside interests that led to membership in Britain's Royal Geographic Society. He played the title role in the television series Colonel Humphrey Flack, which first appeared in 1953-1954 and then was revived in 1958-1959. In the 1954-1955 television season Mowbray played Mr. Swift, the drama coach of the character Mickey Mulligan, in NBC's short-lived situation comedy The Mickey Rooney Show: Hey, Mulligan. Mowbray died of a heart attack in 1969 in Hollywood and was interred in the Holy Cross Cemetery in Culver City, California.\n\nDescription above from the Wikipedia article Alan Mowbray, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1896-08-17",
        "deathday": "1969-03-25",
        "gender": 2,
        "homepage": null,
        "id": 8240,
        "imdb_id": "nm0610253",
        "known_for_department": "Acting",
        "name": "Alan Mowbray",
        "place_of_birth": "London, England, UK",
        "popularity": 0.3107,
        "profile_path": "/tKkLxKHzZLhu675x7ehZ3gq2DVC.jpg"
    }
}