{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rRY5VgnpT1Pm9eYIlsboCbUgn5z.jpg",
                "genre_ids": [
                    35,
                    18,
                    37
                ],
                "id": 16563,
                "original_language": "en",
                "original_title": "Seven Brides for Seven Brothers",
                "overview": "In 1850 Oregon, when a backwoodsman brings a wife home to his farm, his six brothers decide that they want to get married too.",
                "popularity": 2.5557,
                "poster_path": "/8Z4W2oRQKkmt7lhqNPROcNru9yJ.jpg",
                "release_date": "1954-07-22",
                "title": "Seven Brides for Seven Brothers",
                "video": false,
                "vote_average": 7.148,
                "vote_count": 553,
                "character": "Bride Milly Pontipee",
                "credit_id": "52fe46dc9251416c75085eab",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Suzanne Lorraine Burce"
        ],
        "biography": "Jane Powell was singing and dancing at an early age. She sang on the radio and performed in theaters before her screen debut in 1944. Through the 1940s and 1950s, she had a successful career in movie musicals. However, in 1957, her career in films ended, as she had outgrown her innocent girl-next-door image. She has made brief returns to acting in front of the camera -- on television, in commercials, and in a workout video. She has had a variety of roles on stage since the end of her movie career, including the musicals \"South Pacific,\" \"The Sound of Music,\" \"Oklahoma!,\" \"My Fair Lady,\" \"Carousel,\" and a one-woman show \"The Girl Next Door and How She Grew,\" from which she took the title of her 1988 autobiography.\n\nFrom the 1980s to the 2010s, Powell lived with her fifth husband, former child star Dickie Moore, in New York City and Connecticut, active in television and theater through the 2000s.  Moore passed away in 2015 and Powell moved full-time to Wilton, Connecticut after that.  Jane Powell passed away on September 16, 2021, of natural causes, at the age of 92.\n\nDespite the same last name she is not related to actors William Powell, Dick Powell, or Eleanor Powell.",
        "birthday": "1929-04-01",
        "deathday": "2021-09-16",
        "gender": 1,
        "homepage": null,
        "id": 82405,
        "imdb_id": "nm0007225",
        "known_for_department": "Acting",
        "name": "Jane Powell",
        "place_of_birth": "Portland, Oregon, USA",
        "popularity": 0.3934,
        "profile_path": "/mc4d6uI0bu8T5hOd9Sd4RhZYlH7.jpg"
    }
}