{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lAaAtQ5b8iX9JeG6QUq4RM1paKD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10435,
                "original_language": "en",
                "original_title": "Chaplin",
                "overview": "An aged Charlie Chaplin narrates his life to his autobiography's editor, including his rise to wealth and comedic fame from poverty, his turbulent personal life and his run-ins with the FBI.",
                "popularity": 2.9824,
                "poster_path": "/Aeltt5tl02zrEj4GoMynHc94lWG.jpg",
                "release_date": "1992-12-17",
                "title": "Chaplin",
                "video": false,
                "vote_average": 7.438,
                "vote_count": 1131,
                "character": "Minnie Chaplin",
                "credit_id": "6380912a229ae215b45d9c71",
                "order": 70
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Francesca Buller is a British-American actress born in Surrey, England on January 17th, 1964. Classically trained at London's Central School of Speech and Drama, Buller is best known for her work in Syfy's Farscape in which she donned prosthetic make-up and heavy wardrobe to portray four different aliens: M'Lee, ro-Na, Raxil, and War Minister Akhna. Her work as Akhna in \"Bad Timing\" earned Buller a nomination for Best Special Guest Television at the Syfy Genre Awards. Other film and television credits include Minnie Chaplin opposite Robert Downey Jr.'s Chaplin, Dr. Taggert in Heat Stroke, and Lilian in Deceived alongside Goldie Hawn and John Heard. Following her training at Central, Buller found success onstage appearing as Jessica in Dustin Hoffman's West End production of Shakespeare's \"Merchant of Venice,\" staying with the show when it transferred to Broadway in 1989, and Ophelia in Shakespeare Theatre Company's 1992 production of \"Hamlet\" opposite Tom Hulce, for which she received a Helen Hayes award for Outstanding Supporting Actress. Buller now resides in Los Angeles alongside husband Ben Browder and their two grown kids.",
        "birthday": "1964-01-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 82436,
        "imdb_id": "nm0120055",
        "known_for_department": "Acting",
        "name": "Francesca Buller",
        "place_of_birth": "Surrey, England, UK ",
        "popularity": 0.0573,
        "profile_path": "/4AJJLr158ZLrW26gj1F0UjV2Cwj.jpg"
    }
}