{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cSHie9qJvujqN4tYq6gx88WDf7o.jpg",
                "genre_ids": [
                    37
                ],
                "id": 576,
                "original_language": "en",
                "original_title": "The Wild Bunch",
                "overview": "An aging group of outlaws look for one last big score as the \"traditional\" American West is disappearing around them.",
                "popularity": 4.2923,
                "poster_path": "/8j9yEC3xjy1PJDSizIbaxcHaSph.jpg",
                "release_date": "1969-06-19",
                "title": "The Wild Bunch",
                "video": false,
                "vote_average": 7.611,
                "vote_count": 1265,
                "character": "Deke Thornton",
                "credit_id": "52fe4255c3a36847f8015ecd",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/2hABgVIhalvUB30Z2kIPVv8YX9n.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 1654,
                "original_language": "en",
                "original_title": "The Dirty Dozen",
                "overview": "12 American military prisoners in World War II are ordered to infiltrate a well-guarded enemy château and kill the Nazi officers vacationing there. The soldiers, most of whom are facing death sentences for a variety of violent crimes, agree to the mission and the possible commuting of their sentences.",
                "popularity": 5.0242,
                "poster_path": "/tFWWsuhp22zJ6OG6QepJIiPUfeF.jpg",
                "release_date": "1967-06-15",
                "title": "The Dirty Dozen",
                "video": false,
                "vote_average": 7.596,
                "vote_count": 1257,
                "character": "Col. Everett Dasher Breed",
                "credit_id": "52fe4309c3a36847f8035a0f",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "Brig. Gen. James M. Gavin",
                "credit_id": "52fe44e2c3a36847f80afcf3",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Bushnell Ryan",
            "Роберт Райан",
            "رابرت رایان"
        ],
        "biography": "Robert Bushnell Ryan (November 11, 1909 – July 11, 1973) was an American  actor who often played hardened cops and ruthless villains.\n\nRyan was born in Chicago, Illinois, the first child of Timothy Ryan and his wife Mabel Bushnell Ryan.  He graduated from Dartmouth College in 1932, having held the school's heavyweight boxing title all four years of his attendance. After graduation, the 6'4\" Ryan found employment as a stoker on a ship, a WPA worker, and a ranch hand in Montana.\n\nRyan attempted to make a career in show business as a playwright, but had to turn to acting to support himself. He studied acting in Hollywood and appeared on stage and in small film parts during the early 1940s.\n\nIn January 1944, after securing a contract guarantee from RKO Radio Pictures, Ryan enlisted in the United States Marine Corps and served as a drill instructor at Camp Pendleton, in San Diego, California. At Camp Pendleton, he befriended writer and future director Richard Brooks, whose novel, The Brick Foxhole, he greatly admired. He also took up painting.\n\nRyan's breakthrough film role was as an anti-Semitic killer in Crossfire (1947), a film noir based on Brooks's novel. The role won Ryan his sole career Oscar nomination, for Best Supporting Actor. From then on, Ryan's specialty was tough/tender roles, finding particular expression in the films of directors such as Nicholas Ray, Robert Wise and Sam Fuller. In Ray's On Dangerous Ground (1951) he portrayed a burnt-out city cop finding redemption while solving a rural murder. In Wise's The Set-Up (1949), he played an over-the-hill boxer who is brutally punished for refusing to take a dive. Other important films were Anthony Mann's western The Naked Spur, Sam Fuller's uproarious Japanese set gangland thriller House of Bamboo, Bad Day at Black Rock, and the socially conscious heist movie Odds Against Tomorrow. He also appeared in several all-star war films, including The Longest Day (1962) and Battle of the Bulge (1965), and The Dirty Dozen. He also played John the Baptist in MGM's Technicolor epic King of Kings (1961) and was the villainous Claggart in Peter Ustinov's adaptation of Billy Budd (1962).\n\nIn his later years, Ryan continued playing significant roles in major films. Most notable of these were The Dirty Dozen, The Professionals (1966) and Sam Peckinpah's highly influential brutal western The Wild Bunch (1969).\n\nRyan appeared several times on the Broadway stage. His credits there include Clash by Night, Mr. President and The Front Page, the comedy drama about newspapermen.\n\nHe appeared in many television series as a guest star, including the role of Franklin Hoppy-Hopp in the 1964 episode \"Who Chopped Down the Cherry Tree?\" on the NBC medical drama about psychiatry, The Eleventh Hour. Similarly, he guest starred as Lloyd Osment in the 1964 episode \"Better Than a Dead Lion\" in the ABC psychiatric series, Breaking Point. In 1964, Ryan appeared with Warren Oates in the episode \"No Comment\" of CBS's short-lived drama about newspapers, The Reporter, starring Harry Guardino in the title role of journalist Danny Taylor. Ryan appeared five times (1956–1959) on CBS's Dick Powell's Zane Grey Theater and twice (1959 and 1961) on the Zane Grey spin-off Frontier Justice. He appeared three times (1962–1964) on the western Wagon Train.",
        "birthday": "1909-11-11",
        "deathday": "1973-07-11",
        "gender": 2,
        "homepage": null,
        "id": 8253,
        "imdb_id": "nm0752813",
        "known_for_department": "Acting",
        "name": "Robert Ryan",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.3873,
        "profile_path": "/hpWgaPTbBLGCdYXHcEVLIWaA3m0.jpg"
    }
}