{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8KM1KWQt434blaRMbDOJ8ZZ3K3W.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 586,
                "original_language": "en",
                "original_title": "Wag the Dog",
                "overview": "During the final weeks of a presidential race, the President is accused of sexual misconduct. To distract the public until the election, the President's adviser hires a Hollywood producer to help him stage a fake war.",
                "popularity": 3.8872,
                "poster_path": "/rYoEQzMBlB40ZlwVoe6y5s8B58z.jpg",
                "release_date": "1997-12-25",
                "title": "Wag the Dog",
                "video": false,
                "vote_average": 6.941,
                "vote_count": 990,
                "character": "Johnny Dean",
                "credit_id": "52fe4258c3a36847f8016f25",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/gdntMCBO69lLW3eRsqd5dj4sB4J.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 11524,
                "original_language": "en",
                "original_title": "Thief",
                "overview": "Frank is an expert professional safecracker, specialized in high-profile diamond heists. He plans to use his ill-gotten income to retire from crime and build a nice life for himself complete with a home, wife and kids. To accelerate the process, he signs on with a top gangster for a big score.",
                "popularity": 4.8793,
                "poster_path": "/bpjRGwfYJ71bU0hNhLIz7g3t6Oy.jpg",
                "release_date": "1981-03-27",
                "title": "Thief",
                "video": false,
                "vote_average": 7.225,
                "vote_count": 759,
                "character": "David 'Okla' Bertinneau",
                "credit_id": "52fe44529251416c75030957",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The Highwaymen",
            "Willie Hugh Nelson"
        ],
        "biography": "Willie Hugh Nelson (born April 30, 1933) is an American country singer-songwriter, author, poet, actor, and activist. Nelson was one of the main figures of the Outlaw Movement, a subgenre of Country music that developed between the end of 1960s and early 1980s. The critical success of the albums Shotgun Willie, Phases and Stages, and the commercial success of Red Headed Stranger made Nelson one of the most recognized artists in country music. Nelson is also recognized for his contributions to charity, he is the president and one of the founding members of Farm Aid charity concert, and his activism for the legalization of marijuana and for the use of bio-fuels.\n\nNelson started studying music from mail order material that his grandparents gave him. He wrote his first song at age seven and joined his first band at nine. During high school, he toured locally with the Bohemian Fiddlers as their lead singer and guitar player. After graduating from high school in 1950, he joined the Air Force. However, he was discharged due to back problems. After his return, Nelson attended Baylor University for two years but dropped out because he was succeeding in music. During this time, he worked as a disc jockey in Texas radio stations and a singer in honky tonks. Nelson moved to Vancouver, Washington, where he wrote \"Family Bible\" and recorded the song \"Lumberjack\" in 1956. In 1960, he signed a publishing contract with Pamper Music which allowed him to join Ray Price's band as a bassist. During that time, he wrote songs that would become country standards, including \"Funny How Time Slips Away\", \"Hello Walls\", \"Pretty Paper\", and \"Crazy\". In 1962, he recorded his first album, And Then I Wrote. Due to this success, Nelson signed in 1965 with RCA Victor and joined the Grand Ole Opry.\n\nNelson is a major liberal activist and the co-chair of the advisory board of the National Organization for the Reform of Marijuana Laws, which is in favor of marijuana legalization. On the environmental front, Nelson owns the bio-diesel brand Willie Nelson Biodiesel, which is made from vegetable oil. He is the co-founder and president of Farm Aid, and has been contributing to the benefit concert series since the first event in 1985, organizing concerts and performing with other prominent artists. Nelson is also the Honorary Chairman of the Advisory Board of the Texas Music Project, the official music charity of the state of Texas.\n\nDescription above from the Wikipedia article Willie Nelson, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1933-04-30",
        "deathday": null,
        "gender": 2,
        "homepage": "https://willienelson.com/",
        "id": 8261,
        "imdb_id": "nm0005268",
        "known_for_department": "Acting",
        "name": "Willie Nelson",
        "place_of_birth": "Abbott, Texas, USA",
        "popularity": 0.5293,
        "profile_path": "/e5rXc3fn4v642bIDVFWUr6UlVM3.jpg"
    }
}