{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cSHie9qJvujqN4tYq6gx88WDf7o.jpg",
                "genre_ids": [
                    37
                ],
                "id": 576,
                "original_language": "en",
                "original_title": "The Wild Bunch",
                "overview": "An aging group of outlaws look for one last big score as the \"traditional\" American West is disappearing around them.",
                "popularity": 4.049,
                "poster_path": "/8j9yEC3xjy1PJDSizIbaxcHaSph.jpg",
                "release_date": "1969-06-19",
                "title": "The Wild Bunch",
                "video": false,
                "vote_average": 7.61,
                "vote_count": 1264,
                "character": "T.C",
                "credit_id": "52fe4255c3a36847f8015ee9",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/iZGiMD0p1M2AOmzKknFo5bkuz94.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 524,
                "original_language": "en",
                "original_title": "Casino",
                "overview": "In early-1970s Las Vegas, Sam \"Ace\" Rothstein gets tapped by his bosses to head the Tangiers Casino. At first, he's a great success in the job, but over the years, problems with his loose-cannon enforcer Nicky Santoro, his ex-hustler wife Ginger, her con-artist ex Lester Diamond and a handful of corrupt politicians put Sam in ever-increasing danger.",
                "popularity": 9.7377,
                "poster_path": "/gziIkUSnYuj9ChCi8qOu2ZunpSC.jpg",
                "release_date": "1995-11-22",
                "title": "Casino",
                "video": false,
                "vote_average": 7.995,
                "vote_count": 6180,
                "character": "Pat Webb",
                "credit_id": "53a2d500c3a368320a0013be",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Justus McQueen",
            "Justus E. McQueen",
            "LQ Jones",
            "Justus Ellis McQueen, Jr."
        ],
        "biography": "L. Q. Jones (born August 19, 1927, died July 9th 2022) was an American character actor and film director, known for his work in the films of Sam Peckinpah.\n\nJones was born in Beaumont in southeastern Texas, the son of Jessie Paralee (née Stephens) and Justus Ellis McQueen Sr., a railroad worker.  After serving in the United States Navy from 1945 to 1946, Jones attended Lamar Junior College (now Lamar University) and then studied law at the University of Texas at Austin from 1950 to 1951.  He worked as a stand-up comic, briefly played professional baseball and football, and even tried ranching in Nicaragua before turning to acting after corresponding with his former college roommate, Fess Parker.  At the time, in 1954, Parker was already in Hollywood working in films and on television. Jones is a practicing Methodist and a registered Republican.\n\nJones made his film debut in 1955 in Battle Cry, credited under his birth name Justus McQueen.  His character's name in that film, however, was \"L. Q. Jones\", a name he liked and decided to adopt as his stage name for all of his future roles as an actor.  In 1955, he was cast as \"Smitty Smith\" in three episodes of Clint Walker's ABC/Warner Brothers western series, Cheyenne, the first hour-long western on network television.\n\nJones appeared in numerous films in the 1960s and 1970s. He became a member of Sam Peckinpah's stock company of actors, appearing in his Klondike series (1960–1961), Ride the High Country (1962), Major Dundee (1965), The Wild Bunch (1969), The Ballad of Cable Hogue (1970), and Pat Garrett and Billy The Kid (1973).\n\nJones was frequently cast alongside his close friend Strother Martin, most memorably as the posse member and bounty hunter \"T. C.\" in The Wild Bunch. Jones also appeared as recurring characters on such western series as Cheyenne (1955), Gunsmoke (1955), Laramie, Two Faces West (1960–1961), and as ranch hand Andy Belden in The Virginian (1962). That same year (1962) Jones appeared as Ollie Earnshaw, a rich rancher looking for a bride on Lawman in the episode titled \"The Bride.\n\nFrom Wikipedia, the free encyclopedia CLR",
        "birthday": "1927-08-19",
        "deathday": "2022-07-09",
        "gender": 2,
        "homepage": null,
        "id": 8262,
        "imdb_id": "nm0428618",
        "known_for_department": "Acting",
        "name": "L.Q. Jones",
        "place_of_birth": "Beaumont, Texas, USA",
        "popularity": 0.8316,
        "profile_path": "/vSGLFloekrgC8eIaqxCiKe7VW0u.jpg"
    }
}