{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2Mq10FWFbxoYgsZysWlw7T9wSNe.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 61979,
                "original_language": "es",
                "original_title": "Tres metros sobre el cielo",
                "overview": "Story of two young people who belong to different worlds. It is the chronicle of a love improbable, almost impossible but inevitable dragging in a frantic journey they discover the first great love. Babi is a girl from upper-middle class that is educated in goodness and innocence . Hache is a rebellious boy, impulsive, unconscious, has a appetite for risk and danger embodied in endless fights and illegal motorbike races, the limit of common sense",
                "popularity": 9.4189,
                "poster_path": "/nNoMfNPnvEzGADXDkP6eJAP81KB.jpg",
                "release_date": "2010-12-03",
                "title": "Three Steps Above Heaven",
                "video": false,
                "vote_average": 7.728,
                "vote_count": 3141,
                "character": "Hache",
                "credit_id": "52fe466cc3a368484e08fe3f",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/e74H6yfw9qh8uEJP3yVUfWlMvxe.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 109689,
                "original_language": "es",
                "original_title": "Tengo ganas de ti",
                "overview": "The sexy Gin is the new love of Hache, but this can not forget his former girlfriend, so the love triangle is inevitable.",
                "popularity": 4.827,
                "poster_path": "/s16By5DjE1QJDPDfmTnbGozak0H.jpg",
                "release_date": "2012-06-22",
                "title": "I Want You",
                "video": false,
                "vote_average": 7.449,
                "vote_count": 1919,
                "character": "Hache",
                "credit_id": "52fe4ac1c3a36847f81dffa5",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/s3pniDBtG52O26WySm6HY0YLVWh.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 274109,
                "original_language": "es",
                "original_title": "Palmeras en la nieve",
                "overview": "Spain, 2003. An accidental discovery leads Clarence to travel from the snowy mountains of Huesca to Equatorial Guinea, to visit the land where her father Jacobo and her uncle Kilian spent most of their youth, the island of Fernando Poo.",
                "popularity": 2.9654,
                "poster_path": "/iIVqgTKbqt24bUTzMlyRX8kB1Ac.jpg",
                "release_date": "2015-12-25",
                "title": "Palm Trees in the Snow",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 534,
                "character": "Kilian",
                "credit_id": "539021fcc3a3680d6e0012ac",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/1ZSWFzAP4AZuFCigZZoib2RdcUO.jpg",
                "genre_ids": [
                    18,
                    9648,
                    53
                ],
                "id": 411088,
                "original_language": "es",
                "original_title": "Contratiempo",
                "overview": "Barcelona, Spain. Adrián Doria, a young and successful businessman accused of murder, meets one night with Virginia Goodman, an expert interrogation lawyer, in order to devise a defense strategy.",
                "popularity": 5.1047,
                "poster_path": "/fptnZJbLzKUHeNlYrAynbyoL5YJ.jpg",
                "release_date": "2017-01-06",
                "title": "The Invisible Guest",
                "video": false,
                "vote_average": 8.086,
                "vote_count": 4758,
                "character": "Adrián Doria",
                "credit_id": "57ae6905c3a368030a001145",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/ljZOlqLtMa6gnTHcYn9y9lP0bK3.jpg",
                "genre_ids": [
                    18,
                    36,
                    53
                ],
                "id": 528949,
                "original_language": "es",
                "original_title": "El fotógrafo de Mauthausen",
                "overview": "Spanish photographer Francesc Boix, imprisoned in the Mauthausen-Gusen concentration camp, works in the SS Photographic Service. Between 1943 and 1945, he hides, with the help of other prisoners, thousands of negatives, with the purpose of showing the freed world the atrocities committed by the Nazis, exhaustively documented. He will be a key witness during the Nuremberg Trials.",
                "popularity": 3.2055,
                "poster_path": "/6b4L0uLVgFsDfqPx0sFZbCRwIKH.jpg",
                "release_date": "2018-10-26",
                "title": "The Photographer of Mauthausen",
                "video": false,
                "vote_average": 6.988,
                "vote_count": 720,
                "character": "Francesc Boix",
                "credit_id": "5b73654a0e0a267ee71ce975",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mario Casas Sierra",
            "马里奥·卡萨斯",
            "Маріо Касас",
            "馬里奧·卡薩斯",
            "ماریو کاساس"
        ],
        "biography": "Mario Casas, has 4 siblings. Born in La Coruña, although very young, at just 4 years old, he left with his family to Barcelona. Later, at the age of 18, he emigrated to the Spanish capital in an adventure in which he took his whole family with him.\n\nHis parents were very young when they had him; his mother, Heidi, was only 17 and his father, Ramon, 19. Only a year and a half later they had their sister, so they were very young and had two children. For Mario, his father is his \"reference\", while his mother, like his brothers, are his \"confidants\".\n\nHis mother has been raising her children, while his father is a cabinetmaker, but has also done construction and renovation work. Because of this work, his father had no problems moving to another city, so they decided to accompany Mario when he left for Madrid and settled with him in the city.\n\nMario has four other brothers and sisters, forming what he defines as \"a Sicilian family\", a family with many children established around a \"matriarch\". Mario, is the oldest of them all. He is followed by his sister Sheila, and two other brothers, named Christian and Oscar. Finally, the youngest member of the family, Daniel, who was born in 2014, and whom he considers almost as his \"nephew\" because of the enormous age difference.\n\nHe gets along well with all of them, although especially with his sister Sheila, as they have grown up together. Mario, a loyal tattoo lover, has one dedicated to each of his parents and siblings, with the initials of each one.\n\nHe remembers his childhood as \"wonderful\", although he had a bit of a hard time because he was given \"a lot of cane\" for being short, even the girls. He developed very late, until he was 15 years old, he continued to have the body of a child. Even so, he has always been a flirt, and had his first \"girlfriend\" at the age of 4.\n\nAs a child he liked everything: singing, dancing, ping-pong, football.... He says he liked to try everything, although he admits that he got tired fast. His professional career began as an \"advertisement child\", as he was involved in advertising as a child. He advertised Cola Cao, Telepizza, Scalextric... He eventually decided to become an actor after he had enrolled the Cristina Rota School of Dramatic Arts\n\nHe also keeps \"lifelong\" friends from school. They are the ones he made when he arrived in Barcelona and have always been with him. In his words, true friends who you can count on the fingers of one hand.\n\nOver the years he dated a few fellow actresses he starred with in movies such as María Valverde and Berta Vázques. Since 2018, he is in a relationship with famous Spanish actress Blanca Suarez he played with in movies/tv shows such as: Carne de Neon (2010), El Barco (2011-2013), Mi Gran Noche (2015), and El Bar (2017).",
        "birthday": "1986-06-12",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.fnac.es/Mario-Casas/ia182573/biografia",
        "id": 82700,
        "imdb_id": "nm1832584",
        "known_for_department": "Acting",
        "name": "Mario Casas",
        "place_of_birth": "La Coruña, Galicia, Spain",
        "popularity": 0.5973,
        "profile_path": "/dqXRFhBB4OJQSWonymV8BfVghds.jpg"
    }
}