{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rRY5VgnpT1Pm9eYIlsboCbUgn5z.jpg",
                "genre_ids": [
                    35,
                    18,
                    37
                ],
                "id": 16563,
                "original_language": "en",
                "original_title": "Seven Brides for Seven Brothers",
                "overview": "In 1850 Oregon, when a backwoodsman brings a wife home to his farm, his six brothers decide that they want to get married too.",
                "popularity": 2.6449,
                "poster_path": "/8Z4W2oRQKkmt7lhqNPROcNru9yJ.jpg",
                "release_date": "1954-07-22",
                "title": "Seven Brides for Seven Brothers",
                "video": false,
                "vote_average": 7.148,
                "vote_count": 553,
                "character": "Drunk (uncredited)",
                "credit_id": "660db0f395ce24017d6f4521",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/6S4gjpkd359UuMLfrnUV1M695DF.jpg",
                "genre_ids": [
                    37,
                    18
                ],
                "id": 288,
                "original_language": "en",
                "original_title": "High Noon",
                "overview": "Will Kane, the sheriff of a small town in New Mexico, learns a notorious outlaw he put in jail has been freed, and will be arriving on the noon train. Knowing the outlaw and his gang are coming to kill him, Kane is determined to stand his ground, so he attempts to gather a posse from among the local townspeople.",
                "popularity": 4.8188,
                "poster_path": "/qETSMQ4IXBSAS409Z9OL0ppXWTW.jpg",
                "release_date": "1952-06-09",
                "title": "High Noon",
                "video": false,
                "vote_average": 7.666,
                "vote_count": 1502,
                "character": "Gillis - Saloon Owner (uncredited)",
                "credit_id": "56fab7559251410d8f0005e1",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/p47ihFj4A7EpBjmPHdTj4ipyq1S.jpg",
                "genre_ids": [
                    18
                ],
                "id": 599,
                "original_language": "en",
                "original_title": "Sunset Boulevard",
                "overview": "A hack screenwriter writes a screenplay for a former silent film star who has faded into Hollywood obscurity.",
                "popularity": 5.7842,
                "poster_path": "/sC4Dpmn87oz9AuxZ15Lmip0Ftgr.jpg",
                "release_date": "1950-08-10",
                "title": "Sunset Boulevard",
                "video": false,
                "vote_average": 8.293,
                "vote_count": 2743,
                "character": "1st Finance Man",
                "credit_id": "57b5ded5c3a368759900234d",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Larry Blake",
            "Joseph Vieira"
        ],
        "biography": "Larry J. Blake was born in the Bay Ridge section of Brooklyn, New York on April 24, 1914. At the age of 18, his talent at impersonations and dialects grew into a vaudeville act. Blake eventually became a headliner, playing the Orpheum circuit, as well as the Roxy Theatre and the Rainbow Room in Rockefeller Center.\n\nIn 1936, he signed to a contract with Universal studios, and his first job was in the serial Secret Agent X-9 (1937). Right after that, he was chosen for a featured role in James Whale's The Road Back (1937), a sequel to All Quiet on the Western Front (1930). He appeared in other films for Universal including a string of 1938 films, Trouble at Midnight (1937), Air Devils (1938), Nurse from Brooklyn (1938), and The Jury's Secret (1938).\n\nWith the outbreak of WWII, Blake joined the U.S. Navy serving in both the Atlantic and Pacific. He was mustered out and treated at a Naval hospital for his alcoholism. A Catholic priest helped Blake join Alcoholics Anonymous, and in 1946 he help start the first A.A. group for members of the motion picture industry.\n\nBlake returned to acting in 1946, working steadily in supporting and bit parts throughout the 1950s. He is best known for his roles in Sunset Blvd. (1950) and High Noon (1952). In Sunset Boulevard he played the first finance man who comes to repossess William Holden's car. In High Noon, Blake played Gillis, the owner of the saloon who is punched by Gary Cooper.\n\nAs television's popularity began, Blake found plenty of work from westerns, crime dramas to comedies. He was a regular in The Pride of the Family (1953) television series, as well as the recurring part of the friendly jailer in Yancy Derringer (1958).\n\nHis last role was as the museum security guard in Time After Time (1979), when he was forced to retire due to emphysema. Until his death in 1982, Blake continued helping others in the A.A. program. (IMDB)",
        "birthday": "1914-04-24",
        "deathday": "1982-05-25",
        "gender": 2,
        "homepage": null,
        "id": 82750,
        "imdb_id": "nm0086627",
        "known_for_department": "Acting",
        "name": "Larry J. Blake",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.2316,
        "profile_path": "/b4dfz0xLUHJJJEPmAmAI2jrzXBj.jpg"
    }
}