{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2riY7AHpnOmViEymORvtG4KZqDc.jpg",
                "genre_ids": [
                    27,
                    878,
                    9648
                ],
                "id": 837,
                "original_language": "en",
                "original_title": "Videodrome",
                "overview": "As the president of a trashy TV channel, Max Renn is desperate for new programming to attract viewers. When he happens upon \"Videodrome,\" a TV show dedicated to gratuitous torture and punishment, Max sees a potential hit and broadcasts the show on his channel. However, after his girlfriend auditions for the show and never returns, Max investigates the truth behind Videodrome and discovers that the graphic violence may not be as fake as he thought.",
                "popularity": 2.6637,
                "poster_path": "/qqqkiZSU9EBGZ1KiDmfn07S7qvv.jpg",
                "release_date": "1983-02-04",
                "title": "Videodrome",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 2330,
                "character": "Matron",
                "credit_id": "584fd47e9251416f63007594",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kay Hawtry ",
            "Kay Hartrey",
            "Katharine Hawtrey",
            "Katharine Mary Craven Hawtrey"
        ],
        "biography": "Kay Hawtrey, born Katharine Mary Craven Hawtrey, later Katharine Mary Craven Clark, was born on November 8, 1926, in Toronto, Ontario, Canada. She was an actress, who embarked on her career at Toronto’s Hart House Theatre. Following a year-long engagement at London's Embassy Theatre, she ventured into television during the \"Golden Age of Television\" in the 1950s. Credited as Kay Hawtrey, she notably portrayed Mrs. Lutz in 15 episodes of \"The Great Detective,\" starring Douglas Campbell. Also known for Videodrome (1983), Urban Legend (1998) and Funeral Home (1980). She was previously married to John Clark. Her career spanned both stage and screen, showcasing her talents during this pivotal era of television. She died on June 11, 2021 in Toronto, Ontario, Canada.",
        "birthday": "1926-11-08",
        "deathday": "2021-06-11",
        "gender": 1,
        "homepage": null,
        "id": 83024,
        "imdb_id": "nm0370443",
        "known_for_department": "Acting",
        "name": "Kay Hawtrey",
        "place_of_birth": " Toronto, Ontario, Canada ",
        "popularity": 0.1736,
        "profile_path": "/bkBT5qjyGrnbIoK9wmlkvXr3f1S.jpg"
    }
}