{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lmMVUuu2hHX6qrpcusiuSGU8HaC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 9587,
                "original_language": "en",
                "original_title": "Little Women",
                "overview": "With their father away as a chaplain in the Civil War, Jo, Meg, Beth and Amy grow up with their mother in somewhat reduced circumstances. They are a close family who inevitably have their squabbles and tragedies. But the bond holds even when, later, male friends start to become a part of the household.",
                "popularity": 3.6035,
                "poster_path": "/1ZzH1XMcKAe5NdrKL5MfcqZHHsZ.jpg",
                "release_date": "1994-12-21",
                "title": "Little Women",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1275,
                "character": "Sally's Friend",
                "credit_id": "637440336728a8007e7a99cf",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/hPHahVM3JDlE0Zexu6avavypk0g.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 13001,
                "original_language": "en",
                "original_title": "Stargate: The Ark of Truth",
                "overview": "SG-1 searches for an ancient weapon which could help them defeat the Ori, and discover it may be in the Ori's own home galaxy. As the Ori prepare to send ships through to the Milky Way to attack Earth, SG-1 travels to the Ori galaxy aboard the Odyssey. The International Oversight committee have their own plans and SG-1 finds themselves in a distant galaxy fighting two powerful enemies.",
                "popularity": 5.1718,
                "poster_path": "/kIqsCdZBmKYuPwaDnrFYzK1gqlM.jpg",
                "release_date": "2008-03-11",
                "title": "Stargate: The Ark of Truth",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 535,
                "character": "Morgan Le Fay / Ganos Lal",
                "credit_id": "5c3c4deb0e0a260fe68d1184",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nSarah Strange (born September 6, 1974) is a Canadian  actress, known for her work in a variety of American and Canadian  television and film projects, most notably as Helen in the Canadian  drama Da Vinci's Inquest and as the voice actor for Ranma Saotome.\n\nStrange was born in Vancouver, British Columbia, the daughter of screenwriters Susan Lynn (née Ward) and Marc Strange (creators of The Beachcombers).  She grew up in Canada's entertainment industry, and has appeared in  comedic, dramatic, and science fiction projects on both big and small  screens since graduating high school.\n\nStrange has since garnered multiple Gemini Award nominations for her acting, winning an award for her guest role in the Canadian series Neon Rider at 21. Strange is also known for playing the voice of boy-type Ranma Saotome for the OAVs, movies and first three seasons of the anime series Ranma ½. She played Jill Langston in the Canadian Science drama ReGenesis. Jill was lead virologist in season 1 and 2.\n\nShe also provided the voice of Franklin in Dinobabies and Rookie in Littlest Pet Shop.\n\nMost recently, Strange was among the cast of the American romantic comedy-drama Men In Trees, on which she portrayed the town barmaid and a reconciling wife opposite Abraham Benrubi. The role comes two years after a previous series for the network. She also appeared on Life As We Know It as a recurring role named \"Mia\", the mother of Kelly Osbourne's character. She also reprised her role of Ganos Lal/Morgan le Fay in the direct-to-DVD movie Stargate: The Ark of Truth.\n\nStrange has also appeared on an episode of Sanctuary titled \"Kush\" as Dr. Allison Grant.",
        "birthday": "1974-09-06",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 83023,
        "imdb_id": "nm0833385",
        "known_for_department": "Acting",
        "name": "Sarah Strange",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.5954,
        "profile_path": "/u1KEAdixiGx7YAA3EglNSNU4tK4.jpg"
    }
}