{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1K3JmSNUN8OpjYsCjc0Hy0SYxAb.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 102899,
                "original_language": "en",
                "original_title": "Ant-Man",
                "overview": "Armed with the astonishing ability to shrink in scale but increase in strength, master thief Scott Lang must embrace his inner-hero and help his mentor, Doctor Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.",
                "popularity": 8.698,
                "poster_path": "/rQRnQfUl3kfp78nCWq8Ks04vnq1.jpg",
                "release_date": "2015-07-14",
                "title": "Ant-Man",
                "video": false,
                "vote_average": 7.068,
                "vote_count": 20318,
                "character": "Car Driver",
                "credit_id": "55e513a692514137a6000c1d",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "加勒特·莫里斯",
            "گرت موریس"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nGarrett Gonzalez Morris (born February 1, 1937 height 5' 8\" (1,73 m)) is an Americancomedian and actor. He was part of the original cast of the sketch comedy program Saturday Night Live, appearing from 1975 to 1980.\n\nMorris was a church-choir singer from his youth, trained at the Juilliard School of Music, and graduated from Dillard University in 1958. Early in his career, he soloed with the Harry Belafonte singers. He performed in a number of Broadwaymusicals, including Hallelujah, Baby! and Ain't Supposed to Die a Natural Death. He also appeared as a high school teacher in the 1975 film Cooley High. He had a small role as a police sergeant in The Anderson Tapes (1970). Morris also lived in Fort Lauderdale, Florida, where he worked as a postal carrier.",
        "birthday": "1937-02-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 83187,
        "imdb_id": "nm0606541",
        "known_for_department": "Acting",
        "name": "Garrett Morris",
        "place_of_birth": "New Orleans, Louisiana, USA",
        "popularity": 0.3778,
        "profile_path": "/lF69l3dDWHhxoscaJPRDubPglYd.jpg"
    }
}