{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fe5a9dB8tylKUpcXq88ioXpNSsm.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 11971,
                "original_language": "en",
                "original_title": "Much Ado About Nothing",
                "overview": "In this Shakespearean farce, Hero and her groom-to-be, Claudio, team up with Claudio's commanding officer, Don Pedro, the week before their wedding to hatch a matchmaking scheme. Their targets are sharp-witted duo Benedick and Beatrice -- a tough task indeed, considering their corresponding distaste for love and each other. Meanwhile, meddling Don John plots to ruin the wedding.",
                "popularity": 2.0682,
                "poster_path": "/tvltGP6vYOkHdURag0jPSjhPUAV.jpg",
                "release_date": "1993-05-07",
                "title": "Much Ado About Nothing",
                "video": false,
                "vote_average": 6.937,
                "vote_count": 764,
                "character": "Antonio",
                "credit_id": "52fe44ad9251416c7503d153",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/86z1Yrwj7yN1xehSa0gIwHnR7xl.jpg",
                "genre_ids": [
                    10751,
                    12,
                    16,
                    18
                ],
                "id": 37135,
                "original_language": "en",
                "original_title": "Tarzan",
                "overview": "Tarzan was a small orphan who was raised by an ape named Kala since he was a child. He believed that this was his family, but on an expedition Jane Porter is rescued by Tarzan. He then finds out that he's human. Now Tarzan must make the decision as to which family he should belong to...",
                "popularity": 9.525,
                "poster_path": "/bTvHlcqiOjGa3lFtbrTLTM3zasY.jpg",
                "release_date": "1999-06-17",
                "title": "Tarzan",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 7049,
                "character": "Clayton (voice)",
                "credit_id": "52fe462c9251416c9104bab1",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "B. Blessed",
            "برایان بلسد"
        ],
        "biography": "Brian Blessed OBE ( born 9 October 1936) is an English actor. He is known for his distinctive bushy beard, booming voice, and exuberant personality and performances. He portrayed PC \"Fancy\" Smith in Z-Cars; Augustus in the 1976 BBC television production of I, Claudius; King Richard IV in the first series of Blackadder; Prince Vultan in Flash Gordon; Bustopher Jones and Old Deuteronomy in the 1981 original London production of Cats at the New London Theatre; Thomas Beaufort, Duke of Exeter, in Henry V; Boss Nass in Star Wars: Episode I – The Phantom Menace; and the voice of Clayton and the Tarzan yell in Disney's Tarzan.\n\nIn 2016, Blessed was appointed Officer of the Order of the British Empire (OBE) for services to the arts and charity.\n\nBlessed was born on 9 October 1936 at Montagu Hospital in Mexborough, West Riding of Yorkshire, the son of William Blessed, a socialist coal miner at Hickleton Main Colliery (and himself the son of a coal miner) and cricketer for the Yorkshire second team, and Hilda (née Wall). He had a brother Alan, seven years younger, and the pair \"went everywhere together\" when they were growing up. Alan Blessed died from leukaemia aged 52; their mother died aged 87, and their father died aged 99. Blessed's great-great-grandfather, Jabez Blessed, was the father of 13 children and worked as a china and glass dealer in Brigg, Lincolnshire; many of Blessed's relatives hail from Brigg.\n\nBlessed went to Bolton on Dearne Secondary Modern School, and completed his national service in the RAF, in Bicester, before enrolling at the Bristol Old Vic Theatre School in 1956.",
        "birthday": "1936-10-09",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.gordonpoole.com/talent/brian-blessed/",
        "id": 8318,
        "imdb_id": "nm0000306",
        "known_for_department": "Acting",
        "name": "Brian Blessed",
        "place_of_birth": "Mexborough, Yorkshire, England, UK",
        "popularity": 0.6814,
        "profile_path": "/3mLIr94V5IOA5ndY6GyqKKcyrX6.jpg"
    }
}