{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lA5fOBqTOQBQ1s9lEYYPmNXoYLi.jpg",
                "genre_ids": [
                    35,
                    12,
                    878
                ],
                "id": 590223,
                "original_language": "en",
                "original_title": "Love and Monsters",
                "overview": "Seven years since the Monsterpocalypse began, Joel Dawson has been living underground in order to survive. But after reconnecting over radio with his high school girlfriend Aimee, Joel decides to venture out to reunite with her, despite all the dangerous monsters that stand in his way.",
                "popularity": 4.4787,
                "poster_path": "/718NnyxyQuBQcGWt9sdelA1Zc3h.jpg",
                "release_date": "2020-10-16",
                "title": "Love and Monsters",
                "video": false,
                "vote_average": 7.282,
                "vote_count": 4238,
                "character": "Dana",
                "credit_id": "5e477b8e134d5800142ed23e",
                "order": 5
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/7I6VUdPj6tQECNHdviJkUHD2u89.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 603692,
                "original_language": "en",
                "original_title": "John Wick: Chapter 4",
                "overview": "With the price on his head ever increasing, John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes.",
                "popularity": 18.576,
                "poster_path": "/vZloFAK7NmvMGKE7VkF5UHaz0I.jpg",
                "release_date": "2023-03-22",
                "title": "John Wick: Chapter 4",
                "video": false,
                "vote_average": 7.721,
                "vote_count": 7377,
                "credit_id": "67ac6d806eb36d0dad9bcacc",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "الن هولمن"
        ],
        "biography": "Hollman is widely recognized for starring as \"Saxa\" on the hit STARZ series Spartacus: War of the Damned and Spartacus: Vengeance, one of the most buzzed about shows in STARZ history. A seasoned jiu-jitsu practitioner, Hollman is also known for her serious ass kicking in major roles on NCIS: New Orleans as recurring antagonist/assassin \"Amelia Parsons\" and AMC's groundbreaking martial arts series Into the Badlands. Other credits include recurring roles on Ryan Murphy's series 9-1-1 on FOX, Navy SEAL Series SIX on A&E as well as Lethal Weapon and Hawaii Five-0.\n\nBorn in Michigan, Hollman was raised by her father Hart Hollman, a violist for the Detroit Symphony Orchestra, and her mother Julie, a master pianist. No stranger to the arts, Hollman spent countless hours in the Opera House and Orchestra Hall surrounding herself with classical brilliance. In her teen years, she decided to pursue a career in the arts herself, and moved to New York City. There, she studied at various acclaimed acting studios and honed in on her craft of choice: bringing to life a versatile array of characters on stage and on the silver screen. In 2004, Hollman moved out to Los Angeles. Within one year of being in LA, she started landing projects.\n\nAside from acting, Hollman is the CEO of Visual Impact Now, a non-profit based in Los Angeles. Visual Impact Now has served as a fundraising and awareness arm for their partner ONE SIGHT, to provide free eye exams and glasses to children and families who are unable to afford it. They have been involved with various high profile events including the GOLDEN GLOBES STYLE LOUNGE, COACHELLA, SUNDANCE, LA FASHION WEEK, and more. Their Host Committee Members and supporters have included Zoe Saldana, Chris Pine, Debra Messing, Malin Akerman, Shaun White, January Jones, and Taylor Lautner, to name a few. Over the years they have serviced over 7,000 LA youth with eye care and glasses.",
        "birthday": "1983-04-01",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.ellenhollman.com",
        "id": 83218,
        "imdb_id": "nm1712005",
        "known_for_department": "Acting",
        "name": "Ellen Hollman",
        "place_of_birth": "Michigan, USA",
        "popularity": 0.7145,
        "profile_path": "/acqpPqxtFhXbat98llcttsHFARm.jpg"
    }
}