{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fONtQBk12LGjQo4q6bXDROVQmTy.jpg",
                "genre_ids": [
                    53,
                    12
                ],
                "id": 213,
                "original_language": "en",
                "original_title": "North by Northwest",
                "overview": "Advertising man Roger Thornhill is mistaken for a spy, triggering a deadly cross-country chase.",
                "popularity": 3.6101,
                "poster_path": "/kNOFPQrel9YFCVzI0DF8FnCEpCw.jpg",
                "release_date": "1959-08-06",
                "title": "North by Northwest",
                "video": false,
                "vote_average": 7.982,
                "vote_count": 4292,
                "character": "Woman on Sidewalk (uncredited)",
                "credit_id": "67c61813a3277ab4a1e791f2",
                "order": 93
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Doris Ione Smith"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nDonna Douglas (born Doris Ione Smith; September 26, 1932 – January 1, 2015) was an American actress and singer, known for her role as Elly May Clampett in CBS's The Beverly Hillbillies (1962–1971). Following her acting career, Douglas became a real estate agent, gospel singer, inspirational speaker, and author of books for children and adults.\n\nAlthough Douglas was an active actress in the 1960s, she was still relatively unknown when selected from among 500 young actresses to work alongside veteran actor and dancer Buddy Ebsen on The Beverly Hillbillies. This series ran for nine consecutive seasons, beginning in 1962 and ending in 1971. Continually typecast as a result of her Hillbillies role, Douglas decided to focus on her career as a gospel singer.\n\nDuring the 1966 summer hiatus of The Beverly Hillbillies, Douglas made her only starring feature film appearance, cast as Frankie in Fred de Cordova's Frankie and Johnny (1966) alongside Elvis Presley. The film proved popular but it did little to advance Douglas' big-screen career.\n\nWith the 1973 death of Hillbillies co-star Irene Ryan, and Max Baer Jr.'s refusal to participate, Douglas joined Nancy Kulp and Buddy Ebsen in 1981 as the only original cast members to appear in the reunion movie, Return of the Beverly Hillbillies. Douglas was a guest star on a number of other television programs and the subject of paper dolls, dolls, coloring books, and various toys during the height of the show's popularity. In a 2003 interview with \"Confessions of a Pop Culture Addict\", she summed up her views on the role: \"Elly May was like a slice out of my life. She is a wonderful little door opener for me because people love her, and they love the Hillbillies. Even to this day it's shown every day somewhere. But, as with any abilities, she may open a door for you, but you have to have substance or integrity to advance you through that door.\"\n\nIn 1992, Douglas and Baer attended Buddy Ebsen's 84th birthday celebration in Beverly Hills, California. In 1993, Douglas, Ebsen, and Baer reunited on The Jerry Springer Show, and for a final time in a CBS-TV television special, The Legend of The Beverly Hillbillies.\n\nIn December 2010, Mattel released a new collection of three Barbies called the Classic TV Collection. These dolls were Samantha Stephens (from Bewitched, played by Elizabeth Montgomery), Jeannie (from I Dream of Jeannie, played by Barbara Eden) and Elly May Clampett.",
        "birthday": "1933-09-26",
        "deathday": "2015-01-02",
        "gender": 1,
        "homepage": null,
        "id": 83457,
        "imdb_id": "nm0235031",
        "known_for_department": "Acting",
        "name": "Donna Douglas",
        "place_of_birth": "Pride Louisiana USA",
        "popularity": 0.2585,
        "profile_path": "/m81iRXtKxiNjyztDW3Cyde7lFMF.jpg"
    }
}