{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fuKt9vmyN8cpZvPflfW9YGrFTuQ.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 10776,
                "original_language": "en",
                "original_title": "Little Shop of Horrors",
                "overview": "Seymour Krelborn is a nerdy orphan working at Mushnik's; a flower shop in urban Skid Row. He harbors a crush on fellow co-worker, Audrey Fulquard, and is berated by Mr. Mushnik daily. One day, Seymour finds a very mysterious unidentified plant which he calls Audrey II. The plant seems to have a craving for blood and soon begins to sing for his supper.",
                "popularity": 2.2423,
                "poster_path": "/iKkbN17OmFosaW6asCNZTTsyvpu.jpg",
                "release_date": "1986-12-19",
                "title": "Little Shop of Horrors",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1526,
                "character": "Crystal",
                "credit_id": "56952080c3a3680e9d0022c8",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "تیچینا آرنولد"
        ],
        "biography": "Tichina Rolanda Arnold (born June 28, 1971) is an American actress and singer. She is best known for her roles of Pamela James on the FOX sitcom Martin, family matriarch Rochelle on the UPN/CW sitcom Everybody Hates Chris, Judi Mann in the TV Land original sitcom Happily Divorced, the lead role of Cassie Calloway on Survivor's Remorse, and Tina Butler on the CBS sitcom The Neighborhood.\n\nShe began her career as a child actor, appearing in supporting roles in Little Shop of Horrors (1986) and How I Got into College (1989) before being cast as Pamela \"Pam\" James on the FOX sitcom Martin, which she played from 1992 until the show ended in 1997.\n\nArnold also played the family matriarch Rochelle on the UPN/CW sitcom Everybody Hates Chris from 2005 to 2009, and portrayed Judi Mann in the TV Land original sitcom Happily Divorced from 2011 to 2013. From 2014 to 2017, she played the lead role of Cassie Calloway on Survivor's Remorse. As of 2018, Arnold plays Tina Butler in the CBS sitcom series The Neighborhood. From 2018 to 2019, she played the role of Paulette in the South African series Lockdown.",
        "birthday": "1971-06-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 83600,
        "imdb_id": "nm0036651",
        "known_for_department": "Acting",
        "name": "Tichina Arnold",
        "place_of_birth": "Queens, New York City, New York, USA",
        "popularity": 0.6114,
        "profile_path": "/5Z9UnP5MZswrpHGWMtCm5axQ4RQ.jpg"
    }
}