{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y4TbQOC9DCzZop9HwKuX73rKbYO.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 9631,
                "original_language": "en",
                "original_title": "The Negotiator",
                "overview": "The police try to arrest expert hostage negotiator Danny Roman, who insists he's being framed for his partner's murder in what he believes is an elaborate conspiracy. Thinking there's evidence in the Internal Affairs offices that might clear him, he takes everyone in the office hostage and demands that another well-known negotiator be brought in to handle the situation and secretly investigate the conspiracy.",
                "popularity": 6.7528,
                "poster_path": "/dUMHEymATOGbs2K3E4dmNSVBgFQ.jpg",
                "release_date": "1998-07-29",
                "title": "The Negotiator",
                "video": false,
                "vote_average": 7.104,
                "vote_count": 2222,
                "character": "FBI Agent Moran",
                "credit_id": "56df114b9251412ee7000643",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/kJQS6jxxtNTaWI8jw7ynck97rgl.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1637,
                "original_language": "en",
                "original_title": "Speed",
                "overview": "Jack Traven, an LAPD cop on SWAT detail, and veteran SWAT officer Harry Temple thwart an extortionist-bomber's scheme for a $3 million ransom. As they corner the bomber, he flees and detonates a bomb vest, seemingly killing himself. Weeks later, Jack witnesses a mass transit city bus explode and nearby a pay phone rings. On the phone is that same bomber looking for vengeance and the money he's owed. He gives a personal challenge to Jack: a bomb is rigged on another city bus - if it slows down below 50 mph, it will explode - bad enough any day, but a nightmare in LA traffic. And that's just the beginning...",
                "popularity": 7.9456,
                "poster_path": "/o1Zs7VaS9y2GYH9CLeWxaVLWd3x.jpg",
                "release_date": "1994-06-09",
                "title": "Speed",
                "video": false,
                "vote_average": 7.144,
                "vote_count": 6489,
                "character": "Reporter #1",
                "credit_id": "599899f0925141415900ba41",
                "order": 34
            },
            {
                "adult": false,
                "backdrop_path": "/AfGp6Ev3BVdEd7L99kGQzOzsqRb.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 568,
                "original_language": "en",
                "original_title": "Apollo 13",
                "overview": "The true story of technical troubles that scuttle the Apollo 13 lunar mission in 1970, risking the lives of astronaut Jim Lovell and his crew, with the failed journey turning into a thrilling saga of heroism. Drifting more than 200,000 miles from Earth, the astronauts work furiously with the ground crew to avert tragedy.",
                "popularity": 8.8273,
                "poster_path": "/tVeKscCm2fY1xDXZk8PgnZ87h9S.jpg",
                "release_date": "1995-06-30",
                "title": "Apollo 13",
                "video": false,
                "vote_average": 7.452,
                "vote_count": 5608,
                "character": "Anchor",
                "credit_id": "5bc378f4c3a3682d59046714",
                "order": 70
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bruce Wright is an American actor known for his supporting roles in films such as \"Fire in the Sky\" (1993), \"Speed\" (1994), and \"Twister\" (1996). He has appeared in numerous television series including \"The Unit,\" \"JAG,\" \"The X-Files,\" \"ER,\" and \"The West Wing.\" Wright portrayed various characters in the original \"Battlestar Galactica\" series and its spin-offs, often playing bit parts such as security officers and other personnel. In addition to acting, he is noted as an effects animator at Walt Disney Animation Studios, contributing to major animated films including \"Tangled,\" \"Wreck-It Ralph,\" \"Big Hero 6,\" \"Zootopia,\" and \"Frozen 2.\" Wright also directed the experimental virtual reality short \"A Kite's Tale.\" His career spans both live-action and animation, showcasing diverse talents across entertainment mediums.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 83782,
        "imdb_id": "nm0942257",
        "known_for_department": "Acting",
        "name": "Bruce Wright",
        "place_of_birth": null,
        "popularity": 0.2983,
        "profile_path": "/wcYlWdvO9dLifDIBfTUTOSR6fgq.jpg"
    }
}