{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v46Uq29FXcl4huvu1Nh7tJ5qAjZ.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 10673,
                "original_language": "en",
                "original_title": "Wall Street",
                "overview": "A young and impatient stockbroker is willing to do anything to get to the top, including trading on illegal inside information taken through a ruthless and greedy corporate raider, whom takes the youth under his wing.",
                "popularity": 5.3071,
                "poster_path": "/2tQYq9ntzn2dEwDIGLBSipYPenv.jpg",
                "release_date": "1987-12-10",
                "title": "Wall Street",
                "video": false,
                "vote_average": 7.163,
                "vote_count": 2147,
                "character": "Woman at 'Le Cirque'",
                "credit_id": "584c37789251411e3b0004b7",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Liliane Montevecchi (October 13, 1932 – June 29, 2018) was a French-Italian actress, dancer, and singer.\n\nMontevecchi took her first dance classes at 8 with Pierre Duprez, primo ballerino of the Opera in Paris, France. She entered the Conservatoire and completed her training of two years, with Jeanne Schwarz and Mathilde Kschessinska, on the stage of the Opéra Comique. She appeared for the first time on a stage at the Champs Elysées theater in a ballet by David Lichine. She then worked with Léonide Massine and danced in Monte Carlo for the coronation of Rainier III, Prince of Monaco in 1949. She also danced her first steps at the Casino de Paris with Jean Guélis.\n\nMontevecchi began her international career as a prima ballerina in Roland Petit's dance company. She appeared in The Glass Slipper with Michael Wilding and Daddy Long Legs (with Fred Astaire), in both of which she was acting with leading lady Leslie Caron. In the mid-1950s, she was signed to a contract by MGM, which cast her in various roles in such films as Moonfleet with Stewart Granger and Meet Me in Las Vegas with Cyd Charisse and John Brascia. She then played in the Jerry Lewis vehicle The Sad Sack, King Creole with Elvis Presley, and The Young Lions with Montgomery Clift, Dean Martin and Marlon Brando. She knew Gene Kelly, Elizabeth Taylor and Clark Gable, and she took classes at the Actors Studio in New York.\n\nMontevecchi replaced Colette Brosset in the 1958 Broadway revue La Plume de Ma Tante. After some television work in series such as Playhouse 90 and Adventures in Paradise at the end of the decade, Montevecchi opted to leave Hollywood for a star spot in the Folies Bergère in Las Vegas, toured with the company for nine years before appearing at the Folies Bergère in Paris from 1972 to 1978. In 1982, she drew the attention of critics and audiences for her performance in Nine, with Raúl Juliá, for which she won both the Tony and Drama Desk Award for Best Featured Actress in a Musical. Seven years later, she starred in Grand Hotel, earning a Tony nomination for Best Actress in a Musical.\n\nOn TV, she guest–starred in more than 20 shows. Montevecchi also appeared in the films Wall Street and How to Lose a Guy in 10 Days with Matthew McConaughey. She appeared in concert at Carnegie Hall and Lincoln Center and toured internationally with her semi-autobiographical shows On the Boulevard and Back on the Boulevard. Her solo album On the Boulevard is available from Jay Records. She is featured in the recording of the 1985 concert version of Follies staged at Avery Fisher Hall, and she has starred in musicals such as Irma La Douce, Gigi and Hello Dolly!.\n\nIn 1998, she replaced Eartha Kitt as The Wicked Witch of the West in Radio City Entertainment's touring production of The Wizard of Oz, co-starring Mickey Rooney as The Wizard and Jessica Grové as Dorothy. She continued with the show until the spring of 1999 and was succeeded by Jo Anne Worley.\n\nIn 2001, Montevecchi appeared as Mistinguett at the Théâtre National de l’Opéra Comique in Paris. ...\n\nSource: Article \"Liliane Montevecchi\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1932-10-13",
        "deathday": "2018-06-29",
        "gender": 1,
        "homepage": null,
        "id": 83809,
        "imdb_id": "nm0599656",
        "known_for_department": "Acting",
        "name": "Liliane Montevecchi",
        "place_of_birth": "Paris, France",
        "popularity": 0.1235,
        "profile_path": "/sOj0jIVpH84Z8gfk0EKsXVxugTb.jpg"
    }
}