{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ruF3Lmd4A8MHbnEBE6lxPMbsHGL.jpg",
                "genre_ids": [
                    9648,
                    18
                ],
                "id": 15,
                "original_language": "en",
                "original_title": "Citizen Kane",
                "overview": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
                "popularity": 6.1449,
                "poster_path": "/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg",
                "release_date": "1941-04-17",
                "title": "Citizen Kane",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 5751,
                "character": "Newspaperman at Trenton Town Hall (uncredited)",
                "credit_id": "586be7b39251415d2d007bd9",
                "order": 82
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Roland Winternitz"
        ],
        "biography": "Roland Winters (born Roland Winternitz) was an American actor who played many character parts in films and television but today is best remembered for portraying Charlie Chan in six films in the late 1940s.\n\nMonogram Pictures eventually selected Winters to replace Sidney Toler in the Charlie Chan film series. Winters was 44 when he made the first of his six Chan films, The Chinese Ring in 1947 and ending with Charlie Chan and the Sky Dragon (also known as Sky Dragon) in 1949. His other Chan films were \"Docks of New Orleans\", \"Shanghai Chest\", \"The Golden Eye\" and \"The Feathered Serpent\". He also had character roles in three other feature films while he worked on the Chan series.\n\nYunte Huang, in Charlie Chan: The Untold Story of the Honorable Detective and His Rendezvous with American History, noted differences in the actors' appearances, especially that Winters' \"tall nose simply could not be made to look Chinese.\" Huang also cited the actor's age, writing, \"at the age of forty-four, he also looked too young to resemble a seasoned Chinese sage.\"\n\nIn contrast to Huang, Ken Hanke wrote in his book, Charlie Chan at the Movies: History, Filmography, and Criticism, \"Roland Winters has never received his due ... Winters brought with him a badly needed breath of fresh air to the series.\" He cited \"the richness of the approach and the verve with which the series was being tackled\" during the Winters era.\" Similarly, Howard M. Berlin, in his book, Charlie Chan's Words of Wisdom, commented that \"Winters brought a much needed breath of fresh air to the flagging film series with his self-mocking, semi-satirical interpretation of Charlie, which is very close to the Charlie Chan in Biggers' novels.\"\n\nAfter the series finished, Winters continued to work in film and television until 1982. He was in the movies So Big and Abbott and Costello Meet the Killer, Boris Karloff, played Elvis' father in Blue Hawaii and a judge in the Elvis film Follow That Dream. He made appearances as the boss on the early TV series Meet Millie as the boss and the courtroom drama Perry Mason. In one episode of the Bewitched TV series, he played the normally unseen McMann of McMann and Tate. He also portrayed Mr. Gimbel in Miracle on 34th Street in 1973.",
        "birthday": "1904-11-22",
        "deathday": "1989-10-22",
        "gender": 2,
        "homepage": null,
        "id": 83822,
        "imdb_id": "nm0935996",
        "known_for_department": "Acting",
        "name": "Roland Winters",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.1365,
        "profile_path": "/3dZQ2NzZwvgOVODs3WxmqrtfWU3.jpg"
    }
}