{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rl95VDEP3nsUQmGzE0S1S7y6T0N.jpg",
                "genre_ids": [
                    10752,
                    28
                ],
                "id": 190859,
                "original_language": "en",
                "original_title": "American Sniper",
                "overview": "U.S. Navy SEAL Chris Kyle takes his sole mission—protect his comrades—to heart and becomes one of the most lethal snipers in American history. His pinpoint accuracy not only saves countless lives but also makes him a prime target of insurgents. Despite grave danger and his struggle to be a good husband and father to his family back in the States, Kyle serves four tours of duty in Iraq. However, when he finally returns home, he finds that he cannot leave the war behind.",
                "popularity": 8.8358,
                "poster_path": "/i1U46OwMc6vlm7OoSUKfqUH615e.jpg",
                "release_date": "2014-12-25",
                "title": "American Sniper",
                "video": false,
                "vote_average": 7.418,
                "vote_count": 13266,
                "character": "Instructor Rolle",
                "credit_id": "547dc666c3a3685af9004eb1",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Leonard Roberts (born November 17, 1972) is an American actor. He is best known for his roles as Sean Taylor in Drumline and its' sequel Drumline: A New Beat, Forrest Gates on the fourth season of Buffy the Vampire Slayer, D. L. Hawkins on Heroes, and D'Andre Mackey in He Got Game.\n\nHe's also known for his roles as Ben Howard on the new 2023 Goosebumps series, Zeke Allen on The CW's All American: Homecoming, Alex on Peacock's The Girl in the Woods, Dennis Schatzman on FX's America Crime Story, Instructor Rolle in American Sniper, Hayes in Savages, Detective Monroe on The Client List, Tyrone in Hoodlum, and Eddie Coles in Love Jones.\n\nHe's had recurring roles as Ronnie Cooper on 9-1-1, King Idri of Loria on Syfy's The Magicians, Ray on CBS's Mom, and Jason Avery on ABC's Castle.",
        "birthday": "1972-11-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 83859,
        "imdb_id": "nm0731346",
        "known_for_department": "Acting",
        "name": "Leonard Roberts",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.358,
        "profile_path": "/z4hGl1GBHb40C5BrYBB8hxjNyT5.jpg"
    }
}