{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rLm66DbLwxHeRB34oJ1mhsu0urc.jpg",
                "genre_ids": [
                    27,
                    53,
                    18
                ],
                "id": 11167,
                "original_language": "en",
                "original_title": "Peeping Tom",
                "overview": "Loner Mark Lewis works at a film studio during the day and, at night, takes racy photographs of women. Also he's making a documentary on fear, which involves recording the reactions of victims as he murders them. He befriends Helen, the daughter of the family living in the apartment below his, and he tells her vaguely about the movie he is making.",
                "popularity": 2.1133,
                "poster_path": "/kM4AfLIlbcuRZ621vYjyeBFkuba.jpg",
                "release_date": "1960-05-16",
                "title": "Peeping Tom",
                "video": false,
                "vote_average": 7.447,
                "vote_count": 847,
                "character": "Pauline Shields",
                "credit_id": "59620c8cc3a36825e80c5666",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Shirley Ann Field"
        ],
        "biography": "Shirley Anne Field (born Shirley Broomfield; June 27, 1938 - December 10, 2023) was an English actress who performed on stage, film and television since 1955, prominent during the British New Wave.\n\nAfter a course at the Lucie Clayton School and Model Agency, she became a photographic model for pin-up magazines like Reveille and Titbits. She was subsequently spotted by Bill Watts, who ran a theatrical agency and obtained for her roles in late 1950s British films, usually uncredited. Her first appearance in a film was as an extra in Simon and Laura (1955). She had small parts in All for Mary (1955), Lost (1956), Yield to the Night (1956) (directed by J. Lee Thompson), It's Never Too Late (1956), It's a Wonderful World (1956), The Weapon (1956), Loser Takes All (1956), The Silken Affair (1956), Dry Rot (1956), The Good Companions (1957) (again for Thompson), Seven Thunders (1957), and The Flesh Is Weak (1957). She was in episodes of The New Adventures of Martin Kane (1957) and International Detective. Field's first sizeable film role was in Horrors of the Black Museum (1959). She had minor parts in Once More, with Feeling! (1960) and And the Same to You (1960). Field had a larger role in the controversial Peeping Tom (1960). She appeared on stage in The Lily White Boys with Albert Finney.\n\nIn 1960, Field's breakthrough came when she was chosen by Tony Richardson to play the role of model Tina Lapford in The Entertainer (1960), starring Laurence Olivier, distributed by Bryanston Films. Field had a supporting role in Beat Girl (1960), then appeared in probably her best known role as Doreen, the would-be girlfriend of rebellious Arthur Seaton (played by Albert Finney), in the New Wave film Saturday Night and Sunday Morning (1960).\n\nField starred alongside Kenneth More in Man in the Moon (1960). With those three big film starring roles in 1960, she became one of the very few actors ever to have their name above the titles in all the major cinemas around Leicester Square simultaneously.\n\nAlthough offered a role in A Kind of Loving (1962), Field turned it down to play the female lead in a Hollywood financed film, The War Lover (1962), with Steve McQueen. In the UK, she had the lead in Lunch Hour (1962), which was one of her favorite films. For Hammer films, Field starred in The Damned (1963), directed by Joseph Losey. She went to Hollywood to play the female lead in an epic directed by J. Lee Thompson, Kings of the Sun (1963). Thompson had her under personal contract at this stage.\n\nField went to Italy to appear in The Wedding March (1966), then back in England made Doctor in Clover (1966) and Alfie (1966). She had a supporting role in Hell Is Empty (1967) and later starred in With Love in Mind (1970) and A Touch of the Other (1970), then made House of the Living Dead (1974).\n\nBy the late 1970s Field was more commonly seen on TV, in shows such as Centre Play, Shoestring, Buccaneer, Never the Twain and a long run on Santa Barbara as well as TV movies like Two by Forsyth. She had roles in films like My Beautiful Laundrette (1985), Shag (1989), Getting It Right (1989), The Rachel Papers (1989), Hear My Song (1991), UFO (1993), Taking Liberty (1993), Loving Deadly (1994), and At Risk (1994).\n\nDescription above from the Wikipedia article Shirley Anne Field, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1938-06-27",
        "deathday": "2023-12-10",
        "gender": 1,
        "homepage": null,
        "id": 83909,
        "imdb_id": "nm0276043",
        "known_for_department": "Acting",
        "name": "Shirley Anne Field",
        "place_of_birth": "Forest Gate, Essex, England, UK",
        "popularity": 0.19,
        "profile_path": "/gZx5RtYwyEPwmgIpl1BnjviMka6.jpg"
    }
}