{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rcEDPOOOUTLFxLLQJggfLffbofe.jpg",
                "genre_ids": [
                    16,
                    28,
                    14
                ],
                "id": 810693,
                "original_language": "ja",
                "original_title": "劇場版 呪術廻戦 0",
                "overview": "Yuta Okkotsu is a nervous high school student who is suffering from a serious problem—his childhood friend Rika has turned into a curse and won't leave him alone. Since Rika is no ordinary curse, his plight is noticed by Satoru Gojo, a teacher at Jujutsu High, a school where fledgling exorcists learn how to combat curses. Gojo convinces Yuta to enroll, but can he learn enough in time to confront the curse that haunts him?",
                "popularity": 9.5946,
                "poster_path": "/23oJaeBh0FDk2mQ2P240PU9Xxfh.jpg",
                "release_date": "2021-12-24",
                "title": "Jujutsu Kaisen 0",
                "video": false,
                "vote_average": 8.121,
                "vote_count": 1549,
                "character": "Momo Nishimiya (voice)",
                "credit_id": "61c507a79c24fc004247adea",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kugimiya Rie",
            "釘宮 理恵 ",
            "ريي كوغيميا"
        ],
        "biography": "Rie Kugimiya is a Japanese singer and voice actress affiliated with I'm Enterprise.  Some of Kugimiya's most prominent roles include Alphonse Elric in the Fullmetal Alchemist series, Kagura in Gin Tama, and Happy in Fairy Tail. Because of her voicing of lead characters such as Shana in Shakugan no Shana, Louise in The Familiar of Zero, Nagi Sanzenin in Hayate the Combat Butler, Taiga Aisaka in Toradora!, and Aria Holmes Kanzaki in Aria the Scarlet Ammo, some of her fans have nicknamed her the \"Queen of Tsundere.\"\n\nWithin the Tamagotchi fandom she is known for her role in the Tamagotchi movies and anime as Mametchi. She has also contributed her voice to various merchandise such as Mugen Puchipuchi Moe, a virtual keychain bubble-wrap popping game.\n\nShe was nominated for Best Actress in Leading Role in the first Seiyu Awards for the role of Louise in The Familiar of Zero and for Best Actress in Supporting Role for the role of Kagura in Gintama, and jointly won Best Actress in a Supporting Role with Mitsuki Saiga at the second Seiyu Awards. Kugimiya won Best Actress in the third Seiyu Awards for the roles as Taiga Aisaka in Toradora! and her work in Nabari no Ou",
        "birthday": "1979-05-30",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.imenterprise.jp/profile.php?id=52",
        "id": 83928,
        "imdb_id": "nm1069584",
        "known_for_department": "Acting",
        "name": "Rie Kugimiya",
        "place_of_birth": "Kumamoto, Japan",
        "popularity": 1.3701,
        "profile_path": "/xHonhNFpTpz9zCVXLAF7D4OuHLv.jpg"
    }
}