{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x1eYwWTT8KbT8MvZBioxJ4ctZ35.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1000492,
                "original_language": "fr",
                "original_title": "Je verrai toujours vos visages",
                "overview": "Since 2014, France's restorative justice programmes have offered a safe space for supervised dialogue between offenders and victims. Grégoire, Nawelle, and Sabine, victims of heists and violent robberies, agree to join one of these discussion groups alongside offenders Nassim, Issa, and Thomas, all convicted of violent robberies. Meanwhile Chloé, a victim of childhood sexual abuse, prepares for dialogue with her own agressor after learning he has moved back into town.",
                "popularity": 1.8139,
                "poster_path": "/zIgyDGsmIyMAf0ppg7QKTuIM1He.jpg",
                "release_date": "2023-03-29",
                "title": "All Your Faces",
                "video": false,
                "vote_average": 7.965,
                "vote_count": 636,
                "character": "Thomas",
                "credit_id": "6374b800e6d3cc007707723c",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Frédéric Testot"
        ],
        "biography": "Born in Boulogne-Billancourt, Île-de-France, and raised in Porto Vecchio, Corsica, Frédéric Testot began on Fun Radio, with Éric Judor and Ramzy Bedia (Éric et Ramzy), before appearing on Radio Nova in Jamel Debbouze's program where he met Omar Sy for the first time, in 1997.\n\nTogether, they began their television career on Canal+ on Debbouze's program, Le Cinéma de Jamel. They created Le Visiophon, d'Omar et Fred, Les sketches d'Omar et Fred and Les coming-nexts.\n\nAfter a two-year hiatus, the duo returned in 2005 with a show called Service après-vente des émissions (English: \"After-sales service of TV shows\"). From 2006 to 2012, it became a famous daily column of Le Grand Journal, hosted by Michel Denisot.\n\nTestot then played in several comedy movies, including Sur la piste du Marsupilami (2012), The Big Bad Wolf (2013) and Arrête ton cinéma (2016), and starred in the Netflix Original Series La Mante in 2017.",
        "birthday": "1977-02-20",
        "deathday": null,
        "gender": 2,
        "homepage": "http://fredtestot.net",
        "id": 84100,
        "imdb_id": "nm0856493",
        "known_for_department": "Acting",
        "name": "Fred Testot",
        "place_of_birth": "Porto-Vecchio, Corse-du-Sud, France,",
        "popularity": 0.4022,
        "profile_path": "/yN14Ju54laFPhacdeXW9Y81arm4.jpg"
    }
}