{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4G7SzRAaXYZ5hYfS05wbTzjv2Tn.jpg",
                "genre_ids": [
                    12,
                    18,
                    10751,
                    16
                ],
                "id": 420818,
                "original_language": "en",
                "original_title": "The Lion King",
                "overview": "Simba idolizes his father, King Mufasa, and takes to heart his own royal destiny. But not everyone in the kingdom celebrates the new cub's arrival. Scar, Mufasa's brother—and former heir to the throne—has plans of his own. The battle for Pride Rock is ravaged with betrayal, tragedy and drama, ultimately resulting in Simba's exile. With help from a curious pair of newfound friends, Simba will have to figure out how to grow up and take back what is rightfully his.",
                "popularity": 9.2609,
                "poster_path": "/dzBtMocZuJbjLOXvrl4zGYigDzh.jpg",
                "release_date": "2019-07-12",
                "title": "The Lion King",
                "video": false,
                "vote_average": 7.105,
                "vote_count": 10491,
                "character": "Zazu (voice)",
                "credit_id": "59640ace9251410bfa103ac8",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​John Oliver (born 23 April 1977) is a British-born stand-up comedian, actor and writer. He is best known for his work on The Daily Show with Jon Stewart, for which he won an Emmy in 2009, as well as for playing recurring character Professor Ian Duncan on the show Community. He has worked extensively with Andy Zaltzman. In addition to several collaborative stand-up acts, their body of work together includes hundreds of hours worth of satirical podcasts and radio broadcasts, including series such as Political Animal, The Department and The Bugle. He is a permanent resident of the United States and lives in New York City.",
        "birthday": "1977-04-23",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.iamjohnoliver.com",
        "id": 84292,
        "imdb_id": "nm1056659",
        "known_for_department": "Acting",
        "name": "John Oliver",
        "place_of_birth": "Erdington, Birmingham, England, UK",
        "popularity": 0.7377,
        "profile_path": "/wI7LRInWUT3RgCByYx69wRMqgsy.jpg"
    }
}