{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cLZxnkj75cGBK1tLTMyIudOZYZk.jpg",
                "genre_ids": [
                    99
                ],
                "id": 1777,
                "original_language": "en",
                "original_title": "Fahrenheit 9/11",
                "overview": "Michael Moore's view on how the Bush administration allegedly used the tragic events on 9/11 to push forward its agenda for unjust wars in Afghanistan and Iraq.",
                "popularity": 3.7204,
                "poster_path": "/1WQgOCJj22zF7Bsr0pIBgGBr71q.jpg",
                "release_date": "2004-06-25",
                "title": "Fahrenheit 9/11",
                "video": false,
                "vote_average": 7.084,
                "vote_count": 1460,
                "character": "Self (archive footage)",
                "credit_id": "52fe4314c3a36847f8038b49",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Osama bin Mohammed bin Awad bin Laden",
            "أسامة بن محمد بن عوض بن لادن‎",
            "Usāmah bin Muḥammad bin ʿAwaḍ bin Lādin",
            "Usama bin Laden",
            "Ussamah bin Ladin",
            "Abū 'Abdāllāh",
            "al-Amīr",
            "aš-Šaykh",
            "الأمير",
            "الشيخ",
            "Šaykh al-Mujāhid",
            "شيخ المجاهد"
        ],
        "biography": "Osama bin Mohammed bin Awad bin Laden was the founder of al-Qaeda, the terrorist organization responsible for the September 11 attacks on the United States and numerous other mass-casualty attacks against civilian and military targets. He was a member of the wealthy Saudi bin Laden family, and an ethnic Yemeni Kindite. Bin Laden was on the American Federal Bureau of Investigation's (FBI) lists of Ten Most Wanted Fugitives and Most Wanted Terrorists for his involvement in the 1998 U.S. embassy bombings. From 2001 to 2011, bin Laden was a major target of the War on Terror, with a US$25 million bounty by the Federal Bureau of Investigation. After being placed on the FBI's Most Wanted list, bin Laden remained in hiding during three U.S. presidential administrations. On May 2, 2011, bin Laden was shot and killed inside a private residential compound in Abbottabad, Pakistan, by U.S. Navy SEALs and CIA operatives in a covert operation ordered by U.S. President Barack Obama. Shortly after his death, bin Laden's body was buried at sea. Al-Qaeda acknowledged his death on May 6, 2011, vowing to retaliate.",
        "birthday": "1957-03-10",
        "deathday": "2011-05-02",
        "gender": 2,
        "homepage": null,
        "id": 84384,
        "imdb_id": "nm1136915",
        "known_for_department": "Acting",
        "name": "Osama bin Laden",
        "place_of_birth": "Riyadh, Saudi Arabia",
        "popularity": 0.3069,
        "profile_path": "/snT1limeC6W2Gfnf9Kd4dBwkKxK.jpg"
    }
}