{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3oHFSEr4TRnsyTxWGrmY8Xi2FrR.jpg",
                "genre_ids": [
                    18
                ],
                "id": 590,
                "original_language": "en",
                "original_title": "The Hours",
                "overview": "The story of three women searching for more potent, meaningful lives. Each is alive at a different time and place, all are linked by their yearnings and their fears. Their stories intertwine, and finally come together in a surprising, transcendent moment of shared recognition.",
                "popularity": 3.3356,
                "poster_path": "/4myDtowDJQPQnkEDB1IWGtJR1Fo.jpg",
                "release_date": "2002-12-27",
                "title": "The Hours",
                "video": false,
                "vote_average": 7.271,
                "vote_count": 1801,
                "character": "Nelly Boxall",
                "credit_id": "52fe4258c3a36847f80172c5",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/waMGsUEoHfYj3A1uRMUUgpBa71d.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 8055,
                "original_language": "en",
                "original_title": "The Reader",
                "overview": "The story of Michael Berg, a German lawyer who, as a teenager in the late 1950s, had an affair with an older woman, Hanna, who then disappeared only to resurface years later as one of the defendants in a war crimes trial stemming from her actions as a concentration camp guard late in the war. He alone realizes that Hanna is illiterate and may be concealing that fact at the expense of her freedom.",
                "popularity": 5.4852,
                "poster_path": "/r0WURbmnhgKeBpHcpDULBgRedQM.jpg",
                "release_date": "2008-12-10",
                "title": "The Reader",
                "video": false,
                "vote_average": 7.475,
                "vote_count": 3246,
                "character": "Ms. Brenner",
                "credit_id": "5a26051a92514103260ec6e3",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "لیندا باست"
        ],
        "biography": "Linda Bassett was born in the Kentish village of Pluckley - location for the television series The Darling Buds of May (1991). She was brought up in Pimlico, South London, by her typist mother and police officer father. She became interested in acting as a child when she was frequently taken to see plays in London, most notably at the Old Vic, the famous classical theater. On leaving school, Linda went to work at the Old Vic as an usherette and catering manager, before going to read English at Leeds University. However, she dropped out after a year and became involved in a local drama group which put on plays in community-based locations, such as schools. She regards this as her theatrical schooling, having had no formal training. She made her London stage debut at the age of 32 in 1982 and, in 1991, joined the Royal Shakespeare Company. Although she was a well-regarded stage performer, it was the 1999 film version of the play East Is East (1999) (in which she had been an original stage cast member) which brought her to a larger audience and, throughout the 2000s, she has been a familiar face in a variety of films and television series. In the late 1980s, she returned to live in Pluckley.",
        "birthday": "1950-02-04",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 8443,
        "imdb_id": "nm0060221",
        "known_for_department": "Acting",
        "name": "Linda Bassett",
        "place_of_birth": "Pluckley, Kent, England, UK",
        "popularity": 0.5657,
        "profile_path": "/pE6Zoig9kbEn1te1MRtfjchDMeC.jpg"
    }
}