{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cHc7wnX6AIo71gUhwTo6IsAFirO.jpg",
                "genre_ids": [
                    16,
                    14,
                    28,
                    12
                ],
                "id": 176983,
                "original_language": "ja",
                "original_title": "ワンピース フィルム ゼット",
                "overview": "Zephyr, now known as Z, rides the seas with only one goal: Destroy all pirates and their dreams at becoming King of Pirates. When Luffy and his crew encounter him at sea, not only are they utterly defeated by the man with an arm made of Seastone, Nami, Robin, and Chopper are turned 10 years younger due to Z's minion Ain. Luffy is so determined to win against him that he does not even notice Z's master plan that could sacrifice thousands of lives.",
                "popularity": 4.5452,
                "poster_path": "/dd0HwfxstffjRgbBcQvtw3uqS6O.jpg",
                "release_date": "2012-12-15",
                "title": "One Piece Film: Z",
                "video": false,
                "vote_average": 7.487,
                "vote_count": 535,
                "character": "Roronoa Zoro (voice)",
                "credit_id": "52fe4d7cc3a36847f82637d9",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/wghKvEjM7UzQzQcKnGbDjOyQO13.jpg",
                "genre_ids": [
                    16,
                    12,
                    28,
                    14,
                    10402
                ],
                "id": 900667,
                "original_language": "ja",
                "original_title": "ONE PIECE FILM RED",
                "overview": "Uta — the most beloved singer in the world. Her voice, which she sings with while concealing her true identity, has been described as “otherworldly.” She will appear in public for the first time at a live concert. As the venue fills with all kinds of Uta fans — excited pirates, the Navy watching closely, and the Straw Hats led by Luffy who simply came to enjoy her sonorous performance — the voice that the whole world has been waiting for is about to resound.",
                "popularity": 5.7185,
                "poster_path": "/m80kPdrmmtEh9wlLroCp0bwUGH0.jpg",
                "release_date": "2022-08-06",
                "title": "One Piece Film Red",
                "video": false,
                "vote_average": 7.195,
                "vote_count": 1080,
                "character": "Roronoa Zoro (voice)",
                "credit_id": "62f84ef46e938a0091e0da1d",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/wMzToVniA09xWS0DXSRQiufVvpZ.jpg",
                "genre_ids": [
                    28,
                    16,
                    12,
                    35
                ],
                "id": 374205,
                "original_language": "ja",
                "original_title": "ワンピース　フィルム GOLD",
                "overview": "The glittering Gran Tesoro, a city of entertainment beyond the laws of the government, is a sanctuary for the world’s most infamous pirates, Marines, and filthy rich millionaires. Drawn by dreams of hitting the jackpot, Captain Luffy and his crew sail straight for the gold. But behind the gilded curtains lies a powerful king whose deep pockets and deeper ambitions spell disaster for the Straw Hats and the New World alike.",
                "popularity": 2.8785,
                "poster_path": "/9PgiOFTLZXP7emlwcIt0yRasJ9h.jpg",
                "release_date": "2016-07-23",
                "title": "One Piece Film: GOLD",
                "video": false,
                "vote_average": 7.225,
                "vote_count": 507,
                "character": "Roronoa Zoro (voice)",
                "credit_id": "587fa895c3a36854f2001cba",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/g3pIN5kRvmtcdtzjsJomZ1sw2QO.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    878
                ],
                "id": 768744,
                "original_language": "ja",
                "original_title": "僕のヒーローアカデミア THE MOVIE ワールド ヒーローズ ミッション",
                "overview": "A mysterious group called Humarize strongly believes in the Quirk Singularity Doomsday theory which states that when quirks get mixed further in with future generations, that power will bring forth the end of humanity. In order to save everyone, the Pro-Heroes around the world ask UA Academy heroes-in-training to assist them and form a world-class selected hero team. It’s up to the heroes to save the world and the future of heroes in what is the most dangerous crisis to take place yet in My Hero Academia.",
                "popularity": 5.2765,
                "poster_path": "/AsTlA7dj2ySGY1pzGSD0MoHFhEF.jpg",
                "release_date": "2021-08-06",
                "title": "My Hero Academia: World Heroes' Mission",
                "video": false,
                "vote_average": 7.597,
                "vote_count": 590,
                "character": "Flect Turn (voice)",
                "credit_id": "60c88fe2c390c50079d9e363",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Накай Кадзуя",
            "中井 和哉"
        ],
        "biography": "Kazuya Nakai (中井 和哉, born November 25, 1967) is an award-winning Japanese voice actor and narrator who was born in Kobe, Japan. From a young age, he was interested in anime. Growing up he had interests like volleyball and archery. He was working as a civil servant in a technical field at 25 when he decided that's not how he wanted to live his life, so he enrolled into a voice acting school he attended on his days off and on weekends while still working. Despite starting his career as a narrator, he took off as a voice actor and became a big name when he got the role of Roronoa Zoro, a character he definitely wanted to voice.\n\nHe narrates programs including information and news programs and voices many iconic characters such as Roronoa Zoro from One Piece, Toshiro Hijikata from Gintama, Date Masamune from Sengoku Basara, Mugen from Samurai Champloo and Jin Sakai in the Japanese dub of the video game Ghost of Tsushima.  He loves driving, practicing archery and spending time with his dog and cat.",
        "birthday": "1967-11-25",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.aoni.co.jp/search/nakai-kazuya.html",
        "id": 84507,
        "imdb_id": "nm0620017",
        "known_for_department": "Acting",
        "name": "Kazuya Nakai",
        "place_of_birth": "Kobe, Hyogo, Japan",
        "popularity": 1.212,
        "profile_path": "/78PKViY7brjF3AJI8h3tXyUyYT7.jpg"
    }
}