{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/saa1scU6UIBJi9bMEvLNzXXKnDD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 294016,
                "original_language": "en",
                "original_title": "Trumbo",
                "overview": "The career of screenwriter Dalton Trumbo is halted by a witch hunt in the late 1940s when he defies the anti-communist HUAC committee and is blacklisted.",
                "popularity": 5.5782,
                "poster_path": "/2RERIRnZkROSeHZAIf8PSxhzOqs.jpg",
                "release_date": "2015-10-27",
                "title": "Trumbo",
                "video": false,
                "vote_average": 7.158,
                "vote_count": 1619,
                "character": "John Wayne",
                "credit_id": "541e58b1c3a36871320057a1",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/gPW90IPq6Go8hlT0n7Es3cFl7ly.jpg",
                "genre_ids": [
                    18,
                    10770,
                    80
                ],
                "id": 550776,
                "original_language": "en",
                "original_title": "Believe Me: The Abduction of Lisa McVey",
                "overview": "On the night she plans on taking her own life, 17-year-old 'Lisa McVey' is kidnapped and finds herself fighting to stay alive and manages to be a victim of rape. She manages to talk her attacker into releasing her, but when she returns home, no one believes her story except for one detective, who suspects she was abducted by a serial killer. Based on horrifying true events.",
                "popularity": 3.9513,
                "poster_path": "/qbJEzCzEKDHPZDiRvSSBiYEKaAH.jpg",
                "release_date": "2018-09-30",
                "title": "Believe Me: The Abduction of Lisa McVey",
                "video": false,
                "vote_average": 8.056,
                "vote_count": 654,
                "character": "Sgt. Larry Pinkerton",
                "credit_id": "5baf259e0e0a262388000938",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David James Elliot ",
            "David William Smith ",
            "David Elliott ",
            "David Elliot",
            " David Smith"
        ],
        "biography": "David James Elliott is a Canadian film and television actor, best known for playing lead character Harmon Rabb Jr. on the television series \"JAG\".\n\nSubsequently moving to Los Angeles, he took the stage name David James Elliott, having found an actor was already named David Smith. He appeared in the film Police Academy 3: Back in Training in 1986, and subsequently in the television series Street Legal, Knots Landing as Bill Nolan, and in 1993's The Untouchables as Agent Paul Robbins. The following year, Elliott landed a recurring role on the hit series Melrose Place, playing Terry Parsons, and a guest appearance in an episode of Seinfeld as \"Carl\" the antiabortion furniture mover.\n\nIn 1995, Elliott landed the role he would hold for 10 years, the role of naval aviator-turned JAG lawyer Harmon Rabb, Jr. in the NBC/CBS television drama JAG. His tenure on JAG ended in 2005 with the series finale.\n\nIn 1996, Elliott starred in the made-for-cable movie Holiday Affair with Cynthia Gibb. This is a remake of the 1949 classic Holiday Affair which starred Robert Mitchum and Janet Leigh. In 2005, Elliott starred in a Canadian television movie The Man Who Lost Himself, which was based on the true story of Terry Evanshen, a Canadian football player who was in a car accident and lost his memory due to severe head injuries. Nanci Chambers also appeared in this movie as a doctor. In October 2006, Elliott joined the cast of legal drama Close to Home (2005–2007) as Chief Deputy Prosecutor James Conlon. During 2008, he had a recurring role in the Canadian series The Guard. He starred in Sci Fi Channel's four-hour miniseries, Knights of Bloodsteel (2009). Elliott was cast as an Internet millionaire in Terror Trap, directed by Dan Garcia. Elliott also starred in Dad's Home (2010), a widowed advertising executive who loses his job and becomes a stay-at-home dad for his two children.\n\nOn March 19, 2010, Elliott replaced Neal McDonough as the male lead in the television series Scoundrels. In 2010, Elliott was cast as FBI Agent Russ Josephson on CSI: NY, a recurring role as Detective Jo Danville's (Sela Ward) ex-husband, a role which he first portrayed in January 2011.\n\nIn 2012, Elliott also co-starred as Ripp Cockburn, the husband of Kristin Chenoweth's character Carlene, on ABC's comedy-drama series GCB. In 2014, Elliott appeared in Mad Men (season 7) as Dave Wooster. In 2015, Elliott guest starred in the TV drama Scorpion.\n\nIn 2015, Elliott played actor John Wayne in the film Trumbo.\n\nOn March 29, 2019, CBS announced Elliott would be reprising his JAG role of Harmon Rabb, Jr. for a multi-episode arc in the tenth season of NCIS: Los Angeles.\n\nDescription above from the Wikipedia article David James Elliott, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1960-09-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 84522,
        "imdb_id": "nm0004895",
        "known_for_department": "Acting",
        "name": "David James Elliott",
        "place_of_birth": "Milton, Ontario, Canada",
        "popularity": 0.7694,
        "profile_path": "/u71mHttq4ShuhoR5zuIzKR2i3YU.jpg"
    }
}