{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/o8HOv12JGZ0YyetTbxkla0S1o6Q.jpg",
                "genre_ids": [
                    14,
                    9648,
                    53
                ],
                "id": 16007,
                "original_language": "ja",
                "original_title": "デスノート",
                "overview": "Light Yagami finds the \"Death Note,\" a notebook with the power to kill, and decides to create a Utopia by killing the world's criminals, and soon the world's greatest detective, \"L,\" is hired to find the mysterious murderer. An all out battle between the two greatest minds on earth begins and the winner will control the world.",
                "popularity": 4.873,
                "poster_path": "/xiJPZntaz1BMooXfiwi2iZAMbhY.jpg",
                "release_date": "2006-06-17",
                "title": "Death Note",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 735,
                "character": "Misa Amane",
                "credit_id": "52fe46949251416c7507cc87",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/8swHho6hoIlHERMrX2Z83OBQJCa.jpg",
                "genre_ids": [
                    14,
                    53,
                    9648
                ],
                "id": 16140,
                "original_language": "ja",
                "original_title": "デスノート the Last name",
                "overview": "In the second installment of the Death Note film franchise, Light Yagami meets a second Kira and faithful follower Misa Amane and her Shinigami named Rem. Light attempts to defeat L along with Teru Mikami (a Kira follower) and Kiyomi Takada (another Kira follower) but in the end will Light win? or will a Shinigami named Ryuk make all the difference in Light's victory or his ultimate death?",
                "popularity": 3.0008,
                "poster_path": "/zFwCNC5LfmPKBsqMuAhzcG5Jubm.jpg",
                "release_date": "2006-10-28",
                "title": "Death Note: The Last Name",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 513,
                "character": "Misa Amane",
                "credit_id": "52fe46aa9251416c7507f793",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "户田惠梨香",
            "토다 에리카",
            "戶田惠梨香",
            "اریکا تودا",
            "اِريكا تودا"
        ],
        "biography": "Erika Toda began her performing arts activities in the fifth grade of elementary school and debuted as a gravure model by the age of 13. She moved to Tokyo after graduating from junior high school and started acting career in earnest. Her film debut was in 2006 and attracted attention by playing the role of Amane Misa in the movie \"Death Note\" live action.\n\nAfter that, Toda appeared in the live-action adaptation of the manga series “LIAR GAME” as Kanzaki Nao and TBS drama \"Ryusei no Kizuna\" which granted her 3 awards for the Best Supporting Actress in 2nd Tokyo Drama Awards, 59th Television Drama Academy Awards, and 12th Nikkan Sports Drama Grand Prix. Toda is also known for her lead roles in the “Code Blue” series as Hiyama Mihoko, and as Touma Saya in “Keizoku 2: SPEC” series. Most recently, she played the role of heroine in 2019 NHK asadora \"Scarlet\".\n\nToda usually speaks with Kansai dialect, and is represented by the agency, FLaMme.\n\nOn December 10, 2020, Toda announced her marriage to fellow actor Tori Matsuzaka.",
        "birthday": "1988-08-17",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.flamme.co.jp/actress/profile.php?talentid=6",
        "id": 84620,
        "imdb_id": "nm2065859",
        "known_for_department": "Acting",
        "name": "Erika Toda",
        "place_of_birth": "Kobe, Hyogo, Japan",
        "popularity": 0.5815,
        "profile_path": "/iCqhPoR55jp25EUO0WcTGqVS6qW.jpg"
    }
}