{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mm3aNTjFvuo0jeitneRDc1ZUNjI.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 593,
                "original_language": "ru",
                "original_title": "Солярис",
                "overview": "A psychologist is sent to a space station orbiting a planet called Solaris to investigate the death of a doctor and the mental problems of cosmonauts on the station. He soon discovers that the water on the planet is a type of brain which brings out repressed memories and obsessions.",
                "popularity": 3.7342,
                "poster_path": "/pgqj7QoBPWFLLKtLEpPmFYFRMgB.jpg",
                "release_date": "1972-03-20",
                "title": "Solaris",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 1704,
                "character": "Henri Berton",
                "credit_id": "52fe4259c3a36847f80175ab",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Владислав Дворжецкий",
            "Vladislav Dvorzhetskiy"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nVladislav Dvorzhetsky (26 April 1939 – 28 May 1978) was a Soviet film actor. He appeared in eighteen films between 1970 and 1978\n\nDvorzhetsky was born in Omsk. In 1955 he entered the Omsk military medical school. In 1959 he started active service in the Soviet Army at Sakhalin Island as senior feldsher of the regiment. During this time he married the first time.\n\nIn 1964 he went back to Omsk and entered the actors' school of Omsk. After graduation in 1967, Vladislav was accepted in the company of the Omsk provincial dramatic theatre. Here he married for the second time. In 1968 the assistant director from film-studio Mosfilm visits Omsk and Dvorzhetsky got his first role in a film as General Khludow in The Flight (1970).\n\nIn his next film he was the test pilot Burton in the Solaris (1972). During the time in Moscow he divorced his second wife and he decided to live for his film-career. In spring 1972 he played the role of Alexander Ilyin in Sannikow-Land. In 1974 he played the communist Yaroslav in To the Last Minute and got the State prize of the Ukrainian SSR.\n\nIn 1975 he played the main role in the adventure film Kapitän Nemo based on the Jules Verne novel.\n\nThe high point of the attention Muscovites public was the representation of the holy Antonius received 1976. To 29. December 1976 it was in-supplied due to two within two weeks gone through cardiac infarcts acutely to the hospital, as consequence of its overloading and the rhythm, in which he lived and worked. Dvorzhetsky died in 1978 in Gomel, due to a acute heart failure.\n\nDescription above from the Wikipedia article Vladislav Dvorzhetsky, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1939-04-26",
        "deathday": "1978-05-28",
        "gender": 2,
        "homepage": null,
        "id": 8476,
        "imdb_id": "nm0245367",
        "known_for_department": "Acting",
        "name": "Vladislav Dvorzhetsky",
        "place_of_birth": "Omsk, RSFSR, USSR",
        "popularity": 0.3046,
        "profile_path": "/740a9El61imunBGNI5mg2gka8o4.jpg"
    }
}