{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zP6pqpSRRiOCjjC5oWKZKkHqoSB.jpg",
                "genre_ids": [
                    18
                ],
                "id": 595,
                "original_language": "en",
                "original_title": "To Kill a Mockingbird",
                "overview": "Scout Finch, 6, and her older brother Jem live in sleepy Maycomb, Alabama, spending much of their time with their friend Dill and spying on their reclusive and mysterious neighbor, Boo Radley. When Atticus, their widowed father and a respected lawyer, defends a black man named Tom Robinson against fabricated rape charges, the trial and tangent events expose the children to evils of racism and stereotyping.",
                "popularity": 4.5981,
                "poster_path": "/gZycFUMLx2110dzK3nBNai7gfpM.jpg",
                "release_date": "1962-12-20",
                "title": "To Kill a Mockingbird",
                "video": false,
                "vote_average": 7.991,
                "vote_count": 2724,
                "character": "Mr. Gilmer",
                "credit_id": "52fe4259c3a36847f801776d",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/k1YVyPL1ZvEXAOeBvNEuPweA3XY.jpg",
                "genre_ids": [
                    35
                ],
                "id": 2609,
                "original_language": "en",
                "original_title": "Planes, Trains and Automobiles",
                "overview": "An irritable marketing executive, Neal Page, is heading home to Chicago for Thanksgiving when a number of delays force him to travel with a well meaning but overbearing shower curtain ring salesman, Del Griffith.",
                "popularity": 2.6291,
                "poster_path": "/3RSucVsX96Ste8WDJfZP1hbNGqQ.jpg",
                "release_date": "1987-11-26",
                "title": "Planes, Trains and Automobiles",
                "video": false,
                "vote_average": 7.244,
                "vote_count": 2054,
                "character": "Mr. Bryant",
                "credit_id": "66e0cdb29ca66df582bb3d7c",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ویلیام ویندام"
        ],
        "biography": "William Windom was an American actor. He is perhaps best known for his work on television, including several episodes of The Twilight Zone; playing the character of Glen Morley, a congressman from Minnesota like his own great-grandfather and namesake in The Farmer's Daughter; the character of John Monroe on the sitcom My World and Welcome to It, for which he won an Emmy Award for Best Actor in a Comedy Series; as Commodore Matt Decker, commander of the doomed U.S.S. Constellation in the Star Trek episode \"The Doomsday Machine\"; the character Randy Lane in the Emmy-nominated Night Gallery episode \"They're Tearing Down Tim Riley's Bar\" and perhaps that of the most common recurring character on the Emmy-winning series Murder, She Wrote, Seth Hazlitt.\n\nDescription above from the Wikipedia article William Windom, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1923-09-28",
        "deathday": "2012-08-16",
        "gender": 2,
        "homepage": null,
        "id": 8499,
        "imdb_id": "nm0934750",
        "known_for_department": "Acting",
        "name": "William Windom",
        "place_of_birth": "New York City, New York, United States",
        "popularity": 1.5068,
        "profile_path": "/jLKGf2gQR4cBDnUWFOsXY2y5Pui.jpg"
    }
}