{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rjXK74vrvmFMN0vuFw3TViZ18Ha.jpg",
                "genre_ids": [
                    16,
                    10749,
                    12,
                    18,
                    14
                ],
                "id": 204436,
                "original_language": "fr",
                "original_title": "Jack et la mécanique du cœur",
                "overview": "In Scotland 1874, Jack is born on the coldest day ever. Because of the extreme cold, his heart stops beating. The responsible midwife in Edinburgh finds a way to save him by replacing his heart with a clock. So he lives and remains under the midwife's protective care. But he must not get angry or excited because that endangers his life by causing his clock to stop working. Worse than that, when he grows up, he has to face the fact he cannot fall in love because that too could stop his delicate heart.",
                "popularity": 2.3296,
                "poster_path": "/ZSrU2mvlzM5Jr30XtKCU1fziIj.jpg",
                "release_date": "2014-02-05",
                "title": "Jack and the Cuckoo-Clock Heart",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 738,
                "character": "The Crying Man / The Trumpet Man (voice)",
                "credit_id": "59f47ef8c3a3682017010ff1",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bruno Caliciuri"
        ],
        "biography": "Bruno Caliciuri (born 28 June 1968), better known as Cali, is a French singer-songwriter.\n\nCali was born 28 June 1968 in Perpignan to an Italian father and Catalan mother. He grew up in Vernet-les-Bains. A fan of English rock and French chanson during his youth, Cali was also a keen rugby player. He played for his region and Perpignan (USAP). Inspired by a U2 concert in 1984, Cali devoted himself more to music and less to rugby.\n\nAt the age of 17, Cali discovered punk music in Ireland. This was the style of his first group Pénétration anale. His second group was composed of friends from Vernet-les-Bains, and called Les Rebelles. From 25 to 28, Cali self-produced two albums with the band Indy, then was part of Tom Scarlett, where he worked with his past guitarist Hugo Baretge. At the end of 2001, Cali stopped work with Tom record company Labels, which signed him on. At the end of 2003, he released his first well-known solo album L'amour parfait. Regarded as a critical success, the album made him known amongst the premier French artists. Popular songs from the album include \"Elle m'a dit\", the single \"C'est quand le bonheur\" and \"Pensons à l'avenir\".\n\nIn October 2005, Cali released his second solo album Menteur. This album reinforced his position amongst France's most popular artists. Popular songs include \"Je ne vivrai pas sans toi\" and the single \"Je m'en vais (après Miossec)\".\n\nIn 2006, he published \"Le bordel magnifique\" which was recorded during his Menteur tour in Zénith de Lille. It witnesses the connection established between the singer and his audience through the concert.\n\nIn 2007, he did a Take-Away Show video session shot by Vincent Moon.\n\nIn 2007, he went on a support tour for all the producers of cheese pies hard hit by the crisis that raged that year in the cheese industry, thanks to which he was inducted Chevalier du Camembert Doré and Grand Maître de l'Emmental.\n\nIn 2008, he released his third solo album \"L'espoir\" which was recorded in the South of France with the help of [Mathias Malzieu] and [Scott Colburn]. He expressed his penchant for love stories, but also his political engagement in \"Résistance\" and the single \"1000 coeurs debout\"\n\nIn 2010 he got prankster Rémi Gaillard to make the clip for his song \"L'amour fou\".\n\nHe currently lives in Languedoc-Roussillon with his two children.\n\nCali's musical style is pop/rock. He is accompanied usually by a rock trio (guitar, drums, bass) but often also a violin, saxophone, trumpet and even trombone (for songs like \"Tes Yeux\"), giving his music a unique almost folk/jazz feel. Cali accompanies himself sometimes with acoustic guitar. On stage, he is known for injecting much passion and energy into his performances. He will often perform a stage dive towards the end of his set, which in at least four instances led to serious injuries.\n\nHe was nominated for the Breakthrough Artist of the Year award at the 2003 edition of the Victoires de la musique – France's version of the Grammys. In 2004 he was nominated for Male Artist/Group of the Year, Song of the Year for \"Pensons à l'avenir\" and Concert/Show of the Year for his concert at the Bataclan.\n\nSource: Article \"Cali (singer)\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1968-06-20",
        "deathday": null,
        "gender": 2,
        "homepage": "https://calimusic.fr/",
        "id": 85165,
        "imdb_id": "nm1734380",
        "known_for_department": "Acting",
        "name": "Cali",
        "place_of_birth": "Perpignan, Pyrénées-Orientales, France",
        "popularity": 0.1037,
        "profile_path": "/i0faRQNdQtCMhvzQSLu5xN3U3w0.jpg"
    }
}