{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eMgflonfRY89Zj4LZykJKPpG4wg.jpg",
                "genre_ids": [
                    18
                ],
                "id": 596,
                "original_language": "en",
                "original_title": "The Grapes of Wrath",
                "overview": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncle’s farm, and joins them the next day as they head for California and a new life... Hopefully.",
                "popularity": 5.0306,
                "poster_path": "/eUcxMVBIA0Jg8l1RGUqycrc3eIQ.jpg",
                "release_date": "1940-03-15",
                "title": "The Grapes of Wrath",
                "video": false,
                "vote_average": 7.815,
                "vote_count": 1043,
                "character": "Connie Rivers",
                "credit_id": "52fe425ac3a36847f801786b",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Edward Quillan"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nEdward \"Eddie\" Quillan (March 31, 1907 – July 19, 1990) was an American film actor whose career began as a child on the vaudeville stages and silent film and continued through the age of television in the 1980s.\n\nQuillan's very first film appearance was in the 1922 comedy short Up and at 'Em. His next performance was in the 1926 comedy short The Love Sundae opposite actress Alice Day.\n\nQuillan would remain a popular leading and secondary actor throughout the sound film era and would appear in such notable films as 1935's Mutiny on the Bounty with Clark Gable, Charles Laughton, and Franchot Tone, 1939's Young Mr. Lincoln opposite Henry Fonda and Alice Brady, as 'Connie Rivers' in John Ford's 1940 film adaptation of the John Steinbeck novel The Grapes of Wrath opposite Henry Fonda, in 1943's Alaska Highway and It Ain't Hay opposite the comedic duo Abbott and Costello.\n\nQuillan's breezy screen personality was seen in \"B\" musicals, comedies, and even serials during the 1940s. In 1948 Columbia Pictures producer Jules White teamed Quillan with veteran movie comic Wally Vernon for a series of comedy short subjects. White emphasized extreme physical comedy in these films, and Vernon and Quillan made a good team, enthusiastically engaging in pratfalling, kick-in-the-pants slapstick. The series ran through 1956.\n\nBeginning in the late 1950s, Quillan began to make the transition to the medium of television and by the 1960s could be seen frequently appearing as a guest actor in such series as The Andy Griffith Show, Petticoat Junction, Perry Mason, and approximately five appearances on the camp-horror comedy series The Addams Family. He was a regular on the Anthony Franciosa sitcom Valentine's Day from 1964 to 1965, and from 1968 through 1971 he appeared as \"Eddie Edson\" on the television drama Julia opposite actress Diahann Carroll.\n\nThrough the 1950s and 1960s, Quillan continued to appear in motion pictures, but in increasingly smaller roles and often in bit parts. One notable appearance of the era was his role of 'Sandy' in the 1954 Vincente Minnelli directed musical Brigadoon. Quillan also appeared in the uncredited role of 'Mr.Cassidy' in the 1969 Gene Kelly film adaptation of Hello, Dolly!.  Quillan appeared in My Three Sons as Mr Hewlett (1961) and also appeared on the western television adventure series The Rifleman as Angus Evans.\n\nIn the 1970s, Quillan made guest appearances on such varied television series as Mannix, Here's Lucy, Chico and the Man and Baretta. After meeting and befriending actor and director Michael Landon, he played numerous bit roles in the popular television series Little House on the Prairie. Quillan also performed in the Landon-directed series Highway to Heaven and Father Murphy during the 1980s. Quillan made his last television appearance in a 1987 episode of the television crime-mystery series Matlock.",
        "birthday": "1907-03-31",
        "deathday": "1990-07-19",
        "gender": 2,
        "homepage": null,
        "id": 8521,
        "imdb_id": "nm0703600",
        "known_for_department": "Acting",
        "name": "Eddie Quillan",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.3165,
        "profile_path": "/p49Q3UZigqHlmrQYWa2RTNh6CGv.jpg"
    }
}