{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eMgflonfRY89Zj4LZykJKPpG4wg.jpg",
                "genre_ids": [
                    18
                ],
                "id": 596,
                "original_language": "en",
                "original_title": "The Grapes of Wrath",
                "overview": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncle’s farm, and joins them the next day as they head for California and a new life... Hopefully.",
                "popularity": 5.0806,
                "poster_path": "/eUcxMVBIA0Jg8l1RGUqycrc3eIQ.jpg",
                "release_date": "1940-03-15",
                "title": "The Grapes of Wrath",
                "video": false,
                "vote_average": 7.815,
                "vote_count": 1043,
                "character": "Grandma Joad",
                "credit_id": "52fe425ac3a36847f801786f",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Zeffie Agnes Lydia Tilbury",
            "Zeffie Tilsbury"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nZeffie Agnes Lydia Tilbury (November 20, 1863 – July 24, 1950) was an English actress.\n\nTilbury was known first on the London stage and on Broadway in New York City. In 1881, she debuted on stage in Nine Points of the Law at the Theatre Royal, Brighton, England.\n\nShe is today best known for playing wise or evil older characters in films, such as the distinguished lady gambler at dinner with Garbo in The Single Standard, as the pitiful Grandma Joad in The Grapes of Wrath and Grandma Lester in Tobacco Road.\n\nShe appeared in over 70 films. Her earliest surviving silent film is the Valentino / Nazimova 1921 production of Camille. Tilbury is probably best remembered as the old lady who is befriended by Spanky and his friends on her birthday and, as a result, is transformed from a lonely, disagreeable recluse to a happy and loving carefree soul in the 1936 Hal Roach Our Gang comedy Second Childhood. In the same year she also portrayed the Gypsy Queen in the Laurel and Hardy film The Bohemian Girl.\n\nTilbury was married twice. First to Arthur Frederick Lewis in June, 1887, and later to L. E. Woodthorpe, who died on April 8, 1915. She died in Los Angeles, California in 1950 at the age of 86.",
        "birthday": "1863-11-18",
        "deathday": "1950-07-24",
        "gender": 1,
        "homepage": null,
        "id": 8522,
        "imdb_id": "nm0863193",
        "known_for_department": "Acting",
        "name": "Zeffie Tilbury",
        "place_of_birth": "Paddington, London, England, UK",
        "popularity": 0.2707,
        "profile_path": "/o1Na70AGYD8ivcc4icqT2kq0ZTG.jpg"
    }
}