{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/enNubozHn9pXi0ycTVYUWfpHZm.jpg",
                "genre_ids": [
                    18,
                    28,
                    80,
                    53
                ],
                "id": 155,
                "original_language": "en",
                "original_title": "The Dark Knight",
                "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
                "popularity": 45.0503,
                "poster_path": "/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
                "release_date": "2008-07-16",
                "title": "The Dark Knight",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 34382,
                "character": "Gentleman at Party",
                "credit_id": "560c2766c3a3686810006628",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 18.3339,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 23537,
                "character": "Board Member #2",
                "credit_id": "5623d5329251416b3000153a",
                "order": 98
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Patrick Joseph Leahy OBE (born March 31, 1940) is an American politician and attorney who represented Vermont in the United States Senate from 1975 to 2023. A member of the Democratic Party, he also was the president pro tempore of the United States Senate from 2012 to 2015 and from 2021 to 2023.\n\nLeahy was the third-longest-serving U.S. senator in history at 48 years, and was the longest-serving member of the United States Congress to serve solely as a senator. During his tenure he chaired the Senate Appropriations Committee, the Senate Judiciary Committee and the Senate Agriculture Committee. In March 2022, he became the most senior member of Congress. At the time of his retirement, Leahy was the dean of Vermont's congressional delegation, Vermont's longest-serving U.S. senator, and the first Democrat ever elected to the U.S. Senate from Vermont. Leahy was succeeded by Peter Welch, who became the second Democrat to represent Vermont in the Senate.\n\nLeahy's signature legislation is the Leahy Law forbidding the United States from funding foreign military units which violate human rights. Leahy was the presiding officer at Donald Trump's second impeachment trial, becoming the first senator to preside over a former president's impeachment trial. In 2023, Patrick Leahy Burlington International Airport was renamed after him.",
        "birthday": "1940-03-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 853194,
        "imdb_id": "nm0495004",
        "known_for_department": "Acting",
        "name": "Patrick Leahy",
        "place_of_birth": "Montpelier, Vermont, USA",
        "popularity": 0.1133,
        "profile_path": "/vj91AYjmPzhG0cmDNey46ahMWfw.jpg"
    }
}