{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5mQZqk2qSJCsYmvw1cQJLEcLNYM.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 64682,
                "original_language": "en",
                "original_title": "The Great Gatsby",
                "overview": "An adaptation of F. Scott Fitzgerald's Long Island-set novel, where Midwesterner Nick Carraway is lured into the lavish world of his neighbor, Jay Gatsby. Soon enough, however, Carraway will see through the cracks of Gatsby's nouveau riche existence, where obsession, madness, and tragedy await.",
                "popularity": 7.6988,
                "poster_path": "/nimh1rrDDLhgpG8XAYoUZXHYwb6.jpg",
                "release_date": "2013-05-09",
                "title": "The Great Gatsby",
                "video": false,
                "vote_average": 7.361,
                "vote_count": 12608,
                "character": "Taxi Driver",
                "credit_id": "5f3c71b5ad59b5003716ec69",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nicholas John Tate",
            "Nicholas Tate"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nNicholas John Tate (born June 18, 1942) is an Australian actor best known for his role as Eagle pilot Alan Carter in both seasons of the 1970s science fiction television series Space: 1999.\n\nHis parents were the actors John Tate and Neva Carr Glyn. His maternal grandparents were also actors, originally from Great Britain, who performed in Vaudeville. His father also had a connection to the works of Space:1999 creator Gerry Anderson, being a secondary voice actor in Thunderbirds.\n\nTate's big break came with the Australian television series My Brother Jack, followed later by a production of the musical The Canterbury Tales where he played \"Nicholas the Gallant\" for eighteen months on stage and on tour throughout the country. This was followed by the TV series Dynasty (not related to the later American series of the same name), where he joined his father John Tate for the first time on camera; the two playing father and son roles.\n\nFollowing his work in Space: 1999, he broke through in film with an award-winning role in the movie The Devil's Playground. He continued to work in film and has continued to have many supporting roles in a number of important theatrical films, including The Year My Voice Broke, Richard Attenborough's Cry Freedom, Return from the River Kwai, A Cry in the Dark, and Hook. Nick Tate has also made guest appearances on numerous hit TV series, such as The X-Files, Dr. Quinn, Medicine Woman, Star Trek: The Next Generation, Murder, She Wrote, Star Trek: Deep Space Nine (in the sixth season episode \"Honor Among Thieves\"), Farscape and in the Lost episode \"Tabula Rasa\".\n\nTate appeared in the TRIP (Tony Rudlin Ingrid Pitt Productions) production of Duty Free (Don't Bother To Dress), by Emmerdale writer, Neville Siggs, which ran in London's West End for 3 months after a successful National Tour.\n\nHe is also well known for his voiceover work in theatrical trailers for such films as Jurassic Park and Mission: Impossible, as well as work in commercials, including Guinness beer spots airing beginning in fall 2006. Tate and four other well known voice artists (Don LaFontaine, John Leader, Mark Elliot, and Al Chalk) parodied their unique voiceover styles en route to an awards show in a 1997 short film, 5 Men and a Limo.\n\nIn 2000, he provided the voice for the Australian tycoonist Ozzie Mandrill in the game Escape from Monkey Island.\n\nNick Tate returned to the musical stage, where he played the leading role of Captain E.J. Smith in the Australian premiere of the musical Titanic, which opened on October 25, 2006. A career interview with Tate was published in Talkin' Trek and Other Stories by Anthony Wynn. Nick Tate resides in both Australia and Los Angeles.\n\nDescription above from the Wikipedia article Nick Tate, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1942-06-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 85354,
        "imdb_id": "nm0851182",
        "known_for_department": "Acting",
        "name": "Nick Tate",
        "place_of_birth": "Sydney, Australia",
        "popularity": 0.295,
        "profile_path": "/N3wyGlm8JPSaiqdWyO78wAA8GJ.jpg"
    }
}