{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jniabJVBSW3EqLlyhjxWCZjVkiE.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 1895,
                "original_language": "en",
                "original_title": "Star Wars: Episode III - Revenge of the Sith",
                "overview": "The evil Darth Sidious enacts his final plan for unlimited power – and the heroic Jedi Anakin Skywalker must choose a side.",
                "popularity": 8.2385,
                "poster_path": "/xfSAoBEm9MNBjmlNcDYLvLSMlnq.jpg",
                "release_date": "2005-05-17",
                "title": "Star Wars: Episode III - Revenge of the Sith",
                "video": false,
                "vote_average": 7.452,
                "vote_count": 14350,
                "character": "Ruwee Naberrie",
                "credit_id": "54e35e849251411956009d3c",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nGraeme Blundell (born 1945) is an Australian actor, director, producer, writer and biographer. Blundell was born in Melbourne; he grew up in Clifton Hill, a suburb of Melbourne. He was educated at University High School and the University of Melbourne. In his early years, Blundell worked at La Mama Theatre, the Pram Factory, Hoopla, the Playbox Theatre Company, and the Melbourne Theatre Company. He directed and acted in the premiere performance of Jack Hibberd's play Dimboola at La Mama. His first television appearance was as an uncredited extra in the debut episode of Homicide (1964). He is best known as playing the title character in the 70's sex-comedy film Alvin Purple. He has written extensively in The Australian newspaper as well as writing biographies of Brett Whiteley (Brett Whiteley: An Unauthorised Life, 1996, with his then wife Margot Hilton), and Graham Kennedy (King, 2003).\n\nDescription above from the Wikipedia article Graeme Blundell, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1945-07-08",
        "deathday": null,
        "gender": 2,
        "homepage": "https://shanahan.com.au/client/graeme-blundell/",
        "id": 85351,
        "imdb_id": "nm0089882",
        "known_for_department": "Acting",
        "name": "Graeme Blundell",
        "place_of_birth": "Melbourne, Victoria, Australia",
        "popularity": 1.3704,
        "profile_path": "/gvJBWfxW9VJmi17ts7NEjsghKVZ.jpg"
    }
}