{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/n3QtJ6tqE0fnf4Qaxb0iujBk0lH.jpg",
                "genre_ids": [
                    53,
                    27
                ],
                "id": 9540,
                "original_language": "en",
                "original_title": "Dead Ringers",
                "overview": "Elliot, a successful gynecologist, works at the same practice as his identical twin, Beverly. Elliot is attracted to many of his patients and has affairs with them. When he inevitably loses interest, he will give the woman over to Beverly, the meeker of the two, without the woman knowing the difference. Beverly falls hard for one of the patients, Claire, but when she inadvertently deceives him, he slips into a state of madness.",
                "popularity": 2.3745,
                "poster_path": "/ofXwDfM8uYAaftD7cBPcIWdCpMn.jpg",
                "release_date": "1988-09-23",
                "title": "Dead Ringers",
                "video": false,
                "vote_average": 7.128,
                "vote_count": 939,
                "character": "Delivery Boy",
                "credit_id": "664ac9a8ef9041d648e78eb5",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hadley Kaye"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nHadley Kay (born 1973) is a Canadian born voice actor who appeared in the first two Care Bears movies: as the voice of magician Nicholas in The Care Bears Movie and as the villain Dark Heart in Care Bears Movie II: A New Generation.\n\nKay also appeared in Superman II, the Star Wars inspired animated series Ewoks, Inspector Gadget, and some of the earliest The Raccoons specials as the character Tommy. Then in season 3, he would play Bix Wheelie in one episode as a guest role.\n\nHe even guest-voiced Scooby-Doo for the 1997 episodes of Cartoon Network's Johnny Bravo. His other television credits include guest appearances in The Littlest Hobo (the 2-part episode, \"The Five Labours of Hercules\" (1983)), Bizarre (TV series), and Kung Fu: The Legend Continues.",
        "birthday": "1973-02-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 85367,
        "imdb_id": "nm0443058",
        "known_for_department": "Acting",
        "name": "Hadley Kay",
        "place_of_birth": " Toronto, Ontario, Canada",
        "popularity": 0.124,
        "profile_path": null
    }
}