{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8zLS8p1tRyWFLRFfmgQq0j5WE6z.jpg",
                "genre_ids": [
                    12,
                    28,
                    14
                ],
                "id": 564,
                "original_language": "en",
                "original_title": "The Mummy",
                "overview": "Dashing legionnaire Rick O'Connell stumbles upon the hidden ruins of Hamunaptra while in the midst of a battle to claim the area in 1920s Egypt. It has been over three thousand years since former High Priest Imhotep suffered a fate worse than death as a punishment for a forbidden love—along with a curse that guarantees eternal doom upon the world if he is ever awoken.",
                "popularity": 13.6616,
                "poster_path": "/yhIsVvcUm7QxzLfT6HW2wLf5ajY.jpg",
                "release_date": "1999-04-16",
                "title": "The Mummy",
                "video": false,
                "vote_average": 6.949,
                "vote_count": 9490,
                "character": "Allen Chamberlain",
                "credit_id": "52fe4253c3a36847f80156c1",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/qSxeCfWUUyht9hZgaaYmtPtTkw2.jpg",
                "genre_ids": [
                    12,
                    14,
                    10751
                ],
                "id": 8844,
                "original_language": "en",
                "original_title": "Jumanji",
                "overview": "When siblings Judy and Peter discover an enchanted board game that opens the door to a magical world, they unwittingly invite Alan -- an adult who's been trapped inside the game for 26 years -- into their living room. Alan's only hope for freedom is to finish the game, which proves risky as all three find themselves running from giant rhinoceroses, evil monkeys and other terrifying creatures.",
                "popularity": 3.2897,
                "poster_path": "/vgpXmVaVyUL7GGiDeiK1mKEKzcX.jpg",
                "release_date": "1995-12-15",
                "title": "Jumanji",
                "video": false,
                "vote_average": 7.241,
                "vote_count": 10898,
                "character": "Samuel Alan Parrish / Van Pelt",
                "credit_id": "52fe44bfc3a36847f80a7c99",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/hmZnqijPaaACjenDkrbWcCmcADI.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 549509,
                "original_language": "en",
                "original_title": "The Brutalist",
                "overview": "When a visionary architect and his wife flee post-war Europe in 1947 to rebuild their legacy and witness the birth of modern United States, their lives are changed forever by a mysterious, wealthy client.",
                "popularity": 8.7308,
                "poster_path": "/vP7Yd6couiAaw9jgMd5cjMRj3hQ.jpg",
                "release_date": "2024-12-20",
                "title": "The Brutalist",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1292,
                "character": "Leslie Woodrow",
                "credit_id": "64358b0ccca7de012642159a",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/quVfDYktBYQfojgZ3E9pYrclGse.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 407445,
                "original_language": "en",
                "original_title": "Breathe",
                "overview": "Based on the true story of Robin, a handsome, brilliant and adventurous man whose life takes a dramatic turn when polio leaves him paralyzed.",
                "popularity": 4.4763,
                "poster_path": "/wLu2N0QVfSpk10RJ17HLHyRUmww.jpg",
                "release_date": "2017-10-13",
                "title": "Breathe",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 774,
                "character": "Dr. Entwistle",
                "credit_id": "5ae8ef5ac3a3680c2e00097c",
                "order": 38
            },
            {
                "adult": false,
                "backdrop_path": "/tupgjqhWx5oieQrdyesO3aclUX9.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 597,
                "original_language": "en",
                "original_title": "Titanic",
                "overview": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
                "popularity": 23.0816,
                "poster_path": "/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
                "release_date": "1997-11-18",
                "title": "Titanic",
                "video": false,
                "vote_average": 7.906,
                "vote_count": 26321,
                "character": "Bruce Ismay",
                "credit_id": "675afe88d9d5195fadaa3154",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jonathan van Hyde",
            "جاناتان هاید"
        ],
        "biography": "Jonathan Hyde (born 21 May 1948) is an Australian-born English actor, well known for his roles as J. Bruce Ismay, the managing director of the White Star Line in Titanic, Egyptologist Allen Chamberlain in The Mummy and Sam Parrish/Van Pelt, the hunter in Jumanji. He is married to the Scottish soprano Isobel Buchanan. They have two daughters, one of which is the actress Georgia King.\n\nHyde was born in Brisbane, Queensland. He is a member of the Royal Shakespeare Company. Among other roles, he played Ferdinand in a 1985 production of John Webster's The Duchess of Malfi. He graduated from the Royal Academy of Dramatic Art and is an Associate Member there. He was also an original cast member of Not the Nine O'Clock News, the first series of which was pulled from broadcast because of the General Election of 1979. Hyde has been in numerous films including The Contract, The Curse of King Tut's Tomb, Land of the Blind, The Tailor of Panama, Sherlock Holmes and the Case of the Silk Stocking, Eisenstein, Anaconda and Richie Rich.\n\nHe appeared in the 1989 BBC miniseries Shadow of the Noose in which he played the famous barrister Edward Marshall Hall. He has also appeared in several television mysteries, including The Adventures of Sherlock Holmes starring Jeremy Brett, and Midsomer Murders.\n\nIn 2007, Hyde played Dr. Dorn in Chekhov's The Seagull and the Earl of Kent in King Lear for the RSC in a repertory company that included Ian McKellen, Frances Barber, Romola Garai, William Gaunt and Sylvester McCoy. Both plays toured together internationally, before taking up residence in the New London Theatre. The final performance was on 12 January 2008. He reprised his role of Kent in the 2008 television film of King Lear.\n\nDescription above from the Wikipedia article Jonathan Hyde, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1948-05-21",
        "deathday": null,
        "gender": 2,
        "homepage": "http://jonathanhyde.net/",
        "id": 8537,
        "imdb_id": "nm0404993",
        "known_for_department": "Acting",
        "name": "Jonathan Hyde",
        "place_of_birth": "Brisbane, Australia",
        "popularity": 0.7093,
        "profile_path": "/iNLNW7tH8GRpCP9INLXGmwVU1hK.jpg"
    }
}