{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tupgjqhWx5oieQrdyesO3aclUX9.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 597,
                "original_language": "en",
                "original_title": "Titanic",
                "overview": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
                "popularity": 23.0816,
                "poster_path": "/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
                "release_date": "1997-11-18",
                "title": "Titanic",
                "video": false,
                "vote_average": 7.906,
                "vote_count": 26321,
                "character": "John Jacob Astor",
                "credit_id": "52fe425ac3a36847f8017a0f",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hans-Jörg Gudegast"
        ],
        "biography": "Eric Braeden (born Hans-Jörg Gudegast; April 3, 1941) is a German-born film and television actor. The internationally-acclaimed, Emmy Award-winning and People’s Choice Award-winning film and television actor ERIC BRAEDEN is a television icon and arguably the most popular character in daytime history.  For over 37 plus years, he has portrayed “Victor Newman” on the #1 rated daytime drama series The Young and the Restless, which has over 120,000,000 daily viewers around the world.  The show is syndicated in over 30 foreign countries including Australia, Belgium, Canada, France, Greece, India, Israel, Italy, the Middle East, New Zealand, Romania, Slovenia, South Africa, Switzerland and Turkey.\n\nBraeden recently wrote his critically acclaimed autobiography I’ll Be Damned: How My Young and Restless Life Led Me to America’s #1 Daytime Drama from HarperCollins, which appeared on the Publishers Weekly and Canadian bestseller list.  Additionally, according to A.C. Nielsen, Braeden has one of the highest TVQ’s on television, and is one of the most recognized actors in the world.  On July 20 2007, he was the recipient of a star on The Hollywood Walk Of Fame and become the first German born actor since Marlene Dietrich to receive such an honor.",
        "birthday": "1941-04-03",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.ericbraeden.com/",
        "id": 8544,
        "imdb_id": "nm0000967",
        "known_for_department": "Acting",
        "name": "Eric Braeden",
        "place_of_birth": "Bredenbek, Germany",
        "popularity": 0.6715,
        "profile_path": "/3EYWKMIcXJLAYZODY20Z6DpkNUp.jpg"
    }
}