{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j9QaQVuyQIEwckUbjHpAgA7E4jJ.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 50348,
                "original_language": "en",
                "original_title": "The Lincoln Lawyer",
                "overview": "Mick Haller is a charismatic defense attorney who does business out of his Lincoln Continental sedan. Mick spends most of his time defending petty crooks and other bottom-feeders, so it comes as quite a surprise when he lands the case of a lifetime: defending a Beverly Hills playboy who is accused of attempted murder. However, what Mick initially thinks is an open-and-shut case with a big monetary reward develops into something more sinister.",
                "popularity": 4.9158,
                "poster_path": "/gOn8Ve9Yi8fxjRkmLr5BZoOc7KV.jpg",
                "release_date": "2011-03-17",
                "title": "The Lincoln Lawyer",
                "video": false,
                "vote_average": 7.196,
                "vote_count": 3436,
                "character": "Eddie Vogel",
                "credit_id": "52fe47c4c3a36847f8147195",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/fRT76SSQzAuZljogpsWyKphUxYX.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 296524,
                "original_language": "en",
                "original_title": "Deepwater Horizon",
                "overview": "A story set on the offshore drilling rig Deepwater Horizon, which exploded during April 2010 and created the worst oil spill in U.S. history.",
                "popularity": 4.6993,
                "poster_path": "/jgBIYCZACe3iaS9TL2XzVGkO5p5.jpg",
                "release_date": "2016-09-28",
                "title": "Deepwater Horizon",
                "video": false,
                "vote_average": 6.886,
                "vote_count": 4692,
                "character": "Massive Man",
                "credit_id": "629f57557e12f050e5c94a6e",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/1uCX0fpYOdvrTIYulFymWOP08HT.jpg",
                "genre_ids": [
                    37,
                    28,
                    18
                ],
                "id": 785663,
                "original_language": "en",
                "original_title": "Old Henry",
                "overview": "A widowed farmer and his son warily take in a mysterious, injured man with a satchel of cash. When a posse of men claiming to be the law come for the money, the farmer must decide who to trust. Defending a siege of his homestead, the farmer reveals a talent for gun-slinging that surprises everyone calling his true identity into question.",
                "popularity": 6.7743,
                "poster_path": "/eE1SL0QoDsvAMqQly56IkRtlN1W.jpg",
                "release_date": "2021-10-01",
                "title": "Old Henry",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 620,
                "character": "Al",
                "credit_id": "60fee21754a8ac0046e5590f",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tracy Darrell \"Trace\" Adkins",
            "Tracy Darrell Adkins",
            "트레이스 에드킨스"
        ],
        "biography": "Tracy Darrell \"Trace\" Adkins (born January 13, 1962) is an American country music artist. He made his debut in 1996 with the album Dreamin' Out Loud, released on Capitol Records Nashville. Since then, Adkins has released seven more studio albums and two Greatest Hits compilations. In addition, he has charted more than twenty singles on the Billboard country music charts, including the Number One hits \"(This Ain't) No Thinkin' Thing\", \"Ladies Love Country Boys\", and \"You're Gonna Miss This\", which peaked in 1997, 2007, and 2008, respectively. \"I Left Something Turned on at Home\" went to #1 on Canada's country chart. All but one of his studio albums have received gold or platinum certification in the United States; his highest-selling to date is 2005's Songs About Me, which has been certified 2× Multi-Platinum for shipping two million copies.\n\nHe has also made several appearances on television, including as a panelist on the game shows Hollywood Squares and Pyramid, as a finalist on The Celebrity Apprentice, as the voice for recurring character Elvin on King of the Hill, and in television commercial voice-overs for the KFC restaurant chain. In addition, Adkins has written an autobiography entitled A Personal Stand: Observations and Opinions from a Free-Thinking Roughneck, which was released in late 2007.\n\nDescription above from the Wikipedia article Trace Adkins, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1962-01-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 85477,
        "imdb_id": "nm0012081",
        "known_for_department": "Acting",
        "name": "Trace Adkins",
        "place_of_birth": "Springhill, Louisiana, USA",
        "popularity": 0.1581,
        "profile_path": "/9MMbYFI0WL2rp5iQG9DeYL0Pgvl.jpg"
    }
}