{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kQGxGXzYiCumY8kmXXpgbZyZQK8.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53
                ],
                "id": 395834,
                "original_language": "en",
                "original_title": "Wind River",
                "overview": "An FBI agent teams with the town's veteran game tracker to investigate a murder that occurred on a Native American reservation.",
                "popularity": 6.8236,
                "poster_path": "/pySivdR845Hom4u4T2WNkJxe6Ad.jpg",
                "release_date": "2017-08-03",
                "title": "Wind River",
                "video": false,
                "vote_average": 7.435,
                "vote_count": 5485,
                "character": "Dillon",
                "credit_id": "57f5b507c3a36816160020fb",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Matthew Del Negro (born August 2, 1972) is an American actor.\n\nHe was born in Mount Kisco, New York as the youngest of three children. He is a graduate of Boston College, where he played Division I lacrosse.\n\nAfter graduating, Del Negro began to study acting, and after  appearing in several minor commercials and independent films, he was  cast as Brian Cammarata on The Sopranos. This has led to appearances in other TV shows, such as The West Wing, Law & Order, Stargate: Atlantis, Las Vegas, Beautiful People, CSI: Miami, CSI: Crime Scene Investigation, NCIS, Joan of Arcadia, Eastwick, The Good Wife, The Whole Truth, Happy Endings, Rizzoli and Isles, Lie to Me, Teen Wolf, and United States of Tara. His film appearances include Chelsea Walls, Ira and Abby and Trailer Park of Terror. He has also been cast in several theater productions. He provided the voice of Ops Com in the 2011 video game SOCOM 4: U.S. Navy SEALs. Further video game work for Del Negro includes L.A. Noire and Mass Effect 3.",
        "birthday": "1972-08-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 85484,
        "imdb_id": "nm0215682",
        "known_for_department": "Acting",
        "name": "Matthew Del Negro",
        "place_of_birth": "Mount Kisco, New York, USA",
        "popularity": 0.7158,
        "profile_path": "/h3wcgMRunRmeFhFo16BJpKsqQQC.jpg"
    }
}