{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cJ6dqrHhts085zJTMaXECjp0RfX.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 353326,
                "original_language": "en",
                "original_title": "The Man Who Knew Infinity",
                "overview": "Growing up poor in Madras, India, Srinivasa Ramanujan Iyengar earns admittance to Cambridge University during WWI, where he becomes a pioneer in mathematical theories with the guidance of his professor, G.H. Hardy.",
                "popularity": 4.6191,
                "poster_path": "/v2X1BtkxaV8pzLbmM8a5gTdpg7B.jpg",
                "release_date": "2016-04-08",
                "title": "The Man Who Knew Infinity",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1506,
                "character": "Narayana Iyer",
                "credit_id": "60c7af32cf4b8b0077581fbd",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dhritiman Chatterji",
            "드리티만 채터지"
        ],
        "biography": "Dhritiman Chatterjee (Bengali: ধৃতিমান চট্টোপাধ্যায়) is an Indian actor. He began his acting career in 1970 as the protagonist of Satyajit Ray's Pratidwandi (The Adversary). Most of his acting work has been in India's \"parallel\", or independent, cinema with filmmakers such as Satyajit Ray, Mrinal Sen and Aparna Sen, among others. He has also worked in English films with well-known filmmakers such as Deepa Mehta and Jane Campion. He has received several acting awards in India and has been on the Jury of the Indian National film Awards.\n\nChatterjee pursues a parallel career in advertising, social communications and documentary filmmaking. In 2019, he lent his voice for narration in If Not for You[1], a documentary about Kolkata's long lasting love affair with legendary singer-songwriter Bob Dylan.\n\nNever a part of mainstream \"Bollywood\", he's made an astonishingly small number of films. In recent years he's taken roles with filmmakers as diverse as Jane Campion and hugely successful Mumbai directors Sanjay Leela Bhansali and Mani Ratnam.\n\nDhritiman is his screen name. He is otherwise known as Sundar Chatterjee and is quite active on the English stage in Chennai. Born on 30 May 1945, he was educated at Kolkata's St Xavier's Collegiate School and Presidency College, and the Delhi School of Economics.\n\nAbout his acting qualities, Satyajit Ray once remarked, \"I do not know what definition of a star these filmmakers have been using, but mine goes something like this. A star is a person on the screen who continues to be expressive and interesting even after he or she has stopped doing anything. This definition does not exclude the rare and lucky breed that gets lakhs of rupees per film; and it includes everyone who keeps his calm before the camera, projects a personality and evokes empathy. This is a rare breed too but one has met it in our films. Dhritiman Chatterjee of Pratidwandi is such a star.\" - (Our Films Their Films)\n\nDhritiman is currently the anchor of Pradhanmantri in Bengali on ABP Ananda from 14 December 2013.",
        "birthday": "1945-05-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 85593,
        "imdb_id": "nm0154122",
        "known_for_department": "Acting",
        "name": "Dhritiman Chatterjee",
        "place_of_birth": "Calcutta, Bengal Presidency, British India [now India]",
        "popularity": 0.1048,
        "profile_path": "/uoj2dsDhDe1epdubkpEcv0M5DPX.jpg"
    }
}