{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2nerKhF40OzjnGGOyzHcsAw8T53.jpg",
                "genre_ids": [
                    35,
                    18,
                    10752
                ],
                "id": 11902,
                "original_language": "sr",
                "original_title": "Подземље",
                "overview": "A group of Serbian socialists prepares for the war in a surreal underground filled by parties, tragedies, love and hate.",
                "popularity": 2.453,
                "poster_path": "/h8N6y13t4VusrDdH5PzTkwvBvgN.jpg",
                "release_date": "1995-05-13",
                "title": "Underground",
                "video": false,
                "vote_average": 7.736,
                "vote_count": 720,
                "character": "Golub",
                "credit_id": "52fe449e9251416c7503b153",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bora Todorović"
        ],
        "biography": "Borivoje \"Bora\" Todorović (born 5 November 1930 in Belgrade, Kingdom of Yugoslavia) is a Serbian actor. His sister is the famous actress, Mira Stupica, and father of Srđan Todorović. Bora Todorović has an extensive acting career, and has had roles in critically acclaimed Yugoslavian films such as Who's That Singing Over There (1980), The Marathon Family (1982), Balkan Express (1983), Balkanski Špijun (Balkan Spy, 1984), Time of the Gypsies (1988), and Underground (1995). Bora's father died during his childhood. Following secondary school, Bora completed army service, at which point he had no plans to pursue an acting career. However, his older sister Mira's passion for acting exposed him to the business and soon he became passionate about it as well. He enrolled in the Belgrade Drama Arts Academy, and eventually acted on stage at the Belgrade Drama Theatre. In 1957, Bora lived and acted in Zagreb, eventually returning to Belgrade in 1961. Between 1961 and 1983, Bora was a member of the \"Atelje 212\" theater in Belgrade, where he performed various roles. In October 2002, he appeared on the Zvezdara Theatre stage in Belgrade, in the play Larry Thompson. Bora Todorović now alternates residence between Prague and Belgrade. He is currently married to Carolyn Kilkka, with whom he has two children, Dana and Tara. Bora also has a child from his previous marriage to Snežana Matić. He died on July 7, 2014 after suffering a brain-stroke.",
        "birthday": "1930-11-05",
        "deathday": "2014-07-07",
        "gender": 2,
        "homepage": null,
        "id": 85643,
        "imdb_id": "nm0865392",
        "known_for_department": "Acting",
        "name": "Borivoje Todorović",
        "place_of_birth": "Belgrade, Serbia",
        "popularity": 1.0286,
        "profile_path": "/cPl8copuAfqJwGtirplr2yOTDri.jpg"
    }
}