{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xfEU7DOlQPwz8Y0TBhKmpETuNIc.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648
                ],
                "id": 93,
                "original_language": "en",
                "original_title": "Anatomy of a Murder",
                "overview": "Semi-retired Michigan lawyer Paul Biegler takes the case of Army Lt. Manion, who murdered a local innkeeper after his wife claimed that he raped her. Over the course of an extensive trial, Biegler parries with District Attorney Lodwick and out-of-town prosecutor Claude Dancer to set his client free, but his case rests on the victim's mysterious business partner, who's hiding a dark secret.",
                "popularity": 4.2805,
                "poster_path": "/b2G1QSAwtBv9luhEwErIgSRaU92.jpg",
                "release_date": "1959-07-01",
                "title": "Anatomy of a Murder",
                "video": false,
                "vote_average": 7.848,
                "vote_count": 1075,
                "character": "Parnell Emmett McCarthy",
                "credit_id": "52fe4216c3a36847f8003061",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/ejLsnT6KmMpvtoPHMp40m54hRDd.jpg",
                "genre_ids": [
                    12,
                    18,
                    53
                ],
                "id": 551,
                "original_language": "en",
                "original_title": "The Poseidon Adventure",
                "overview": "When their ocean liner capsizes, a group of passengers struggle to survive and escape.",
                "popularity": 4.4311,
                "poster_path": "/6RGiA5BfhelU9zoD0b1GAG4GWWf.jpg",
                "release_date": "1972-12-01",
                "title": "The Poseidon Adventure",
                "video": false,
                "vote_average": 7.11,
                "vote_count": 937,
                "character": "John, the Chaplain",
                "credit_id": "54cb2e77925141678e012f94",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/ruF3Lmd4A8MHbnEBE6lxPMbsHGL.jpg",
                "genre_ids": [
                    9648,
                    18
                ],
                "id": 15,
                "original_language": "en",
                "original_title": "Citizen Kane",
                "overview": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
                "popularity": 6.1449,
                "poster_path": "/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg",
                "release_date": "1941-04-17",
                "title": "Citizen Kane",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 5751,
                "character": "Reporter (uncredited)",
                "credit_id": "586aff30c3a3685ea6000009",
                "order": 62
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Arthur O'Connell (March 29, 1908 – May 18, 1981) was an American stage and film actor. He appeared in films (starting with a small role in Citizen Kane) in 1941 and television programs (mostly guest appearances). Among his screen appearances were Picnic, Anatomy of a Murder, and as the watch-maker who hides Jews during WWII in The Hiding Place.\n\nA veteran vaudevillian, O'Connell, from New York City, made his legitimate stage debut in the mid 1930s, at which time he fell within the orbit of Orson Welles' Mercury Theatre. Welles cast O'Connell in the tiny role of a reporter in the closing scenes of Citizen Kane (1941), a film often referred to as O'Connell's film debut, though in fact he had already appeared in Freshman Year (1939) and had costarred in two Leon Errol short subjects as Leon's conniving brother-in-law.\n\nAfter numerous small movie parts, O'Connell returned to Broadway, where he appeared as the erstwhile middle-aged swain of a spinsterish schoolteacher in Picnic - a role he'd recreate in the 1956 film version, earning an Oscar nomination in the process. Later the jaded looking O'Connell was frequently cast as fortyish losers and alcoholics; in the latter capacity he appeared as James Stewart's boozy attorney mentor in Anatomy of a Murder (1959), and the result was another Oscar nomination. In 1962 O'Connell portrayed the father of Elvis Presley's character in the motion picture Follow That Dream, and in 1964 in the Presley-picture Kissin' Cousins.\n\nO'Connell continued appearing in choice character parts on both TV and films during the 1960s, but avoided a regular television series, holding out until he could be assured top billing. He appeared as Joseph Baylor in the 1964 episode \"A Little Anger Is a Good Thing\" on the ABC medical drama about psychiatry, Breaking Point. The actor accepted the part of a man who discovers that his 99-year-old father has been frozen in an iceberg on the 1967 sitcom The Second Hundred Years, assuming he'd be billed first per the producers' agreement. Instead, top billing went to newcomer Monte Markham in the dual role of O'Connell's father and his son. O'Connell accepted the demotion to second billing as well as could be expected, but he never again trusted the word of any Hollywood executive.\n\nIll health forced O'Connell to significantly reduce his acting appearances in the mid '70s, but the actor stayed busy as a commercial spokesman, a friendly pharmacist who was a spokesperson for Crest toothpaste. At the time of his death from Alzheimer's disease in California in May 1981, O'Connell was appearing solely in these commercials, by his own choice.\n\nO'Connell was buried in Calvary Cemetery, Queens, New York.\n\nDescription above from the Wikipedia article Arthur O'Connell, licensed under CC-BY-SA, full list of contributors on Wikipedia.    ",
        "birthday": "1908-03-29",
        "deathday": "1981-05-18",
        "gender": 2,
        "homepage": null,
        "id": 857,
        "imdb_id": "nm0640023",
        "known_for_department": "Acting",
        "name": "Arthur O'Connell",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.5077,
        "profile_path": "/jJh2FxbrpIm5GzIMP8uA0cWNQdc.jpg"
    }
}