{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zJjI78peUFRIe2NPHthVhow2f60.jpg",
                "genre_ids": [
                    28,
                    12,
                    14,
                    18
                ],
                "id": 256040,
                "original_language": "te",
                "original_title": "బాహుబలి:ద బిగినింగ్",
                "overview": "The young Shivudu is left as a foundling in a small village by his mother. By the time he’s grown up, it has become apparent that he possesses exceptional gifts. He meets the beautiful warrior princess Avanthika and learns that her queen has been held captive for the last 25 years. Shividu sets off to rescue her, discovering his own origins in the process.",
                "popularity": 4.9895,
                "poster_path": "/9BAjt8nSSms62uOVYn1t3C3dVto.jpg",
                "release_date": "2015-07-10",
                "title": "Bāhubali: The Beginning",
                "video": false,
                "vote_average": 7.542,
                "vote_count": 859,
                "character": "Avanthika",
                "credit_id": "53020605925141219b2809dc",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/yCRYYGldFGVa4cmZVpTVCRQMfjA.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 350312,
                "original_language": "te",
                "original_title": "బాహుబలి 2: ది కన్ క్లూజన్",
                "overview": "When Mahendra, the son of Bāhubali, learns about his heritage, he begins to look for answers. His story is juxtaposed with past events that unfolded in the Mahishmati Kingdom.",
                "popularity": 4.1995,
                "poster_path": "/xQ22LOWSkClP3maYhR9nZH0dnWM.jpg",
                "release_date": "2017-04-27",
                "title": "Bāhubali 2: The Conclusion",
                "video": false,
                "vote_average": 7.461,
                "vote_count": 789,
                "character": "Avanthika",
                "credit_id": "55df3a3dc3a36834760000a7",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tamannaah ",
            "தமன்னா",
            "Tamanna Bhatia",
            "Таманна Бхатия",
            "تمنا بهاتیا"
        ],
        "biography": "Tamannaah Bhatia also known as Tamannaah, is an Indian actress who predominantly appears in Telugu and Tamil films. She has also appeared in Hindi films. In addition to acting, she also participates in stage shows and is a prominent celebrity endorser for brands and products.\n\nIn 2005, she made her acting debut in the age of 15 in the Bollywood film, Chand Sa Roshan Chehra and appeared in Abhijeet Sawant album song \"Lafzon main\" from the album Aapka Abhijeet which was also released in the year 2005, before working in Telugu cinema and Tamil cinema. In the same year, Tamannaah made her Telugu film debut in Sri, and the next year she appeared in her first Tamil movie, Kedi. In 2007, she starred in two college-life-based drama films, Happy Days in Telugu and Kalloori in Tamil.\n\nHer projects include the Tamil films Ayan (2009), Paiyaa (2010), Sura (2010) and Siruthai (2011), Veeram (2014) and Telugu films include 100% Love (2011). Other films include Racha (2012), Thadaka (2013), Baahubali: The Beginning (2015), Bengal Tiger (2015) and Oopiri (2016). She thus established herself as one of the leading contemporary actresses in Telugu cinema and Tamil cinema.\n\nTamannaah has acted with major actors including Ajith Kumar, Vijay, Surya, Karthi, Dhanush, Jayam Ravi, Arya, Pawan Kalyan, Mahesh Babu, Nagarjuna, Allu Arjun, Ramcharan, Jr.Ntr, Ravi Teja, Prabhas, Saif Ali Khan, Ajay Devgn, Akshay Kumar, Ranveer Singh. She is one of the highest paid actresses in South Indian cinema.\n\nShe is the first actress in India who was nominated at Saturn Awards (for Best Supporting Actress) but Lost to Jessica Chastain for Crimson Peak.\n\nTamannaah received the Kalaimamani Award in 2010 from the Chief Minister of Tamil Nadu.",
        "birthday": "1989-12-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 85721,
        "imdb_id": "nm1961459",
        "known_for_department": "Acting",
        "name": "Tamannaah Bhatia",
        "place_of_birth": "Mumbai, Maharashtra, India",
        "popularity": 1.0755,
        "profile_path": "/t4WYoKiFAyO1Rhjv7O03EKmJHp4.jpg"
    }
}