{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qszuXKhzYR24oRpsmh7eZaPbvL8.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 805,
                "original_language": "en",
                "original_title": "Rosemary's Baby",
                "overview": "A young couple, Rosemary and Guy, moves into an infamous New York apartment building, known by frightening legends and mysterious events, with the purpose of starting a family.",
                "popularity": 3.2262,
                "poster_path": "/uYgvlHceRFjAFbsNeMInYcLZLUb.jpg",
                "release_date": "1968-06-12",
                "title": "Rosemary's Baby",
                "video": false,
                "vote_average": 7.825,
                "vote_count": 4132,
                "character": "Mrs. Gilmore",
                "credit_id": "52fe4279c3a36847f80215fb",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hope Summers could portray a friendly neighbor or companion as she did for Frances Bavier's Aunt Bee character on many episodes of The Andy Griffith Show (1960) or a seemingly amiable Satanist in Rosemary's Baby (1968).\n\nBorn in Mattoon, Illinois, she developed an early interest in the theater. Graduating from Northwestern School of Speech in Evanston, Illinois, she subsequently taught speech and diction there. This, in turn, led to her the head position in the Speech Department at Bradley University in Peoria, Illinois, teaching students privately on the side as well. In the 1930s Hope began to focus on acting. She found work in community and stock theaters in Illinois and earned some notice for putting on one-woman shows such as \"Backstage of Broadway.\" She made use of her vocal eloquence by building up her resumé on radio, performing in scores of dramatic shows, including \"Authors' Playhouse,\" \"First Night,\" \"Ma Perkins\", and \"Step-Mother\".\n\nIn 1950 Hope transferred her talents to the new medium of television and earned a regular role on the comedy series Hawkins Falls: A Television Novel (1950). By the age of 50 she was customarily called upon to play slightly older than she was, appearing in a number of minuscule matron roles in such films as Zero Hour! (1957), Hound-Dog Man (1959), Inherit the Wind (1960), Spencer's Mountain (1963), The Ghost and Mr. Chicken (1966), Charley Varrick (1973) and her last, Foul Play (1978). She never had any major stand-out roles in movies; TV would be a more prolific choice of medium. Her gently stern, old-fashioned looks allowed her to be a part of many small-town settings, including Dennis the Menace (1959) and Petticoat Junction (1963), and in various western locales such as Maverick (1957) and Wagon Train (1957).\n\nShe played a rustic regular for many years on The Rifleman (1958). Usually assigned to play teachers, nurses and other helpful, nurturing types, her characters were also known to be inveterate gossips. Hope worked until close to the end of her life, passing away from heart failure in 1979.",
        "birthday": "1896-06-07",
        "deathday": "1979-06-22",
        "gender": 1,
        "homepage": null,
        "id": 85838,
        "imdb_id": "nm0814064",
        "known_for_department": "Acting",
        "name": "Hope Summers",
        "place_of_birth": "Mattoon, Illinois, USA",
        "popularity": 0.4531,
        "profile_path": "/6JVCwoKx9HlPh5leJLoNVtUlkmn.jpg"
    }
}