{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ihoQaiMFAz4YCTAaSIsQjRknsNH.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 3085,
                "original_language": "en",
                "original_title": "His Girl Friday",
                "overview": "Walter Burns is an irresistibly conniving newspaper publisher desperate to woo back his paper’s star reporter, who also happens to be his estranged wife. She’s threatening to quit and settle down with a new beau, but, as Walter knows, she has a weakness: she can’t resist a juicy scoop.",
                "popularity": 3.6597,
                "poster_path": "/lu86Y9zTPH3neCiUzLzHCEFHf7f.jpg",
                "release_date": "1940-01-18",
                "title": "His Girl Friday",
                "video": false,
                "vote_average": 7.396,
                "vote_count": 879,
                "character": "Evangeline (uncredited)",
                "credit_id": "566c5d77c3a3682e980084b1",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marion Suplee",
            "Marian Martin"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMarion Martin (born Marion Suplee, June 7, 1909 – August 13, 1985) was an American movie and stage actress.\n\nMartin was born in Philadelphia, Pennsylvania, the daughter of a Bethlehem Steel executive. She became an actress after her family fortune was lost in the Wall Street Crash of 1929, and appeared in the Broadway productions Lombardi Ltd. and Sweet Adeline.\n\nShe made her film debut in She's My Lillie, I'm Her Willie and subsequently played minor roles, often as showgirls. Several of her early roles were in musicals and she achieved some success as a singer. By the end of the decade she had played leading female roles in several \"B\" pictures, playing one of her most notable roles in James Whale's Sinners in Paradise (1938). Despite her success she was often cast in minor roles in more widely seen films such as His Girl Friday (1940). The majority of her roles were in comedies but she also appeared in dramas such as Boom Town (1940) in which she played a dance hall singer who is briefly romanced by Clark Gable. She played secondary roles in three Lupe Vélez \"Mexican Spitfire\" films in the early 1940s, and was a comic foil for the Marx Brothers in The Big Store, where the back of her skirt is cut away by Harpo.\n\nShe played a ghost in Gildersleeve's Ghost, and was the subject of a legendary fistfight between Gildersleeve star Harold Peary and Warner Bros studio mogul Bud Stevens at the Mocambo nightclub in 1943. Her more substantial roles included Alice Angel, a dizzy showgirl, in the murder mystery Lady of Burlesque with Barbara Stanwyck and Angel on My Shoulder. She also appeared in The Big Street with Lucille Ball, in the western The Woman of the Town with Claire Trevor and in The Great Mike at PRC in 1944.\n\nBy the late 1940s, her roles were often minor. Three Stooges fans will remember her as western cowgirl Gladys in Merry Mavericks. She played \"Belle Farnol\" in a 1950 episode of The Lone Ranger entitled \"Pardon for Curley\". Shortly afterward, she made her final film appearance in 1952. Married to a physicist, Martin retired, and although she expressed the desire to return to show business, suitable roles were not offered to her.\n\nShe was awarded a star on the Hollywood Walk of Fame for her contributions to motion pictures, at 6925 Hollywood Boulevard. She died in 1985 in Santa Monica, California, and was buried in Holy Cross Cemetery in Culver City, California.",
        "birthday": "1908-06-07",
        "deathday": "1985-08-13",
        "gender": 1,
        "homepage": null,
        "id": 85900,
        "imdb_id": "nm0552744",
        "known_for_department": "Acting",
        "name": "Marion Martin",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.9885,
        "profile_path": "/3WTkubutgHhO3lJXlW5rqYZGr01.jpg"
    }
}