{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wqgZSvgoctaadgwUdPYVsksivxn.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 20334,
                "original_language": "en",
                "original_title": "The Shop Around the Corner",
                "overview": "Two employees at a gift shop can barely stand one another, without realising that they are falling in love through the post as each other's anonymous pen pal.",
                "popularity": 3.5227,
                "poster_path": "/dZ1aEzGYRiqJwPfjS6VL7wUkHmF.jpg",
                "release_date": "1940-01-12",
                "title": "The Shop Around the Corner",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 766,
                "character": "Flora",
                "credit_id": "52fe43e2c3a368484e003b0d",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Catherine Haden",
            "Sarah Haden",
            "Sarah Hayden",
            "Sara Hayden"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nSara Haden (born Catherine Haden, November 17, 1898 – September 15, 1981) was a character actress in Hollywood films of the 1930s through the 1950s and in television into the mid-1960s. She may be best remembered for appearing as Aunt Milly Forrest in thirteen entries in MGM's Andy Hardy film series.\n\nHaden first appeared on the stage in the early 1920s. As early as October 1920, she was appearing with Walter Hampden's acting troupe. Her Broadway debut came in Trigger (1927).\n\nShe made her film debut in 1934 (one year after her mother's retirement) in the Katharine Hepburn vehicle Spitfire. Haden later became a Metro-Goldwyn-Mayer contract player in the late 1930s and had smallish roles in many of the studio's films, most notably in the Andy Hardy series starring Mickey Rooney, cast as the spinsterish Aunt Milly Forrest.\n\nHaden made her last film, Andy Hardy Comes Home, in 1958, but was active on television until a 1965 guest spot on Dr. Kildare. She was most notable for her stern, humorless characterisations such as a truant officer in Shirley Temple's Captain January (1936), but she also played the much-loved teacher Miss Pipps, who is unjustly fired in the Our Gang comedy Come Back, Miss Pipps (1941). Other films in which she appeared include Poor Little Rich Girl (1936), The Shop Around the Corner (1940), Woman of the Year (1942), and The Bishop's Wife (1947). Her television appearances include episodes of Climax!, Bourbon Street Beat, and Bonanza. She had a guest appearance on Perry Mason as Florence Harvey in the 1959 episode, \"The Case of the Romantic Rogue\".\n\nHaden played Dora Darling in My Favorite Martian, season 2 episode 28, \"Once Upon a Martian's Mother's Day\" in 1965.\n\nShe was married to film actor Richard Abbott (born Seamon Vandenberg; 1899-1986) from 1921 until their divorce in 1948. Sara Haden died on September 15, 1981 at the Motion Picture & Television Country House and Hospital in Woodland Hills, California, at age 82.",
        "birthday": "1898-11-16",
        "deathday": "1981-09-15",
        "gender": 1,
        "homepage": null,
        "id": 85956,
        "imdb_id": "nm0352774",
        "known_for_department": "Acting",
        "name": "Sara Haden",
        "place_of_birth": "Galveston, Texas, USA",
        "popularity": 0.277,
        "profile_path": "/77NW5jRIn7rxzEMxhR2kjsCCDXg.jpg"
    }
}