{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rsI82F7DadIQcrZyPbuwmkhN5ty.jpg",
                "genre_ids": [
                    35
                ],
                "id": 3034,
                "original_language": "en",
                "original_title": "Young Frankenstein",
                "overview": "A young neurosurgeon inherits the castle of his grandfather, the famous Dr. Victor von Frankenstein. In the castle he finds a funny hunchback, a pretty lab assistant and the elderly housekeeper. Young Frankenstein believes that the work of his grandfather was delusional, but when he discovers the book where the mad doctor described his reanimation experiment, he suddenly changes his mind.",
                "popularity": 3.9553,
                "poster_path": "/c6335WJCZO8NK5wehHk5sA9Cypv.jpg",
                "release_date": "1974-12-15",
                "title": "Young Frankenstein",
                "video": false,
                "vote_average": 7.867,
                "vote_count": 3247,
                "character": "First Village Elder",
                "credit_id": "52fe437fc3a36847f80587a9",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/bhEJZ6XH1B9ld97OWppdAnvWzl5.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11165,
                "original_language": "en",
                "original_title": "Tora! Tora! Tora!",
                "overview": "In the summer of 1941, the United States and Japan seem on the brink of war after constant embargos and failed diplomacy come to no end. \"Tora! Tora! Tora!\", named after the code words used by the lead Japanese pilot to indicate they had surprised the Americans, covers the days leading up to the attack on Pearl Harbor, which plunged America into the Second World War.",
                "popularity": 3.337,
                "poster_path": "/c311sN931DixuZRer0JGYCwpx9N.jpg",
                "release_date": "1970-01-26",
                "title": "Tora! Tora! Tora!",
                "video": false,
                "vote_average": 7.149,
                "vote_count": 566,
                "character": "U.S. Army General (uncredited)",
                "credit_id": "61e7d0ffbc8657001bdf983f",
                "order": 67
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Walker Berry Kroeger",
            "Barry Kroeger",
            "Berry Kroger",
            "Barry Kroger"
        ],
        "biography": "Berry Kroeger was an American film, television and stage actor.\n\nBorn in San Antonio, Texas, Kroeger got his acting start on radio as an announcer on Suspense and as an actor, playing for a time The Falcon in the radio series. Kroeger was a regular as Sam Williams on the radio daytime drama Young Doctor Malone. He was discovered by filmmaker William Wellman while performing on Broadway and began appearing in films in 1948 with his role in The Iron Curtain.\n\nKroeger specialized in playing slimy bad guys in films like Act of Violence (1948) and The Iron Curtain (1948), a crooked lawyer in Cry of the City (1948) and a heavy in Joseph H. Lewis' cult crime classic, Gun Crazy (1949). His flair for decadent leering and evil scowls often led to his being cast in \"schlock fare\", like 1966's Chamber of Horrors and 1971's The Incredible Two-Headed Transplant. He appeared in a small role as a village elder in Young Frankenstein (1974).\n\nHe appeared in dozens of television programs. He guest starred on seven episodes of Perry Mason, including murderer Edgar Whitehead in the 1961 episode, \"The Case of the Blind Man's Bluff,\" and murder victim Kirk Cameron in the 1964 episode, \"The Case of the Illicit Illusion.\" He also appeared in shows such as Hawaiian Eye, Get Smart (as a character spoofing actor Sydney Greenstreet) and The Man from U.N.C.L.E.. His last major film role was in 1977's The Demon Seed.\n\nOn Broadway, Kroeger portrayed the High Lama in the ill-fated 1956 musical adaptation of Lost Horizon entitled Shangri-La.\n\nOn January 4, 1991, Berry Kroeger died of kidney failure.\n\n*Source:* **Wikipedia**",
        "birthday": "1912-10-16",
        "deathday": "1991-01-04",
        "gender": 2,
        "homepage": null,
        "id": 85988,
        "imdb_id": "nm0471854",
        "known_for_department": "Acting",
        "name": "Berry Kroeger",
        "place_of_birth": "San Antonio, Texas, USA",
        "popularity": 0.1969,
        "profile_path": "/egarsq9nJe61ligHIhOsrCSnd9d.jpg"
    }
}