{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nCl5KzxUs4rVVlAdixDf4r5AbbZ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 887,
                "original_language": "en",
                "original_title": "The Best Years of Our Lives",
                "overview": "It's the hope that sustains the spirit of every GI: the dream of the day when he will finally return home. For three WWII veterans, the day has arrived. But for each man, the dream is about to become a nightmare.",
                "popularity": 5.3127,
                "poster_path": "/gd5EoAU4MM57sW3vlWxJ0NMM8cV.jpg",
                "release_date": "1946-12-25",
                "title": "The Best Years of Our Lives",
                "video": false,
                "vote_average": 7.79,
                "vote_count": 694,
                "character": "Mr. Parrish",
                "credit_id": "52fe4287c3a36847f80261f1",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/qszuXKhzYR24oRpsmh7eZaPbvL8.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 805,
                "original_language": "en",
                "original_title": "Rosemary's Baby",
                "overview": "A young couple, Rosemary and Guy, moves into an infamous New York apartment building, known by frightening legends and mysterious events, with the purpose of starting a family.",
                "popularity": 3.3933,
                "poster_path": "/uYgvlHceRFjAFbsNeMInYcLZLUb.jpg",
                "release_date": "1968-06-12",
                "title": "Rosemary's Baby",
                "video": false,
                "vote_average": 7.825,
                "vote_count": 4132,
                "character": "Mr. Wees (uncredited)",
                "credit_id": "6504c76dfa27f4014eb0631b",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/a3eYLIK5eYSHAJTtOy9PdciVjxx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 28580,
                "original_language": "en",
                "original_title": "The Lost Weekend",
                "overview": "Don Birnam, a long-time alcoholic, has been sober for ten days and appears to be over the worst... but his craving has just become more insidious. Evading a country weekend planned by his brother and girlfriend, he begins a four-day bender that just might be his last - one way or another.",
                "popularity": 2.7953,
                "poster_path": "/8ggIOoCzt8xT2ePl8DdlRtXgcOh.jpg",
                "release_date": "1945-11-29",
                "title": "The Lost Weekend",
                "video": false,
                "vote_average": 7.628,
                "vote_count": 629,
                "character": "Man from Albany (uncredited)",
                "credit_id": "55e72b93c3a368377c000234",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Walter S. Baldwin Jr.",
            "Walter S. Baldwin",
            "Walter Smith Baldwin Jr."
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nWalter S. Baldwin Jr. (January 2, 1889 − January 27, 1977) was a prolific character actor whose career spanned five decades and 150 film and television roles, and numerous stage performances.\n\nBaldwin was born in Lima, Ohio from a theatrical family and served in the First World War.\n\nHe was probably best known for playing the father of the handicapped sailor in The Best Years of Our Lives. He was the first actor to portray \"Floyd the Barber\" on The Andy Griffith Show.\n\nPrior to his first film roles in 1939, Baldwin had appeared in more than a dozen Broadway plays. He played Whit in the first Broadway production of Of Mice and Men, and also appeared in the original Grand Hotel in a small role, as well as serving as the production's stage manager. He originated the role of Bensinger, the prissy Chicago Tribune reporter, in the Broadway production of The Front Page.\n\nIn the 1960s he had small acting roles in television shows such as Petticoat Junction and Green Acres. He continued to act in motion pictures, and one of his last roles was in Rosemary's Baby.\n\nBaldwin was known for playing solid middle class burghers, although sometimes he gave portrayals of eccentric characters. He played a customer seeking a prostitute in The Lost Weekend and the rebellious prison trusty Orvy in Cry of the City. Walter Baldwin was featured in a lot of John Deere Day Movies from 1949-59 where he played the farmer Tom Gordon. In this series of Deere Day movies over a decade he helped to introduce many new pieces of John Deere farm equipment year-by-year. In each yearly movie he would be shown on his in A Tom Gordon Family Film where he would be buying new John Deere farm equipment or a new green and yellow tractor.A picture of Walter Baldwin playing Tom Gordon can be found on page 108 of Bob Pripp's book John Deere Yesterday & Today\n\nHal Erickson writes in Allmovie: \"With a pinched Midwestern countenance that enabled him to portray taciturn farmers, obsequious grocery store clerks and the occasional sniveling coward, Baldwin was a familiar (if often unbilled) presence in Hollywood films for three decades.\"",
        "birthday": "1889-01-01",
        "deathday": "1977-01-27",
        "gender": 2,
        "homepage": null,
        "id": 85990,
        "imdb_id": "nm0050019",
        "known_for_department": "Acting",
        "name": "Walter Baldwin",
        "place_of_birth": "Lima, Ohio, USA",
        "popularity": 0.2339,
        "profile_path": "/oS2Cymq1iHV6b2MopFvp3DiX6pE.jpg"
    }
}