{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xfEU7DOlQPwz8Y0TBhKmpETuNIc.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648
                ],
                "id": 93,
                "original_language": "en",
                "original_title": "Anatomy of a Murder",
                "overview": "Semi-retired Michigan lawyer Paul Biegler takes the case of Army Lt. Manion, who murdered a local innkeeper after his wife claimed that he raped her. Over the course of an extensive trial, Biegler parries with District Attorney Lodwick and out-of-town prosecutor Claude Dancer to set his client free, but his case rests on the victim's mysterious business partner, who's hiding a dark secret.",
                "popularity": 4.2805,
                "poster_path": "/b2G1QSAwtBv9luhEwErIgSRaU92.jpg",
                "release_date": "1959-07-01",
                "title": "Anatomy of a Murder",
                "video": false,
                "vote_average": 7.848,
                "vote_count": 1075,
                "character": "Mary Pilant",
                "credit_id": "52fe4216c3a36847f8003073",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/zZvtZZXRnZ4Tdcs0QEWaZZcIWy8.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 567,
                "original_language": "en",
                "original_title": "Rear Window",
                "overview": "A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder.",
                "popularity": 6.1933,
                "poster_path": "/ILVF0eJxHMddjxeQhswFtpMtqx.jpg",
                "release_date": "1954-08-01",
                "title": "Rear Window",
                "video": false,
                "vote_average": 8.349,
                "vote_count": 6829,
                "character": "Girl at Songwriter's Party (uncredited)",
                "credit_id": "52fe4253c3a36847f8015897",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Olive Kathryn Grandstaff",
            "Kathryn Grant Crosby",
            "Kathryn Grant-Crosby",
            "Kathryn Crosby",
            "Kathryn Grandstaff"
        ],
        "biography": "Kathryn Crosby (November 25, 1933 - September 20, 2024) was an American actress and singer who also performed under the stage-name Kathryn Grant.\n\nBorn Olive Kathryn Grandstaff in Houston, Texas, she graduated from the University of Texas at Austin with a Bachelor of Fine Arts in 1955. Two years later she became Bing Crosby's second wife. The couple had three children, Harry, Mary Frances, and Nathaniel. She appeared as a guest star on her husband's 1964–1965 ABC sitcom The Bing Crosby Show.\n\nShe largely retired after their marriage, but did have a featured role in the courtroom drama Anatomy of a Murder. She also played the part of \"Mama Bear\" alongside her husband and children in Goldilocks and starred with Jack Lemmon in Operation Mad Ball in 1957.\n\nIn the mid-1970s, she hosted The Kathryn Crosby Show, a 30-minute local talk-show on KPIX-TV in San Francisco. Husband Bing appeared as a guest occasionally.\n\nAfter Bing Crosby's death in 1977, she took on a few smaller roles and the lead in the short-lived 1996 Broadway musical State Fair.\n\nFor 16 years ending in 2001, Crosby hosted the Crosby National Golf Tournament at Bermuda Run Country Club in Bermuda Run, North Carolina. A nearby bridge carrying U.S. Route 158 over the Yadkin River is named for Crosby.\n\nOn November 4, 2010, Crosby was seriously injured in an automobile accident in the Sierra Nevada that killed her 85-year-old husband, Maurice William Sullivan.",
        "birthday": "1933-11-25",
        "deathday": "2024-09-20",
        "gender": 1,
        "homepage": null,
        "id": 861,
        "imdb_id": "nm0335497",
        "known_for_department": "Acting",
        "name": "Kathryn Grant",
        "place_of_birth": "West Columbia, Texas, USA",
        "popularity": 0.4566,
        "profile_path": "/tgQ9cvlr90QvmeFdN6M8lidhPsL.jpg"
    }
}