{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/p47ihFj4A7EpBjmPHdTj4ipyq1S.jpg",
                "genre_ids": [
                    18
                ],
                "id": 599,
                "original_language": "en",
                "original_title": "Sunset Boulevard",
                "overview": "A hack screenwriter writes a screenplay for a former silent film star who has faded into Hollywood obscurity.",
                "popularity": 5.7842,
                "poster_path": "/sC4Dpmn87oz9AuxZ15Lmip0Ftgr.jpg",
                "release_date": "1950-08-10",
                "title": "Sunset Boulevard",
                "video": false,
                "vote_average": 8.293,
                "vote_count": 2743,
                "character": "Artie Green",
                "credit_id": "52fe425ac3a36847f8017c39",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Randolph Webb",
            "John Randolph"
        ],
        "biography": "John Randolph 'Jack' Webb, also known by the pen name John Randolph, was an American actor, television producer, director, and screenwriter, who is most famous for his role as Sergeant Joe Friday in the radio and television series Dragnet. He was also the founder of his own production company, Mark VII Limited.\n\nBorn in Santa Monica, California, Webb grew up in the Bunker Hill section of Los Angeles as the child of a single mother after his father left home before he was born.\n\nDuring World War II, Webb enlisted in the United States Army Air Forces, but he \"washed out\" of flight training and was granted a hardship discharge to care for his family. Following his discharge, he moved to San Francisco, where a wartime shortage of announcers led to a temporary appointment to his own half-hour comedy radio show on ABC's KGO Radio in 1946. By 1949 he had abandoned comedy for drama, and starred in numerous radio shows until finding success in film and television in the late 1950s.\n\nWebb had a featured role as a crime lab technician in the 1948 film He Walked by Night, a thinly-fictionalized recounting of the 1946 Walker crime spree. This experience gave Webb the idea for Dragnet: a recurring series based on real cases from LAPD police files, featuring authentic depictions of the modern police detective, including methods, mannerisms, and technical language. Following the success of Dragnet, Webb appeared in numerous television shows and specials, including the well-known 1972 series Emergency!\n\nDuring his work on a revival of Dragnet in 1982, Webb suffered a heart attack and died at the age of 62. His funeral was given full police honors, and then LAPD Chief Daryl Gates retired the badge number 714 used by Webb's Joe Friday of Dragnet fame.  ",
        "birthday": "1920-04-02",
        "deathday": "1982-12-23",
        "gender": 2,
        "homepage": null,
        "id": 8634,
        "imdb_id": "nm0916131",
        "known_for_department": "Acting",
        "name": "Jack Webb",
        "place_of_birth": "Santa Monica, California, USA",
        "popularity": 0.5976,
        "profile_path": "/4X6wbZ9wDqVrpDP3WvIJZBLPsLh.jpg"
    }
}