{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oa6yoeeZtjxdgzAcZtbCSW3GEE9.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 11462,
                "original_language": "en",
                "original_title": "Suspicion",
                "overview": "A sheltered young heiress elopes with a handsome playboy. Gradually, she discovers his dishonest nature.",
                "popularity": 2.6894,
                "poster_path": "/clWNlzlbyaEoIK63lcFjqBmXoQz.jpg",
                "release_date": "1941-11-14",
                "title": "Suspicion",
                "video": false,
                "vote_average": 7.134,
                "vote_count": 853,
                "character": "Reggie Wetherby",
                "credit_id": "52fe44459251416c7502ec89",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Matthew Reginald Sheffield Cassan",
            "Eric Desmond",
            "Reggie Sheffield",
            "Reggy Sheffield"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nReginald Sheffield was born Matthew Reginald Sheffield Cassan in the St. George's, Hanover Square district of London, to Matthew Sheffield Cassan and Alice Mary Field. He had a brother, Edward Sheffield Cassan, and a sister, Flora Kathleen Sheffield Cassan, who became an actress known as Flora Sheffield.\n\nHis father was born in Ireland and his mother in England. They were married in London in 1892. Matthew died when Reginald was nine. In 1913 Reginald (billed as Eric Desmond) appeared in David Copperfield. In 1914, Alice Sheffield and her children emigrated to the United States, where they lived in Queens, New York. Reginald acted on the stage and in films. While his sister Flora was an actress, brother Edward worked as an accountant in a bank and later became a theatrical agent.\n\nSheffield's Broadway performances credited as Reggie Sheffield include Evidence (1914), in which his mother also appeared, The Merry Wives of Windsor (1916), If (1917), The Betrothal (1918), and Helena's Boys (1924). His performances credited as Reginald Sheffield include Youth (1920), The Way Things Happen (1924), Hay Fever (1925), Slaves All (1926), Soldiers and Women (1929), and Dear Old England (1930).\n\nReginald Sheffield was married in 1927 to Louise Van Loon (21 January 1905 – 14 April 1987), a New York-born Vassar College graduate with a liberal arts education. The couple had three children:  Mary Alice Sheffield Cassan (born 1928), Jon Matthew Sheffield Cassan (11 April 1931 – 15 October 2010) (aka actor Johnny Sheffield), and William Hart Sheffield Cassan (15 July 1935 – 12 December 2010) (actor Billy Sheffield).\n\nAs film production became more and more located in Southern California, Sheffield and his wife travelled back and forth between New York City and Los Angeles. After several years they moved permanently to the West Coast.\n\nBeing a trained stage actor, Sheffield easily made the transition from silent films to talkies. He was a working actor who became memorable in numerous character and supporting roles and appeared with some of the greatest film stars of the day, including Constance Bennett, William Powell, George Arliss, Loretta Young, Gary Cooper, Errol Flynn, Rosalind Russell, Cary Grant and Joan Fontaine.\n\nIn 1954, he began starring as Professor Mayberry in the television series Rocky Jones, Space Ranger. And after his son, Johnny Sheffield [of first the Tarzan then the Bomba films series], appeared in his last jungle film in 1955, Reginald created, produced and directed a pilot for a television series, Bantu, the Zebra Boy, but a sponsor was not found and the show was never produced as a weekly series.\n\nSheffield acted in both versions, 1938 and 1958, of Cecil B. DeMille's The Buccaneer, the latter being his last screen appearance.\n\nReginald Sheffield died 8 December 1957 at his home in Pacific Palisades, California, aged 56.",
        "birthday": "1901-02-18",
        "deathday": "1957-12-08",
        "gender": 2,
        "homepage": null,
        "id": 86349,
        "imdb_id": "nm0221439",
        "known_for_department": "Acting",
        "name": "Reginald Sheffield",
        "place_of_birth": "London, England, UK",
        "popularity": 0.0418,
        "profile_path": "/2vdJFsjZJxXs0QBdH21HG3wShWf.jpg"
    }
}