{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9Ebn8atCcGk5OZrx4xmoTobAxoh.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 1581,
                "original_language": "en",
                "original_title": "The Holiday",
                "overview": "Two women, one American and one British, swap homes at Christmastime following bad breakups. Each woman finds romance with a local man but realizes that the imminent return home may end the relationship.",
                "popularity": 6.9861,
                "poster_path": "/h1ITOpvJN3Tw4Sy60w2QTfYMvdd.jpg",
                "release_date": "2006-12-05",
                "title": "The Holiday",
                "video": false,
                "vote_average": 7.092,
                "vote_count": 5340,
                "character": "Limo Driver",
                "credit_id": "630b5691b3e627007d455115",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/D3eDUNEzJPBDG3TCJcR7RyRgTA.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 96721,
                "original_language": "en",
                "original_title": "Rush",
                "overview": "In the 1970s, a rivalry propels race car drivers Niki Lauda and James Hunt to fame and glory — until a horrible accident threatens to end it all.",
                "popularity": 9.7222,
                "poster_path": "/cyfncP1YKDNcGb0agE7RQr6UOYr.jpg",
                "release_date": "2013-09-02",
                "title": "Rush",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 7473,
                "character": "British Journalist",
                "credit_id": "5cbf9370c3a368776c8a3471",
                "order": 55
            },
            {
                "adult": false,
                "backdrop_path": "/pQQggUuDMleFSl2tQYxzTmKIiLU.jpg",
                "genre_ids": [
                    12,
                    9648,
                    80
                ],
                "id": 497582,
                "original_language": "en",
                "original_title": "Enola Holmes",
                "overview": "While searching for her missing mother, intrepid teen Enola Holmes uses her sleuthing skills to outsmart big brother Sherlock and help a runaway lord.",
                "popularity": 7.4407,
                "poster_path": "/riYInlsq2kf1AWoGm80JQW5dLKp.jpg",
                "release_date": "2020-09-23",
                "title": "Enola Holmes",
                "video": false,
                "vote_average": 7.249,
                "vote_count": 6265,
                "character": "Conductor (uncredited)",
                "credit_id": "5dc645f09c24fc0015c077d1",
                "order": 35
            },
            {
                "adult": false,
                "backdrop_path": "/x4OYcZVHggyZHOrvkCo2HH9kLkF.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 4348,
                "original_language": "en",
                "original_title": "Pride & Prejudice",
                "overview": "A story of love and life among the landed English gentry during the Georgian era. Mr. Bennet is a gentleman living in Hertfordshire with his overbearing wife and five daughters, but if he dies their house will be inherited by a distant cousin whom they have never met, so the family's future happiness and security is dependent on the daughters making good marriages.",
                "popularity": 9.6,
                "poster_path": "/jnsoq5q98DQaE8yw6WZH0F9dW5G.jpg",
                "release_date": "2005-09-16",
                "title": "Pride & Prejudice",
                "video": false,
                "vote_average": 8.06,
                "vote_count": 8407,
                "character": "Meryton Milliner",
                "credit_id": "5f4c565f12aabc0034a8d3de",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джей Симпсон"
        ],
        "biography": "Jay Simpson is a prolific English film, television and stage actor. Most recently, he has appeared in Chernobyl and Frontier.\n\nSimpson is perhaps best known in television for portraying cockney desk sergeant Ian 'Brookie' Brooke in Foyle's War, and he has also appeared on television in Recovery with David Tennant and Sarah Parish, Hot Money, Bad Crowd, A Touch of Frost, Casualty, Primeval, The Bill, Peep Show, Rome, Ashes to Ashes, Murder in Suburbia and Soundproof. Jay also uses his charm and voice skills as he is the voice of 'The Tree of Temptation' in Big Brother.\n\nHis films include Hush Your Mouth, The Holiday, Pride and Prejudice and Erik the Viking and the 1988 TV film The Firm with Gary Oldman. He also voiced a major character, Flea, in the 2008 English language DVD re-release of the cult 2006 Norwegian animated film, Free Jimmy, alongside Woody Harrelson and with dialogue written by Simon Pegg. The character of Flea was something of comedy relief in the film, with a character partly inspired by Sean Ryder.\n\nIn 2008 he appeared alongside Ross Boatman and Roger Lloyd-Pack in Patrick Marber's play Dealer's Choice for a run on the West End. In 2011 he appeared as George Redman in the television film The Suspicions of Mr Whicher for ITV.\n\nIn 2011, he appeared in \"The National Anthem\", an episode of the anthology series Black Mirror\n\nOn 13 April 2012, he appeared as Stretch in the sitcom Not Going Out and appeared in the ITV series Mrs Biggs as one of the great train robbers, Bruce Reynolds.",
        "birthday": "1966-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.eamonnbedford.com/jaysimpson/",
        "id": 86467,
        "imdb_id": "nm0801043",
        "known_for_department": "Acting",
        "name": "Jay Simpson",
        "place_of_birth": "London, England, UK",
        "popularity": 2.6826,
        "profile_path": "/4UDQaaRqvMqPwJbUxJVZ7u6P7Wt.jpg"
    }
}