{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pRSTtNlcADoQkfeBGtFQNE1FDpb.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 5548,
                "original_language": "en",
                "original_title": "RoboCop",
                "overview": "In a violent, near-apocalyptic Detroit, evil corporation Omni Consumer Products wins a contract from the city government to privatize the police force. To test their crime-eradicating cyborgs, the company leads street cop Alex Murphy into an armed confrontation with crime lord Boddicker so they can use his body to support their untested RoboCop prototype. But when RoboCop learns of the company's nefarious plans, he turns on his masters.",
                "popularity": 6.3886,
                "poster_path": "/esmAU0fCO28FbS6bUBKLAzJrohZ.jpg",
                "release_date": "1987-07-17",
                "title": "RoboCop",
                "video": false,
                "vote_average": 7.347,
                "vote_count": 5425,
                "character": "Emergency Doctor",
                "credit_id": "52fe440dc3a36847f807f771",
                "order": 50
            },
            {
                "adult": false,
                "backdrop_path": "/zSFuvi6fIPT8CHpH1KMG25T2Iub.jpg",
                "genre_ids": [
                    80,
                    18,
                    878,
                    53
                ],
                "id": 281,
                "original_language": "en",
                "original_title": "Strange Days",
                "overview": "Former policeman Lenny Nero has moved into a more lucrative trade: the illegal sale of virtual reality-like recordings that allow users to experience the emotions and past experiences of others. While they typically contain tawdry incidents, Nero is shocked when he receives one showing a murder.",
                "popularity": 6.275,
                "poster_path": "/rY5BrDRcYAKE0BYmmT66YG6Uy5Q.jpg",
                "release_date": "1995-10-13",
                "title": "Strange Days",
                "video": false,
                "vote_average": 7.004,
                "vote_count": 1431,
                "character": "Lane",
                "credit_id": "5de0b3390cd4460014333913",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nDavid Packer (born August 25, 1962) is an American actor. He was born in Passaic, New Jersey.\n\nHis first starring role was as the human traitor Daniel Bernstein in the 1983 NBC miniseries V. He reprised the role in the 1984 sequel V: The Final Battle.\n\nPacker subsequently appeared in such films as You Can't Hurry Love, Strange Days, True Crime and Infested. In 1994, he received the Cable Ace Award for his role as Leo in the 1993 television series Big Al. He also appeared in the video game, Double Switch as Jeff, who leads the band Scream and has made guest appearances in numerous television shows such as ER, Fame, St. Elsewhere, The Division, CSI: Crime Scene Investigation, CSI: NY and M*A*S*H.\n\nPacker was good friends with V co-star Dominique Dunne and was rehearsing a scene with her for V the night she was murdered by her boyfriend.\n\nDescription above from the Wikipedia article David Packer, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1962-08-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 86542,
        "imdb_id": "nm0655478",
        "known_for_department": "Acting",
        "name": "David Packer",
        "place_of_birth": "Passaic, New Jersey, USA",
        "popularity": 0.1776,
        "profile_path": "/fmIUl1AVx9TYEwtC5TXBUdLIpyq.jpg"
    }
}