{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oCCvZEbqCCcALQtah8HJm9Ja4HT.jpg",
                "genre_ids": [
                    18
                ],
                "id": 323272,
                "original_language": "en",
                "original_title": "War Room",
                "overview": "The family-friendly movie explores the transformational role prayer plays in the lives of the Jordan family. Tony and Elizabeth Jordan, a middle-class couple who seemingly have it all – great jobs, a beautiful daughter, their dream home. But appearances can be deceiving. In reality, the Jordan’s marriage has become a war zone and their daughter is collateral damage. With the help of Miss Clara, an older, wiser woman, Elizabeth discovers she can start fighting for her family instead of against them. Through a newly energized faith, Elizabeth and Tony’s real enemy doesn’t have a prayer.",
                "popularity": 5.9171,
                "poster_path": "/unxQeVUi5DH01r7ZNvAHwpvX7UK.jpg",
                "release_date": "2015-08-28",
                "title": "War Room",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 556,
                "character": "Jump Rope Judge",
                "credit_id": "5fc19ac0cf9ba30041c03b56",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gary Wheeler is an award-winning North Carolina-based film producer who has developed movie and television projects internationally. He is the founder and president of Level Path Productions. Wheeler's recent projects include Final Solution, a critically acclaimed theatrical release shot in South Africa starring Tony Award winner John Kani, Midnight Clear, a Christmas Special starring Stephen Baldwin and The List, a legal thriller starring Malcolm McDowell, Hilarie Burton and Will Patton which was based on the novel of the same name by Robert Whitlow.\n\nWheeler is known for making films with strong Christian themes. Wheeler often talks openly about his beliefs and how they have impacted his film career. For this reason, he is a recognized figure in the growing Christian-film industry and acts as a board member of the International Christian Visual Media organization.\n\nDescription above from the Wikipedia article Gary Wheeler (filmmaker), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 86932,
        "imdb_id": "nm1088868",
        "known_for_department": "Production",
        "name": "Gary Wheeler",
        "place_of_birth": null,
        "popularity": 0.2071,
        "profile_path": "/hkcWlYYa5fWi9ZLGDme3d6t9t0m.jpg"
    }
}