{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fEaZwgkX2k91LJZ5APkaK0aDwg1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 321741,
                "original_language": "en",
                "original_title": "Concussion",
                "overview": "A dramatic thriller based on the incredible true David vs. Goliath story of American immigrant Dr. Bennet Omalu, the brilliant forensic neuropathologist who made the first discovery of CTE, a football-related brain trauma, in a pro player and fought for the truth to be known. Omalu's emotional quest puts him at dangerous odds with one of the most powerful institutions in the world.",
                "popularity": 2.0863,
                "poster_path": "/uuRFr7Jhsq7bITDyyvxZrQMAr9e.jpg",
                "release_date": "2015-11-12",
                "title": "Concussion",
                "video": false,
                "vote_average": 7.082,
                "vote_count": 2627,
                "character": "Daniel Sullivan",
                "credit_id": "54c8853bc3a368700600147b",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/oQ024BtJgArg8WI4zfuc2vkCJno.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 363676,
                "original_language": "en",
                "original_title": "Sully",
                "overview": "On 15 January 2009, the world witnessed the 'Miracle on the Hudson' when Captain 'Sully' Sullenberger glided his disabled plane onto the Hudson River, saving the lives of all 155 souls aboard. However, even as Sully was being heralded by the public and the media for his unprecedented feat of aviation skill, an investigation was unfolding that threatened to destroy his reputation and career.",
                "popularity": 5.9412,
                "poster_path": "/4vs83YcJ8TsabADDtaeCJ6ZTjYY.jpg",
                "release_date": "2016-09-07",
                "title": "Sully",
                "video": false,
                "vote_average": 7.197,
                "vote_count": 7442,
                "character": "Charles Porter",
                "credit_id": "57d253e8c3a3685b4800093a",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Edward O'Malley (born October 31, 1966) is an American actor and writer who has appeared in films and television series. Born in Boston and raised in New Hampshire, O'Malley hosted the early 1990s children's game show Nickelodeon Guts before moving to Los Angeles later that decade to star in his own sitcom for NBC called The Mike O'Malley Show. He is best known for his role as Jimmy Hughes on Yes, Dear, a CBS series which aired from 2000 to 2006. He was nominated for an Emmy Award for his role as Burt Hummel on the Fox series Glee.\n\nO'Malley has also guest-starred in series including My Name Is Earl, Raising Hope, Parenthood and Parks and Recreation, and has appeared in films including 28 Days, Deep Impact, Leatherheads, Eat, Pray, Love, R.I.P.D., Concussion and Sully.\n\nO'Malley is also a published playwright whose plays include Three Years From Thirty and Diverting Devotion. He adapted another play called Searching for Certainty for Peter Askin's film Certainty, which premiered at the Boston Film Festival in 2011. O'Malley is also a writer on Showtime's hit drama Shameless.\n\nO'Malley was the creator and an executive producer of the Starz series Survivor's Remorse, which ran for four seasons between 2014 and 2017.",
        "birthday": "1966-10-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 87192,
        "imdb_id": "nm0005282",
        "known_for_department": "Acting",
        "name": "Mike O'Malley",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.6255,
        "profile_path": "/q5T34bdF9BhQ6N95I8b6pzUM8KQ.jpg"
    }
}