{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjnfM8QmrXQkWl8dUimsDGl73el.jpg",
                "genre_ids": [
                    12,
                    10749,
                    36
                ],
                "id": 10907,
                "original_language": "en",
                "original_title": "The Adventures of Robin Hood",
                "overview": "Robin Hood fights nobly for justice against the evil Sir Guy of Gisbourne while striving to win the hand of the beautiful Maid Marian.",
                "popularity": 2.6754,
                "poster_path": "/4mazyXEMkmLw5h6076yyNSm9uv0.jpg",
                "release_date": "1938-05-13",
                "title": "The Adventures of Robin Hood",
                "video": false,
                "vote_average": 7.484,
                "vote_count": 800,
                "character": "Robin Hood",
                "credit_id": "52fe43ce9251416c7501ed8b",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Errol Leslie Flynn",
            "Errol Leslie Thomson Flynn"
        ],
        "biography": "Errol Leslie Thomson Flynn (June 20, 1909 - October 14, 1959) was an Australian-American actor and writer. He is popularly remembered as a charismatic romantic hero in the eight films he starred in with Olivia de Havilland. Flynn’s most iconic role came as Robin Hood in \"The Adventures of Robin Hood\" (1938).\n\nAfter signing with Warner Bros. Pictures in January 1935, Flynn’s rise to stardom was swift. The studio decided to take a risk casting the unknown 26-year-old as the lead in \"Captain Blood\" (1935). The film established Flynn as a major Hollywood star and the natural successor to Douglas Fairbanks. The smash hit was followed up by \"The Charge of the Light Brigade\" (1936) and \"The Adventures of Robin Hood\" (1938), the most expensive film Warner Bros. had made up to that time. In spite of his Australian accent, Flynn starred in the enormously successful westerns \"Dodge City\" (1939), \"Virginia City\" (1940), \"Santa Fe Trail\" (1940), and \"They Died with Their Boots On\" (1941). The popularly of these westerns played a part in the genre’s revival.\n\nIn late 1942, Flynn was charged with statutory rape of two 17-year-old girls. Despite his acquittal, press coverage of the trial led to the ubiquity of the expression, “In like Flynn.” With America’s involvement in WWII, Flynn had tried to enlist but was rated 4-F due to his enlarged heart, latent pulmonary tuberculosis and recurrent malaria (contracted in New Guinea). During the war, he made several films with the director Raoul Walsh. These include \"Gentleman Jim\" (1942) – one of Flynn’s favorite roles – and war films such as \"Desperate Journey\" (1942) and \"Objective, Burma!\" (1945).\n\nEmbittered by his public image as a womanizer and his inability to serve in the war, Flynn further descended into a life of drug-addiction and alcoholism. His slow deflation became apparent in the waning success of his films and his aging physical appearance. By the late '50s, Flynn mounted a comeback with his turns in \"The Sun Also Rises\" (1957), \"Too Much, Too Soon\" (1958) and \"The Roots of Heaven\" (1958). In 1959, he died of a heart attack in Vancouver, Canada. Flynn’s notorious autobiography \"My Wicked, Wicked Ways\" (1959) was posthumously published. He also wrote two novels: \"Beam Ends\" (1937) and \"Showdown\" (1946).",
        "birthday": "1909-06-20",
        "deathday": "1959-10-14",
        "gender": 2,
        "homepage": null,
        "id": 8724,
        "imdb_id": "nm0001224",
        "known_for_department": "Acting",
        "name": "Errol Flynn",
        "place_of_birth": "Hobart, Tasmania, Australia",
        "popularity": 0.7874,
        "profile_path": "/x7yOzNMVCQzt7UQYy8Po3GNrR0I.jpg"
    }
}