{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Melanie Hamilton",
                "credit_id": "52fe4274c3a36847f801fe1f",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/yjnfM8QmrXQkWl8dUimsDGl73el.jpg",
                "genre_ids": [
                    12,
                    10749,
                    36
                ],
                "id": 10907,
                "original_language": "en",
                "original_title": "The Adventures of Robin Hood",
                "overview": "Robin Hood fights nobly for justice against the evil Sir Guy of Gisbourne while striving to win the hand of the beautiful Maid Marian.",
                "popularity": 3.1216,
                "poster_path": "/4mazyXEMkmLw5h6076yyNSm9uv0.jpg",
                "release_date": "1938-05-13",
                "title": "The Adventures of Robin Hood",
                "video": false,
                "vote_average": 7.481,
                "vote_count": 799,
                "character": "Maid Marian",
                "credit_id": "52fe43ce9251416c7501ed8f",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Olivia Mary de Havilland",
            "Livvie",
            "Olivia De Havilland",
            "Olivia DeHavilland",
            "Олівія де Гевіленд",
            "올리비아 드 하빌랜드",
            "الیویا دی هاویلند"
        ],
        "biography": "Dame Olivia Mary de Havilland DBE was a British-American actress, whose career spanned from 1935 to 1988. She appeared in 49 feature films, and was one of the leading movie stars during the golden age of Classical Hollywood. She is best known for her early screen performances in The Adventures of Robin Hood (1938) and Gone with the Wind (1939), and her later award-winning performances in To Each His Own (1946), The Snake Pit (1948), and The Heiress (1949).\n\nBorn in Tokyo to British parents, de Havilland and her younger sister, actress Joan Fontaine, moved with their mother to California in 1919. They were brought up by their mother Lilian, a former stage actress who taught them drama, music, and elocution.\n\nOlivia de Havilland made her screen debut in Reinhardt's A Midsummer Night's Dream in 1935. During her career, she often played demure ingénues opposite popular leading men, including Errol Flynn, with whom she made nine films. They became one of Hollywood's most popular romantic on-screen pairings.\n\nShe achieved her initial popularity in romantic comedy films, such as The Great Garrick (1937), and in Westerns, such as Dodge City (1939). Her natural beauty and refined acting style made her particularly effective in historical period dramas, such as Anthony Adverse (1936), and romantic dramas, such as Hold Back the Dawn (1941).\n\nIn her later career, she was most successful in dramas, such as Light in the Piazza (1962), and unglamorous roles in psychological dramas including Hush… Hush, Sweet Charlotte (1964). In addition to her film career, de Havilland continued her work in the theatre, appearing three times on Broadway. She also worked in television, appearing in the successful miniseries, Roots: The Next Generations (1979), and television feature films, such as Anastasia: The Mystery of Anna, for which she received a Primetime Emmy Award nomination.\n\nDuring her film career, de Havilland won two Academy Awards, two Golden Globe Awards, two New York Film Critics Circle Awards, the National Board of Review Award for Best Actress, and the Venice Film Festival Volpi Cup. For her contributions to the motion picture industry, she received a star on the Hollywood Walk of Fame. For her lifetime contribution to the arts, she received the National Medal of Arts from President George W. Bush, and was appointed a Chevalier of the Légion d'honneur by French President Nicolas Sarkozy.\n\nDe Havilland and Joan Fontaine are the only siblings to have won Academy Awards in a lead acting category. A lifelong rivalry between the two actresses resulted in an estrangement that lasted over three decades. De Havilland lived in Paris since 1956, and celebrated her 100th birthday on July 1, 2016.\n\nIn June 2017, two weeks before her 101st birthday, de Havilland was appointed Dame Commander of the Order of the British Empire in the 2017 Birthday Honours for services to drama. She was the oldest woman ever to receive the honour. In a statement, she called it \"the most gratifying of birthday presents\".",
        "birthday": "1916-07-01",
        "deathday": "2020-07-26",
        "gender": 1,
        "homepage": null,
        "id": 8725,
        "imdb_id": "nm0000014",
        "known_for_department": "Acting",
        "name": "Olivia de Havilland",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 0.372,
        "profile_path": "/9pIjSCaOSIp9IbMVUaZhQ4dWc9F.jpg"
    }
}