{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjnfM8QmrXQkWl8dUimsDGl73el.jpg",
                "genre_ids": [
                    12,
                    10749,
                    36
                ],
                "id": 10907,
                "original_language": "en",
                "original_title": "The Adventures of Robin Hood",
                "overview": "Robin Hood fights nobly for justice against the evil Sir Guy of Gisbourne while striving to win the hand of the beautiful Maid Marian.",
                "popularity": 2.6754,
                "poster_path": "/4mazyXEMkmLw5h6076yyNSm9uv0.jpg",
                "release_date": "1938-05-13",
                "title": "The Adventures of Robin Hood",
                "video": false,
                "vote_average": 7.484,
                "vote_count": 800,
                "character": "Will Scarlett",
                "credit_id": "52fe43ce9251416c7501edd1",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/hwMWJ8G5173SGCHzrm0mVjvESaY.jpg",
                "genre_ids": [
                    27,
                    18
                ],
                "id": 13666,
                "original_language": "en",
                "original_title": "The Wolf Man",
                "overview": "After his brother's death, Larry Talbot returns home to his father and the family estate. Events soon take a turn for the worse when Larry is bitten by a werewolf.",
                "popularity": 1.1972,
                "poster_path": "/vG8fu5syTtQLzK1hQXyi3ugOPNF.jpg",
                "release_date": "1941-12-12",
                "title": "The Wolf Man",
                "video": false,
                "vote_average": 7.012,
                "vote_count": 645,
                "character": "Frank Andrews",
                "credit_id": "52fe45889251416c75059d0d",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Reginald Lawrence Knowles",
            "Pat Knowles"
        ],
        "biography": "Reginald Lawrence Knowles (11 November 1911 – 23 December 1995) was an English film actor who renamed himself Patric Knowles, a name which reflects his Irish descent. He appeared in films of the 1930s through the 1970s. He made his film debut in 1933, and played either first or second film leads throughout his career.\n\nIn his first American film, Give Me Your Heart (1936), released in Great Britain as Sweet Aloes, Knowles was cast as a titled Englishman of means.\n\nWhile making The Charge of the Light Brigade (1936) at Lone Pine, California, he befriended Errol Flynn, whose acquaintance he had made when both were under contract to Warner Bros. in England. Since that film, in which Knowles played the part of Capt. Perry Vickers, the brother of Flynn's Maj. Geoffrey Vickers, he was cast more frequently as straitlaced characters alongside Flynn's flamboyant ones, notably as Will Scarlet in The Adventures of Robin Hood (1938). Both actors starred as well in Four's A Crowd, also in 1938.\n\nMore than two decades after Flynn's death, biographer Charles Higham sullied Flynn's memory by accusing him of having been a fascist sympathizer and Nazi spy. Knowles, who had served in World War II as a flying instructor in the RCAF, came to Flynn's defense, writing Rebuttal for a Friend as an epilogue to Tony Thomas' Errol Flynn: The Spy Who Never Was (Citadel Press, 1990) ISBN 080651180X.\n\nKnowles was a freelance film actor from 1939 until his last film appearance in 1973. In the 1940s, he was known for playing protagonists in a number of horror films, including The Wolf Man (1941) and Frankenstein Meets the Wolfman (1943).\n\nKnowles was also cast as comic foils in a number of comedies such as Abbott and Costello's Who Done It? (1942) and Hit The Ice (1943). He also appeared opposite Jack Kelly in a 1957 episode of the television series Maverick called \"The Wrecker\", which was based on a Robert Louis Stevenson adventure and co-starred James Garner.\n\nKnowles was inducted into the Hollywood Walk of Fame and wrote a novel called Even Steven (Vantage Press, 1960) ASIN B0006RMC2G. He was cremated. His ashes were either given to a friend or family.\n\nDescription above from the Wikipedia article Patric Knowles, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1911-11-11",
        "deathday": "1995-12-23",
        "gender": 2,
        "homepage": null,
        "id": 8726,
        "imdb_id": "nm0461549",
        "known_for_department": "Acting",
        "name": "Patric Knowles",
        "place_of_birth": "Horsforth, Yorkshire, England, UK",
        "popularity": 0.3699,
        "profile_path": "/sponrKX5PpUydRstnn69KjD1qpQ.jpg"
    }
}