{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGDXh6QU6CRqHVXfoYOBwqEnBVO.jpg",
                "genre_ids": [
                    28,
                    36,
                    10752
                ],
                "id": 10590,
                "original_language": "en",
                "original_title": "We Were Soldiers",
                "overview": "The story of the first major battle of the American phase of the Vietnam War and the soldiers on both sides that fought it.",
                "popularity": 3.285,
                "poster_path": "/d5uupBAORxnFNbkNQ2G0Bi2cpY8.jpg",
                "release_date": "2002-03-01",
                "title": "We Were Soldiers",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 2147,
                "character": "Catherine Metsker",
                "credit_id": "55d210bec3a36877570044aa",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Amy Young",
            "بلامی یانگ"
        ],
        "biography": "Bellamy Young (born Amy Young) is an American television, film, and theatre actress.\n\nShe has starred on TV as Margaret Honeycutt on Promised Land, Jessica Whitly on Prodigal Son, and Mellie Grant on Scandal. She's had recurring roles as Beth Clemmons, Hotchner's love interest, on Criminal Minds, Dr. Miller on Scrubs, Ellen Darling on Dirty Sexy Money, Assistant State's Attorney Monica West on CSI: Miami, Diane Shaw on American Dreams, and Twyla Gentry on Peacemakers.\n\nShe has guest starred on numerous television shows including Castle, Supernatural, Law & Order, Law & Order: LA, The Mentalist, The West Wing, United States of Tara, NCIS, Grey's Anatomy, Drop Dead Diva, Franklin & Bash, Medium, Ghost Whisperer, The X-Files, Two and a Half Men, Frasier, Cold Case, Private Practice, Boston Legal, ER, Nash Bridges, and General Hospital.\n\nShe also has appeared in movies, with roles in A Wrinkle in Time, We Were Soldiers, and Mission: Impossible III. In addition to television and film, she has starred in several Broadway shows including The Life and Randy Newman's Faust.",
        "birthday": "1970-02-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 87280,
        "imdb_id": "nm0949292",
        "known_for_department": "Acting",
        "name": "Bellamy Young",
        "place_of_birth": "Asheville, North Carolina, USA",
        "popularity": 1.2257,
        "profile_path": "/9ZztKPFuqzOnSZ2spQ6BDkfCxl9.jpg"
    }
}