{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hmiC0MsI0PDd1TJXC62xyw0tX0s.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 3078,
                "original_language": "en",
                "original_title": "It Happened One Night",
                "overview": "A runaway heiress makes a deal with the rogue reporter trailing her but the mismatched pair end up stuck with each other when their bus leaves them behind.",
                "popularity": 3.4083,
                "poster_path": "/2PNUGWAflH6UUumas0POMmokHlc.jpg",
                "release_date": "1934-02-22",
                "title": "It Happened One Night",
                "video": false,
                "vote_average": 7.823,
                "vote_count": 1323,
                "character": "Danker",
                "credit_id": "52fe4383c3a36847f8059c7b",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/yjnfM8QmrXQkWl8dUimsDGl73el.jpg",
                "genre_ids": [
                    12,
                    10749,
                    36
                ],
                "id": 10907,
                "original_language": "en",
                "original_title": "The Adventures of Robin Hood",
                "overview": "Robin Hood fights nobly for justice against the evil Sir Guy of Gisbourne while striving to win the hand of the beautiful Maid Marian.",
                "popularity": 2.6907,
                "poster_path": "/4mazyXEMkmLw5h6076yyNSm9uv0.jpg",
                "release_date": "1938-05-13",
                "title": "The Adventures of Robin Hood",
                "video": false,
                "vote_average": 7.481,
                "vote_count": 799,
                "character": "Little John",
                "credit_id": "52fe43ce9251416c7501edd9",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Allan Hale",
            "Alan Hale Sr.",
            "Rufus Edward MacKahan",
            "Rufus Alan MacKahan"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nAlan Hale Sr. (born Rufus Edward Mackahan; February 10, 1892 – January 22, 1950) was an American movie actor and director, most widely remembered for his many supporting character roles, in particular as a frequent sidekick of Errol Flynn, as well as films supporting Lon Chaney, Wallace Beery, Douglas Fairbanks, James Cagney, Clark Gable, Cary Grant, Humphrey Bogart and Ronald Reagan, among dozens of others.  Hale was born Rufus Edward Mackahan in Washington, D.C. He studied to be an opera singer and also had success as an inventor. Among his innovations were a sliding theater chair (to allow spectators to slide back to admit newcomers rather than standing), the hand fire extinguisher, and greaseless potato chips.\n\nHis first film role was in the 1911 silent movie The Cowboy and the Lady. He played \"Little John\" in the 1922 film Robin Hood, with Douglas Fairbanks and Wallace Beery, reprised the role 16 years later in The Adventures of Robin Hood with Errol Flynn and Basil Rathbone, then played him yet again in Rogues of Sherwood Forest in 1950 with John Derek as Robin Hood's son, an unprecedented 28-year span of portrayals of the same character in theatrical films. Hale played Hugh O'Neill, Earl of Tyrone, in The Private Lives of Elizabeth and Essex (1939), featuring in a pivotal confrontation with the Earl of Essex, portrayed by Flynn.\n\nHis other films include the 1922 epic The Trap with Lon Chaney, 1928's Skyscraper; as well as Fog Over Frisco with Bette Davis; Miss Fane's Baby Is Stolen with Baby LeRoy and William Frawley; The Little Minister with Katharine Hepburn; and It Happened One Night with Clark Gable and Claudette Colbert; all released in 1934; the 1937 film Stella Dallas with Barbara Stanwyck; High, Wide, and Handsome with Irene Dunne and Dorothy Lamour; The Fighting 69th with James Cagney and Pat O'Brien; They Drive By Night with George Raft and Humphrey Bogart; Manpower with Edward G. Robinson, Marlene Dietrich, and George Raft; Virginia City with Errol Flynn, Randolph Scott, and Humphrey Bogart; and as the cantankerous Sgt. McGee in the 1943 movie This Is the Army with Irving Berlin. He also co-starred with Errol Flynn and Olivia de Havilland in the successful western film Dodge City (1939) where he played the slightly dimwitted but likeable and comical Rusty Hart, sidekick to Flynn's character, Sheriff Wade Hatton. Hale co-starred with Errol Flynn in 13 movies.\n\nHale directed eight movies during the 1920s and 1930s and acted in 235 theatrical films.",
        "birthday": "1892-02-09",
        "deathday": "1950-01-22",
        "gender": 2,
        "homepage": null,
        "id": 8729,
        "imdb_id": "nm0002118",
        "known_for_department": "Acting",
        "name": "Alan Hale",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 1.6319,
        "profile_path": "/e90MwAMkxjDqr3wOnOhDAjvylW5.jpg"
    }
}