{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x0pkoGlwWdkzRxgQioD3cUG0awu.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1000837,
                "original_language": "pt",
                "original_title": "Ainda Estou Aqui",
                "overview": "A woman married to a former politician during the 1971 military dictatorship in Brazil is forced to reinvent herself and chart a new course for her family after a violent and arbitrary act.",
                "popularity": 6.6253,
                "poster_path": "/quSUoX9zBrK7abP20fRf4d5YlXA.jpg",
                "release_date": "2024-09-19",
                "title": "I'm Still Here",
                "video": false,
                "vote_average": 7.962,
                "vote_count": 806,
                "character": "Eunice Paiva",
                "credit_id": "62d3d6253780620c6fab582f",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "フェルナンダ・トーレス",
            "费尔南达·托雷斯"
        ],
        "biography": "Fernanda Pinheiro Torres (Rio de Janeiro, September 15, 1965), is a Brazilian actress, writer, columnist and screenwriter. She is the daughter of Oscar-nominated actress Fernanda Montenegro and actor Fernando Torres.\n\nIn May 1986, she received the Best Actress Award at Cannes Festival for Arnaldo Jabor's \"Eu Sei Que Vou Te Amar\", at the age of 20.\n\nShe's married to movie producer and director Andrucha Waddington, who directed her and her mother in the 2005 film \"The House of Sand\". They have two sons together, Joaquim (b. 2000) and Antônio (born on April 10, 2008). She is also the stepmother of João (b. 1993) and Pedro (b. 1995).\n\nIn 2003, she wrote her first script (\"O Redentor\", 2004), with the assistance of her brother, cinematographer Cláudio Torres.\n\nIn 2025, she received the Golden Globe award for Best Actress in a Motion Picture - Drama and an Academy Award nomination for Best Actress in a Leading Role, both for her performance in \"I'm Still Here (Ainda Estou Aqui)\".",
        "birthday": "1965-09-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 87335,
        "imdb_id": "nm0868639",
        "known_for_department": "Acting",
        "name": "Fernanda Torres",
        "place_of_birth": "Rio de Janeiro, Rio de Janeiro, Brazil",
        "popularity": 0.3553,
        "profile_path": "/dkxdADNwbM7ZLQK5YBNeKBqVJNM.jpg"
    }
}