{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dzx5vStQX4bHA1JBq8n5yLUqQx4.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 37950,
                "original_language": "en",
                "original_title": "Charlie St. Cloud",
                "overview": "Accomplished sailor Charlie St. Cloud has the adoration of his mother Claire and his little brother Sam, as well as a college scholarship that will lead him far from his sleepy Pacific Northwest hometown. But his bright future is cut short when tragedy strikes and takes his dreams with it. After high school classmate Tess returns home unexpectedly, Charlie grows torn between honoring a promise he made four years earlier and moving forward with newfound love. As he finds the courage to let go of the past for good, Charlie discovers the soul most worth saving is his own.",
                "popularity": 5.5156,
                "poster_path": "/r4XSrs6N086EU8CNm339dHRPhZg.jpg",
                "release_date": "2010-07-30",
                "title": "Charlie St. Cloud",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 2192,
                "character": "Girl in Toy Store",
                "credit_id": "56f5b868c3a3686a610008f3",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brenna O'Brien (born March 9, 1991) is a Canadian actress. She is best known for voicing Rin in the anime series Inuyasha.\n\nO'Brien was in the original pilot of The Middle in 2007 also starring Ricki Lake and Atticus Shaffer. This pilot was then re-created in 2009 with the current cast. O'Brien began her acting career at age 9, performing in local theatre productions and school plays. Her first film role was in Scooby-Doo 2: Monsters Unleashed at the age of 12 and from there went on to guest star in such films and televisions shows such as Supernatural as the NSA demon secretary Cecily, Stargate SG-1, Meghan in Zixx: Level Two, X-Men: The Last Stand, Phantom Racer and Girl in Progress. She is an accomplished voice over actor, having worked as a guest star as well as lead roles in several anime series, including Inuyasha, Hamtaro, Gundam SEED Destiny, and Elemental Gelade. She was a lead voice in Marvel’s animated feature Next Avengers: Heroes of Tomorrow, Marvel series Iron Man: Armored Adventures and Nintendo’s Dragalia Lost.",
        "birthday": "1991-03-09",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.brennaobrien.net/",
        "id": 87736,
        "imdb_id": "nm1378650",
        "known_for_department": "Acting",
        "name": "Brenna O'Brien",
        "place_of_birth": "Brampton, Ontario, Canada",
        "popularity": 0.1994,
        "profile_path": "/uELRo1iat97rVeyBxCrpqy6v1OR.jpg"
    }
}