{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4840rkbpsiuow5ew155oVKcqJwj.jpg",
                "genre_ids": [
                    18
                ],
                "id": 615,
                "original_language": "en",
                "original_title": "The Passion of the Christ",
                "overview": "A graphic portrayal of the last twelve hours of Jesus of Nazareth's life.",
                "popularity": 8.8822,
                "poster_path": "/v9f9MMrq2nGQrN7cHnQRmEq9lSE.jpg",
                "release_date": "2004-02-25",
                "title": "The Passion of the Christ",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 4914,
                "character": "Poncio Pilato",
                "credit_id": "52fe425ec3a36847f8018d9d",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/tOfAkOf7TrAPuz4kKG5Fvq1seCd.jpg",
                "genre_ids": [
                    28,
                    53,
                    80,
                    18
                ],
                "id": 38234,
                "original_language": "en",
                "original_title": "Undisputed III: Redemption",
                "overview": "Russian inmate Boyka, now severely hobbled by the knee injury suffered at the end of Undisputed 2. No longer the feared prison fighter he was, he has declined so far that he is now good only for cleaning toilets. But when a new prison fight tournament begins - an international affair, matching the best fighters from prisons around the globe, enticing them with the promise of freedom for the winner - Boyka must reclaim his dignity and fight for his position in the tournament.",
                "popularity": 8.336,
                "poster_path": "/g8KB77SPA7SyU8eid6TAEpt9skU.jpg",
                "release_date": "2010-04-17",
                "title": "Undisputed III: Redemption",
                "video": false,
                "vote_average": 7.54,
                "vote_count": 956,
                "character": "Warden Kuss",
                "credit_id": "52fe46a19251416c9105a96f",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hristo Naumov Shopov",
            "Христо Наумов Шопов",
            "Христо Шопов"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nHristo Naumov Shopov (Bulgarian: Христо Наумов Шопов) (born January 4, 1964 in Sofia) is a Bulgarian actor. Shopov's father, Naum Shopov, is a famous Bulgarian actor as well.\n\nHe is most noted for his portrayal of Pontius Pilate in Mel Gibson's The Passion of the Christ. He has become one of Bulgaria's most successful actors, making his debut in 1981 with Dishay, choveche (Breathe, Little Man!). His body of work includes many Bulgarian films such as Vchera (Yesterday) and Sledvay me (Follow Me). He has also appeared in several low-budget US film productions including Phantom Force, Target of Opportunity and Alien Hunter. In his homeland, he is best known for his role in the movie Vchera, which became a symbol of several generations. The movie tells the story of young Bulgarian people studying in an English college during Communist rule.\n\nMary Soan, an assistant director of the film I Am David, suggested that he would be suited for the role of Pilate to Shaila Rubin, who was casting the film. After Hristo and Gibson had a brief conversation, Hristo was given the part. Shopov also played the role of Pontius Pilate in the 2006 film The Inquiry, which also cast Max von Sydow as Emperor Tiberius.\n\nHe recently played the Russian premier in the upcoming Command Performance starring and directed by Dolph Lundgren.\n\nDescription above from the Wikipedia article Hristo Naumov Shopov, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1964-01-04",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.hristoshopov.com/",
        "id": 8775,
        "imdb_id": "nm0794885",
        "known_for_department": "Acting",
        "name": "Hristo Shopov",
        "place_of_birth": "Sofia, Bulgaria",
        "popularity": 0.2103,
        "profile_path": "/5b3xNLQwZK15eUiy8QiTGQjJVCA.jpg"
    }
}