{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ejLsnT6KmMpvtoPHMp40m54hRDd.jpg",
                "genre_ids": [
                    12,
                    18,
                    53
                ],
                "id": 551,
                "original_language": "en",
                "original_title": "The Poseidon Adventure",
                "overview": "When their ocean liner capsizes, a group of passengers struggle to survive and escape.",
                "popularity": 2.4836,
                "poster_path": "/6RGiA5BfhelU9zoD0b1GAG4GWWf.jpg",
                "release_date": "1972-12-01",
                "title": "The Poseidon Adventure",
                "video": false,
                "vote_average": 7.11,
                "vote_count": 937,
                "character": "Purser",
                "credit_id": "54cb39c6c3a368709000f4b4",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Byron Webster made 1951 his film debut in Capitaine sans peur (1951). He moved to the USA in 1952 and settled in Chicago, Illinois. Acting assignments were few in Chicago, and he supplemented his income working for British European Airways. After some local area (Illinois) theatre work, he was cast in the NY company of \"The Killing of Sister George,\" and then in \"Funny Girl.\" Moving to Los Angeles in 1966, he appeared in the film version of \"Funny Girl\" and others, most notably as The Purser in L'aventure du Poséidon (1972). He toured and co-starred in national companies of \"Camelot\" and \"My Fair Lady\". Mr. Webster possessed a beautiful and powerful singing voice that was little used in his film and television appearances. He is perhaps best remembered by television fans as a regular cast member in the TV series Soap (1977). An avid Bridge player, he held Master Points and was often in Bridge tournaments. Always fighting a weight problem, he succumbed to heart failure December 1, 1991, at his home in Sherman Oaks, California.  - IMDb Mini Biography",
        "birthday": "1931-06-14",
        "deathday": "1991-12-01",
        "gender": 2,
        "homepage": null,
        "id": 88170,
        "imdb_id": "nm0916843",
        "known_for_department": "Acting",
        "name": "Byron Webster",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1174,
        "profile_path": "/qdjGcSb81uYsJVKYGhapkxu2sbw.jpg"
    }
}