{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/z51Wzj94hvAIsWfknifKTqKJRwp.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 120,
                "original_language": "en",
                "original_title": "The Lord of the Rings: The Fellowship of the Ring",
                "overview": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.",
                "popularity": 27.0563,
                "poster_path": "/6oom5QYQ2yQTMJIbnvbkBL9cHo6.jpg",
                "release_date": "2001-12-18",
                "title": "The Lord of the Rings: The Fellowship of the Ring",
                "video": false,
                "vote_average": 8.425,
                "vote_count": 26375,
                "character": "Arwen",
                "credit_id": "52fe421ac3a36847f800449b",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/mshaKLtPUxcDBhzau6qiObEblhL.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 121,
                "original_language": "en",
                "original_title": "The Lord of the Rings: The Two Towers",
                "overview": "Frodo Baggins and the other members of the Fellowship continue on their sacred quest to destroy the One Ring--but on separate paths. Their destinies lie at two towers--Orthanc Tower in Isengard, where the corrupt wizard Saruman awaits, and Sauron's fortress at Barad-dur, deep within the dark lands of Mordor. Frodo and Sam are trekking to Mordor to destroy the One Ring of Power while Gimli, Legolas and Aragorn search for the orc-captured Merry and Pippin. All along, nefarious wizard Saruman awaits the Fellowship members at the Orthanc Tower in Isengard.",
                "popularity": 17.4636,
                "poster_path": "/5VTN0pR8gcqV3EPUHHfMGnJYN9L.jpg",
                "release_date": "2002-12-18",
                "title": "The Lord of the Rings: The Two Towers",
                "video": false,
                "vote_average": 8.409,
                "vote_count": 22912,
                "character": "Arwen",
                "credit_id": "52fe421ac3a36847f8004595",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/2u7zbn8EudG6kLlBzUYqP8RyFU4.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 122,
                "original_language": "en",
                "original_title": "The Lord of the Rings: The Return of the King",
                "overview": "As armies mass for a final battle that will decide the fate of the world--and powerful, ancient forces of Light and Dark compete to determine the outcome--one member of the Fellowship of the Ring is revealed as the noble heir to the throne of the Kings of Men. Yet, the sole hope for triumph over evil lies with a brave hobbit, Frodo, who, accompanied by his loyal friend Sam and the hideous, wretched Gollum, ventures deep into the very dark heart of Mordor on his seemingly impossible quest to destroy the Ring of Power.​",
                "popularity": 23.019,
                "poster_path": "/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg",
                "release_date": "2003-12-17",
                "title": "The Lord of the Rings: The Return of the King",
                "video": false,
                "vote_average": 8.489,
                "vote_count": 25451,
                "character": "Arwen",
                "credit_id": "52fe421bc3a36847f8004703",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/inPupECvfe7cHuAwaEVBkDJjXZO.jpg",
                "genre_ids": [
                    18
                ],
                "id": 2355,
                "original_language": "en",
                "original_title": "Reign Over Me",
                "overview": "A man who lost his family in the September 11 attack on New York City runs into his old college roommate. Rekindling the friendship is the one thing that appears able to help the man recover from his grief.",
                "popularity": 5.2409,
                "poster_path": "/b5EtDvwj2gdG1qMBLijamlLfJLB.jpg",
                "release_date": "2007-03-22",
                "title": "Reign Over Me",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1123,
                "character": "Angela Oakhurst",
                "credit_id": "52fe4350c3a36847f804af3b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/vxhnRV7jGncAZmf0FFHMs6rFHWn.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749,
                    10402
                ],
                "id": 9591,
                "original_language": "en",
                "original_title": "That Thing You Do!",
                "overview": "A Pennsylvania band scores a hit in 1964 and rides the star-making machinery as long as it can, with lots of help from its manager.",
                "popularity": 3.2741,
                "poster_path": "/9RmZu33qHdyZFGLfhEOmkTjdNEu.jpg",
                "release_date": "1996-10-04",
                "title": "That Thing You Do!",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 874,
                "character": "Faye Dolan",
                "credit_id": "52fe450ec3a36847f80b9b97",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/mV2UZZHYiWPKH0AwtMSil1T7DUH.jpg",
                "genre_ids": [
                    878,
                    35,
                    18,
                    80
                ],
                "id": 84329,
                "original_language": "en",
                "original_title": "Robot & Frank",
                "overview": "Curmudgeonly old Frank lives by himself. His routine involves daily visits to his local library, where he has a twinkle in his eye for the librarian. His grown children are concerned about their father’s well-being and buy him a caretaker robot. Initially resistant to the idea, Frank soon appreciates the benefits of robotic support – like nutritious meals and a clean house – and eventually begins to treat his robot like a true companion. With his robot’s assistance, Frank’s passion for his old, unlawful profession is reignited, for better or worse.",
                "popularity": 1.7838,
                "poster_path": "/602vUwe1GPmaRvcrT3OQWqH1Nm1.jpg",
                "release_date": "2012-08-24",
                "title": "Robot & Frank",
                "video": false,
                "vote_average": 6.912,
                "vote_count": 1117,
                "character": "Madison",
                "credit_id": "52fe48eb9251416c9109cb07",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Liv Rundgren",
            "Liv Rundgren Tyler"
        ],
        "biography": "Liv Rundgren Tyler (born Liv Rundgren; July 1, 1977) is an American actress. She began a modelling career at age 14 before making her film debut in Silent Fall (1994); she went on to achieve critical recognition with starring roles in Heavy and Empire Records (both 1995), as well as That Thing You Do! and Stealing Beauty (both 1996). She then appeared in films such as Inventing the Abbotts (1997), Armageddon (1998), Cookie's Fortune and Onegin (both 1999), Dr. T & the Women (2000), and One Night at McCool's (2001). She then played the elf Arwen Undómiel in the Lord of the Rings film trilogy (2001–2003), which became one of the highest-grossing film series in history.\n\nFollowing the success of Lord of the Rings, Tyler has appeared in a variety of roles, including the films Jersey Girl (2004), Lonesome Jim (2005), Reign Over Me (2007), The Strangers, The Incredible Hulk (both 2008), Robot & Frank (2012), Space Station 76 (2014), Wildling (2018), and Ad Astra (2019). Outside of film, she starred in the HBO supernatural drama series The Leftovers (2014–2017), the BBC period drama series Gunpowder (2017), the ITV/Hulu period drama series Harlots (2018–2019), and the Foxprocedural drama series 9-1-1: Lone Star (2020).\n\nTyler is also a singer. Having sung with composer Howard Shore, she appeared as a guest vocalist on The Lemonheads' album Varshons (2009), singing a cover of the Leonard Cohen song \"Hey, That's No Way to Say Goodbye.\" She appeared on the 2017 bonus disc of Evan Dando's album Baby I'm Bored (2003), providing featured vocals for the song \"Shots Is Fired.\" In 2011, she released her debut single, \"Need You Tonight.\".\n\nTyler has served as a UNICEF Goodwill Ambassador for the United States since 2003 and as a spokesperson for Givenchy's line of perfume and cosmetics. She is the daughter of Steven Tyler and Bebe Buell, although she has a very close relationship with her adoptive father, Todd Rundgren.\n\nDescription above from the Wikipedia article Liv Tyler, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1977-07-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 882,
        "imdb_id": "nm0000239",
        "known_for_department": "Acting",
        "name": "Liv Tyler",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 2.5494,
        "profile_path": "/aYlqS4wYuNCiN9wmvDwKRAE9BQ9.jpg"
    }
}