{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/orSiH0y4r0BwFxNdWhNKkgPocQx.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 12919,
                "original_language": "en",
                "original_title": "Can't Buy Me Love",
                "overview": "Nerdy high schooler Ronald Miller rescues cheerleader Cindy Mancini from parental punishment after she accidentally destroys her mother's designer clothes. Ronald agrees to pay for the $1,000 outfit on one condition: that she will act as though they're a couple for an entire month. As the days pass, however, Cindy grows fond of Ronald, making him popular. But when Ronald's former best friend gets left behind, he realizes that social success isn't everything.",
                "popularity": 2.8466,
                "poster_path": "/qK3yiqo84U3twOOKOx81c407Hpr.jpg",
                "release_date": "1987-08-14",
                "title": "Can't Buy Me Love",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 686,
                "character": "Iris",
                "credit_id": "60388db909ed8f002de4a98f",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nDevin Renee DeVasquez (born June 25, 1963 in Baton Rouge, Louisiana) is an American model and actress. She was chosen as Playboy's Playmate of the Month in June 1985, after being featured in the October 1981 issue's college pictorial. Her centerfold was photographed by Richard Fegley. Her father was from Madrid, Spain and her mother is of Irish descent.\n\nShe appeared in Can't Buy Me Love with Patrick Dempsey and went on to star in Society with Billy Warlock. DeVasquez has appeared in over 100 commercials and authored the book, The Naked Truth About A Pinup Model which is about pinup modeling and includes an interview with Bettie Page. She married Ronn Moss, who played Ridge Forrester on the CBS series, The Bold and the Beautiful on September 25, 2009.\n\nShe dated pop star Prince in the mid-1980s.\n\nTo help those who were affected by Hurricane Katrina, DeVasquez created Devin's Kickass Cajun Seasoning and offered it through her business, DevRonn Enterprises.",
        "birthday": "1963-06-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 88526,
        "imdb_id": "nm0222233",
        "known_for_department": "Acting",
        "name": "Devin DeVasquez",
        "place_of_birth": "Baton Rouge, Louisiana, USA",
        "popularity": 0.2014,
        "profile_path": "/eO2WrdVda2unbUdgSVoj6Sif2Us.jpg"
    }
}