{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hSmX0ZyYZk2ECIWtJ1JSHINPZIK.jpg",
                "genre_ids": [
                    9648,
                    80,
                    53
                ],
                "id": 910,
                "original_language": "en",
                "original_title": "The Big Sleep",
                "overview": "Private Investigator Philip Marlowe is hired by wealthy General Sternwood regarding a matter involving his youngest daughter Carmen. Before the complex case is over, Marlowe sees murder, blackmail, deception, and what might be love.",
                "popularity": 4.0282,
                "poster_path": "/lraHo9D8c0YWfxsKqT5P5sVqMKN.jpg",
                "release_date": "1946-08-23",
                "title": "The Big Sleep",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1091,
                "character": "Lash Canino",
                "credit_id": "52fe428bc3a36847f80271bf",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/38uM6QuI06znUCELfOSiVQy05CX.jpg",
                "genre_ids": [
                    37
                ],
                "id": 301,
                "original_language": "en",
                "original_title": "Rio Bravo",
                "overview": "A small-town sheriff in the American West enlists the help of a disabled man, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.",
                "popularity": 5.654,
                "poster_path": "/4gI4KKmoi0d3yfsF71YU3S0I5t8.jpg",
                "release_date": "1959-03-18",
                "title": "Rio Bravo",
                "video": false,
                "vote_average": 7.813,
                "vote_count": 1204,
                "character": "Matt Harris (uncredited)",
                "credit_id": "5705357192514175fb000345",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bob Bradbury Jr.",
            "Robert Bradbury Jr.",
            "Robert Adrian Bradbury"
        ],
        "biography": "From Wikipedia, the free encyclopedia.                    \n\n                    \n\nBob Steele (January 23, 1907 - December 21, 1988) was an American actor. He was born Robert Adrian Bradbury in Portland, Oregon, into a vaudeville family. After years of touring, the family settled down in Hollywood in the late 1910s, where his father, Robert N. Bradbury, soon found work in the movies, first as an actor, later as a director, and by 1920, he hired Bob and his twin brother Bill (1907–1971) as juvenile leads for a series of adventure movies entitled \"The Adventures of Bob and Bill\".\n\nBob's career began to take off for good in 1927, when he was hired by production company Film Booking Offices of America (FBO) to star in a series of Westerns. Bob—who was rechristened Bob Steele at FBO—soon made a name for himself, and in the late 1920s, 1930s and 1940s starred in B-Westerns for almost every minor film studio, including Monogram, Supreme, Tiffany, Syndicate, Republic (including several films of the Three Mesquiteers series) and Producers Releasing Corporation (PRC) (including the initial films of their \"Billy the Kid\" series), plus he had the occasional role in an A-movie, as in the adaptation of John Steinbeck's novel, Of Mice and Men from 1939.\n\nIn the 1940s, Bob's career as a cowboy hero was on the decline, but he kept himself working by accepting supporting roles in many big movies like Howard Hawks' The Big Sleep, or the John Wayne vehicles Island in the Sky, Rio Bravo and Rio Lobo. Besides these he also made occasional appearances in science fiction films like Atomic Submarine and Giant from the Unknown and did lots of television work, culminating in a regular supporting role in the army comedy F Troop (1965–1967), which allowed him to show his comic talent. Steele played the character of Trooper Duffy who claimed to have been \"shoulder to shoulder with Davy Crockett at the Alamo\"-in fact Steele played in With Davy Crockett at the Fall of the Alamo in 1926.\n\nBob Steele died on December 21, 1988 from emphysema after a long sickness.\n\nBob Steele is said to have been the inspiration for the character \"Cowboy Bob\" in the Dennis The Menace comic strip.        \n\n                    \n\nDescription above from the Wikipedia article Bob Steele (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.                    ",
        "birthday": "1907-01-23",
        "deathday": "1988-12-21",
        "gender": 2,
        "homepage": null,
        "id": 88649,
        "imdb_id": "nm0824496",
        "known_for_department": "Acting",
        "name": "Bob Steele",
        "place_of_birth": "Portland, Oregon, USA",
        "popularity": 0.3755,
        "profile_path": "/jOaQFxwyNWRNEEdRoiiRaOVrOpK.jpg"
    }
}