{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2lfDV3DCNumvNyEhgsIGsrB19fs.jpg",
                "genre_ids": [
                    37,
                    12
                ],
                "id": 995,
                "original_language": "en",
                "original_title": "Stagecoach",
                "overview": "A group of people traveling on a stagecoach find their journey complicated by the threat of Geronimo, and learn something about each other in the process.",
                "popularity": 3.4391,
                "poster_path": "/zgMnfnwWZ3nkx4t0bUDEKtW24O8.jpg",
                "release_date": "1939-03-02",
                "title": "Stagecoach",
                "video": false,
                "vote_average": 7.625,
                "vote_count": 1172,
                "character": "Bit Part (uncredited)",
                "credit_id": "55515c749251416eba000fe0",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Paterson McGowan"
        ],
        "biography": "From Wikipedia\n\nJohn Paterson McGowan (February 24, 1880 – March 26, 1952) was a pioneering Hollywood actor and director and occasionally a screenwriter  and producer. J. P. McGowan, as he was usually known, remains the only Australian to have been made a life member of the Screen Directors Guild (now Directors Guild of America).\n\nBorn in the then-bustling railway centre of Terowie in South Australia, McGowan grew up in Adelaide (Islington) and Sydney. He was a capable horseman and served in the Second Boer War with Montmorency's Scouts as a special dispatch rider.\n\nMcGowan directed and often acted in the first 33 episodes of Kalem's 1914 adventure film series, The Hazards of Helen, which eventually ran to 54 episodes, some still with McGowan's participation. While filming he began a relationship with Helen Holmes, the film's star, and the two married. They left Kalem to set up their own production company, Signal Films, which successfully made a series of railroad melodramas but lost out when their distributor (Mutual) failed. The collaboration ended when they divorced in 1925. There was an adopted daughter, Kaye.\n\nMcGowan successfully made the transition from silent film to talkies. While never a major star, in a busy career that spanned four decades he is credited with acting in 232 films—mostly strong roles like sheriff or villain—writing 26 screenplays and directing 242 productions. In 1932 he directed a young John Wayne in the 12-episode rail vs airplane serial The Hurricane Express for the independent Mascot Pictures. From 1938 to 1951, as Executive Secretary of the Screen Directors Guild, he fought to secure recognition for the director within the studio systems of the film and emerging television industry.\n\nJ.P. McGowan died in 1952 in Hollywood and was interred in the Forest Lawn Memorial Park Cemetery in Glendale, California.",
        "birthday": "1880-02-23",
        "deathday": "1952-03-26",
        "gender": 2,
        "homepage": null,
        "id": 88717,
        "imdb_id": "nm0569645",
        "known_for_department": "Acting",
        "name": "J.P. McGowan",
        "place_of_birth": "Terowie, Australia",
        "popularity": 0.106,
        "profile_path": "/wgnKlARq4qwwpOr732Rvyta63Fk.jpg"
    }
}