{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rUAZnGMgISkZYJU8o7kuSNj3mPl.jpg",
                "genre_ids": [
                    28,
                    35,
                    10749
                ],
                "id": 22538,
                "original_language": "en",
                "original_title": "Scott Pilgrim vs. the World",
                "overview": "As bass guitarist for a garage-rock band, Scott Pilgrim has never had trouble getting a girlfriend; usually, the problem is getting rid of them. But when Ramona Flowers skates into his heart, he finds she has the most troublesome baggage of all: an army of ex-boyfriends who will stop at nothing to eliminate him from her list of suitors.",
                "popularity": 9.4823,
                "poster_path": "/g5IoYeudx9XBEfwNL0fHvSckLBz.jpg",
                "release_date": "2010-08-12",
                "title": "Scott Pilgrim vs. the World",
                "video": false,
                "vote_average": 7.49,
                "vote_count": 8202,
                "character": "Matthew Patel",
                "credit_id": "5fb843a0e640d6003e058340",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Satya Bhaba",
            "Satya Sorab Bhabha"
        ],
        "biography": "Satya Sorab Bhabha was born on December 13, 1983 in London.  He is a British actor best known for his breakout film roles in the Scott Pilgrim franchise and Salman Rushdie’s Midnight’s Children. He played Matthew Patel, the first “evil ex” in Scott Pilgrim vs. the World (2010).  Bhabha spent his early childhood in London and moved to the United States as a child – living in Chicago during his high school years. He later attended Yale University, where he studied theater, directed student productions, and earned the prestigious Louis Sudler Prize for Excellence in the Arts.  Besides acting, Bhabha is an accomplished musician: he is a classically trained cellist who has performed around the world with symphony orchestras and chamber ensembles. He has even played cello in an indie band. In recent years he has moved behind the camera as well, directing for television. He directed episodes of shows such as the HBO series Gossip Girl.  On television, Bhabha had a multi-episode recurring role as Shivrang on Fox’s sitcom New Girl.  His other screen credits include roles in indie films and shorts (eg, the coming-of-age comedy Dude in 2018), and ensemble projects with actors like Michael Cera and Anna Kendrick.",
        "birthday": "1983-12-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 88903,
        "imdb_id": "nm1440863",
        "known_for_department": "Acting",
        "name": "Satya Bhabha",
        "place_of_birth": "London, England, UK",
        "popularity": 0.798,
        "profile_path": "/22LbZ6odkgoPIpDJY3lJmNOHJPD.jpg"
    }
}