{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rUAZnGMgISkZYJU8o7kuSNj3mPl.jpg",
                "genre_ids": [
                    28,
                    35,
                    10749
                ],
                "id": 22538,
                "original_language": "en",
                "original_title": "Scott Pilgrim vs. the World",
                "overview": "As bass guitarist for a garage-rock band, Scott Pilgrim has never had trouble getting a girlfriend; usually, the problem is getting rid of them. But when Ramona Flowers skates into his heart, he finds she has the most troublesome baggage of all: an army of ex-boyfriends who will stop at nothing to eliminate him from her list of suitors.",
                "popularity": 9.4823,
                "poster_path": "/g5IoYeudx9XBEfwNL0fHvSckLBz.jpg",
                "release_date": "2010-08-12",
                "title": "Scott Pilgrim vs. the World",
                "video": false,
                "vote_average": 7.49,
                "vote_count": 8202,
                "character": "Knives Chau",
                "credit_id": "5fb8439f5f6c4900407ebafa",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ellen Wong was born in Ontario, Canada. The first film she watched in a movie theatre was \"Titanic\". Her favourite actress is Kate Winslet. Her first role was on the award winning television series \"This is Wonderland\". She is best known for her role as Knives Chau in \"Scott Pilgrim VS The World\", starring alongside Michael Cera, Mary Elizabeth Winstead and Jason Schwartzman. She auditioned against many hopefuls through an international talent search to fill the role of Knives Chau. Edgar Wright wanted to work with Ellen as she was able to showcase herself as a unique actress, with the ability to also take on intense fight choreography. During training for \"Scott Pilgrim VS The World\", the on-set trainer nicknamed Ellen, The Ellen-nator. She trains in WTF Taekwondo. Her favourite action stars are Michelle Yeoh, Tony Jaa, Jackie Chan, Bruce Lee, Yanin Vismitananda aka \"Jeeja\" Yanin, Jet Li.",
        "birthday": "1985-05-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 88902,
        "imdb_id": "nm2771798",
        "known_for_department": "Acting",
        "name": "Ellen Wong",
        "place_of_birth": "Scarborough, Ontario, Canada",
        "popularity": 0.3386,
        "profile_path": "/aJcsSflzYnGXiOaD7XkjPtnIPYz.jpg"
    }
}