{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rUAZnGMgISkZYJU8o7kuSNj3mPl.jpg",
                "genre_ids": [
                    28,
                    35,
                    10749
                ],
                "id": 22538,
                "original_language": "en",
                "original_title": "Scott Pilgrim vs. the World",
                "overview": "As bass guitarist for a garage-rock band, Scott Pilgrim has never had trouble getting a girlfriend; usually, the problem is getting rid of them. But when Ramona Flowers skates into his heart, he finds she has the most troublesome baggage of all: an army of ex-boyfriends who will stop at nothing to eliminate him from her list of suitors.",
                "popularity": 9.4823,
                "poster_path": "/g5IoYeudx9XBEfwNL0fHvSckLBz.jpg",
                "release_date": "2010-08-12",
                "title": "Scott Pilgrim vs. the World",
                "video": false,
                "vote_average": 7.49,
                "vote_count": 8202,
                "character": "Comeau",
                "credit_id": "5fb843a204733f003e1bdb9c",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/iVk4mVKwNE66JbBcoDwcYFvuUXM.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 68734,
                "original_language": "en",
                "original_title": "Argo",
                "overview": "As the Iranian revolution reaches a boiling point, a CIA 'exfiltration' specialist concocts a risky plan to free six Americans who have found shelter at the home of the Canadian ambassador.",
                "popularity": 5.276,
                "poster_path": "/m5gPWFZFIp4UJFABgWyLkbXv8GX.jpg",
                "release_date": "2012-10-11",
                "title": "Argo",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 8594,
                "character": "LA Times Reporter",
                "credit_id": "5fdd39e579b3d4003b286e30",
                "order": 61
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Franklin was born to father Howard Franklin, a screenwriter and director. His stepmother is DJ Anne Litt. Franklin attended high school at Campbell Hall School in Studio City, California. He graduated from New York University Tisch School of the Arts.\n\nFranklin's first major role was a recurring role as Nick, the I.T. worker on NBC's The Office. Franklin later went on to appear as a series regular on the short-lived FOX comedy series Traffic Light. He appears with another Office actor, David Denman, who played Pam's ex-fiancée Roy. His side projects include a short for Funny or Die: a fake commercial promoting the Dudes-N-Bros Talking Points System, which is a service that helps guys who aren't dudes or bros hold a conversation with dudes and bros. He co-starred on the CBS sitcom The Millers and appeared on FOX sitcom New Girl, the HBO political comedy Veep, Black-ish, and Abby's.",
        "birthday": "1985-07-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 88928,
        "imdb_id": "nm1815689",
        "known_for_department": "Acting",
        "name": "Nelson Franklin",
        "place_of_birth": null,
        "popularity": 0.2965,
        "profile_path": "/2YYnTxpFmS5i9qRkb6H4Nxky2px.jpg"
    }
}