{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rUAZnGMgISkZYJU8o7kuSNj3mPl.jpg",
                "genre_ids": [
                    28,
                    35,
                    10749
                ],
                "id": 22538,
                "original_language": "en",
                "original_title": "Scott Pilgrim vs. the World",
                "overview": "As bass guitarist for a garage-rock band, Scott Pilgrim has never had trouble getting a girlfriend; usually, the problem is getting rid of them. But when Ramona Flowers skates into his heart, he finds she has the most troublesome baggage of all: an army of ex-boyfriends who will stop at nothing to eliminate him from her list of suitors.",
                "popularity": 9.4823,
                "poster_path": "/g5IoYeudx9XBEfwNL0fHvSckLBz.jpg",
                "release_date": "2010-08-12",
                "title": "Scott Pilgrim vs. the World",
                "video": false,
                "vote_average": 7.49,
                "vote_count": 8203,
                "character": "Winifred Hailey",
                "credit_id": "5fb845290c3ec8003f8db1ac",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Эмили Кэсси"
        ],
        "biography": "Emily Kassie (born 15 December 1992; Toronto) is a Canadian documentary filmmaker, investigative journalist, and cinematographer. Her debut feature documentary Sugarcane premiered at the 2024 Sundance Film Festival, where it won the Directing Award.\n\nIn 2016, Kassie won the World Press Photo award for multimedia on the cover up of DuPont's chemical spill in West Virginia and was also named one of NPPA's 2016 multimedia portfolios of the year for her work on radicalization of ISIS operatives and corruption in the pharmaceutical industry. In 2017 she won an Overseas Press Club Award, a National Magazine Award and the ASNE's Punch Sulzberger award for her work reporting on the profiteers of the refugee crisis, in Niger, Turkey, Italy and Germany.\n\nIn 2019, she won the World Press Photo award and was nominated for an Emmy for her New York Times documentary on sexual abuse in immigrant detention. In 2020, she won a National Magazine Award for her immersive documentary on immigrant detention and was nominated for a Peabody Award.She was named to Forbes 30 under 30 list in 2020. In 2021, she was nominated for an Emmy for a Frontline documentary on undocumented immigrants in the pandemic.\n\nShe was part of the PBS NewsHour team to win the Overseas Press Club award for a series on the fall of Afghanistan in 2021.\n\nShe served as director, producer and cinematographer of Sugarcane with co-director Julian Brave NoiseCat. The film won the Grand Jury Directing Award at the Sundance Film Festival.",
        "birthday": "1992-12-15",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.emilykassie.com",
        "id": 88934,
        "imdb_id": "nm3354131",
        "known_for_department": "Directing",
        "name": "Emily Kassie",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.3545,
        "profile_path": "/7iO7GppWHD0HfhgYvc0eaGlLaUG.jpg"
    }
}