{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bP9iuGdBVD48Sw6r06ZcepwMZ1c.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 22596,
                "original_language": "en",
                "original_title": "Safety Last!",
                "overview": "When a store clerk organizes a contest to climb the outside of a tall building, circumstances force him to make the perilous climb himself.",
                "popularity": 2.0538,
                "poster_path": "/fEt5HWJ32ek8ibef7zSZnA00Jp0.jpg",
                "release_date": "1923-04-01",
                "title": "Safety Last!",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 542,
                "character": "The Girl",
                "credit_id": "52fe4447c3a368484e01a10b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mildred Hillary Davis"
        ],
        "biography": "Mildred Hillary Davis (February 22, 1901 – August 18, 1969) was an American actress who appeared in many of Harold Lloyd's classic silent comedies and eventually married him.\n\nThe daughter of Howard Beckett Davis, she was born in Philadelphia, Pennsylvania, and educated at the Friends School in Philadelphia. After several years spent studying, she traveled to Los Angeles in the hopes of securing a role in a film. After appearing in several small roles, she caught the attention of Hal Roach, who pointed her out to comedian Lloyd. He was looking for a leading lady to replace Bebe Daniels, and cast Davis in his comedy short From Hand to Mouth in 1919. It would be the first of fifteen films they would star in together.\n\nOn February 10, 1923, she married Lloyd. After their marriage, Lloyd announced that Davis would not appear in any more motion pictures. After much persuasion on Davis' part, and much grief, she received Lloyd's consent for her return to the screen in Too Many Crooks, which Lloyd produced through his production company. It was the only acting role she undertook after her marriage.",
        "birthday": "1901-02-22",
        "deathday": "1969-08-18",
        "gender": 1,
        "homepage": null,
        "id": 88954,
        "imdb_id": "nm0205192",
        "known_for_department": "Acting",
        "name": "Mildred Davis",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 2.5075,
        "profile_path": "/vkWEUDIbRVqjn5Pfvqc8IMpYvdj.jpg"
    }
}