{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/budvUJdSNKVzEkNdoh4qa4r7Vj1.jpg",
                "genre_ids": [
                    16,
                    10751
                ],
                "id": 15167,
                "original_language": "en",
                "original_title": "Barbie in the Nutcracker",
                "overview": "\"Barbie\" stars as Clara in this animated retelling of the classic Christmas ballet, complete with Tchaikovsky soundtrack and ballet choreography.",
                "popularity": 3.9939,
                "poster_path": "/eIkXJggVmzN4MyPgJ2kDjOy9lmQ.jpg",
                "release_date": "2001-09-30",
                "title": "Barbie in the Nutcracker",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1082,
                "character": "Nutcracker / Prince Eric (voice)",
                "credit_id": "62fa4b301dbc88007c8b62f8",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kirby Robert Morrow (August 28, 1973 – November 18, 2020) was a Canadian actor, voice actor, writer and comedian. Morrow was born in Jasper, Alberta and studied theatre at Mount Royal University in Calgary, and worked in Vancouver, British Columbia. In animation, he was known as the voice of Miroku from InuYasha, Van Fanel from the Ocean dub of Escaflowne, Cyclops from X-Men Evolution, Jay from Class of the Titans, Teru Mikami from Death Note, Trowa Barton from Mobile Suit Gundam Wing, Ryo Takatsuki from Project ARMS, Goku from Ocean's dub of Dragon Ball Z (from Episode 160 onwards), Hot Shot from Transformers: Cybertron (replacing Brent Miller) and Cole from Lego Ninjago: Masters of Spinjitzu. On camera, he was known for the recurring role of Captain Dave Kleinman from Stargate Atlantis.\n\nDescription above from the Wikipedia article Kirby Morrow, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1973-08-28",
        "deathday": "2020-11-18",
        "gender": 2,
        "homepage": null,
        "id": 89025,
        "imdb_id": "nm0607516",
        "known_for_department": "Acting",
        "name": "Kirby Morrow",
        "place_of_birth": "Jasper, Alberta, Canada",
        "popularity": 0.5445,
        "profile_path": "/nnxjEsC4LxwIfMZ3EXGgpcDfI8v.jpg"
    }
}