{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fi40dLKa4aHnvyH81BKo8Go8kSp.jpg",
                "genre_ids": [
                    12,
                    28,
                    35,
                    53
                ],
                "id": 8697,
                "original_language": "cn",
                "original_title": "我是誰",
                "overview": "A group of covert CIA operatives trailing a potential new energy source are double-crossed by corrupt agent Morgan, who causes a helicopter crash in remote South Africa. The sole survivor, suffering severe amnesia, is nursed to recovery by a kindly native tribe who call him \"Whoami\" after the question he keeps asking. With the help of a mysterious reporter Christine, Whoami pieces together his past and tracks the turncoat agent and his criminal cohorts.",
                "popularity": 6.3554,
                "poster_path": "/9YDKLbBmWGpxG5bO3TBawtNNOAr.jpg",
                "release_date": "1998-01-17",
                "title": "Who Am I?",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 922,
                "character": "General Sharman",
                "credit_id": "53fa045ec3a368734f002f4f",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/bDsXa3PV3biQ8ZK1tQyK4vlkvCc.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821,
                "original_language": "en",
                "original_title": "Judgment at Nuremberg",
                "overview": "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.",
                "popularity": 5.8267,
                "poster_path": "/b6vYatvui1EXeFYfpDX4rcbueuP.jpg",
                "release_date": "1961-12-18",
                "title": "Judgment at Nuremberg",
                "video": false,
                "vote_average": 8.025,
                "vote_count": 864,
                "character": "Captain at Nightclub Announcing Call-up of Officers (uncredited)",
                "credit_id": "55fd9b0c92514152aa0012e4",
                "order": 45
            },
            {
                "adult": false,
                "backdrop_path": "/diGPtRd1p8Oanp5Vu51rV2bu4K5.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 11329,
                "original_language": "en",
                "original_title": "Runaway Jury",
                "overview": "After a workplace shooting in New Orleans, a trial against the gun manufacturer pits lawyer Wendell Rohr against shady jury consultant Rankin Fitch, who uses illegal means to stack the jury with people sympathetic to the defense. But when juror Nicholas Easter and his girlfriend Marlee reveal their ability to sway the jury into delivering any verdict they want, a high-stakes cat-and-mouse game begins.",
                "popularity": 4.1238,
                "poster_path": "/g58RA1zzE39KnkRpKRfgA5RxoXP.jpg",
                "release_date": "2003-01-16",
                "title": "Runaway Jury",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1423,
                "character": "George Dressler",
                "credit_id": "5b645c999251414056048a46",
                "order": 69
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Edwin Stafford Nelson"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nEdwin Stafford Nelson (born December 21, 1928) is an American actor.\n\nNelson has appeared in numerous television shows, more than fifty motion pictures, and hundreds of stage productions. Until 2005, he was teaching acting and screenwriting in his native New Orleans at two local universities there. Hurricane Katrina prompted him to move his family to Sterlington near Monroe in Ouachita Parish in northeastern Louisiana.\n\nNelson began acting while attending Tulane University in New Orleans. He left college after two years to study at the New York School of Radio and Television Technique. After graduating, he took a position as a director at WDSU-TV in New Orleans. By 1956, acting became his central focus and he moved to the Los Angeles area. Early in his career he worked with famed B-movie producer Roger Corman on such Corman films as Cry Baby Killers, A Bucket of Blood, Teenage Cave Man and Attack of the Crab Monsters. In 1958 he participated in Bruno VeSota's science fiction horror film The Brain Eaters.\n\nHis early television career featured many guest starring roles in such series as The Fugitive, Gunsmoke, Harbor Command, Tombstone Territory, Tightrope, The Blue Angels (as arrogant flight instructor Lieutenant Dayl Martin), Laramie, COronado 9, The Eleventh Hour, Bonanza, Thriller (US TV series), and Channing, an ABC drama about college life.\n\nIn 1964 he won his most famous role portraying Dr. Michael Rossi on the ABC drama Peyton Place, which ran from 1964 to 1969. Nelson's fellow cast members included Mia Farrow, Ryan O'Neal, and Dorothy Malone. Dr. Rossi proved to be so popular that by 1968, he became the lead actor on the show. Nelson reprised his role in two made-for-TV movies, Murder in Peyton Place and Peyton Place: The Next Generation.\n\nAfter Peyton Place ended, Nelson worked in many more productions of all varieties, including starring role in many movies of the week, a second TV series, \"The Silent Force,\" and a popular morning talk show which he hosted for three years.\n\nSoon after, Nelson struck gold with his critically acclaimed portrayal of elusive pit crew chief Robert Denby in the hit film Riding with Death (1976), earning him several prestigious accolades and legions of devoted fans.\n\nHe portrayed a dangerous impostor in the adventure movie For the Love of Benji (1977).\n\nDuring the 1980s, Nelson took on the role of Senator Mark Denning in the daytime soap Capitol.\n\nNelson also spent a couple of years as Harry Truman onstage replacing James Whitmore for the National Tour of \"Give 'Em Hell, Harry.\"\n\nWhile living in Los Angeles, Nelson was an active member of the Screen Actors Guild and was elected to the union board for many years. Nelson is a long-standing member of the Academy of Motion Picture Arts and Sciences and continues a long tradition of participation in voting for the Academy Awards.\n\nIn 1999, Nelson returned to Tulane University to finish credits toward his undergraduate degree, which he completed the following year at the age of seventy-one. Nelson continues to act as the opportunity arises. He and his wife of fifty-eight years, Patsy, enjoy semi-retirement visiting his six children and fourteen grandchildren.\n\nDescription above from the Wikipedia article Ed Nelson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1928-12-21",
        "deathday": "2014-08-09",
        "gender": 2,
        "homepage": null,
        "id": 89040,
        "imdb_id": "nm0625343",
        "known_for_department": "Acting",
        "name": "Ed Nelson",
        "place_of_birth": "New Orleans, Louisiana, USA",
        "popularity": 0.7367,
        "profile_path": "/pEDqGHZ958ciZhr4MVxqJzkwkL4.jpg"
    }
}