{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7a4WHNllmX5ZGR0MfYJDPhV69eM.jpg",
                "genre_ids": [
                    16,
                    878
                ],
                "id": 55931,
                "original_language": "en",
                "original_title": "The Animatrix",
                "overview": "Straight from the creators of the groundbreaking Matrix trilogy, this collection of short animated films from the world's leading anime directors fuses computer graphics and Japanese anime to provide the background of the Matrix universe and the conflict between man and machines. The shorts include Final Flight of the Osiris, The Second Renaissance, Kid's Story, Program, World Record, Beyond, A Detective Story and Matriculated.",
                "popularity": 4.3083,
                "poster_path": "/g52SOsTvdjzY8oPIn5znLJMzLHG.jpg",
                "release_date": "2003-05-09",
                "title": "The Animatrix",
                "video": false,
                "vote_average": 7.197,
                "vote_count": 1666,
                "character": "Alexa (\"Matriculated\") (voice)",
                "credit_id": "52fe48e6c3a36847f817f785",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Melinda Patrice Clarke",
            "Mindy Clarke",
            "メリンダ・クラーク"
        ],
        "biography": "Melinda Clarke (born April 24, 1969 height 5' 7\" (1,70 m)) is an American actress who has primarily worked in television. Clarke is best known for playing Faith Taylor on the daytime drama Days of our Lives, the manipulative and cunning Julie Cooper-Nichol on The O.C., as well as the professional dominatrix Lady Heather on CSI. From 2010 to 2013, she portrayed Amanda on the action-thriller television series Nikita. She was added as a recurring character on Vegas in 2013.\n\nClarke was born in Dana Point, California, the daughter of Patricia Lewis, a ballet dancer, and John Clarke, an actor who was an original cast member of the daytime soap opera Days of Our Lives. One of three siblings, Clarke's sister, Heidi, died in 1994 of a malignant heart tumor. She has a brother, Joshua.\n\nClarke appeared on the daytime soap opera Days of Our Lives as Faith Taylor (where her father was a senior cast member), and starred on Soldier of Fortune, Inc. for both of its seasons. She also guest starred on Xena: Warrior Princess as the Amazon chieftain Velasca, Firefly as the brothel madam Nandi, Charmed as the Siren, and has had six appearances on CSI where she played the dominatrix, Lady Heather. She also appeared in the Seinfeld episode \"The Muffin Tops\", playing Jerry's girlfriend who likes anything hairless. She also appeared in the 1993 horror film Return of the Living Dead 3.\n\nShe appeared on the Fox drama The O.C. as Julie Cooper, a cunning socialite who marries for money. Her character in the show is mainly portrayed as a manipulative, morally wrong woman, but as the show progresses the reasons behind her choices are explained. She was originally billed as a guest star in the first few episodes, and due to fan response was offered a series regular contract; Clarke accepted the role and her character became an integral part of the show's storylines. As well as starring on The O.C., she has appeared on HBO's hit series Entourage as a fictionalized version of herself, married to Malcolm McDowell's Terrance McQuewick. Clarke also appeared as the Devil's girlfriend in The CW's 2007 series Reaper. She also auditioned for the role of \"Number Six\" on SCI-FI's smash hit Battlestar Galactica but the role ultimately went to Tricia Helfer.\n\nIn 2010, she appeared on The CW show The Vampire Diaries as Kelly Donovan. Other projects included the television film She Drives Me Crazy, which was produced by her former The O.C. co-star Kelly Rowan. She appeared as a guest star on Chuck, another series from The O.C. creator Josh Schwartz. She starred on The CW drama Nikita, where she played Amanda from 2010 to 2013.\n\nShe lent her voice to several voice acting projects, voicing Alexa in The Animatrix: Matriculated, Sofia Ivanescu in the video game Mission Impossible: Operation Surma, Madame Macmu-Ling in Avatar: The Last Airbender, and Charlene in King of the Hill.\n\nDescription above from the Wikipedia article Melinda Clarke, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1969-04-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 89251,
        "imdb_id": "nm0164918",
        "known_for_department": "Acting",
        "name": "Melinda Clarke",
        "place_of_birth": "Dana Point, California, USA",
        "popularity": 0.6758,
        "profile_path": "/6TmH4yC7ypxhawo6dQcfLcTtwvK.jpg"
    }
}