{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6IFTmhNh9kmwd5ix53OdlSphPYl.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 623,
                "original_language": "en",
                "original_title": "A Fish Called Wanda",
                "overview": "While a diamond advocate attempts to steal a collection of diamonds, troubles arise when he realises he’s not the only one after the collection.",
                "popularity": 5.4089,
                "poster_path": "/hkSGFNVfEEUXFCxRZDITFHVhUlu.jpg",
                "release_date": "1988-07-15",
                "title": "A Fish Called Wanda",
                "video": false,
                "vote_average": 7.204,
                "vote_count": 2298,
                "character": "Wendy",
                "credit_id": "52fe4260c3a36847f8019675",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Aitken was born in Dublin, Ireland, the daughter of Sir William Aitken, a Conservative MP, and Penelope Aitken, whose father was John Maffey, 1st Baron Rugby. Her grandfather was the UK Representative to Ireland (1939–49). She is a great-niece of newspaper magnate and war-time minister Lord Beaverbrook, and sister to former Conservative cabinet minister Jonathan Aitken. She attended Riddlesworth Hall Preparatory School in Norfolk, Sherborne School for Girls in Dorset and St Anne's College, Oxford, where she graduated with a degree in English Language and Literature.\n\nShe has directed several plays in the West End and on Broadway. Her production of The 39 Steps, which ran in London for nine years, also played three years on Broadway and won Olivier and Tony Awards. In 2011, she directed Frank Langella in Man and Boy on Broadway. She is a Visiting Lecturer at Yale, NYU and Juilliard drama schools. Her extensive acting career includes leading roles at the Royal National Theatre, the Royal Shakespeare Company and in the West End. She has played more Noël Coward leads than any other actress. Her film career includes appearances in Doctor Faustus (1967), Mary, Queen of Scots (1971), Half Moon Street (1986), A Fish Called Wanda (1988) (for which she was nominated for a BAFTA award), The Fool (1990), The Grotesque (1995), Fierce Creatures (1997), Jinnah (1998) and Asylum (2005).\n\nShe is the author of A Girdle Round the Earth, a story of some of the more remarkable women travellers of the last 200 years, and Style: Acting in High Comedy, published in 1996, which contends that \"High comedies are not bloodless, refined, wordy plays — their themes are sex, money and social advancement. They contain a splendid contradiction: wit and elegance at the service of man's basest drives.\"\n\nFrom Wikipedia",
        "birthday": "1945-09-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 8946,
        "imdb_id": "nm0014883",
        "known_for_department": "Acting",
        "name": "Maria Aitken",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.1449,
        "profile_path": "/68hYz23dvcanehgrkgEis3yn0L7.jpg"
    }
}