{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fBvSfLetWlAMevQVHa0nBDV1Fon.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1572,
                "original_language": "en",
                "original_title": "Die Hard: With a Vengeance",
                "overview": "New York detective John McClane is back and kicking bad-guy butt in the third installment of this action-packed series, which finds him teaming with civilian Zeus Carver to prevent the loss of innocent lives. McClane thought he'd seen it all, until a genius named Simon engages McClane, his new \"partner\" -- and his beloved city -- in a deadly game that demands their concentration.",
                "popularity": 6.5824,
                "poster_path": "/buqmCdFQEWwEpL3agGgg2GVjN2d.jpg",
                "release_date": "1995-05-19",
                "title": "Die Hard: With a Vengeance",
                "video": false,
                "vote_average": 7.273,
                "vote_count": 6370,
                "character": "Roman",
                "credit_id": "5963807fc3a3680dec0cd5e2",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Viikinki",
            "Ludvig Borga",
            "The Viking",
            "Finland Hellraiser Thor"
        ],
        "biography": "Tony Christian Halme was a Finnish politician, athlete, author, actor, and singer. He was a member of the Finnish Parliament from 2003 to 2007, representing the True Finns party as an independent politician. Halme was also known by the pseudonym Viikinki, which he used while appearing in Gladiaattorit, a Finnish version of the TV game show Gladiators, in the 1990s. He was also a professional wrestler best known for his appearances with Catch Wrestling Association (CWA), New Japan Pro-Wrestling (NJPW) and World Wrestling Federation (WWF) under the ring name Ludvig Borga; a mixed martial artist and the first fighter from the Nordic countries to ever compete in the Ultimate Fighting Championship (UFC); and a professional boxer who held the Finnish heavyweight title.\n\nDuring his time in CWA, he was an accomplished main eventer, who headlined many events for the company including the company's flagship event Euro Catch Festival three times.",
        "birthday": "1963-01-06",
        "deathday": "2010-01-08",
        "gender": 2,
        "homepage": null,
        "id": 89485,
        "imdb_id": "nm0356844",
        "known_for_department": "Acting",
        "name": "Tony Halme",
        "place_of_birth": "Helsinki, Finland",
        "popularity": 0.1575,
        "profile_path": "/scEsDqEybz2DpOeEQEOBxEROHwp.jpg"
    }
}