{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5HjzYTihkH7EvOWSE7KcsF6pBMM.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16
                ],
                "id": 522478,
                "original_language": "en",
                "original_title": "Peter Rabbit 2: The Runaway",
                "overview": "Peter Rabbit runs away from his human family when he learns they are going to portray him in a bad light in their book. Soon, he crosses paths with an older rabbit who ropes him into a heist.",
                "popularity": 6.4166,
                "poster_path": "/cycDz68DtTjJrDJ1fV8EBq2Xdpb.jpg",
                "release_date": "2021-03-25",
                "title": "Peter Rabbit 2: The Runaway",
                "video": false,
                "vote_average": 7.065,
                "vote_count": 853,
                "character": "Busker K. Bushy, Esq (voice)",
                "credit_id": "66067482a894d60162626292",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/5B22eed7ErxFiYAG4Ksb4eLwKNF.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 770254,
                "original_language": "en",
                "original_title": "Back to the Outback",
                "overview": "Tired of being locked in a reptile house where humans gawk at them like they are monsters, a ragtag group of Australia’s deadliest creatures plot an escape from their zoo to the Outback, a place where they’ll fit in without being judged.",
                "popularity": 4.2613,
                "poster_path": "/jbAUTO7qFN8XFG2LM3bz30vzGFJ.jpg",
                "release_date": "2021-12-03",
                "title": "Back to the Outback",
                "video": false,
                "vote_average": 7.662,
                "vote_count": 758,
                "character": "Pretty Boy (voice)",
                "credit_id": "5fc4d8e43a340b0041df49d9",
                "order": 1
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/5B22eed7ErxFiYAG4Ksb4eLwKNF.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 770254,
                "original_language": "en",
                "original_title": "Back to the Outback",
                "overview": "Tired of being locked in a reptile house where humans gawk at them like they are monsters, a ragtag group of Australia’s deadliest creatures plot an escape from their zoo to the Outback, a place where they’ll fit in without being judged.",
                "popularity": 4.2613,
                "poster_path": "/jbAUTO7qFN8XFG2LM3bz30vzGFJ.jpg",
                "release_date": "2021-12-03",
                "title": "Back to the Outback",
                "video": false,
                "vote_average": 7.662,
                "vote_count": 758,
                "credit_id": "5fc4d8700328b9003f6bb3c4",
                "department": "Sound",
                "job": "Songs"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Timothy David Minchin",
            "Тім Мінчін"
        ],
        "biography": "Tim Minchin is an Australian musician, actor, comedian and writer. He has been performing his unique brand of musical comedy in front of appropriately excitable and ever growing audiences since starting out in South Melbourne’s Butterfly Club in 2005. He won the Director’s Award at the Melbourne International Comedy Festival for his break-out show Darkside, and followed this later the same year with one of the most successful debut acts ever at the Edinburgh Fringe – winning the\n\nPerrier Award for Best Newcomer. Without wanting to go on and on about it, he’s done some pretty successful live shows since then, often in Australia or the UK, but also on the North American continent (yes that includes you too Canada). But not you Guatemala. Maybe one day.  His current songs span topics such as environmentalism, rationalism, prejudice(ism) and his amour de boobs(ism). In fact it would hardly be over the top to say that his love of boobs would be up there in the back of Plato’s cave in the bit that’s carved out for the most perfect and complete example of the love of boobs. But not in a weird way. During his shows he plays the piano, always nicely and oftentimes wildly and excitingly, whilst looking wonderfully athletic, in a pair of delightfully uncomfortable skinny jeans.  Tim has made many TV appearances: most recently on Good News Week in Australia and Friday Night with Jonathan Ross in the UK. He’s also performed on radio; his most recent project being Strings, a brand new comedy sitcom pilot for BBC Radio 2, which he both wrote and starred in. His acclaimed 9-minute beat poem, Storm, is being animated for release in October. Tim is currently writing the music and lyrics for the musical Matilda with the Royal Shakespeare Company. This adaptation of the Roald Dahl classic opens in Stratford-upon-Avon in November 2010.  Tim, his wife and two young children, now live in London.",
        "birthday": "1975-10-07",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.timminchin.com",
        "id": 89564,
        "imdb_id": "nm2423358",
        "known_for_department": "Acting",
        "name": "Tim Minchin",
        "place_of_birth": "Northampton, England, UK",
        "popularity": 0.3393,
        "profile_path": "/jIf1rJYaoJgB73iGPYu4U6Ce93.jpg"
    }
}