{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dYocWQoWk3Y6vBa0pGc0OQ8GLqn.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    10752,
                    10749
                ],
                "id": 961,
                "original_language": "en",
                "original_title": "The General",
                "overview": "During America’s Civil War, Union spies steal engineer Johnny Gray's beloved locomotive, 'The General'—with Johnnie's lady love aboard an attached boxcar—and he single-handedly must do all in his power to both get The General back and to rescue Annabelle.",
                "popularity": 1.8743,
                "poster_path": "/nIp4gIXogCjfB1QABNsWwa9gSca.jpg",
                "release_date": "1926-12-25",
                "title": "The General",
                "video": false,
                "vote_average": 7.942,
                "vote_count": 1329,
                "character": "Officer on Horseback (uncredited)",
                "credit_id": "5416934fc3a3684cf7004929",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alfred St. John",
            "Al St John",
            "Fuzzy Q. Jones",
            "'Fuzzy' St. John",
            "Al \"Fuzzy' St. John",
            "Al 'Fuzzy' St. John",
            "Al Fuzzy St. John",
            "Al {Fuzzy} St. John",
            "Al. 'Fuzzy' St. John",
            "Fuzzy St. John",
            "Al 'Fuzzy' St.John",
            "Al Fuzzy St.John",
            "Al St.John",
            "Fuzzy St.John",
            "Al {Fuzzy} St.John ",
            "Альфред Сент-Джон",
            "Аль Ст. Джон"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nAl St. John (September 10, 1893 – January 21, 1963) in his persona of Fuzzy Q. Jones basically defined the role and concept of \"comical sidekick\" to cowboy heroes from 1930 to 1951. St. John also created a character, \"Stoney,\" in the first of a continuing Western film series, The Three Mesquiteers, that was later played (at a low point in his own career) by John Wayne.\n\nBorn in Santa Ana, California, St. John entered silent films around 1912 and soon rose to co-starring and starring roles in short comic films from a variety of studios. His uncle, Roscoe \"Fatty\" Arbuckle, may have helped him in his early days at Mack Sennett Studios, but talent kept him working. He was slender, sandy-haired, handsome and a remarkable acrobat.\n\nSt. John frequently appeared as Arbuckle's mischievously villainous rival for the attentions of leading ladies like Mabel Normand, and worked with Arbuckle and Charles Chaplin in The Rounders (1914). The most critically praised film from St. John's period with Arbuckle remains Fatty and Mabel Adrift (1916) with Normand.\n\nThe name Fuzzy originally belonged to a different actor, John Forrest “Fuzzy“ Knight, who took on the role of cowboy sidekick before St. John. As the studio first intended to hire Knight for the western series but then gave the role to St. John instead, he took on the nickname of his rival for his screen character.\n\nIn most of his films, screen time was set aside for St. John to do a sort of solo comedy act, emphasizing amazing pratfalls and acrobatics. He might \"find\" a bicycle on a fairground set, and do an astonishing sequence of acrobatic stunts on the cycle, or he might try to capture a rat, bat, skunk, gopher, or bug with hilarious and chaotic consequences. Another stunt which he used in nearly every Western was virtually his trademark: he would mount his horse in apparently the standard manner, but somehow wind up sitting facing backward, and often would ride off with the hero in this unusual orientation.\n\nWhen Crabbe left PRC (according to interviews, in disgust at their increasingly low budgets), St. John was paired with new star Lash LaRue. Ultimately, St. John made more than 80 Westerns as Fuzzy. His last film was released in 1952. From that time on until his death in 1963 in Lyons, Georgia, he made personal appearances at fairs and rodeos, and travelled with the Tommy Scott Wild West Show. Altogether, Al St. John acted in 346 movies, spanning four decades from 1912 to 1952.\n\nDescription above from the Wikipedia article Al St. John, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1893-09-09",
        "deathday": "1963-01-21",
        "gender": 2,
        "homepage": null,
        "id": 89609,
        "imdb_id": "nm0820607",
        "known_for_department": "Acting",
        "name": "Al St. John",
        "place_of_birth": "Santa Ana, California, USA ",
        "popularity": 0.1554,
        "profile_path": "/u6jepFCiItOjfo9wP3yU2ZLZFgE.jpg"
    }
}