{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qvTmYyYsv71qTq5syAq24k1kGk.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 624,
                "original_language": "en",
                "original_title": "Easy Rider",
                "overview": "Wyatt and Billy, two Harley-riding hippies, complete a drug deal in Southern California and decide to travel cross-country in search of spiritual truth.",
                "popularity": 2.9419,
                "poster_path": "/mmGEB6ly9OG8SYVfvAoa6QqHNvN.jpg",
                "release_date": "1969-06-26",
                "title": "Easy Rider",
                "video": false,
                "vote_average": 7.064,
                "vote_count": 2059,
                "character": "Connection",
                "credit_id": "52fe4260c3a36847f8019741",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nHarvey Philip Spector (December 26, 1939 – January 16, 2021) was an American record producer and songwriter. The originator of the \"Wall of Sound\" production technique, Spector was a pioneer of the 1960s girl group sound and produced over 25 Top 40 hits between 1960 and 1965 alone. After this initial success, Spector later worked with artists including Ike and Tina Turner, John Lennon, George Harrison, and the Ramones with similar acclaim.\n\nHe produced the Beatles' Academy Award-winning album Let It Be, and the Grammy Award-winning Concert for Bangladesh by former Beatle George Harrison. In 1989, Spector was inducted into the Rock and Roll Hall of Fame as a non-performer. The 1965 song \"You've Lost That Lovin' Feelin'\", produced and co-written by Spector for The Righteous Brothers, is listed by BMI as the song with the most U.S. airplay in the 20th century.\n\nThe 2003 shooting death of actress Lana Clarkson in his Alhambra, California home led to his being charged with murder in the second degree. After a 2007 mistrial, he was convicted in 2009 and given a prison sentence of 19 years to life. An appeal of the conviction was heard by the California Courts of Appeal in April 2011, but the murder conviction was upheld less than three weeks later. Spector's attorneys intend to pursue another hearing by the appeals court and will seek a review of the ruling by the California Supreme Court.",
        "birthday": "1939-12-26",
        "deathday": "2021-01-16",
        "gender": 2,
        "homepage": null,
        "id": 8961,
        "imdb_id": "nm0817489",
        "known_for_department": "Acting",
        "name": "Phil Spector",
        "place_of_birth": "The Bronx, New York City, New York, USA",
        "popularity": 0.1411,
        "profile_path": "/sCWVTDNUn7Ni7Ct79njisdnJTNc.jpg"
    }
}