{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xfEU7DOlQPwz8Y0TBhKmpETuNIc.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648
                ],
                "id": 93,
                "original_language": "en",
                "original_title": "Anatomy of a Murder",
                "overview": "Semi-retired Michigan lawyer Paul Biegler takes the case of Army Lt. Manion, who murdered a local innkeeper after his wife claimed that he raped her. Over the course of an extensive trial, Biegler parries with District Attorney Lodwick and out-of-town prosecutor Claude Dancer to set his client free, but his case rests on the victim's mysterious business partner, who's hiding a dark secret.",
                "popularity": 4.2805,
                "poster_path": "/b2G1QSAwtBv9luhEwErIgSRaU92.jpg",
                "release_date": "1959-07-01",
                "title": "Anatomy of a Murder",
                "video": false,
                "vote_average": 7.848,
                "vote_count": 1075,
                "character": "Clarence Madigan",
                "credit_id": "56b832fec3a3684816009091",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Conlin",
            "James Conlon",
            "Jimmy Conlon"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJimmy Conlin (October 14, 1884 – May 7, 1962) was an American character actor who appeared in almost 150 films in his 32-year career.  Conlin was born in Camden, New Jersey in 1884, and his acting career started out in vaudeville, where he and his first wife Myrtle Glass played the Keith-Albee-Orpheum circuits billed as \"Conlin & Glass\", a song-and-dance team. They also starred together in two short films, Sharps and Flats (1928) and Zip! Boom! Bang! (1929) for Vitaphone.\n\nConlin made another comedy short without Glass in 1930 (A Tight Squeeze), but his film career started for good in 1933, and for the next 27 years, with the single exception of 1951, every year saw the release of at least one film in which Conlin appeared – at the height of his career, often more than a dozen of them. Recognizable by his small size and odd appearance, Conlin played all sorts of small roles and bit parts, many times not receiving an onscreen credit.\n\nIn the 1940s, Conlin was part of Preston Sturges' unofficial \"stock company\" of character actors, appearing in nine films written and directed by Sturges. His roles in Sturges' films were often sizable and often came with good billing. One of his best performances came in Sturges' The Sin of Harold Diddlebock in 1946, when he played \"Wormy\", the racetrack tout who convinces Harold Lloyd to have his first drink, setting off the events of the film. The loyalty between Sturges and Conlin ran both ways, and when the former golden boy of Hollywood fell on hard times, Conlin remained a friend, stayed in contact, and helped out in any way he could.\n\nConlin did not make many television appearances, but he did have a regular role as a bartender on Duffy's Tavern, a syndicated series from 1954. He made his final film in 1959, when he played a habitual criminal in Anatomy of a Murder.",
        "birthday": "1884-10-13",
        "deathday": "1962-05-07",
        "gender": 2,
        "homepage": null,
        "id": 89672,
        "imdb_id": "nm0174813",
        "known_for_department": "Acting",
        "name": "Jimmy Conlin",
        "place_of_birth": " Camden, New Jersey, USA",
        "popularity": 0.0773,
        "profile_path": "/fImzSAUll4h46mb7iPnjPlDHr3c.jpg"
    }
}