{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bhEJZ6XH1B9ld97OWppdAnvWzl5.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11165,
                "original_language": "en",
                "original_title": "Tora! Tora! Tora!",
                "overview": "In the summer of 1941, the United States and Japan seem on the brink of war after constant embargos and failed diplomacy come to no end. \"Tora! Tora! Tora!\", named after the code words used by the lead Japanese pilot to indicate they had surprised the Americans, covers the days leading up to the attack on Pearl Harbor, which plunged America into the Second World War.",
                "popularity": 3.4619,
                "poster_path": "/c311sN931DixuZRer0JGYCwpx9N.jpg",
                "release_date": "1970-01-26",
                "title": "Tora! Tora! Tora!",
                "video": false,
                "vote_average": 7.149,
                "vote_count": 566,
                "character": "Destroyer Captain (uncredited)",
                "credit_id": "61e8f6c3a9117f00e8418d6c",
                "order": 76
            },
            {
                "adult": false,
                "backdrop_path": "/eMgflonfRY89Zj4LZykJKPpG4wg.jpg",
                "genre_ids": [
                    18
                ],
                "id": 596,
                "original_language": "en",
                "original_title": "The Grapes of Wrath",
                "overview": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncle’s farm, and joins them the next day as they head for California and a new life... Hopefully.",
                "popularity": 5.0806,
                "poster_path": "/eUcxMVBIA0Jg8l1RGUqycrc3eIQ.jpg",
                "release_date": "1940-03-15",
                "title": "The Grapes of Wrath",
                "video": false,
                "vote_average": 7.815,
                "vote_count": 1043,
                "character": "Gas Station Attendant #2 in Needles (uncredited)",
                "credit_id": "55e50558c3a36813eb000949",
                "order": 89
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jack Carson",
            "Steve Pendelton",
            "Gaylord 'Steve' Pendleton",
            "Gaylord Pendleton",
            "Jack Pendleton"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nSteve Pendleton (September 16, 1908 – October 3, 1984) was an American film and television actor, often cast in the role of law-enforcement officers.\n\nPendleton was cast in eight episodes in different roles from 1952 to 1957 on The Roy Rogers Show. In 1955, he played the role of Baumer in \"Gold of Haunted Mountain\" of the CBS drama, Brave Eagle. In another 1955 appearance, he was cast as Captain Kenneth McNabb in \"The Fight for Texas\" of the syndicated western series, Buffalo Bill, Jr. In 1956, he was cast as Bill Mathison in the episode \"The Long Weekend\" of the then CBS military drama, Navy Log. In 1957, he appeared on two episodes of William Bendix's NBC situation comedy, The Life of Riley. In 1958, he played Marshal Purvis in \"Star Witness\" of another syndicated western series, Casey Jones, with Alan Hale, Jr., in the title role. In 1959 he portrayed Sheriff Anderson in \"The Louisiana Dude\" of the CBS western series Yancy Derringer.\n\nPendleton was cast in two roles in a total of twelve episodes broadcast between 1956 and 1961 of the ABC/Desilu western television series, The Life and Legend of Wyatt Earp, with Hugh O'Brian in the title role of deputy marshal Wyatt Earp. He played a United States Army mayor, Benteen, in five segments, including \"Dull Knife Strikes for Freedom\" (May 7, 1957). In this segment, the actor Ian MacDonald is cast as Dull Knife, a Cheyenne chief, who leads his tribe from its reservation in Oklahoma Territory to their homeland in Montana, which they claim the U.S. government had promised them. Benteen has orders to prevent the Indians from passing through. Pendleton also appeared in seven other series episodes as the character Thacker.\n\nIn 1960, Pendleton was cast as Marshal McCoy in \"The Town That Wasn't There\" of the ABC/Warner Brothers western series, Maverick. That same year, he played deputy Kelsey, with Lee Van Cleef as deputy Clyde Wilson, in the episode \"Man on a Mountain\" of another ABC/WB western, Lawman. In 1961, he portrayed deputy marshal Ben Johnson in the episode \"Death Trap\" of the ABC western series, The Rifleman, starring Chuck Connors.\n\nIn 1967, he played Mr. Hutchins in the episode \"Howard and Millie\" of the CBS sitcom, The Andy Griffith Show. From 1968 to 1970, he had a recurring role as Mr. Bennett in six episodes of the NBC sitcom, Julia, starring Diahann Carroll.\n\nHis last role was as a businessman on the 1976 episode \"The Reformer\" of William Conrad's CBS crime drama, Cannon. Pendleton died at the age of seventy-six in Pasadena, California.",
        "birthday": "1908-09-16",
        "deathday": "1984-10-03",
        "gender": 2,
        "homepage": null,
        "id": 89704,
        "imdb_id": "nm0671747",
        "known_for_department": "Acting",
        "name": "Steve Pendleton",
        "place_of_birth": "Harlem, New York City, New York, USA",
        "popularity": 0.0822,
        "profile_path": "/o8VCARJgaUxQbqs3IMKL2TC7gFE.jpg"
    }
}