{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nCl5KzxUs4rVVlAdixDf4r5AbbZ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 887,
                "original_language": "en",
                "original_title": "The Best Years of Our Lives",
                "overview": "It's the hope that sustains the spirit of every GI: the dream of the day when he will finally return home. For three WWII veterans, the day has arrived. But for each man, the dream is about to become a nightmare.",
                "popularity": 5.3127,
                "poster_path": "/gd5EoAU4MM57sW3vlWxJ0NMM8cV.jpg",
                "release_date": "1946-12-25",
                "title": "The Best Years of Our Lives",
                "video": false,
                "vote_average": 7.79,
                "vote_count": 694,
                "character": "Hat Check Girl (uncredited)",
                "credit_id": "64e2839b873f0000ae235c07",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Olivia Joyce Compton"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nOlivia Joyce Compton (January 27, 1907 – October 13, 1997) was an American actress.  Compton was born in Lexington, Kentucky. (Despite frequent reports to the contrary, her name was not originally \"Eleanor Hunt\"; she had appeared in the film Good Sport (1931) with Hunt and this confusion in an early press article followed Compton throughout her career.) After graduating high school she spent two years studying at the University of Tulsa, studying dramatics, art, music and dancing. She won a personality and beauty contest and spent two months in a film studio as an extra.\n\nCompton first made a name for herself when she was named one of the WAMPAS Baby Stars in 1926, alongside Mary Brian, Dolores Costello, Joan Crawford, Dolores del Río, Janet Gaynor and Fay Wray. Compton appeared in a long string of mostly B-movies from the 1920s through the 1950s. She was a comedy actress and protested at being stereotyped as a \"dumb blonde\".\n\nAmong her over two hundred films were Imitation of Life, Magnificent Obsession, The Awful Truth, Mildred Pierce, and The Best Years of Our Lives.\n\nA devout Christian, on her gravestone, just beneath her dates of birth and death, is written \"Christian Actress\". She died from natural causes, aged 90, and was buried in Forest Lawn Memorial Park in the Hollywood Hills.",
        "birthday": "1907-01-27",
        "deathday": "1997-10-13",
        "gender": 1,
        "homepage": null,
        "id": 89725,
        "imdb_id": "nm0174049",
        "known_for_department": "Acting",
        "name": "Joyce Compton",
        "place_of_birth": "Lexington, Kentucky, USA",
        "popularity": 0.3098,
        "profile_path": "/z5rRRN40OSWX1G5i5edvfqe56wv.jpg"
    }
}