{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i8fiqKaQklF02VmQYhSxmwa8KOH.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 223,
                "original_language": "en",
                "original_title": "Rebecca",
                "overview": "Story of a young woman who marries a fascinating widower only to find out that she must live in the shadow of his former wife, Rebecca, who died mysteriously several years earlier. The young wife must come to grips with the terrible secret of her handsome, cold husband, Max De Winter. She must also deal with the jealous, obsessed Mrs. Danvers, the housekeeper, who will not accept her as the mistress of the house.",
                "popularity": 2.5313,
                "poster_path": "/1qz3qUOHnVy7dL7M7G8jSErxE4b.jpg",
                "release_date": "1940-03-23",
                "title": "Rebecca",
                "video": false,
                "vote_average": 7.899,
                "vote_count": 1869,
                "character": "Hotel Desk Clerk (uncredited)",
                "credit_id": "5650b9ecc3a3680712007aa0",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nEgon Brecher (18 February 1880 – 12 August 1946) was an Austria-Hungary-born actor and director, who also served as the chief director of Vienna's Stadts Theatre, before entering the motion picture industry.\n\nThe son of a professor, Brecher began studying philosophy in 1900 at the University of Heidelberg in Germany. He did not finish his studies, deciding to become an actor. He appeared on several provincial stages in Germany and Austria until 1910, and then played in Vienna on various occasions, directed by Josef Jarno until 1921.\n\nIn 1907, he founded an initiative (which lasted for something like one or two years) to play modern Yiddish theatre in German language with Siegfried Schmitz and members of the student club ‘Theodor Herzl’ like Hugo Zuckermann and Oskar Rosenfeld. In 1919 he was co-founder of the Freie Jüdische Volksbühne in Vienna, a Yiddish theatre, which existed for three years.\n\nThen, in 1921, he moved to New York to act on Broadway. He moved to Hollywood in the late 1920s to appear in foreign-language versions of American films. In the mid-1930s he appeared in classic horror films The Black Cat, Werewolf of London, The Black Room, Mark of the Vampire and The Devil-Doll, and worked steadily in the espionage films of the 1930s/40s, his Slavic accent landing him roles both noble and villainous. One of his largest screen roles was in 1946's So Dark the Night. He died later in 1946, aged 66, of a heart attack in Los Angeles, California.",
        "birthday": "1880-02-15",
        "deathday": "1946-08-12",
        "gender": 2,
        "homepage": null,
        "id": 89727,
        "imdb_id": "nm0106504",
        "known_for_department": "Acting",
        "name": "Egon Brecher",
        "place_of_birth": "Olmütz, Moravia, Austria-Hungary [now Olomouc, Czech Republic]",
        "popularity": 0.0788,
        "profile_path": "/sNEB6hOJxTUuooPE3YdrKqVQ0C5.jpg"
    }
}