{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.0884,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Korah's Wife",
                "credit_id": "52fe4466c3a36847f8093b5b",
                "order": 38
            },
            {
                "adult": false,
                "backdrop_path": "/hrED8MSOn4xJP9Cpk7WomUcFKGI.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 229,
                "original_language": "en",
                "original_title": "Bride of Frankenstein",
                "overview": "Dr. Frankenstein and his monster both turn out to be alive, not killed as previously believed. Dr. Frankenstein wants to get out of the evil experiment business, but when a mad scientist, Dr. Pretorius, kidnaps his wife, Dr. Frankenstein agrees to help him create a new creature.",
                "popularity": 3.0623,
                "poster_path": "/5241zUwe7rC17MNc2QpCBKKdp1N.jpg",
                "release_date": "1935-04-20",
                "title": "Bride of Frankenstein",
                "video": false,
                "vote_average": 7.509,
                "vote_count": 1037,
                "character": "Queen Homunculus (uncredited)",
                "credit_id": "55a5eb71c3a3682baf00092c",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joanne Woodbury",
            "Nana Martinez",
            "John Woodbury",
            "Joan Elmer Woodbury"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJoan Woodbury (December 17, 1915 – February 22, 1989) was an American actress beginning in the 1930s and continuing well into the 1960s.\n\nWoodbury received her first acting role in the 1934 film Eight Girls in a Boat, which was uncredited. Another uncredited role followed, with her first credited role being in the 1934 film One Exciting Adventure, which starred Binnie Barnes. Her first major role, billed as Nana Martinez, was in a Hopalong Cassidy movie The Eagle's Brood. Woodbury appeared in 15 films from 1934 through 1935, of which 10 were uncredited.\n\nIn 1936, her career began to become more successful, with appearances in eight films that year, of which five were uncredited. However, of the three roles that were credited, Woodbury made an impact, and caught the attention of studios. Her mixture of Danish, British, and Native American heritage gave her an exotic appearance, and allowed her to be cast in many different ethnicities, from Hispanic to French and Asian. By 1937, her career had taken off, mostly in B-movies such as Living on Love and Bulldog Courage, but also with her receiving many credited roles.\n\nIn 1937, Woodbury starred in her first of several credited Charlie Chan films, titled Charlie Chan on Broadway. She also began appearing in numerous Westerns, portraying the heroine opposite some of the 1930s' biggest cowboy actors, to include William Boyd of Hopalong Cassidy fame, Roy Rogers, and Johnny Mack Brown. Woodbury appeared in 50 films from 1937 to 1945, almost all of which were credited. Her most memorable of that period was her lead role in the serial Brenda Starr, Reporter, in 1945.  Description above from the Wikipedia article Joan Woodbury, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1915-12-17",
        "deathday": "1989-02-22",
        "gender": 1,
        "homepage": null,
        "id": 89746,
        "imdb_id": "nm0940199",
        "known_for_department": "Acting",
        "name": "Joan Woodbury",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.1791,
        "profile_path": "/iL1484M8j6f4vPtDGXcvD9By5oF.jpg"
    }
}