{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c7OeJd34rc9bI1DXqd4ucb1wVrf.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 625,
                "original_language": "en",
                "original_title": "The Killing Fields",
                "overview": "New York Times reporter Sydney Schanberg is on assignment covering the Cambodian Civil War, with the help of local interpreter Dith Pran and American photojournalist Al Rockoff. When the U.S. Army pulls out amid escalating violence, Schanberg makes exit arrangements for Pran and his family. Pran, however, tells Schanberg he intends to stay in Cambodia to help cover the unfolding story — a decision he may regret as the Khmer Rouge rebels move in.",
                "popularity": 3.359,
                "poster_path": "/cX6Bv7natnZwQjsV9bLL8mmWjkS.jpg",
                "release_date": "1984-11-23",
                "title": "The Killing Fields",
                "video": false,
                "vote_average": 7.461,
                "vote_count": 781,
                "character": "Dith Pran",
                "credit_id": "52fe4260c3a36847f80197e9",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " 吴汉润",
            "Dr. Haing S. Ngor"
        ],
        "biography": "​Dr. Haing Somnang Ngor (March 22, 1940 – February 25, 1996) was a Cambodian-born American physician, actor, and author who is best known for winning the 1985 Academy Award for Best Supporting Actor for his debut performance in the movie The Killing Fields, in which he portrayed Cambodian journalist and refugee Dith Pran. His mother was Khmer and his father was of Chinese descent. Ngor and Harold Russell are the only two non-professional actors to win an Academy Award in an acting category.\n\nNgor and his close friend Jack Ong established the Dr. Haing S. Ngor Foundation to assist in raising funds for Cambodian aid. As part of his humanitarian efforts, Ngor built an elementary school and operated a small sawmill that provided jobs and an income for local families.\n\nOn February 25, 1996, he was shot and killed outside his home in Chinatown, Los Angeles. Three alleged members of the \"Oriental Lazy Boyz\" street gang, who had prior arrests for snatching purses and jewelry, were charged with the murder. They were tried together in the Superior Court of Los Angeles County, though their cases were heard by three separate juries. Prosecutors argued that they killed Ngor because, after handing over his gold Rolex watch willingly, he refused to give them a locket that contained a photo of his late wife, My-Huoy.\n\nAll of the defendants were found guilty on April 16, 1998, the same day Pol Pot's death was confirmed in Cambodia. Tak Sun Tan was sentenced to 56 years to life; Indra Lim to 26 years to life; and Jason Chan to life sentence without parole.\n\nFrom Wikipedia, the free encyclopedia.",
        "birthday": "1940-03-22",
        "deathday": "1996-02-25",
        "gender": 2,
        "homepage": null,
        "id": 8976,
        "imdb_id": "nm0628955",
        "known_for_department": "Acting",
        "name": "Haing S. Ngor",
        "place_of_birth": null,
        "popularity": 0.2065,
        "profile_path": "/60QdTuxnCtOKjrU6yz4od7JeKvh.jpg"
    }
}