{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pWd09ohdwOSNF4IWG8a25qORc2O.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35,
                    18
                ],
                "id": 9487,
                "original_language": "en",
                "original_title": "A Bug's Life",
                "overview": "On behalf of \"oppressed bugs everywhere,\" an inventive ant named Flik hires a troupe of warrior bugs to defend his bustling colony from a horde of freeloading grasshoppers led by the evil-minded Hopper.",
                "popularity": 10.3363,
                "poster_path": "/Ah3J9OJVc2CNCuH2zMydXy9fmIC.jpg",
                "release_date": "1998-11-25",
                "title": "A Bug's Life",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 9459,
                "character": "Queen (voice)",
                "credit_id": "52fe44fec3a36847f80b6513",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Phyllis Driver"
        ],
        "biography": "Phyllis Ada Diller (née Driver; July 17, 1917 – August 20, 2012) was an American stand-up comedian, actress, author, musician, and visual artist, best known for her eccentric stage persona, self-deprecating humor, wild hair and clothes, and exaggerated, cackling laugh.\n\nDiller was one of the first female comics to become a household name in the U.S., credited as an influence by Joan Rivers, Roseanne Barr, and Ellen DeGeneres, among others. She had a large gay following and is considered a gay icon. She was also one of the first celebrities to openly champion plastic surgery, for which she was recognized by the cosmetic surgery industry.\n\nDiller contributed to more than 40 films, beginning with 1961's Splendor in the Grass. She appeared in many television series, featuring in numerous cameos as well as her own short-lived sitcom and variety show. Some of her credits include Night Gallery, The Muppet Show, The Love Boat, Cybill, and Boston Legal, plus 11 seasons of The Bold and the Beautiful. Her voice-acting roles included the monster's wife in Mad Monster Party, the Queen in A Bug's Life, Granny Neutron in The Adventures of Jimmy Neutron: Boy Genius, and Thelma Griffin in Family Guy.\n\nDescription above from the Wikipedia article Phyllis Diller, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1917-07-17",
        "deathday": "2012-08-20",
        "gender": 1,
        "homepage": null,
        "id": 89784,
        "imdb_id": "nm0226887",
        "known_for_department": "Acting",
        "name": "Phyllis Diller",
        "place_of_birth": "Lima, Ohio, USA",
        "popularity": 0.3927,
        "profile_path": "/teELYDRWmPGAVCzH4n4lX17Wa4J.jpg"
    }
}