{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/scQf03Fm3jeyv4FH04qvi4fp4wh.jpg",
                "genre_ids": [
                    80,
                    35,
                    28
                ],
                "id": 402900,
                "original_language": "en",
                "original_title": "Ocean's Eight",
                "overview": "Debbie Ocean, a criminal mastermind, gathers a crew of female thieves to pull off the heist of the century at New York's annual Met Gala.",
                "popularity": 9.0605,
                "poster_path": "/MvYpKlpFukTivnlBhizGbkAe3v.jpg",
                "release_date": "2018-06-07",
                "title": "Ocean's Eight",
                "video": false,
                "vote_average": 6.968,
                "vote_count": 8525,
                "character": "Anna Wintour",
                "credit_id": "587a37d89251413f0f002ca6",
                "order": 117
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Anna Wintour, OBE (born November 3, 1949) is the British-born editor-in-chief of American Vogue, a position she has held since 1988. With her trademark pageboy bob haircut and sunglasses, Wintour has become an institution throughout the fashion world, widely praised for her eye for fashion trends and her support for younger designers. Her reportedly aloof and demanding personality has earned her the nickname \"Nuclear Wintour\".\n\nShe is the eldest daughter of Charles Wintour, editor of the London Evening Standard. Anna became interested in fashion as a teenager. Her father consulted her on how to make the newspaper relevant to the youth of the era. Her career in fashion journalism began at two British magazines. Later she moved to the United States, with stints at New York and House & Garden. She returned home for a year to turn around British Vogue, and later assumed control of the franchise's magazine in New York, reviving what many saw as a stagnating publication. Her use of the magazine to shape the fashion industry has been the subject of debate within it. Animal rights activists have attacked her for promoting fur, while other critics have charged her with using the magazine to promote elitist views of femininity and beauty.\n\nA former personal assistant, Lauren Weisberger, wrote the 2003 bestselling roman à clef The Devil Wears Prada, later made into a successful film starring Meryl Streep as Miranda Priestly, a fashion editor widely believed to be based on Wintour. In 2009 she was the focus of another film, R.J. Cutler's documentary The September Issue.",
        "birthday": "1949-11-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 89815,
        "imdb_id": "nm1659661",
        "known_for_department": "Acting",
        "name": "Anna Wintour",
        "place_of_birth": "London, England, UK",
        "popularity": 1.0993,
        "profile_path": "/n14ZUjdjBkdFKDJsbvUubcYPA4i.jpg"
    }
}