{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uw4SnKFZ453Gxmj5XR5Susj8TNo.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 602,
                "original_language": "en",
                "original_title": "Independence Day",
                "overview": "Strange phenomena surface around the globe. The skies ignite. Terror races through the world's major cities. As these extraordinary events unfold, it becomes increasingly clear that a force of incredible magnitude has arrived. Its mission: total annihilation over the Fourth of July weekend. The last hope to stop the destruction is an unlikely group of people united by fate and unimaginable circumstances.",
                "popularity": 7.9562,
                "poster_path": "/p0BPQGSPoSa8Ml0DAf2mB2kCU0R.jpg",
                "release_date": "1996-06-25",
                "title": "Independence Day",
                "video": false,
                "vote_average": 6.896,
                "vote_count": 9970,
                "character": "Alicia",
                "credit_id": "52fe425bc3a36847f8017fbf",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/sTgavNm82pTaZR9U2NQZ1J2FrJz.jpg",
                "genre_ids": [
                    35,
                    18,
                    10751
                ],
                "id": 788,
                "original_language": "en",
                "original_title": "Mrs. Doubtfire",
                "overview": "Loving but irresponsible dad Daniel Hillard, estranged from his exasperated spouse, is crushed by a court order allowing only weekly visits with his kids. When Daniel learns his ex needs a housekeeper, he gets the job -- disguised as a British nanny. Soon he becomes not only his children's best pal but the kind of parent he should have been from the start.",
                "popularity": 5.8994,
                "poster_path": "/shHrSmXS5140o6sQzgzXxn3KqSm.jpg",
                "release_date": "1993-11-24",
                "title": "Mrs. Doubtfire",
                "video": false,
                "vote_average": 7.196,
                "vote_count": 6349,
                "character": "Lydia Hillard",
                "credit_id": "52fe4276c3a36847f80209cf",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nLisa Jakub (born December 27, 1978) is a Canadian writer, yoga teacher, and former actress. She is best known for her roles as Lydia Hillard in the comedy-drama film Mrs. Doubtfire (1993) and as Alicia Casse in Independence Day (1996).\n\nChildhood and education\n\nJakub was born on December 27, 1978, in Toronto, Ontario. She is of Slovak (father) and Welsh and Scottish (mother) descent. She attended multiple schools in her early life, including Hillfield Strathallan College.\n\nJakub graduated from the University of Virginia with a degree in sociology in 2010.\n\nActing\n\nJakub's first role was as Katis' Granddaughter in the 1985 film Eleni. She appeared in comedy-drama film Mrs. Doubtfire (1993) alongside Mara Wilson, Sally Field, Matthew Lawrence, and Robin Williams. When Jakub received the part of Lydia in Mrs. Doubtfire, her high school expelled her for accruing too many absences. Robin Williams wrote a letter to Jakub's high school, pleading with them to re-admit Jakub but this was unsuccessful.\n\nShe played Sandra in Matinee (1993), appeared in A Pig's Tale (1994) and Independence Day (1996), The Beautician and the Beast (1997), and played the \"inspiration\" for Princess Leia in the short film George Lucas in Love (1999). She starred in Picture Perfect (1995) and portrayed a bordello worker in the American Old West in Painted Angels (1997).\n\nPersonal life\n\nJakub retired from acting in 2001 at the age of 22 and soon moved to Virginia. In 2005, she married Jeremy Jones, a longtime friend and former theatre manager. Jakub stated she has no plans to return to acting.\n\nJakub later became a writer, authoring two non-fiction books: the autobiography You Look Like That Girl (2015) and Not Just Me (2017). She also contributes to online blogs.\n\nJakub is a qualified Kripalu yoga teacher. She has openly discussed her battles with anxiety, depression and panic attacks, from which she has suffered since her teenage years, and credits her yoga practice for helping her to overcome them. In 2021, Lisa launched a new website, BlueMala, which she described as the resource that she wished she had when she was in her darkest moments. The website contains her articles on mental wellness along with her yoga and meditation videos.\n\nWritings\n\nYou Look Like That Girl: A Child Actor Stops Pretending and Finally Grows Up (2015)\n\nNot Just Me: Anxiety, Depression, and Learning to Embrace Your Weird (2017)\n\n(Don't) Call Me Crazy (contributing writer) (Algonquin, 2018)",
        "birthday": "1978-12-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 8987,
        "imdb_id": "nm0004356",
        "known_for_department": "Acting",
        "name": "Lisa Jakub",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.9382,
        "profile_path": "/6lgi7ietMAsarGhEvjWZFjDA3S2.jpg"
    }
}