{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xMoQjqa3JUc2unO4nF9PmM1JTQu.jpg",
                "genre_ids": [
                    10402,
                    35,
                    10749
                ],
                "id": 11113,
                "original_language": "en",
                "original_title": "My Fair Lady",
                "overview": "A snobbish phonetics professor agrees to a wager that he can take a flower girl and make her presentable in high society.",
                "popularity": 4.1967,
                "poster_path": "/bTXVc29lGSNclf94VIZ49W4gGKl.jpg",
                "release_date": "1964-12-01",
                "title": "My Fair Lady",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1368,
                "character": "Mrs. Pearce",
                "credit_id": "538e0757c3a36871550051ce",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mona Lee Washbourne",
            "Мона Уошборн"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMona Lee Washbourne (27 November 1903 – 15 November 1988) was an English actress of stage, film, and television. Her most critically acclaimed role was in the film Stevie (1978), late in her career, for which she was nominated for a Golden Globe Award and a BAFTA Award.\n\nMona Washbourne was born in Solihull, Warwickshire and began her entertaining career training as a concert pianist.\n\nIn 1948, after several years acting professionally on stage, and numerous stage musical performances, she began appearing in films. Her film credits include the horror movie The Brides of Dracula (1960), Billy Liar (1963), and The Collector (1965). She is probably best known to American audiences for her role as housekeeper Mrs. Pearce in My Fair Lady (1964). She also appeared as the stern and caustic Mrs. Bramson in the remake of Night Must Fall (also 1964), and the matron in the film If.... (1968).\n\nShe appeared at both the Royal Court Theatre in London and on Broadway in 1970 in David Storey's Home. She was nominated for the Tony Award for Best Performance by a Featured Actress in a Play. In 1975 she appeared on the West End stage with James Stewart in a revival of Mary Chase's play Harvey, in the role originally taken by Josephine Hull. Washbourne won the 1981 New York Film Critics' Circle Awards for Best Supporting Actress in Stevie (1978).\n\nIn 1981 Washbourne appeared in Granada Television's TV miniseries adaptation of Evelyn Waugh's novel Brideshead Revisited as Nanny Hawkins. One of her last television appearances was in Where's the Key? (1983), a BBC play about Alzheimer's disease.\n\nMona Washbourne was married to actor Basil Dignam (1905-1979), whom she wed in 1940.\n\nShe died in 1988, aged 84, in London.",
        "birthday": "1903-11-27",
        "deathday": "1988-11-15",
        "gender": 1,
        "homepage": null,
        "id": 89895,
        "imdb_id": "nm0913332",
        "known_for_department": "Acting",
        "name": "Mona Washbourne",
        "place_of_birth": "Solihull, Warwickshire, England, UK",
        "popularity": 0.2568,
        "profile_path": "/3verXd1ywWcpiOIPxqApEV3TvTT.jpg"
    }
}