{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/s5PP0ryxAo12jzvPntSEybahpCw.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 9516,
                "original_language": "en",
                "original_title": "Menace II Society",
                "overview": "A young street hustler attempts to escape the rigors and temptations of the ghetto in a quest for a better life.",
                "popularity": 6.1828,
                "poster_path": "/nS7yqmSVeNoH22VXj69JoFCxW1h.jpg",
                "release_date": "1993-05-26",
                "title": "Menace II Society",
                "video": false,
                "vote_average": 7.502,
                "vote_count": 815,
                "character": "Grandmama",
                "credit_id": "5a6280bfc3a3687fa3000cfc",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Marilyn B. Coleman was a writer, a singer, and an award-winning actress on Broadway, on television, and in film.\n\nShe was born to the late Estella and Fred Bonaparte in Philadelphia. She moved to Los Angeles in 1966 and began a career that spanned more than 45 years on stage, film and television.\n\nColeman started her acting career landing roles in films, such as the drama \"Looking For Mr. Goodbar\" (1977) with Diane Keaton, the comedic adaptation \"Which Way Is Up?\" (1977) with Richard Pryor and the crime flick \"Remember My Name\" (1978) with Geraldine Chaplin. She also appeared in the TV movie \"Nowhere to Run\" (NBC, 1977-78). She also was featured in the miniseries \"A Woman Called Moses\" (1978-79). She worked in television in her early acting career as well, including a part on \"Good Times\" (CBS, 1973-79). Her career progressed to film, including a role in the Season Hubley drama \"Vice Squad\" (1982). She also starred in the TV movies \"Aunt Mary\" (1979-1980), \"The Best Little Girl in the World\" (ABC, 1980-81) and \"Something So Right\" (CBS, 1982-83). Coleman focused on film in more recent years, appearing in the dramatic comedy \"The Five Heartbeats\" (1991) with Robert Townsend and \"Menace II Society\" (1993) with Tyrin Turner. She also was featured in the TV movie \"Heat Wave\" (TNT, 1989-1990). She also worked in television during these years, including a part on \"Designing Women\" (CBS, 1986-1993). Coleman more recently acted in the Robert Townsend adventurous drama \"The Meteor Man\" (1993).\n\nMarilyn was formerly married to jazz percussionist George Allen. They have a daughter, Marci Allen-Koutsialis. After their divorce, she married jazz singer Earl Coleman. They had two children, Kevin Coleman and Dana Coleman-Baylor.",
        "birthday": "1934-03-23",
        "deathday": "2013-06-25",
        "gender": 1,
        "homepage": null,
        "id": 89954,
        "imdb_id": "nm0171141",
        "known_for_department": "Acting",
        "name": "Marilyn Coleman",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.2007,
        "profile_path": "/dL6XJpxVrdj1Tj4bzXiauzGrVfu.jpg"
    }
}