{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/m2SXRnAd0d5N6qH2cbgluRgMX4z.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 11016,
                "original_language": "en",
                "original_title": "Key Largo",
                "overview": "A hurricane swells outside, but it's nothing compared to the storm within the hotel at Key Largo. There, sadistic mobster Johnny Rocco holes up - and holds at gunpoint hotel owner James Temple, his widowed daughter-in-law Nora, and ex-GI Frank McCloud.",
                "popularity": 4.4886,
                "poster_path": "/rySfmQQZhS7RswOiJcJrww6FcHy.jpg",
                "release_date": "1948-07-16",
                "title": "Key Largo",
                "video": false,
                "vote_average": 7.459,
                "vote_count": 554,
                "character": "Sheriff Ben Wade",
                "credit_id": "52fe43e39251416c750220a5",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/87wqeMeUeMRLjsE1IWNKJcPlpuC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 289,
                "original_language": "en",
                "original_title": "Casablanca",
                "overview": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
                "popularity": 5.0551,
                "poster_path": "/oyGRZVIthHJjc98ekKpeWpDh8Ws.jpg",
                "release_date": "1943-01-15",
                "title": "Casablanca",
                "video": false,
                "vote_average": 8.155,
                "vote_count": 5717,
                "character": "American (uncredited)",
                "credit_id": "53a1b530c3a3687ba6002fb4",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "G.M. Blue",
            "Gerard Montgomery \"Monte\" Blue",
            "Gerard Montgomery Blue"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMonte Blue (January 11, 1887 – February 18, 1963) was a movie actor who began his career as a romantic leading man in the silent film era, and later progressed to character roles.\n\nBlue was born as Gerard Montgomery Bluefeather in Indianapolis, Indiana. His father was half French, half Cherokee Indian. One of five children, his father died and his mother could not raise five children alone. Along with another brother, they both admitted to the Indiana Soldiers' and Sailors' Children's Home. This did not stop him working his way through to Purdue University.\n\nWhen growing up, Blue built up his physique to become a football player (he grew to six feet three inches tall). He not only played football, but he was also a fireman, railroad worker, coal miner, cowpuncher, ranch hand, circus rider, lumberjack, and finally, a day laborer at the studios of D. W. Griffith.\n\nHe had no theatrical experience when he came to the screen. In his first movie, The Birth of a Nation (1915), he was a stuntman and an extra in the movie. In his next movie, he starred in another small part in the movie, Intolerance (1916). Gradually moving to supporting roles for both D. W. Griffith and Cecil B. DeMille, Blue earned his breakthrough role as Danton in Orphans of the Storm, starring sisters, Lillian Gish and Dorothy Gish. Then he rose to stardom as a rugged romantic lead along with top leading actresses such as Clara Bow, Gloria Swanson, and Norma Shearer. His most prolific female screen partner was Marie Prevost with whom he made several films in the mid 20s at Warner Brothers. Blue's finest silent screen performance was as the alcoholic doctor who finds paradise in MGM's White Shadows in the South Seas (1928). Blue became one of the few silent stars to survive the talkie revolution. However, he lost his investments in the stock market crash of 1929.\n\nHe rebuilt his career as a character actor, working until his retirement in 1954. One of his more memorable roles was the sheriff in Key Largo. He divorced his first wife in 1923 and married Tova Jansen in 1924. He had two children, Barbara Ann and Richard Monte. During the later part of his life, Monte Blue was an active Mason and the advance man for the Hamid-Morton Shrine Circus; while on business in Milwaukee, Wisconsin, he had a heart attack because of complications from influenza, dying at age 76.\n\nMonte Blue has a star on the Hollywood Walk of Fame at 6286 Hollywood Blvd.\n\nDescription above from the Wikipedia article Monte Blue, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1887-01-10",
        "deathday": "1963-02-18",
        "gender": 2,
        "homepage": null,
        "id": 90074,
        "imdb_id": "nm0089524",
        "known_for_department": "Acting",
        "name": "Monte Blue",
        "place_of_birth": "Indianapolis, Indiana, USA",
        "popularity": 0.224,
        "profile_path": "/f9VVvlkPviIaHfcW8fog8JwYUvP.jpg"
    }
}