{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sd4xN5xi8tKRPrJOWwNiZEile7f.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    10751
                ],
                "id": 920,
                "original_language": "en",
                "original_title": "Cars",
                "overview": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters.",
                "popularity": 10.888,
                "poster_path": "/u4G8EkiIBZYx0wEg2xDlXZigTOZ.jpg",
                "release_date": "2006-06-08",
                "title": "Cars",
                "video": false,
                "vote_average": 7.01,
                "vote_count": 14592,
                "character": "Mario Andretti (voice)",
                "credit_id": "59234930c3a36804a3000e2a",
                "order": 29
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/sd4xN5xi8tKRPrJOWwNiZEile7f.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    10751
                ],
                "id": 920,
                "original_language": "en",
                "original_title": "Cars",
                "overview": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters.",
                "popularity": 10.888,
                "poster_path": "/u4G8EkiIBZYx0wEg2xDlXZigTOZ.jpg",
                "release_date": "2006-06-08",
                "title": "Cars",
                "video": false,
                "vote_average": 7.01,
                "vote_count": 14592,
                "credit_id": "5ba0352bc3a368711500481d",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nMario Gabriele Andretti (born February 28, 1940) is a retired Italian American world champion racing driver, one of the most successful Americans in the history of the sport. He is one of only two drivers to win races in Formula One, IndyCar, World Sportscar Championship and NASCAR (the other being Dan Gurney). He also won races in midget cars, sprint cars, and drag racing.\n\nDuring his career, Andretti won four IndyCar titles (three under USAC-sanctioning, one under CART), the 1978 Formula One World Championship, and IROC VI. To date, he remains the only driver ever to win the Indianapolis 500 (1969), Daytona 500 (1967) and the Formula One World Championship, and, along with Juan Pablo Montoya, the only driver to have won a race in the NASCAR Sprint Cup Series, Formula One, and an Indianapolis 500. No American has won a Formula One race since Andretti's victory at the 1978 Dutch Grand Prix. Andretti had 109 career wins on major circuits.\n\nAndretti had a long career in racing. He was the only person to be named United States Driver of the Year in three decades (1967, 1978, and 1984). He was also one of only three drivers to win races on road courses, paved ovals, and dirt tracks in one season, a feat that he accomplished four times. With his final IndyCar win in April 1993, Andretti became the first driver to win IndyCar races in four different decades and the first to win automobile races of any kind in five.\n\nIn American popular culture, his name has become synonymous with speed, similar to Barney Oldfield in the early twentieth century and Stirling Moss in the United Kingdom.\n\nDescription above from the Wikipedia article Mario Andretti licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1940-02-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 90424,
        "imdb_id": "nm0004707",
        "known_for_department": "Acting",
        "name": "Mario Andretti",
        "place_of_birth": "Montona, Istria, Italy  -now Motovun, Istria, Croatia",
        "popularity": 0.1137,
        "profile_path": "/d73LeLNJT02qEJ8ay0gY5GDcW4t.jpg"
    }
}