{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/exPxtvZYNxpt6xTCPYYkCVyquh5.jpg",
                "genre_ids": [
                    53,
                    28,
                    35,
                    80
                ],
                "id": 252822,
                "original_language": "no",
                "original_title": "Kraftidioten",
                "overview": "Upstanding community leader Nils has just won an award for \"Citizen of the Year\" when he learns the news that his son has died of a heroin overdose. Suspecting foul play, Nils begins to investigate, and soon finds himself at the center of an escalating underworld gang war between Serbian drug dealers and a sociopathic criminal mastermind known only as “The Count.”",
                "popularity": 2.1943,
                "poster_path": "/ujlJLvzWRh2hR0UoHypv9QLZ2os.jpg",
                "release_date": "2014-02-21",
                "title": "In Order of Disappearance",
                "video": false,
                "vote_average": 6.904,
                "vote_count": 642,
                "character": "Marit",
                "credit_id": "52fe4e569251416c9112e48f",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Birgitte Hjort Sorensen",
            "Birgitte Hjort-Sørensen",
            "Birgitte Hjort-Sorensen",
            "Birgitte Hjort",
            "비르기테 요르트 쇠렌센",
            "بریگیته هیورت سورنسن"
        ],
        "biography": "Birgitte Hjort Sørensen (born 16 January 1982) is a Danish actress. She has been nominated for three Robert Awards and one Bodil Award. Born in Hillerød and raised in Birkerød, Sørensen aspired to an acting career after watching the West End production of the musical Chicago while at school. She graduated from the Danish National School of Performing Arts. Her acting debut was in a minor role in the television series The Eagle in 2005. She followed this by playing Roxie Hart in a Copenhagen production of Chicago, and later on the West End. Sørensen's breakthrough role was as journalist Katrine Fønsmark in the television political drama Borgen (2010–2013).\n\nDescription above from the Wikipedia article Birgitte Hjort Sørensen, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1982-01-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 90514,
        "imdb_id": "nm2171898",
        "known_for_department": "Acting",
        "name": "Birgitte Hjort Sørensen",
        "place_of_birth": "Hillerød, Danmark",
        "popularity": 1.035,
        "profile_path": "/nFWcco0Z1Ic50g7YfZlaUrjBiEp.jpg"
    }
}