{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nRsr98MFztBGm532hCVMGXV6qOp.jpg",
                "genre_ids": [
                    12,
                    14,
                    10751
                ],
                "id": 630,
                "original_language": "en",
                "original_title": "The Wizard of Oz",
                "overview": "Young Dorothy finds herself in a magical world where she makes friends with a lion, a scarecrow and a tin man as they make their way along the yellow brick road to talk with the Wizard and ask for the things they miss most in their lives. The Wicked Witch of the West is the only thing that could stop them.",
                "popularity": 7.919,
                "poster_path": "/pfAZFD7I2hxW9HCChTuAzsdE6UX.jpg",
                "release_date": "1939-08-15",
                "title": "The Wizard of Oz",
                "video": false,
                "vote_average": 7.591,
                "vote_count": 5830,
                "character": "\"Hunk\" / Scarecrow",
                "credit_id": "52fe4261c3a36847f8019be3",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raymond Wallace Bulcao",
            "Рэй Болджер",
            "Raymond Wallace Bolger"
        ],
        "biography": "Ray Bolger began his career in vaudeville. He was half of a team called \"Sanford and Bolger\" and also did numerous Broadway shows on his own. He, like Gene Kelly, was a song-and-dance man as well as an actor. He was signed to a contract with MGM in 1936 and his first role was as himself in The Great Ziegfeld (1936). This was soon followed by a role opposite Eleanor Powell in Rosalie (1937). His first dancing and singing role was in Sweethearts (1938), where he did the \"wooden shoes\" number with red-headed soprano/actress Jeanette MacDonald. This got him noticed by MGM producers and resulted in his being cast in his most famous role, that of the Scarecrow in The Wizard of Oz (1939). Surprisingly, even though the film was a success, Bolger's contract with MGM ended. He went to RKO to make Four Jacks and a Jill (1942). After this, Bolger went to Broadway, where he received his greatest satisfaction. In 1953 he turned to television and got his own sitcom, Where's Raymond? (1953), later changed to \"The Ray Bolger Show\". After his series ended, Bolger made frequent guest appearances on TV and had some small roles in movies. In 1985 he co-hosted That's Dancing! (1985) with Liza Minnelli. Bolger died in 1987 at the age of 83. Interred at Holy Cross Cemetery, Culver City, California, USA, in the Mausoleum, Crypt F2, Block 35.",
        "birthday": "1904-01-10",
        "deathday": "1987-01-15",
        "gender": 2,
        "homepage": null,
        "id": 9068,
        "imdb_id": "nm0001961",
        "known_for_department": "Acting",
        "name": "Ray Bolger",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.3285,
        "profile_path": "/43GZ1i6m905Q0r0qe99lgUUPX5O.jpg"
    }
}