{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fO0qXJnBJYuWJ5dvWWGXfRF8MXA.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 382591,
                "original_language": "fr",
                "original_title": "Demain tout commence",
                "overview": "A man without attachments or responsibilities suddenly finds himself with an abandoned baby and leaves for London to try and find the mother. Eight years later after he and his daughter become inseparable Gloria's mother reappears.",
                "popularity": 3.279,
                "poster_path": "/aFgtdhuzgI2eqnIVWtRB03x3pnt.jpg",
                "release_date": "2016-12-07",
                "title": "Two Is a Family",
                "video": false,
                "vote_average": 7.737,
                "vote_count": 3008,
                "character": "Bernie",
                "credit_id": "56bfa2649251414ba9000ebf",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Peter Choinière"
        ],
        "biography": "Antoine Bertrand (born September 13, 1977) is a Canadian film and television actor. He is best known for his roles in the television series Les Bougon and the films Louis Cyr, a role that earned him the Iris Award for Best Actor, and Starbuck, for which he garnered a Genie Award nomination for Best Supporting Actor at the 2012 Genie Awards.\n\nAntoine Bertrand became famous from his role as Junior in the popular TV series Les Bougon in 2003. He was also acclaimed for his role as Yannick in the TV series C.A., for which he won a Gémeaux Award in the category “Best Leading Male Role: Comedy.” From 2010 to 2014, he co-hosted the cult show Les enfants de la télé alongside Véronique Cloutier, which earned him two Gémeaux Awards in the category “Best Show Host: Comedy, Variety Series, Game, or Reality Show.” More recently, he has appeared in Boomerang and True North, series for which he has also been awarded. He has numerous credits on the big screen in more than a dozen feature films, including Martin Villeneuve's The 12 Tasks of Imelda (Les 12 travaux d'Imelda), co-starring playwright Robert Lepage and actress-signer Ginette Reno, in which he plays Martin and Denis Villeneuve's cousin Louis.\n\nSource: Article \"Antoine Bertrand\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1977-09-13",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.agenceartistique.com/1-antoine-bertrand-profil.html",
        "id": 90681,
        "imdb_id": "nm1531116",
        "known_for_department": "Acting",
        "name": "Antoine Bertrand",
        "place_of_birth": "Granby, Québec, Canada",
        "popularity": 0.2894,
        "profile_path": "/uVVAjRMb7eVOehWRkE6shiMspuK.jpg"
    }
}