{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mpfRchw4jh2cEBajB9EJltTnDH2.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 1429,
                "original_language": "en",
                "original_title": "25th Hour",
                "overview": "In New York City in the days following the events of 9/11, Monty Brogan is a convicted drug dealer about to start a seven-year prison sentence, and his final hours of freedom are devoted to hanging out with his closest buddies and trying to prepare his girlfriend for his extended absence.",
                "popularity": 4.4731,
                "poster_path": "/uW7tTRElr2tRhmAVESzvHy4ByXg.jpg",
                "release_date": "2002-12-19",
                "title": "25th Hour",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 2441,
                "character": "Schultz",
                "credit_id": "5f8badd8202e1100384bd3c8",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nMarc H. Simon is an award winning filmmaker and respected entertainment attorney. He created, wrote and produced After Innocence, which won the special jury award at the 2005 Sundance Film Festival, before going on to receive other numerous recognitions, including its selection as a semi-finalist for Best Feature Documentary at the 78th Academy Awards. Nursery University (2008) marked Simon’s feature directorial debut. The film, which premiered at Toronto's Hot Docs Film Festival, was the top-grossing independent film during its opening theatrical weekend, and has been broadcast throughout the world. The documentary Unraveled (2011) is Simon’s second straight directing effort and third as a producer. The film centers around prominent laywer, Marc Dreier, who was arrested for orchestrating a massive fraud scheme that netted hundreds of millions of dollars from hedge funds.\n\nSimon is also a leading independent film attorney serving as lead counsel for films such as Winter's Bone, The Kids Are All Right, and Werner Herzog’s Cave of Forgotten Dreams.\n\nDescription above from the Wikipedia article Marc H. Simon, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 90698,
        "imdb_id": "nm1296465",
        "known_for_department": "Production",
        "name": "Marc H. Simon",
        "place_of_birth": null,
        "popularity": 0.6193,
        "profile_path": null
    }
}