{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c9SvfYLJyai34bafR1AvqD9vAJi.jpg",
                "genre_ids": [
                    18
                ],
                "id": 209274,
                "original_language": "pl",
                "original_title": "Ida",
                "overview": "In 1960s Poland, young novitiate Anna is on the verge of taking her vows when she discovers a family secret dating back to the years of the German occupation.",
                "popularity": 2.0521,
                "poster_path": "/3uoCttE46RGHybiA26cXTvmFqbW.jpg",
                "release_date": "2013-10-25",
                "title": "Ida",
                "video": false,
                "vote_average": 7.246,
                "vote_count": 1013,
                "character": "Singer",
                "credit_id": "52fe4d60c3a368484e1e5d61",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/uIUhGW2PMMlxr3GccdMdOMcqsIa.jpg",
                "genre_ids": [
                    10749,
                    10402,
                    18
                ],
                "id": 440298,
                "original_language": "pl",
                "original_title": "Zimna wojna",
                "overview": "A man and a woman meet in the ruins of post-war Poland. With vastly different backgrounds and temperaments, they are fatally mismatched and yet drawn to each other.",
                "popularity": 2.1999,
                "poster_path": "/6rbS8oPIgUMhQgIX8oGVTtlNgLR.jpg",
                "release_date": "2018-06-08",
                "title": "Cold War",
                "video": false,
                "vote_average": 7.444,
                "vote_count": 1525,
                "character": "Zuzanna 'Zula' Lichoń",
                "credit_id": "599971fa9251410ec8027966",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joanna Kulig (born June 24, 1982) is a Polish actress and singer. Noted for performing in different languages, she has worked in film, television and radio as well as on stage. She is the recipient of a European Film Award and two Polish Film Awards, and her work has been recognised at various film festivals. In 2018, Polish magazine Wprost included her among the 50 most influential Poles for her contributions to the cinema of Poland.\n\nAfter an unsuccessful attempt at a career as a jazz singer, Kulig enrolled at the AST National Academy of Theatre Arts in Kraków, graduating in 2007. She began performing on stage while still in drama school, debuting in the play A Midsummer Night's Dream. Her first starring film role in the 2007 drama Wednesday, Thursday Morning won her the award for Best Debut at the Gdynia Film Festival. She received further acclaim for her performance in the 2011 film Elles, which earned her Best Supporting Actress at the Polish Film Awards and Gdynia Film Festival.\n\nKulig was born on 24 June 1982 in Krynica, Lesser Poland Voivodeship, Poland. Her mother worked as a cook at a local kindergarten and her father was a folk poet. She was raised in a musical family along with four siblings—two older brothers and two younger sisters—in Muszynka. One of her sisters, Justyna Schneider, is also an actress and adopted their great-grandmother's surname to avoid confusion as their first names are similar",
        "birthday": "1982-06-24",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.dasimperium.com/joanna-kulig/",
        "id": 908548,
        "imdb_id": "nm2251846",
        "known_for_department": "Acting",
        "name": "Joanna Kulig",
        "place_of_birth": "Krynica-Zdrój, Poland",
        "popularity": 0.6747,
        "profile_path": "/hlRdav6dSvfzyDnSSMooVh9GVxh.jpg"
    }
}