{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hKrrCigPFmhv1bg5IJl9nzjEaN4.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 631,
                "original_language": "en",
                "original_title": "Sunrise: A Song of Two Humans",
                "overview": "A married farmer falls under the spell of a slatternly woman from the city, who tries to convince him to drown his wife.",
                "popularity": 3.5707,
                "poster_path": "/oj8ZW8jKXBSs8F1e5iWsTUeXSJW.jpg",
                "release_date": "1927-11-04",
                "title": "Sunrise: A Song of Two Humans",
                "video": false,
                "vote_average": 7.836,
                "vote_count": 850,
                "character": "The Photographer",
                "credit_id": "52fe4261c3a36847f8019cbd",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/3q35nBLCIdEbxYfsr7D5ocYQXKz.jpg",
                "genre_ids": [
                    18,
                    10751,
                    14
                ],
                "id": 1585,
                "original_language": "en",
                "original_title": "It's a Wonderful Life",
                "overview": "A holiday favourite for generations...  George Bailey has spent his entire life giving to the people of Bedford Falls.  All that prevents rich skinflint Mr. Potter from taking over the entire town is George's modest building and loan company.  But on Christmas Eve the business's $8,000 is lost and George's troubles begin.",
                "popularity": 6.3809,
                "poster_path": "/bSqt9rhDZx1Q7UZ86dBPKdNomp2.jpg",
                "release_date": "1946-12-20",
                "title": "It's a Wonderful Life",
                "video": false,
                "vote_average": 8.272,
                "vote_count": 4589,
                "character": "Man Whose Grandfather Planted Tree (uncredited)",
                "credit_id": "52fe4301c3a36847f803360d",
                "order": 88
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joseph Farrell MacDonald",
            "John Farrell MacDonald",
            "Farrell Macdonald",
            "J. Farrell McDonald",
            "J.F. McDonald"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJohn Farrell MacDonald (June 6, 1875 – August 2, 1952) was an American character actor and director. He played supporting roles and occasional leads. He appeared in over 325 films over a 41-year career from 1911 to 1951, and directed forty-four silent films from 1912 to 1917.\n\nMacDonald was the principal director of L. Frank Baum's Oz Film Manufacturing Company, and he can frequently be seen in the films of Frank Capra, Preston Sturges and, especially, John Ford.\n\nEarly in his career, MacDonald was a singer in minstrel shows, and he toured the United States extensively for two years with stage productions. He made his first silent film in 1911, a dramatic short entitled The Scarlett Letter made by Carl Laemmle's Independent Moving Pictures Company (IMP), the forerunner of Universal Pictures,. He continued to act in numerous films each year from that time on, and by 1912 he was directing them as well. The first film he directed was The Worth of a Man, another dramatic short, again for IMP, and he was to direct 43 more films until his last in 1917, Over the Fence, which he co-directed with Harold Lloyd. MacDonald had crossed paths with Lloyd several years earlier, when Lloyd was an extra and MacDonald had given him much-needed work – and he did the same with Hal Roach, both of whom appearing in small roles in The Patchwork Girl of Oz, which MacDonald directed in 1914. When Roach set up his own studio, with Lloyd as his principal attraction, he hired MacDonald to direct.\n\nBy 1918, MacDonald, who was to become one of the most beloved character men in Hollywood, had given up directing and was acting full-time, predominantly in Westerns and Irish comedies. He first worked under director John Ford in 1919's A Fight for Love. In all, Ford would use MacDonald on twenty-five films between 1919 and 1950.\n\nWith a voice that matched his personality, MacDonald made the transition to sound films easily, with no noticeable drop in his acting output – if anything, it went up. In 1931, for instance, MacDonald appeared in 14 films – among them the first version of The Maltese Falcon, in which he played \"Detective Tom Polhaus\" – and in 22 of them in 1932. Although he played laborers, policemen, military men and priests, among many other characters, his roles were usually a cut above a \"bit part\". His characters usually had names, and he was most often credited for his performances. A highlight of this period was his performance as the hobo \"Mr. Tramp\" in Our Little Girl with Shirley Temple (1935).\n\nIn the 1940s, MacDonald was part of Preston Sturges' unofficial \"stock company\" of character actors, appearing in seven films written and directed by Sturges. MacDonald appeared in Sullivan's Travels, The Palm Beach Story, The Miracle of Morgan's Creek, The Great Moment, The Sin of Harold Diddlebock, Unfaithfully Yours and The Beautiful Blonde from Bashful Bend, Sturges' last American film. Earlier, MacDonald had also appeared in The Power and the Glory, which Sturges wrote. His work on Sturges' films was generally uncredited. He was notable in 1946 in John Ford's My Darling Clementine in which he played \"Mac,\" the bartender in the town saloon. MacDonald also had uncredited roles in It's a Wonderful Life and Here Comes The Groom.",
        "birthday": "1875-06-05",
        "deathday": "1952-08-02",
        "gender": 2,
        "homepage": null,
        "id": 9091,
        "imdb_id": "nm0531759",
        "known_for_department": "Acting",
        "name": "J. Farrell MacDonald",
        "place_of_birth": "Waterbury, Connecticut, USA",
        "popularity": 0.3501,
        "profile_path": "/hSINvJ003UJAohrEgqBPkXzu1cM.jpg"
    }
}