{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hKrrCigPFmhv1bg5IJl9nzjEaN4.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 631,
                "original_language": "en",
                "original_title": "Sunrise: A Song of Two Humans",
                "overview": "A married farmer falls under the spell of a slatternly woman from the city, who tries to convince him to drown his wife.",
                "popularity": 3.3885,
                "poster_path": "/oj8ZW8jKXBSs8F1e5iWsTUeXSJW.jpg",
                "release_date": "1927-11-04",
                "title": "Sunrise: A Song of Two Humans",
                "video": false,
                "vote_average": 7.836,
                "vote_count": 850,
                "character": "The Manicure Girl",
                "credit_id": "52fe4261c3a36847f8019cc5",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia\n\nJane Winton (October 10, 1905 - September 22, 1959) was a movie actress, dancer, opera soprano, writer, and painter. She was born in Philadelphia, Pennsylvania.\n\nDuring the 1920s she began her stage career as a dancer with the Ziegfeld Follies.\n\nAfter coming to the west coast Winton became known as the green-eyed goddess of Hollywood. Her film appearances include roles in Tomorrow's Love (1925), Why Girls Go Back Home (1926), Sunrise, The Crystal Cup and The Fair Coed (1927), Burning Daylight, Melody of Love and The Patsy (1928), Scandal and Show Girl in Hollywood (1929), and The Furies and Hell's Angels (1930).\n\nWinton played Donna Isobel, the mother of the title character, in Don Juan (1926). The film starred John Barrymore and Mary Astor. The movie was billed as the first film made in Vitaphone, a new invention which synchronized sound with motion pictures. Modern talking pictures began with the Vitaphone.\n\nAfter leaving Hollywood, Winton performed various operatic roles both in the United States and abroad. In 1933 she was with the National Grand Opera Company for their production of I Pagliacci. She sang Nedda. She starred in the operetta Caviar. In England she became noted for her singing and work in radio.\n\nJane Winton died in 1959 at the Pierre Hotel in New York City.",
        "birthday": "1905-10-10",
        "deathday": "1959-09-22",
        "gender": 1,
        "homepage": null,
        "id": 9093,
        "imdb_id": "nm0936079",
        "known_for_department": "Acting",
        "name": "Jane Winton",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 1.1728,
        "profile_path": "/5ZjnRtGI5gfcxWpIPRIqUTDhcBm.jpg"
    }
}