{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gCOe0ZSGgfsHob7gdg2xQANwTAD.jpg",
                "genre_ids": [
                    80,
                    9648,
                    18
                ],
                "id": 925102,
                "original_language": "fr",
                "original_title": "La Nuit du 12",
                "overview": "Young and ambitious Captain Vivés has just been appointed group leader at the Grenoble Criminal Squad when Clara's murder case lands on his desk. Vivés and his team investigate Clara's complex life and relations, but what starts as a professional and methodical immersion into the victim's life soon turns into a haunting obsession.",
                "popularity": 1.0692,
                "poster_path": "/9IHnpje2aZ6TI6B385BqGfhcMuB.jpg",
                "release_date": "2022-07-13",
                "title": "The Night of the 12th",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 704,
                "character": "Yohan Vivès",
                "credit_id": "61db11076c8492008da561cf",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/8IYpYg6MdNBGiMnNAZptSxt1jGm.jpg",
                "genre_ids": [
                    12,
                    28,
                    18
                ],
                "id": 1084736,
                "original_language": "fr",
                "original_title": "Le Comte de Monte-Cristo",
                "overview": "Edmond Dantes becomes the target of a sinister plot and is arrested on his wedding day for a crime he did not commit. After 14 years in the island prison of Château d’If, he manages a daring escape. Now rich beyond his dreams, he assumes the identity of the Count of Monte-Cristo and exacts his revenge on the three men who betrayed him.",
                "popularity": 9.9181,
                "poster_path": "/sAT1P3FGhtJ68anUyJScnMu8t1l.jpg",
                "release_date": "2024-06-28",
                "title": "The Count of Monte Cristo",
                "video": false,
                "vote_average": 7.968,
                "vote_count": 1766,
                "character": "Fernand de Morcerf",
                "credit_id": "648f4b2f263462012d4ac5fe",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bastien Bouillon began his career in 2009, acting in the series RIS, Central Nuit, and Boulevard du Palais.  His role in Declaration of War was the beginning of a lasting collaboration with Valérie Donzelli, with whom he would work again in Hand in Hand (2012) and Marguerite et Julien, in Competition at Cannes in 2015.\n\nIn 2014, his role in Julie Lopes-Curval’s High Society earned him a Lumières Award nomination for Most Promising Actor.  A loyal actor, he has worked notably several times with Dominik Moll, in Only the Animals in 2019 and in the lead role of The Night of the 12th, presented in the Cannes Première strand at Cannes 2022. A role for which he has again been nominated, three years after Sébastien Betbeder’s Up the Mountain, for a César Award for Most Promising Actor.",
        "birthday": "1985-05-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 910944,
        "imdb_id": "nm3319078",
        "known_for_department": "Acting",
        "name": "Bastien Bouillon",
        "place_of_birth": "France",
        "popularity": 0.511,
        "profile_path": "/8ksm25v40MS2p2y0EyyNrxdt7it.jpg"
    }
}