{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rM3C9s0b9oiOQDdrfLSOoE0sjWl.jpg",
                "genre_ids": [
                    35,
                    18,
                    10752
                ],
                "id": 632,
                "original_language": "en",
                "original_title": "Stalag 17",
                "overview": "It's a dreary Christmas 1944 for the American POWs in Stalag 17 and the men in Barracks 4, all sergeants, have to deal with a grave problem—there seems to be a security leak.",
                "popularity": 4.4701,
                "poster_path": "/lfve9FDKjT7JPbWI9NCs5340F79.jpg",
                "release_date": "1953-05-29",
                "title": "Stalag 17",
                "video": false,
                "vote_average": 7.695,
                "vote_count": 629,
                "character": "Sgt. 'Hoffy' Hoffman",
                "credit_id": "52fe4261c3a36847f8019d6f",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/bhEJZ6XH1B9ld97OWppdAnvWzl5.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11165,
                "original_language": "en",
                "original_title": "Tora! Tora! Tora!",
                "overview": "In the summer of 1941, the United States and Japan seem on the brink of war after constant embargos and failed diplomacy come to no end. \"Tora! Tora! Tora!\", named after the code words used by the lead Japanese pilot to indicate they had surprised the Americans, covers the days leading up to the attack on Pearl Harbor, which plunged America into the Second World War.",
                "popularity": 3.4619,
                "poster_path": "/c311sN931DixuZRer0JGYCwpx9N.jpg",
                "release_date": "1970-01-26",
                "title": "Tora! Tora! Tora!",
                "video": false,
                "vote_average": 7.149,
                "vote_count": 566,
                "character": "Colonel Edward F. French",
                "credit_id": "52fe44069251416c750264ff",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Richard Erdmann ",
            "Dick Erdman"
        ],
        "biography": "Richard Erdman (June 1, 1925 - March 16, 2019) was an American film and television actor and director.\n\nIn a career that has spanned seven decades, his best known roles are that of the barracks chief Hoffy in Stalag 17, and McNulty in the classic Twilight Zone episode \"A Kind of a Stopwatch\". In Tora Tora Tora he played Colonel Edward F. French, the officer who responded to the failure to transmit the warning to Pearl Harbor using Army radio to instead use commercial telegraph rather than using the Navy or FBI radio systems.\n\nErdman appeared as the blackmailer, Arthur Binney, in the Perry Mason first season TV episode \"The Case Of The Gilded Lily\" aired May 24, 1958. In 1960, he co-starred with Tab Hunter in the short-lived The Tab Hunter Show on NBC, which aired opposite The Ed Sullivan Show on CBS and Lawman with John Russell on ABC. He was very funny when he appeared as a Broadway wardrobe man named Buck Brown on \"The Dick Van Dyke Show\". In 1962, Erdman had a recurring role as Klugie, the photographer, in the short-lived Nick Adams-John Larkin NBC series Saints and Sinners.",
        "birthday": "1925-06-01",
        "deathday": "2019-03-16",
        "gender": 2,
        "homepage": null,
        "id": 9110,
        "imdb_id": "nm0258757",
        "known_for_department": "Acting",
        "name": "Richard Erdman",
        "place_of_birth": "Enid, Oklahoma, USA",
        "popularity": 0.3644,
        "profile_path": "/1fqfBDlztr3jqdmW1bC6VRPmf5p.jpg"
    }
}