{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Charles Hamilton",
                "credit_id": "52fe4274c3a36847f801feb5",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Arlington Rand Brooks Jr."
        ],
        "biography": "Arlington Rand Brooks Jr. (September 21, 1918 – September 1, 2003) was an American film and television actor.\n\nBrooks was born in Wright City, Missouri. He was the son of Arlington Rand Brooks, a farmer. His mother and he moved to Los Angeles when he was four, though he continued to spend summers in Wright City. Brooks continued to make visits to his hometown of Wright City into the 1950s, up to and following the death of his father in 1950. His mother and his grandfather were actors.\n\nAfter leaving school, Brooks got a screen test at MGM and was given a bit part in Love Finds Andy Hardy (1938). His big fame came with his part as Charles Hamilton in Gone with the Wind (1939), a role which he later admitted he despised; he wanted to play more macho parts. He made $100 per week under contract at MGM, but when he was on loan to Selznick International Pictures for Gone with the Wind, he made $500 per week.\n\nAfter Gone With the Wind, he had relatively small parts in other movies including Babes in Arms, then a regular role as Lucky in the Hopalong Cassidy series of Westerns in the mid-1940s; Brooks succeeded Russell Hayden in the role. Among the films, which starred William Boyd as Hopalong, were Hoppy's Holiday, The Dead Don't Dream, and Borrowed Trouble. He received positive notice for his work in Fool's Gold, with Variety reporting that he did \"an excellent job.\" In edited, half-hour versions of some of the films, he appeared in 12 of the 52 episodes of the Hopalong Cassidy television series.\n\nIn 1948, he co-starred with Adele Jergens and Marilyn Monroe in the low-budget, black-and-white Columbia Pictures film, Ladies of the Chorus. Brooks became the first actor to share an on-screen kiss with Monroe, who in a few years was one of the world's biggest movie stars. Filmed in just 10 days, the film was released soon after its completion. Variety called his performance in the 1952 film The Steel Fist \"capable.\"\n\nTelevision brought new opportunities, again often in Westerns. He played Cpl. Randy Boone in the 1950s television series, The Adventures of Rin Tin Tin. Brooks had guest roles in 1950s Western series, including Mackenzie's Raiders, The Lone Ranger, Maverick, Gunsmoke, and Bonanza. He appeared twice on the syndicated adventure series, Rescue 8, as well as on CBS's Perry Mason courtroom drama series.\n\nIn 1962, he directed and produced a movie about brave dogs, Bearheart, but the film was entangled in legal troubles due to his business manager's involvement in crimes such as forgery and graft. The film was finally released in 1978, under the title Legend of the Northwest.\n\nAfter he left show business, Brooks ran a private ambulance company in Glendale, California. He commented that he \"died in more pictures than almost anyone\" and that though he was never very big in show business, he was willing to return to it. Brooks sold the ambulance company in 1994, and retired to his ranch in the Santa Ynez Valley, where he bred champion Andalusian horses. He attended a Gone with the Wind reunion for Clark Gable's birthday, along with Ann Rutherford and Fred Crane, in Cadiz, Ohio, in 1992.\n\nOn September 1, 2003, Brooks died in Santa Ynez, California.",
        "birthday": "1918-09-21",
        "deathday": "2003-09-01",
        "gender": 2,
        "homepage": null,
        "id": 91217,
        "imdb_id": "nm0112203",
        "known_for_department": "Acting",
        "name": "Rand Brooks",
        "place_of_birth": "Wright City, Missouri, USA",
        "popularity": 0.3955,
        "profile_path": "/mwZQYR7h2vydfAdLJgUYnh0mv5q.jpg"
    }
}