{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/p8LlfRewGJkf67UhVM0s70IfNBt.jpg",
                "genre_ids": [
                    35
                ],
                "id": 233063,
                "original_language": "de",
                "original_title": "Fack ju Göhte",
                "overview": "Ex-con Zeki Müller goes undercover as a teacher at a below average Gymnasium to find money he'd stashed prior to incarceration.",
                "popularity": 3.4225,
                "poster_path": "/hV88MiailtnGVF6rbp6Ug6UBKYS.jpg",
                "release_date": "2013-11-07",
                "title": "Suck Me Shakespeer",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1720,
                "character": "Chantal Ackermann",
                "credit_id": "52fe4e11c3a36847f827c099",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ژلا هاسه"
        ],
        "biography": "Jella Haase (born 27 October 1992) is a German actress. She began acting in theatre at a very early age. Her film credits include Lollipop Monster, Fack ju Göhte and Kriegerin. She has also appeared on the television shows Polizeiruf 110 and Alpha 0.7 – Der Feind in dir. She won the Bavarian Film Award for Best Young Actress in 2012, the Günter Strack Television Award in 2013 and earned a nomination at the German Film Awards in 2014.\n\nHaase was born in Berlin-Kreuzberg. Her mother is a dentist. Haase began her career as a child actor in drama theatre. In 2009, she made her film debut in the short film, Der letzte Rest at the age of 15. Her first major role was in the television film, Mama kommt!. It was followed by other TV productions, including two appearances in Polizeiruf 110. In 2010, she starred in six episodes of Alpha 0.7 – Der Feind in dir.\n\nIn 2011, she acted in the movie Männerherzen … und die ganz ganz große Liebe. In the same year, she played a leading role in David Wnendt's neo-Nazi film Kriegerin. In the film she appeared alongside Alina Levshin and Gerdy Zint. For this role, and also for the 2011 Ziska Riemann's directorial debut film Lollipop Monster, she received the Bavarian Film Award for Best Young Actress in 2012.\n\nIn 2013, she played the role of an underage prostitute who films herself having sex with judges and uses the video to blackmail them in the film, Puppenspieler. She also received the Günter-Strack-Television Award in June 2013 for Best Actress. In the same year, she played the role of a teenager Chantal Ackermann in the comedy film Fack ju Göhte directed by Bora Dağtekin. For her role in the film, she earned a nomination for the German Film Award for Best Actress in a Supporting Role in 2014. She also plays football for FC International.\n\nIn 2022, she starred in the Netflix series Kleo.\n\nSource: Article \"Jella Haase\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1992-10-27",
        "deathday": null,
        "gender": 1,
        "homepage": "https://spiel-kind.com/femaleactors/haase-jella/",
        "id": 912632,
        "imdb_id": "nm3436464",
        "known_for_department": "Acting",
        "name": "Jella Haase",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.7144,
        "profile_path": "/kwbw9Q4Cnk1Oiwz8ktIQXgECLTx.jpg"
    }
}