{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u9ZLyLvqHY5VDjn0Rs4LKAklsAV.jpg",
                "genre_ids": [
                    878,
                    18
                ],
                "id": 840,
                "original_language": "en",
                "original_title": "Close Encounters of the Third Kind",
                "overview": "After an encounter with UFOs, an electricity linesman feels undeniably drawn to an isolated area in the wilderness where something spectacular is about to happen.",
                "popularity": 5.308,
                "poster_path": "/yaPx3cK9zGFX3SbcKwxWM1QIbUh.jpg",
                "release_date": "1977-12-14",
                "title": "Close Encounters of the Third Kind",
                "video": false,
                "vote_average": 7.347,
                "vote_count": 4399,
                "character": "Longly (uncredited)",
                "credit_id": "52fe427fc3a36847f802358f",
                "order": 54
            },
            {
                "adult": false,
                "backdrop_path": "/mmRY0ZtKtK3lP5TYmI2jDC4EpZa.jpg",
                "genre_ids": [
                    18
                ],
                "id": 16619,
                "original_language": "en",
                "original_title": "Ordinary People",
                "overview": "Beth, Calvin, and their son Conrad are living in the aftermath of the death of the other son. Conrad is overcome by grief and misplaced guilt to the extent of a suicide attempt. He is in therapy. Beth had always preferred his brother and is having difficulty being supportive to Conrad. Calvin is trapped between the two trying to hold the family together.",
                "popularity": 5.6788,
                "poster_path": "/tJVETEDAKgD3fEh88SHOvMvOQue.jpg",
                "release_date": "1980-09-19",
                "title": "Ordinary People",
                "video": false,
                "vote_average": 7.467,
                "vote_count": 656,
                "character": "Sloan",
                "credit_id": "52fe46e09251416c75086859",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.2908,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 3366,
                "character": "Auctioneer",
                "credit_id": "52fe48d7c3a368484e10d943",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/p2U4wScUValTXnvikXy7kfQNDsH.jpg",
                "genre_ids": [
                    18,
                    9648,
                    53
                ],
                "id": 891,
                "original_language": "en",
                "original_title": "All the President's Men",
                "overview": "During the 1972 elections, two reporters' investigation sheds light on the controversial Watergate scandal that compels President Nixon to resign from his post.",
                "popularity": 9.3472,
                "poster_path": "/qwdcIdiTAk8iANsJEK2JmrYQx5o.jpg",
                "release_date": "1976-04-09",
                "title": "All the President's Men",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 1928,
                "character": "Assistant Metro Editor",
                "credit_id": "63a0514a8ddc34149eeec941",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Basil Harry Hoffman"
        ],
        "biography": "Basil Harry Hoffman (January 18, 1938 — September 17, 2021) was an American actor with a film and television career spanning five decades, mostly in supporting roles. He starred in films with many award-winning directors, including Alan Pakula and Robert Redford. He has also authored two books about acting, including Acting and How to Be Good at It.\n\nHoffman was born in Houston, Texas in January 1938, the son of Beulah (née Novoselsky) and David Hoffman, an antique dealer. He graduated from Tulane University; and he spent two years at the American Academy of Dramatic Arts in New York City, receiving a scholarship for the second, graduating year.\n\nHis thirteen years of work in New York included many plays, some roles in episodic television, a recurring character on One Life to Live on ABC, hundreds of commercials and a film role in Lady Liberty with Sophia Loren, directed by Mario Monicelli.\n\nHe made his first trip to Los Angeles in 1974. In that season, he filmed a theatrical feature, At Long Last Love, for Peter Bogdanovich. In the years that followed he appeared in two television movies, television episodes of Kung Fu, The Rockford Files, Sanford and Son (2 roles), Police Woman, Columbo, Kojak, M*A*S*H (2 roles), Barney Miller and several TV commercials. He had recurring roles as the fingerprint technician on Ellery Queen and as Principal Dingleman on Square Pegs.\n\nAlthough most of his work was in film and television, he made a few stage appearances, most notably in Sand Mountain, by Romulus Linney, for which he won a Drama-Logue Award, the first staged reading of Martin E. Brooks’ Joe and Flo at the Actors Studio, and the world premiere of William Blinn's Walking Peoria.\n\nHe was best known for his work with distinguished film directors, including Peter Bogdanovich, Mario Monicelli, Richard Benjamin, Carl Reiner (twice), Peter Medak (six times) and Alan J. Pakula (twice); Academy Award winners Joel and Ethan Coen, Paolo Sorrentino, Michel Hazanavicius, Steven Spielberg, Delbert Mann, Blake Edwards, Stanley Donen, Sydney Pollack, Ron Howard and Robert Redford (twice as director); and others. His films include: All the President's Men, Close Encounters of the Third Kind, My Favorite Year, The Box, The Electric Horseman, Night Shift, Lucky Lady, Switch, The Milagro Beanfield War, Rio, I Love You, The Pineville Heist, and the Academy Award-winning Best Pictures Ordinary People and The Artist, among many others.\n\nA long-time private acting teacher and coach, he was also a frequent guest lecturer and teacher at prestigious professional and academic institutions, including the American Film Institute, the American Academy of Dramatic Arts, Emerson College, the University of Southern California, Confederation College in Thunder Bay, Ontario, Canada, and the Academie Libanaise des Beaux Arts in Beirut, Lebanon.\n\nIn 2008, he returned to Beirut as a U.S. State Department Cultural Envoy to Lebanon to teach acting and directing at the University of Balamand's Academie Libanaise des Beaux Arts, Lebanese University, Notre Dame University and St. Joseph University's Institut D'Etude Sceniques Audiovisuelles et Cinematographiques. ...\n\nSource: Article \"Basil Hoffman\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1938-01-18",
        "deathday": "2021-09-17",
        "gender": 2,
        "homepage": null,
        "id": 91369,
        "imdb_id": "nm0388819",
        "known_for_department": "Acting",
        "name": "Basil Hoffman",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 1.6641,
        "profile_path": "/iDAK5OkF0tHs049IB858uQ0NYjX.jpg"
    }
}