{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vxhnRV7jGncAZmf0FFHMs6rFHWn.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749,
                    10402
                ],
                "id": 9591,
                "original_language": "en",
                "original_title": "That Thing You Do!",
                "overview": "A Pennsylvania band scores a hit in 1964 and rides the star-making machinery as long as it can, with lots of help from its manager.",
                "popularity": 2.5841,
                "poster_path": "/9RmZu33qHdyZFGLfhEOmkTjdNEu.jpg",
                "release_date": "1996-10-04",
                "title": "That Thing You Do!",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 874,
                "character": "Ernie the Disc Master Engineer",
                "credit_id": "60899fa7e19de90029f81bf9",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gregory Mars Martin"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nMars Callahan (born 1971) is an American actor, director, producer and writer.\n\nHe is known, among other things, for the movie Poolhall Junkies where he served as director, actor and screenwriter.\n\nAt the age of eleven Callahan toured with a children's musical group through thirty-seven states. At fifteen he received his first acting role in the television series The Wonder Years. After honing his acting skills in television he tried for the big screen and soon appeared in various films. Inspired by the directors he worked with Callahan decided to try working behind the camera and in 1998 shot his first short film The Red Bag.\n\nIn a 2007 Hollywood Reporter interview he revealed that he has had serious health problems when doctors found a tumor in his right kidney. He lost his right kidney, his right adrenal gland and has been in and out of a wheelchair for years.\n\nDescription above from the Wikipedia article Mars Callahan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 91389,
        "imdb_id": "nm0552358",
        "known_for_department": "Acting",
        "name": "Mars Callahan",
        "place_of_birth": "Studio City, California, U.S.",
        "popularity": 0.1512,
        "profile_path": "/1nQKNOkIb45v1OsUbekkaD407w8.jpg"
    }
}