{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wnKwGjUfxIs7fasocw7JwZ3gfQD.jpg",
                "genre_ids": [
                    10751,
                    16,
                    14
                ],
                "id": 73456,
                "original_language": "en",
                "original_title": "Barbie: Princess Charm School",
                "overview": "Barbie stars as Blair Willows, a kind-hearted girl who is chosen to attend Princess Charm School: a magical, modern place that teaches dancing, how to have tea parties, and proper princess manners. Blair loves her classes -- as well as the helpful magical sprites and her new friends, Princesses Hadley and Isla. But when royal teacher Dame Devin discovers that Blair looks a lot like the kingdom’s missing princess, she turns Blair’s world upside down to stop her from claiming the throne. Now Blair, Hadley and Delancy must find an enchanted crown to prove Blair’s true identity in this charming and magical princess story!",
                "popularity": 8.6658,
                "poster_path": "/lI2jPbssax6XX5vDqB9mTJHGzfH.jpg",
                "release_date": "2011-08-11",
                "title": "Barbie: Princess Charm School",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 839,
                "character": "Portia / Hadley (voice)",
                "credit_id": "52fe489bc3a368484e101b13",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/ce6HzPfxRRcLk5QRLcdExeVpsA1.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 406997,
                "original_language": "en",
                "original_title": "Wonder",
                "overview": "The story of August Pullman – a boy with facial differences – who enters fifth grade, attending a mainstream elementary school for the first time.",
                "popularity": 5.5825,
                "poster_path": "/sONh3LYGFcVDTy8pm1tbSOB13Li.jpg",
                "release_date": "2017-11-13",
                "title": "Wonder",
                "video": false,
                "vote_average": 8.114,
                "vote_count": 8069,
                "character": "Ms. Petosa",
                "credit_id": "57b794ae925141267c002f17",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alison Dyan Liebert"
        ],
        "biography": "Ali Liebert is a Canadian Screen Award winner (\"Best Actress in a Featured Supporting Role in a Dramatic Series\") for her portrayal of Betty Mcrae in Reelz/Global TV's original hit series, Bomb Girls. She also won a Leo Award for the same character. In 2013, Whistler Film Festival, Elle Canada & Variety named her \"Rising Star of the Festival\". Variety also featured her as \"International Star You Should Know\" in their July issue. In 2014, the Hollywood Reporter named Ali as one of the \"Next Generation 15 Hottest Canadian Talents under 35\".\n\nAli's film career has taken her to festivals across the world, most recently to South Korea for the Busan International Film Festival with Connor Gaston's crisis-of-faith drama, THE DEVOUT. Ali took home the 2016 Leo Award for 'Best Lead Actress in a Motion Picture' for her role in THE DEVOUT, a mother coming to terms with her young daughters imminent passing. Her other favourite feature credits include Sook- Yin Lee's YEAR OF THE CARNIVORE (TIFF), Ben Ratner's DOWN RIVER (VIFF) and FOXFIRE (TIFF) (based on the Joyce Carol Oates novel), which was written and directed by Palme d'Or winning French filmmaker Laurent Cantet for Paris-based Memento Films International. In 2011, Ali had two films that premiered at TIFF: AFGHAN LUKE (Mike Clattenburg) and SISTERS AND BROTHERS (Carl Bessai). Ali was also extremely honoured to work alongside Academy Award Nominee Michael Clark Duncan and Emmy Award Nominee Loretta Devine in the Robert Townsend dramatic feature, IN THE HIVE. In 2017, Ali was also thrilled to be a part of Stephen Chbosky's WONDER, starring Julia Roberts and Jacob Trembley. Her favorite Television Credits include: Bomb Girls (Global), MechX4 (DisneyXD), Lost Girl (Syfy), Ten Days in the Valley (ABC), iZombie (CW), Legends of Tomorrow (CW), Harper's Island (CBC) and and Strange Empire and Intelligence, both on the CBC.\n\nWith her extensive experience as an actor (85 credits to her name) and producer (AFTERPARTY, Whistler Film Festival & COOKING WITH LOVE, Hallmark Channel), Ali's creative evolution to directing is a natural one. Having completed principal photography on her first movie, AMISH ABDUCTION, in December 2018, Ali is in prep for her second film. Alongside her producing partner, Ali has multiple projects in active development and plans to continue directing and producing her own projects. Ali splits her time between Vancouver, Toronto & Los Angeles. You can find her at @aliliebert on instagram & twitter.\n\n- IMDb",
        "birthday": "1981-08-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 91402,
        "imdb_id": "nm1650932",
        "known_for_department": "Acting",
        "name": "Ali Liebert",
        "place_of_birth": "Surrey, British Columbia, Canada",
        "popularity": 0.3475,
        "profile_path": "/gBqC2pUU7TtW9pdYqernpRivSel.jpg"
    }
}