{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7kURId6slyHNujYpCFm0Z1M3kRt.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 49538,
                "original_language": "en",
                "original_title": "X-Men: First Class",
                "overview": "Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their powers for the first time. Before they were arch-enemies, they were closest of friends, working together with other mutants (some familiar, some new), to stop the greatest threat the world has ever known.",
                "popularity": 0.4264,
                "poster_path": "/hNEokmUke0dazoBhttFN0o3L7Xv.jpg",
                "release_date": "2011-06-01",
                "title": "X-Men: First Class",
                "video": false,
                "vote_average": 7.298,
                "vote_count": 13126,
                "character": "Swiss Bank Manager",
                "credit_id": "58850e2d925141044c0226b6",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Sebastian Faulkner",
            "제임스 폴크너 "
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJames Sebastian Faulkner (born 18 July 1948) is a British actor, known for his many various appearance on television and in movies, usually in supporting roles.\n\nFaulkner made his big screen debut as Josef Strauss in The Great Waltz in 1972. He appeared in other films such as Whispering Death, Minder on the Orient Express, played Lt Teignmouth Melvill in Zulu Dawn that he co-produced, and appeared as Uncle Geoffrey in both Bridget Jones films. He played Herod in BBC's 1976 television adaptation of I, Claudius. In 1988 he portrayed one of the biggest enemies of Sherlock Holmes, as Stapleton in Granada Television's production of The Hound of the Baskervilles, opposite Jeremy Brett. In 1991, he played Alex Mair, the manager of the Larksoken nuclear power plant, in an Anglia production of the P.D. James novel featuring her character Inspector Adam Dalgleish, Devices and Desires. He has also portrayed Agent Smith in the film Hitman. He was also the principal antagonist Baron Mullins in the short-lived US/UK television show, Covington Cross. He voiced Severus Snape in the video game version of Harry Potter and the Half-Blood Prince. He also starred as Lord Kenworth in the film Agent Cody Banks 2: Destination London.\n\nDescription above from the Wikipedia article James Faulkner, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1948-07-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 9140,
        "imdb_id": "nm0269077",
        "known_for_department": "Acting",
        "name": "James Faulkner",
        "place_of_birth": "Hampstead, London, England, UK",
        "popularity": 0.5111,
        "profile_path": "/wMDpbctF9cAL5nYnSL6AcXUTG5K.jpg"
    }
}