{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y4TbQOC9DCzZop9HwKuX73rKbYO.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 9631,
                "original_language": "en",
                "original_title": "The Negotiator",
                "overview": "The police try to arrest expert hostage negotiator Danny Roman, who insists he's being framed for his partner's murder in what he believes is an elaborate conspiracy. Thinking there's evidence in the Internal Affairs offices that might clear him, he takes everyone in the office hostage and demands that another well-known negotiator be brought in to handle the situation and secretly investigate the conspiracy.",
                "popularity": 6.3574,
                "poster_path": "/dUMHEymATOGbs2K3E4dmNSVBgFQ.jpg",
                "release_date": "1998-07-29",
                "title": "The Negotiator",
                "video": false,
                "vote_average": 7.103,
                "vote_count": 2223,
                "character": "Farley",
                "credit_id": "52fe4514c3a36847f80bb291",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/56H7AtJ5GK4UxFoHuw9QDwI7wzD.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 42297,
                "original_language": "en",
                "original_title": "Burlesque",
                "overview": "Ali leaves behind a troubled life and follows her dreams to Los Angeles, where she lands a job as a cocktail waitress at the Burlesque Lounge, a once-majestic theater that houses an inspired musical revue. Vowing to perform there, she makes the leap from bar to stage, helping restore the club's former glory.",
                "popularity": 5.0965,
                "poster_path": "/3U9zBIibERQZqYKM3N1a4MYgBsN.jpg",
                "release_date": "2010-11-23",
                "title": "Burlesque",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 2306,
                "character": "Dwight",
                "credit_id": "56d23a83c3a3681e3c00d41a",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/cgrQefMZspzBD2HXmZ8LYoCuN5m.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 16620,
                "original_language": "en",
                "original_title": "La Bamba",
                "overview": "Los Angeles teenager Ritchie Valens becomes an overnight rock 'n' roll success in 1958, thanks to a love ballad called \"Donna\" that he wrote for his girlfriend. But as his star rises, Valens has conflicts with his jealous brother, Bob, and becomes haunted by a recurring nightmare of a plane crash just as he begins his first national tour alongside Buddy Holly.",
                "popularity": 3.6443,
                "poster_path": "/6Znulqtc7cdqlUC69HGf26Ef5fi.jpg",
                "release_date": "1987-07-24",
                "title": "La Bamba",
                "video": false,
                "vote_average": 7.272,
                "vote_count": 744,
                "character": "Big Bopper",
                "credit_id": "58f614d392514127a600cce4",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/qtamfYGFfDLfGRcucx1zNwohRts.jpg",
                "genre_ids": [
                    53,
                    878,
                    18
                ],
                "id": 860,
                "original_language": "en",
                "original_title": "WarGames",
                "overview": "High school student David Lightman has a talent for hacking. But while trying to hack into a computer system to play unreleased video games, he unwittingly taps into the Department of Defense's war computer and initiates a confrontation of global proportions. Together with his friend and a wizardly computer genius, David must race against time to outwit his opponent and prevent a nuclear Armageddon.",
                "popularity": 5.1682,
                "poster_path": "/zZ1rN4LoPxKNfAp67Xl300WxVeD.jpg",
                "release_date": "1983-06-03",
                "title": "WarGames",
                "video": false,
                "vote_average": 7.072,
                "vote_count": 2008,
                "character": "Sgt. Schneider",
                "credit_id": "5fb67727498bc2003ea3f097",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Stephen Lee was born in Englewood New Jersey in 1955. Having lived in Europe the first 15 years of his life Stephen comes from a casino background. His father selling and making slot machines. Stephen started acting when he came to the U.S in 1970 and eventually getting a partial scholarship to Avila College in Kansas City, Missouri. He has appeared in over 200 TV shows, 5 TV series and over 20 pilots. He has also played in 39 movies including: La Bamba (1987), WarGames (1983), Purple Hearts (1984), RoboCop 2 (1990), The Negotiator (1998), Dolls (1987) and many others. He speaks English, German, French and Spanish. His interests include golf, tennis, horseback riding (when time permits) and biking around his Sherman Oaks, CA neighborhood. His recent guest stars are NCIS, Fear itself, Boston Legal (for which he received critical acclaim), Bones and Til' Death. He is grateful everyday for a roof over his head and hopes for a more prosperous future for himself and everyone who has experienced such hard times. IMDb Mini Biography By: Stephen Lee",
        "birthday": "1955-11-11",
        "deathday": "2014-08-14",
        "gender": 2,
        "homepage": null,
        "id": 91537,
        "imdb_id": "nm0498280",
        "known_for_department": "Acting",
        "name": "Stephen Lee",
        "place_of_birth": "Englewood, New Jersey, USA",
        "popularity": 0.4567,
        "profile_path": "/faHDY2Y9n0oMY1Y1RI2COeiaODB.jpg"
    }
}