{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ryoWP1kvNcwPif6uNbuZwQfrJPy.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 24382,
                "original_language": "it",
                "original_title": "I soliti ignoti",
                "overview": "Best friends Peppe and Mario are thieves, but they're not very good at it. Still, Peppe thinks that he's finally devised a master heist that will make them rich. With the help of some fellow criminals, he plans to dig a tunnel from a rented apartment to the pawnshop next door, where they can rob the safe. But his plan is far from foolproof, and the fact that no one in the group has any experience digging tunnels proves to be the least of their problems.",
                "popularity": 1.6895,
                "poster_path": "/f5OxD8Nl0pR3DcYHtYhHRfpsmjl.jpg",
                "release_date": "1958-07-26",
                "title": "Big Deal on Madonna Street",
                "video": false,
                "vote_average": 8.099,
                "vote_count": 740,
                "character": "Nicoletta",
                "credit_id": "52fe4493c3a368484e02a8d9",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Карла Гравина"
        ],
        "biography": "Carla Gravina (born 5 August 1941) is an Italian actress and politician. She appeared in 40 films between 1957 and 1993.\n\nBorn in Gemona, Gravina made her film debut at fifteen years old, in Alberto Lattuada's Guendalina. Very active in films and on television series, both in comedic and dramatic roles, from the late 1970s she gradually focused her activities on stage and in political activism, being a PCI deputy between 1980 and 1983.\n\nDuring her career Gravina won a number of international awards, including the Best Actress Award for her performance in Alessandro Blasetti's Love and Chatter at the 1958 Locarno International Film Festival, the award for Best Supporting Actress for her role in Ettore Scola's La terrazza at the 1980 Cannes Film Festival, and the award for Best Actress for Margarethe von Trotta's The Long Silence at the 1993 Montreal World Film Festival.",
        "birthday": "1941-08-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 91544,
        "imdb_id": "nm0336390",
        "known_for_department": "Acting",
        "name": "Carla Gravina",
        "place_of_birth": "Gemona del Friuli, Friuli Venezia Giulia, Italy",
        "popularity": 0.2474,
        "profile_path": "/fKzCYbOwExmpFNwkVfFChPps2xg.jpg"
    }
}