{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4VgyburZo88ocO1aSRFm0i5H5VX.jpg",
                "genre_ids": [
                    35
                ],
                "id": 760,
                "original_language": "fr",
                "original_title": "Les Aventures de Rabbi Jacob",
                "overview": "In this riot of frantic disguises and mistaken identities, Victor Pivert, a blustering, bigoted French factory owner, finds himself taken hostage by Slimane, an Arab rebel leader. The two dress up as rabbis as they try to elude not only assasins from Slimane's country, but also the police, who think Pivert is a murderer. Pivert ends up posing as Rabbi Jacob, a beloved figure who's returned to France for his first visit after 30 years in the United States. Adding to the confusion are Pivert's dentist-wife, who thinks her husband is leaving her for another woman, their daughter, who's about to get married, and a Parisian neighborhood filled with people eager to celebrate the return of Rabbi Jacob.",
                "popularity": 2.62,
                "poster_path": "/oYuCFxS2BGCHNGuv9No0GoP2DZf.jpg",
                "release_date": "1973-10-17",
                "title": "The Mad Adventures of Rabbi Jacob",
                "video": false,
                "vote_average": 7.401,
                "vote_count": 1012,
                "character": "Wedding guest (uncredited)",
                "credit_id": "5eb988f5bbe1dd0021867804",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christine Boisson (April 8, 1956 - October 21, 2024) was a French actress.\n\nAfter she registered in a model agency, Just Jaeckin liked her photo, and she got a part in the film Emmanuelle starring Sylvia Kristel, in which she played a lollipop-sucking teenager who masturbates over a picture of Paul Newman. Then she got some more film roles, but she also continued to study acting.\n\nIn 1977 she made her stage debut in Chekhov's The Seagull directed by Bruno Bayen.\n\nIn 1984, she received the Prix Romy Schneider (most promising actress awards) for Rue Barbare.\n\nIn 2005, she was starring in the stage play Viol by Botho Strauß (based on Titus Andronicus), directed by Luc Bondy.\n\nOn 14 October 2010, she tried to commit suicide.\n\nDescription above from the Wikipedia article Christine Boisson, licensed under CC-BY-SA, full list of contributors on Wikipedia.\n\n​",
        "birthday": "1956-04-08",
        "deathday": "2024-10-21",
        "gender": 1,
        "homepage": null,
        "id": 91573,
        "imdb_id": "nm0092381",
        "known_for_department": "Acting",
        "name": "Christine Boisson",
        "place_of_birth": "Salon-de-Provence, Bouches-du-Rhône, France",
        "popularity": 0.2509,
        "profile_path": "/aU8dQjROQt6sqyC9yQw9s76ZtLG.jpg"
    }
}