{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5IM4A22LKZlQiynzIw1qNF6h5cE.jpg",
                "genre_ids": [
                    18,
                    28,
                    10752
                ],
                "id": 616,
                "original_language": "en",
                "original_title": "The Last Samurai",
                "overview": "Nathan Algren is an American hired to instruct the Japanese army in the ways of modern warfare, which finds him learning to respect the samurai and the honorable principles that rule them. Pressed to destroy the samurai's way of life in the name of modernization and open trade, Algren decides to become an ultimate warrior himself and to fight for their right to exist.",
                "popularity": 9.2419,
                "poster_path": "/lsasOSgYI85EHygtT5SvcxtZVYT.jpg",
                "release_date": "2003-12-05",
                "title": "The Last Samurai",
                "video": false,
                "vote_average": 7.595,
                "vote_count": 7176,
                "character": "Taka",
                "credit_id": "52fe425ec3a36847f8018e6f",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "코유키",
            "Коюкі",
            "Коюкі Като",
            "Koyuki Kato",
            "کیوکی"
        ],
        "biography": "Koyuki Katō (born December 18, 1976), better known as Koyuki, is a Japanese model and actress.\n\nKoyuki was born in Zama, Kanagawa-ken. She started her modeling career in 1995 and has since starred in various Japanese dramas, TV and magazine ad campaigns and films. She frequently appears in Japanese print and television campaigns for the electronics company Panasonic. She rose to fame in the drama Kimi wa petto (2003) with Jun Matsumoto and gained huge popularity. Her first international film was The Last Samurai (2003) where she played Taka, wife of a Samurai slain by the character Nathan Algren, portrayed by Tom Cruise, Koyuki was well-known in Japan for years before that. She first caught the attention of the public in 1997 by winning an exclusive modelling contract with the magazine Non-no, but quickly grew beyond modelling and has earned acclaim as an actress through her many roles on Japanese television and in several Japanese films.\n\nDescription above from the Wikipedia article Koyuki, licensed under CC-BY-SA, full list of contributors on Wikipedia. ​",
        "birthday": "1976-12-18",
        "deathday": null,
        "gender": 1,
        "homepage": "http://koyuki.jp/en/",
        "id": 9190,
        "imdb_id": "nm0468746",
        "known_for_department": "Acting",
        "name": "Koyuki",
        "place_of_birth": "Zama, Kanagawa, Japan",
        "popularity": 1.4472,
        "profile_path": "/nf1PQoJ0xxXXA7BLl1VF203HX5g.jpg"
    }
}