{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g7prwSflNODkHZI6792MYoU4qoh.jpg",
                "genre_ids": [
                    53,
                    12,
                    18
                ],
                "id": 38985,
                "original_language": "en",
                "original_title": "Sorcerer",
                "overview": "Four men from different parts of the globe, all hiding from their pasts in the same remote South American town, agree to risk their lives transporting several cases of dynamite (which is so old that it is dripping unstable nitroglycerin) across dangerous jungle terrain.",
                "popularity": 2.7907,
                "poster_path": "/2b7oexm173SF1FSEq0DdgxZZNRH.jpg",
                "release_date": "1977-06-24",
                "title": "Sorcerer",
                "video": false,
                "vote_average": 7.441,
                "vote_count": 599,
                "character": "\"Carlos\"",
                "credit_id": "52fe46f09251416c91064bd3",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/40Rl5nZRxXQ4kHV4Lhghj5iQZZN.jpg",
                "genre_ids": [
                    53,
                    10749,
                    9648
                ],
                "id": 303,
                "original_language": "en",
                "original_title": "Notorious",
                "overview": "In order to help bring Nazis to justice, U.S. government agent T.R. Devlin recruits Alicia Huberman, the American daughter of a convicted German war criminal, as a spy. As they begin to fall for one another, Alicia is instructed to win the affections of Alexander Sebastian, a Nazi hiding out in Brazil. When Sebastian becomes serious about his relationship with Alicia, the stakes get higher, and Devlin must watch her slip further undercover.",
                "popularity": 3.9227,
                "poster_path": "/4RERYb1NIQrJHYY5e8nUlYM7t2z.jpg",
                "release_date": "1946-08-21",
                "title": "Notorious",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 1664,
                "character": "Knerr (uncredited)",
                "credit_id": "56d4894c925141799e0130b5",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fredrick Ledebur",
            "Friedrich Ledebur"
        ],
        "biography": "Friedrich Anton Maria Hubertus Bonifacius Graf von Ledebur-Wicheln (June 3, 1900 – December 25, 1986) was an Austrian actor who was known for Moby Dick (1956), Alexander the Great (1955) and Slaughterhouse-Five (1972).\n\nLedebur was born in Nisko, Austro-Hungarian Empire (now Poland) in 1900. Friedrich enlisted in the Austro-Hungarian Imperial Army in 1916, and was an officer in the Austrian Cavalry Division during the last years of World War I.\n\nIn the 1930s Ledebur became a close friend of Charles Bedaux, with whom he traveled extensively in Africa and Canada.\n\nAfter the war, Ledebur spent the next two decades travelling the world, working all manner of odd jobs from gold mining to deep sea diving, to riding and winning prize money at rodeos. Ledebur settled in the United States in 1939 and anglicised his name to 'Frederick'.\n\nA close friendship with fellow adventurer and director John Huston, gave Ledebur his entrée to character acting.\n\nIn 1945, von Ledebur made his film debut. He later appeared in Alexander the Great (1955), and played chief harpooneer Queequeg, a South Sea chieftain, in the film Moby Dick (1956). \"Better a sober cannibal than a drunken Christian\", Herman Melville's Ishmael famously says of Queequeg in the book and the film. He appeared as Brother Christophorus in The Twilight Zone episode \"The Howling Man\".\n\nSource: Article \"Friedrich von Ledebur\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1900-06-03",
        "deathday": "1986-12-25",
        "gender": 2,
        "homepage": null,
        "id": 91971,
        "imdb_id": "nm0496428",
        "known_for_department": "Acting",
        "name": "Friedrich von Ledebur",
        "place_of_birth": "Nisko, Poland",
        "popularity": 0.5118,
        "profile_path": "/bBRaajqzljFK8PYsaiY2rEnvOYq.jpg"
    }
}