{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5jhG1lTgV0MS6tDkBMQSSitttTT.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1402,
                "original_language": "en",
                "original_title": "The Pursuit of Happyness",
                "overview": "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.",
                "popularity": 10.7204,
                "poster_path": "/lBYOKAMcxIvuk9s9hMuecB9dPBV.jpg",
                "release_date": "2006-12-14",
                "title": "The Pursuit of Happyness",
                "video": false,
                "vote_average": 7.891,
                "vote_count": 10205,
                "character": "Stock Broker (uncredited)",
                "credit_id": "57d6d97e92514172d60008d9",
                "order": 66
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nPhil Austin (often credited as Philip; born April 6, 1941) is a comedian and writer. He was born in Denver, Colorado and later grew up in Fresno, California, attending Fresno High School. He attended Bowdoin College and UCLA, joining the staff of KPFK radio in Los Angeles in the late 1960s.\n\nAustin is best known for his work as part of The Firesign Theatre (of which he is the only constant member), where he plays the group's best-known creation, Nick Danger. Other prominent roles are as Harry (Happy) Cox, the narrator of Everything You Know Is Wrong and Bebop Loco/Lobo on Give Me Immortality or Give Me Death. He is also serves as the troupe's musician and record producer. His collection of short stories, Tales of the Old Detective and Other Big Fat Lies, is published by Audio Editions. Two of his stories appear in the third volume of Mirth of a Nation.\n\nAustin also wrote a solo work, Roller Maidens From Outer Space, and directed (and acted in) Eat Or Be Eaten.\n\nDescription above from the Wikipedia article Phil Austin, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1941-04-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 92058,
        "imdb_id": "nm1971070",
        "known_for_department": "Acting",
        "name": "Phil Austin",
        "place_of_birth": "Denver, Colorado, United States",
        "popularity": 0.1368,
        "profile_path": "/rfgWK2zjC9qTNu9jXSqmFqXQl3a.jpg"
    }
}