{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/22yIGscWOOLRvwQb44ZboZmstIH.jpg",
                "genre_ids": [
                    18,
                    28,
                    53,
                    878
                ],
                "id": 9693,
                "original_language": "en",
                "original_title": "Children of Men",
                "overview": "In 2027, in a chaotic world in which humans can no longer procreate, a former activist agrees to help transport a miraculously pregnant woman to a sanctuary at sea, where her child's birth may help scientists save the future of humankind.",
                "popularity": 9.0933,
                "poster_path": "/8Xgvmx7WWc7Z9Ws9RAYk7uya2kh.jpg",
                "release_date": "2006-09-22",
                "title": "Children of Men",
                "video": false,
                "vote_average": 7.611,
                "vote_count": 7443,
                "character": "Café Customer (uncredited)",
                "credit_id": "56b7906092514178bf0002d8",
                "order": 69
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/22yIGscWOOLRvwQb44ZboZmstIH.jpg",
                "genre_ids": [
                    18,
                    28,
                    53,
                    878
                ],
                "id": 9693,
                "original_language": "en",
                "original_title": "Children of Men",
                "overview": "In 2027, in a chaotic world in which humans can no longer procreate, a former activist agrees to help transport a miraculously pregnant woman to a sanctuary at sea, where her child's birth may help scientists save the future of humankind.",
                "popularity": 9.0933,
                "poster_path": "/8Xgvmx7WWc7Z9Ws9RAYk7uya2kh.jpg",
                "release_date": "2006-09-22",
                "title": "Children of Men",
                "video": false,
                "vote_average": 7.611,
                "vote_count": 7443,
                "credit_id": "52fe451dc3a36847f80bd33b",
                "department": "Writing",
                "job": "Novel"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Phyllis Dorothy James",
            "P.D. James"
        ],
        "biography": "Phyllis Dorothy James, Baroness James of Holland Park, OBE, FRSA, FRSL (August 3, 1920 – November 27, 2014), known professionally as P. D. James, was an English novelist and life peer. Her rise to fame came with her series of detective novels featuring the police commander and poet, Adam Dalgliesh.\n\nJames was born in Oxford, the daughter of Sidney Victor James, a tax inspector, and his wife, Dorothy Mary James. She was educated at the British School in Ludlow and Cambridge High School for Girls. Her mother was committed to a mental hospital when James was in her mid-teens.\n\nShe had to leave school at the age of sixteen to work to take care of her younger siblings, sister Monica, and brother Edward, because her family did not have much money and her father did not believe in higher education for girls. She worked in a tax office in Ely for three years and later found a job as an assistant stage manager for the Festival Theatre in Cambridge. She married Ernest Connor Bantry White (called \"Connor\"), an army doctor, on 8 August 1941. They had two daughters, Clare and Jane.\n\nWhite returned from the Second World War mentally ill and was institutionalised. With her daughters being mostly cared for by Connor's parents, James studied hospital administration, and from 1949 to 1968 worked for a hospital board in London. She began writing in the mid-1950s, using her maiden name (\"My genes are James genes\").\n\nHer first novel, Cover Her Face, featuring the investigator and poet Adam Dalgliesh of New Scotland Yard, was published in 1962. Dalgliesh's last name comes from a teacher of English at Cambridge High School and his first name is that of Miss Dalgliesh's father. Many of James's mystery novels take place against the backdrop of UK bureaucracies, such as the criminal justice system and the National Health Service, in which she worked for decades starting in the 1940s. Two years after the publication of Cover Her Face, James's husband died on 5 August 1964. Prior to his death, James had not felt able to change her job: \"He [Connor] would periodically discharge himself from hospital, sometimes at very short notice, and I never knew quite what I would have to face when I returned home from the office. It was not a propitious time to look for promotion or for a new job, which would only impose additional strain. But now [after Connor's death] I felt the strong need to look for a change of direction.\" She applied for the grade of Principal in the Home Civil Service and held positions as a civil servant within several sections of the Home Office, including the criminal section. She worked in government service until her retirement in 1979. ...\n\nSource: Article \"P. D. James\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1920-08-03",
        "deathday": "2014-11-27",
        "gender": 1,
        "homepage": null,
        "id": 920732,
        "imdb_id": "nm0416807",
        "known_for_department": "Writing",
        "name": "P. D. James",
        "place_of_birth": "Oxford, Oxfordshire, England UK",
        "popularity": 0.2121,
        "profile_path": "/tfk4cmvC9J3x2hpVKmWThUPgChk.jpg"
    }
}