{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cDTDGNaF5zu4LYD4gZjkaZ8DjjY.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4012,
                "original_language": "en",
                "original_title": "The Believer",
                "overview": "A hardcore US racist skinhead who, because of his intelligence, leads a gang dedicated to fighting the enemy: the supposed American-Jewish conspiracy for domination. However, he's hiding a secret: he's Jewish-born, a brilliant scholar whose questioning of the tenets of his faith has left him angry and confused, turning against those who he thinks have a tragic history of their own making.",
                "popularity": 4.129,
                "poster_path": "/6hw5RXCVgqKtY6xmHsEWRjJXljM.jpg",
                "release_date": "2001-08-23",
                "title": "The Believer",
                "video": false,
                "vote_average": 6.875,
                "vote_count": 635,
                "character": "Lina Moebius",
                "credit_id": "52fe43abc3a36847f80667f1",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Theresa Paup"
        ],
        "biography": "Theresa Russell (born Theresa Lynn Paup; March 20, 1957) is an American actress. Russell made her film debut in The Last Tycoon (1976), followed by a lead role in Straight Time (1978). She was then cast in Nicolas Roeg's controversial thriller Bad Timing (1980), which earned her critical praise. After marrying Roeg in 1982, she appeared in many films directed by him, mainly arthouse and experimental films, including Eureka (1983), Insignificance (1985), and Cold Heaven (1991).\n\nRussell starred in Whore and Kafka, both released in 1991. Russell appeared in the box-office hit thriller Wild Things (1998), starred in the critically acclaimed drama The Believer (2001) and, in the later 2000s, appeared in HBO miniseries Empire Falls (2005) and had a minor role in Spider-Man 3 (2007).\n\nDescription above from the Wikipedia article Theresa Russell, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1957-03-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 9207,
        "imdb_id": "nm0000622",
        "known_for_department": "Acting",
        "name": "Theresa Russell",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 0.7658,
        "profile_path": "/v0s86Nh5IMqYk5oazosuAwXAiO5.jpg"
    }
}