{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ufUdEHvs31M8yw3HMFjhTaVJIVp.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1374,
                "original_language": "en",
                "original_title": "Rocky IV",
                "overview": "Rocky Balboa holds the world heavyweight championship, but a new challenger has stepped forward: Drago, a six-foot-four, 261-pound fighter who has the backing of the Soviet Union. This time, Rocky's training regimen takes him to Siberia, where he prepares for a globally televised match in the heart of Moscow. But nothing can truly prepare him for what he's about to face – a fight to the finish, in which he must defend not only himself, but also the honor of his country!",
                "popularity": 6.2169,
                "poster_path": "/2MHUit4H6OK5adcOjnCN6suCKOl.jpg",
                "release_date": "1985-11-21",
                "title": "Rocky IV",
                "video": false,
                "vote_average": 7.08,
                "vote_count": 4612,
                "character": "Ludmilla Vobet Drago",
                "credit_id": "52fe42f1c3a36847f802e8d3",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/9il7qNbeYnPMYlutsVYDsj4hRyb.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 480530,
                "original_language": "en",
                "original_title": "Creed II",
                "overview": "Between personal obligations and training for his next big fight against an opponent with ties to his family's past, Adonis Creed is up against the challenge of his life.",
                "popularity": 9.55,
                "poster_path": "/v3QyboWRoA4O9RbcsqH8tJMe8EB.jpg",
                "release_date": "2018-11-21",
                "title": "Creed II",
                "video": false,
                "vote_average": 7.035,
                "vote_count": 5602,
                "character": "Ludmilla Drago",
                "credit_id": "5bf4df460e0a26265c0b308f",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brigitte Nielsen (born Gitte Nielsen; July 15, 1963) is a Danish actress, model, singer, and television personality, who began her acting career with appearances in the 1985 films Red Sonja and Rocky IV. She is also known for her marriage to Sylvester Stallone (1985-1987) and subsequently appeared with him in the 1986 film Cobra. She then was noted for her widely publicized breakup with Stallone in 1987, and her subsequent relationship with New York Jets defensive end Mark Gastineau from 1988 to 1990. She's also known for her relationship with rapper Flavor Flav in 2005.\n\nShe began her career modeling for Greg Gorman and Helmut Newton. She then acted in the 1985 films Red Sonja and Rocky IV, later returning to the Rocky series in Creed II (2018). Nielsen married Sylvester Stallone, with whom she starred in the 1986 film Cobra. She played a villain in Beverly Hills Cop II (1987) and starred as the Black Witch in the 1990s Italian film series Fantaghirò. She later built a career starring in B-movies, hosting TV shows, and appearing on reality shows.\n\nHer exploits were well-covered in the entertainment media in the 1980s, and the world press started referring to her as an \"Amazon\"  because of her tall stature (verified by the Guinness Book of World Records at six feet, or 1.82 meters).  She first commented on her stature and used the term \"Amazonian\" to describe herself in 1985. She later built a career appearing in B-movies, and in the 2000s, for appearing on reality shows such as The Surreal Life, on which she met and began a relationship with rapper Flavor Flav. In 2008, she appeared on the reality show Celebrity Rehab with Dr. Drew, which depicted her and several other celebrities dealing with recovery from drug and alcohol addiction.\n\nShe's been married 5 times, Sylvester Stallone was her second husband. She has 5 children: a son with her first husband, a son with NY Jets football player Marc Gastineau, 2 sons with her fourth husband, and a daughter (at the age of 54) with her fifth husband, who is 15 years younger. In her 2011 book, she revealed having had an affair with Arnold Schwarzenegger (he verified this in 2020) during the filming of Red Sonja (1985), after Schwarzenegger had just started a relationship with Maria Shriver.  Besides her native Danish, she is fluent in English, German and Italian.\n\nDescription above from the Wikipedia article Brigitte Nielsen, licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1963-07-15",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.brigittenielsen.com/",
        "id": 921,
        "imdb_id": "nm0000557",
        "known_for_department": "Acting",
        "name": "Brigitte Nielsen",
        "place_of_birth": "Rødovre, Danmark",
        "popularity": 0.7733,
        "profile_path": "/lkP0qKkDOvVk0ETZX0bx3Qmufkm.jpg"
    }
}