{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iTPTdfEGYGwbELLLvNnmgKZpVZj.jpg",
                "genre_ids": [
                    18,
                    10749,
                    35
                ],
                "id": 660120,
                "original_language": "no",
                "original_title": "Verdens verste menneske",
                "overview": "The chronicles of four years in the life of Julie, a young woman who navigates the troubled waters of her love life and struggles to find her career path, leading her to take a realistic look at who she really is.",
                "popularity": 3.6275,
                "poster_path": "/1NxGNQchGBTHXJ6RShLY1IlZqWn.jpg",
                "release_date": "2021-10-13",
                "title": "The Worst Person in the World",
                "video": false,
                "vote_average": 7.441,
                "vote_count": 1601,
                "character": "Åse",
                "credit_id": "60e864c64ca67600750d3d07",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Thea Stabell (born 4 July 1939), née Dorothea Jessie Pierstorff, is a Norwegian actress. Stabell's mother was American, and her father worked for the Foreign Service. As a result, she had a nomadic lifestyle growing up, living in both the United States, France and Belgium.  She graduated from the Norwegian National Academy of Theatre in 1964, and had her début the same year in the play Boyfriend at Oslo Nye Teater. She has since acted both at Torshovteatret, Hålogaland Teater and Nationaltheatret (the National Theatre), while all the while working as an instructor at Teaterhøyskolen. In 2006 she was hired as a professor here, as the first of her kind with an acting background, not an academic one.\n\nAmong the general public Stabell is best remembered for her role as \"Ingrid Femte\" in the 1972 comedy Norske byggeklosser. She has also acted in other well-known Norwegian movies, such as Balladen om mestertyven Ole Høiland (1970) and Mannen som ikke kunne le (1968), and more recently also in TV-series, among these \"Seks som oss\" (2005–2007) and \"Ved kongens bord\" (2005).",
        "birthday": "1939-07-04",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 92106,
        "imdb_id": "nm0820883",
        "known_for_department": "Acting",
        "name": "Thea Stabell",
        "place_of_birth": null,
        "popularity": 0.0261,
        "profile_path": null
    }
}