{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d7YwLX0PnX8vsaaQq9bz93jczGw.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 37719,
                "original_language": "en",
                "original_title": "A Night at the Opera",
                "overview": "The Marx Brothers take on high society and the opera world to bring two lovers together. A sly business manager and two wacky friends of two opera singers help them achieve success while humiliating their stuffy and snobbish enemies.",
                "popularity": 2.2813,
                "poster_path": "/A4YDGfJwaG7aMxDVrVJsOHJ7ufK.jpg",
                "release_date": "1935-11-15",
                "title": "A Night at the Opera",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 519,
                "character": "Dignitary (uncredited)",
                "credit_id": "64a087ff4a52f800af121736",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/iItypZVpdnxTFgA0iv345AzMUqk.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 981,
                "original_language": "en",
                "original_title": "The Philadelphia Story",
                "overview": "When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.",
                "popularity": 7.137,
                "poster_path": "/dKUubjvxO78XDts6VP1Ggcp4R9O.jpg",
                "release_date": "1940-12-05",
                "title": "The Philadelphia Story",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 914,
                "character": "Wedding Guest (uncredited)",
                "credit_id": "57b48dd0c3a3686a11000523",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William King Baggot",
            "King Baggott"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nWilliam King Baggot (November 7, 1879 – July 11, 1948) was an American actor, film director and screenwriter. He was an internationally famous movie star of the silent film era. The first individually publicized leading man in America, Baggot was referred to as \"King of the Movies\", \"The Most Photographed Man in the World\", and \"The Man Whose Face Is As Familiar As The Man In The Moon\".\n\nBaggot appeared in over 300 motion pictures from 1909 to 1947, wrote 18 screenplays, and directed 45 movies from 1912 to 1928, including The Lie (1912), Raffles: The Amateur Cracksman (1925), and The House of Scandal (1928). He also directed William S. Hart in his most famous western, Tumbleweeds (1925).\n\nAmong his film appearances, Baggot was best known for The Scarlet Letter (1911), Dr. Jekyll and Mr. Hyde (1913), and Ivanhoe (1913).\n\nBaggot began his career on the stage, in a Shakespearean stock company, and toured throughout the U.S.\n\nWhile acting in stock in St. Louis in 1909, he was cast as supporting player in the Schubert touring production of The Wishing Ring. When The Wishing Ring closed in Chicago, Baggot returned to New York to join another company. Upon a chance meeting with Harry Solter, who was directing movies for Carl Laemmle at Independent Moving Pictures Company (IMP), he was persuaded to go with Solter to the studio. Baggot became interested in the fledgling industry and decided to turn picture player.\n\nHis first film was the romance short The Awakening of Bess (1909) opposite Florence Lawrence. It was directed by Harry Solter, her husband, at IMP in Fort Lee, New Jersey. At a time when screen actors worked anonymously, Baggot and Lawrence became the first \"movie stars\" to be given billing, a marquee, and promotion in advertising.\n\nBaggot starred in at least 42 movies opposite Lawrence from 1909 to 1911. In the latter year, he starred in at least 16 movies with Mary Pickford.\n\nHe also began writing screenplays and directing, all the while becoming a major star internationally. When he appeared \"in person\" at theatres he was mobbed at stage doors.\n\nBy 1912, he was so famous that when he took the leading part in forming the prestigious Screen Club in New York, the first organization of its kind strictly for movie people, he was the natural choice for its first president.\n\nKing Baggot died in Los Angeles, California in 1948, age 68.\n\nFor his contributions to the film industry, Baggot received a motion pictures star on the Hollywood Walk of Fame in 1960. His star is located at 6312 Hollywood Boulevard.",
        "birthday": "1879-11-06",
        "deathday": "1948-07-11",
        "gender": 2,
        "homepage": null,
        "id": 921738,
        "imdb_id": "nm0007215",
        "known_for_department": "Acting",
        "name": "King Baggot",
        "place_of_birth": "Saint Louis, Missouri, USA",
        "popularity": 0.1029,
        "profile_path": "/3RH89Z7zLKJjVRyb0vz27fWn9d3.jpg"
    }
}