{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2f2denPrX62TjWJKVD9i2dum164.jpg",
                "genre_ids": [
                    35
                ],
                "id": 58522,
                "original_language": "it",
                "original_title": "Boris - Il film",
                "overview": "A director and his crew attempt to make the transition from the small to the big screen.",
                "popularity": 2.0957,
                "poster_path": "/bro0yk5rDSU3mCIk5pnEzPDWV50.jpg",
                "release_date": "2011-04-01",
                "title": "Boris: The Film",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 608,
                "character": "Self",
                "credit_id": "52fe4967c3a36847f8198493",
                "order": 77
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/y0eyUFB8dBLKjbQFeAgFMiklQDq.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1254,
                "original_language": "fr",
                "original_title": "Je vais bien, ne t'en fais pas",
                "overview": "A 19-year-old searches for her twin brother after he runs away from home, following a fight with their father.",
                "popularity": 1.4751,
                "poster_path": "/yD6skMZZq0Rgn2NhI9dk4B2Dipu.jpg",
                "release_date": "2006-09-06",
                "title": "Don't Worry, I'm Fine",
                "video": false,
                "vote_average": 7.206,
                "vote_count": 593,
                "credit_id": "52fe42eac3a36847f802c9d7",
                "department": "Sound",
                "job": "Original Music Composer"
            },
            {
                "adult": false,
                "backdrop_path": "/6aNKD81RHR1DqUUa8kOZ1TBY1Lp.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 637,
                "original_language": "it",
                "original_title": "La vita è bella",
                "overview": "A touching story of an Italian book seller of Jewish ancestry who lives in his own little fairy tale. His creative and happy life would come to an abrupt halt when his entire family is deported to a concentration camp during World War II. While locked up he tries to convince his son that the whole thing is just a game.",
                "popularity": 7.2874,
                "poster_path": "/mfnkSeeVOBVheuyn2lo4tfmOPQb.jpg",
                "release_date": "1997-12-20",
                "title": "Life Is Beautiful",
                "video": false,
                "vote_average": 8.44,
                "vote_count": 13548,
                "credit_id": "52fe4262c3a36847f801a15f",
                "department": "Sound",
                "job": "Original Music Composer"
            },
            {
                "adult": false,
                "backdrop_path": "/mgJFiLulYzHxorIWNQyU5Wp4KHU.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11447,
                "original_language": "it",
                "original_title": "La stanza del figlio",
                "overview": "A psychoanalyst and his family go through profound emotional trauma when their son dies in a scuba diving accident.",
                "popularity": 0.959,
                "poster_path": "/mUeDLodG63QSGBEGWDYZIsYjhok.jpg",
                "release_date": "2001-03-09",
                "title": "The Son's Room",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 528,
                "credit_id": "52fe44419251416c7502e48f",
                "department": "Sound",
                "job": "Original Music Composer"
            },
            {
                "adult": false,
                "backdrop_path": "/sGuFLx1g3lmNMj7O7CUWdMcziz4.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 575452,
                "original_language": "it",
                "original_title": "Il traditore",
                "overview": "Palermo, Sicily, 1980. Mafia member Tommaso Buscetta decides to move to Brazil with his family fleeing the constant war between the different clans of the criminal organization. But when, after living several misfortunes, he is forced to return to Italy, he makes a bold decision that will change his life and the destiny of Cosa Nostra forever.",
                "popularity": 3.1363,
                "poster_path": "/bjb1zKlyw85hYwDXzz2UM6XqjUU.jpg",
                "release_date": "2019-05-23",
                "title": "The Traitor",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1382,
                "credit_id": "5c3e5bfa9251415524ae2bc3",
                "department": "Sound",
                "job": "Original Music Composer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nikola Piovani"
        ],
        "biography": "Nicola Piovani (born 26 May 1946) is an Italian light-classical musician, theater and film score composer. In 1998, he won the Academy Award for Best Original Dramatic Score for Roberto Benigni's film Life Is Beautiful (1997).\n\nAfter high school, Piovani enrolled at the Sapienza University of Rome, receiving his degree in piano from the Verdi Conservatory in Milan in 1967, and later studied orchestration under the Greek composer Manos Hadjidakis.\n\nIn 1971 and 1973 collaborated for the music of two albums of the songwriter Fabrizio De André: Storia di un impiegato and Non al denaro non all'amore né al cielo. In 2008, after De André departure, Piovani wrote the music for the film Amore che vieni, amore che vai, inspired by a novel of De André himself, Un destino ridicolo.\n\nAmong his more popular works is the score for the Federico Fellini film Intervista, his second of three collaborations with the famous director, the others being Ginger e Fred (Ginger and Fred in English) and La voce della luna (The Voice of the Moon). Years later, he composed a ballet titled Balletto Fellini.\n\nIn 2000, his Academy Award-winning score for Life Is Beautiful (La Vita è bella) was further nominated for a Grammy Award in the \"Best Instrumental Composition Written for a Motion Picture, Television or Other Visual Media\" category, losing to Randy Newman. In 2005, he was a member of the jury at the 27th Moscow International Film Festival. In light of his recent work with French directors, notably Danièle Thompson, Philippe Lioret, and Éric-Emmanuel Schmitt, the French Minister of Culture gave him the title of Chevalier (Knight) of the Ordre des Arts et des Lettres on 21 May 2008 at the Cannes Film Festival.\n\nTo date, Piovani has over 130 film scores to his credit, including films such as Slap the Monster on Page One (1972), The Perfume of the Lady in Black (1974), Flavia the Heretic (1974), Le Orme (1975), A Leap in the Dark (1980) The Night of the Shooting Stars (1982), and Kaos (1984). The music for the latter is considered by many as one of the best film scores ever done. However, he is reported to believe that \"Too many film scores make a composer a hack, but in the theatre music is above all craftsmanship\". Accordingly, he continues to work in musical theatre, and also composes concert and chamber music.\n\nPiovani also composed the first opera Amorosa presenza on a libretto by Aisha Cerami and Nicola Piovani, based on the novel by Vincenzo Cerami and is performed at the Teatro Verdi in Trieste in January 2022.\n\nIn 2023, he was awarded the Lifetime Achievement Award from the World Soundtrack Academy.\n\nIn 2024, Piovani composed the score for Loris Lai's debut feature film, How Kids Roll.\n\nSource: Article \"Nicola Piovani\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1946-05-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 9245,
        "imdb_id": "nm0003607",
        "known_for_department": "Sound",
        "name": "Nicola Piovani",
        "place_of_birth": "Rome, Italy",
        "popularity": 0.1605,
        "profile_path": "/56tRfEIn4RBPhjJ7JOGCOtTZApU.jpg"
    }
}