{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/30UGnraRdbZl4a8vcfYJPIzvzjM.jpg",
                "genre_ids": [
                    99,
                    10402,
                    10770
                ],
                "id": 319075,
                "original_language": "en",
                "original_title": "Cobain: Montage of Heck",
                "overview": "Hailed as one of the most innovative and intimate documentaries of all time, experience Kurt Cobain like never before in the only ever fully authorized portrait of the famed music icon. Academy Award nominated filmmaker Brett Morgen expertly blends Cobain's personal archive of art, music, never seen before movies, animation and revelatory interviews from his family and closest friends.",
                "popularity": 1.404,
                "poster_path": "/d0DgEvMNrGGlUXqyQ7HJbgnIxO7.jpg",
                "release_date": "2015-03-23",
                "title": "Cobain: Montage of Heck",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 717,
                "character": "Self (archive footage/voice)",
                "credit_id": "54c416fbc3a36878fb005c6d",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nirvana ",
            "Kurt Donald Cobain"
        ],
        "biography": "Kurt Donald Cobain (February 20, 1967 – c. April 5, 1994) was an American singer-songwriter, musician and artist, best known as the lead singer and guitarist of the grunge band Nirvana.\n\nCobain formed Nirvana with Krist Novoselic in Aberdeen, Washington, in 1985 and established it as part of the Seattle music scene, having its debut album Bleach released on the independent record label Sub Pop in 1989. After signing with major label DGC Records, the band found breakthrough success with \"Smells Like Teen Spirit\" from its second album Nevermind (1991). Following the success of Nevermind, Nirvana was labeled \"the flagship band\" of Generation X, and Cobain hailed as \"the spokesman of a generation\". Cobain however was often uncomfortable and frustrated, believing his message and artistic vision to have been misinterpreted by the public, with his personal issues often subject to media attention. He challenged Nirvana's audience with its final studio album In Utero (1993).\n\nDuring the last years of his life, Cobain struggled with heroin addiction, illness and depression, his fame and public image, as well as the professional and lifelong personal pressures surrounding himself and his wife, musician Courtney Love. On April 8, 1994, Cobain was found dead at his home in Seattle, the victim of what was officially ruled a suicide by a self-inflicted shotgun wound to the head. The circumstances of his death have become a topic of public fascination and debate. Since their debut, Nirvana, with Cobain as a songwriter, has sold over 25 million albums in the US alone, and over 50 million worldwide.\n\nDescription above from the Wikipedia article Kurt Cobain, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1967-02-20",
        "deathday": "1994-04-05",
        "gender": 2,
        "homepage": null,
        "id": 92563,
        "imdb_id": "nm0001052",
        "known_for_department": "Acting",
        "name": "Kurt Cobain",
        "place_of_birth": "Aberdeen, Washington, USA",
        "popularity": 0.165,
        "profile_path": "/gZcvwWRbvLgtbQ04sBOBrA98Zgw.jpg"
    }
}