{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i109vzdCkG7W3H9FxHmfpZjgh61.jpg",
                "genre_ids": [
                    10751,
                    12,
                    18
                ],
                "id": 522518,
                "original_language": "en",
                "original_title": "A Dog's Journey",
                "overview": "A dog finds the meaning of his own existence through the lives of the humans he meets.",
                "popularity": 4.6657,
                "poster_path": "/wquJChp0NpoqthYdE3YjXNNxvVC.jpg",
                "release_date": "2019-05-03",
                "title": "A Dog's Journey",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 1570,
                "character": "Gloria Mitchell",
                "credit_id": "5c603c27c3a3683cc69034af",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/yizL4cEKsVvl17Wc1mGEIrQtM2F.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 588228,
                "original_language": "en",
                "original_title": "The Tomorrow War",
                "overview": "The world is stunned when a group of time travelers arrive from the year 2051 to deliver an urgent message: Thirty years in the future, mankind is losing a global war against a deadly alien species. The only hope for survival is for soldiers and civilians from the present to be transported to the future and join the fight. Among those recruited is high school teacher and family man Dan Forester. Determined to save the world for his young daughter, Dan teams up with a brilliant scientist and his estranged father in a desperate quest to rewrite the fate of the planet.",
                "popularity": 14.3206,
                "poster_path": "/34nDCQZwaEvsy4CFO5hkGRFDCVU.jpg",
                "release_date": "2021-09-03",
                "title": "The Tomorrow War",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 3816,
                "character": "Emmy Forester",
                "credit_id": "5dcaf0cf470ead00189a7fe3",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Elizabeth Folan Gilpin",
            "Ελίζαμπεθ Φόλαν Γκίλπιν"
        ],
        "biography": "Betty Gilpin, born Elizabeth Folan Gilpin on July 21, 1986, is an American actress known for her versatile performances in both television and film. She has garnered critical acclaim for her work, particularly in the Netflix series \"GLOW.\"\n\nGilpin grew up in New York City and was exposed to the world of acting from a young age. Her father, Jack Gilpin, is also an actor. She pursued her passion for acting and honed her skills through training and stage performances.\n\nGilpin gained wider recognition for her role as Debbie \"Liberty Belle\" Eagan in the comedy-drama series \"GLOW\" (2017-2019). The show, set in the 1980s, follows the fictionalized story of the Gorgeous Ladies of Wrestling (GLOW). Gilpin's performance as the talented and conflicted wrestler earned her critical praise and award nominations. She showcased her range as an actress, seamlessly transitioning between comedic and dramatic moments, and bringing depth to her character.\n\nBeyond \"GLOW,\" Gilpin has appeared in various television series, including \"Nurse Jackie,\" \"Law & Order: SVU,\" and \"Masters of Sex.\" She has also made appearances in films such as \"True Story\" (2015), \"The Hunt\" (2020) and the series \"American Primeval\" (2025) displaying her versatility in different genres.\n\nGilpin's performances are often characterized by her ability to capture complex emotions, convey vulnerability, and bring depth to her characters. She has been praised for her sharp comedic timing, nuanced portrayals, and her ability to tackle challenging roles with authenticity.\n\nIn addition to her acting work, Gilpin has been vocal about issues such as gender inequality in the entertainment industry and has advocated for more diverse and inclusive storytelling.\n\nBetty Gilpin's talent, dedication, and ability to embody a wide range of characters have established her as a respected actress in both television and film. Her performances continue to captivate audiences and showcase her remarkable skills as a performer.",
        "birthday": "1986-07-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 92572,
        "imdb_id": "nm2365811",
        "known_for_department": "Acting",
        "name": "Betty Gilpin",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.797,
        "profile_path": "/hBOviIHCVqbWyyPUoIxZohDl5SL.jpg"
    }
}