{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dbdegCWeD4iK5LXxSBjGdIRsVXS.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 639,
                "original_language": "en",
                "original_title": "When Harry Met Sally...",
                "overview": "Sex always gets in the way of friendships between men and women. At least, that's what Harry Burns believes. So when Harry meets Sally Albright and a deep friendship blossoms between them, Harry's determined not to let his attraction to Sally destroy it. But when a night of weakness ends in a morning of panic, can the pair avoid succumbing to Harry's fears by remaining friends and admitting they just might be the perfect match for each other?",
                "popularity": 4.6945,
                "poster_path": "/rFOiFUhTMtDetqCGClC9PIgnC1P.jpg",
                "release_date": "1989-07-12",
                "title": "When Harry Met Sally...",
                "video": false,
                "vote_average": 7.406,
                "vote_count": 4300,
                "character": "Alice",
                "credit_id": "5474253a92514160e30003d0",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lisa Persky"
        ],
        "biography": "Lisa Jane Persky (born May 5, 1955) is an American actress.\n\nPersky was born in New York City, New York, the daughter of Jane Holley (née Wilson) and Mort Persky. She grew up in New York's Greenwich Village and attended the High School of Art and Design.\n\nShe debuted as Robert Duvall's daughter in The Great Santini and went on to act in such movies as American Pop, The Big Easy, When Harry Met Sally..., Coneheads, KISS Meets the Phantom of the Park, and Peggy Sue Got Married.\n\nShe wrote for New York Rocker magazine in the 1970s and dated former Blondie bass player Gary Valentine Lachman. On January 19, 2008, she married music historian and former co-star of the Comedy Central game show Beat the Geeks Andy Zax.\n\nIn 2009 and 2010, Persky began making appearances on The Best Show on WFMU radio program, as both as a regular caller and as an in-studio special guest.\n\nDescription above from the Wikipedia article Lisa Jane Persky, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1955-05-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 9259,
        "imdb_id": "nm0675484",
        "known_for_department": "Acting",
        "name": "Lisa Jane Persky",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3167,
        "profile_path": "/bURqr4uN7kKyC3kcVae8OQlAQjR.jpg"
    }
}