{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ioQYjcRnU54ir5ltgyS7k53zw5x.jpg",
                "genre_ids": [
                    18,
                    10751,
                    10402,
                    10749
                ],
                "id": 15121,
                "original_language": "en",
                "original_title": "The Sound of Music",
                "overview": "In the years before the Second World War, a tomboyish postulant at an Austrian abbey is hired as a governess in the home of a widowed naval captain with seven children, and brings a new love of life and music into the home.",
                "popularity": 9.0195,
                "poster_path": "/c6CrUZypAsBCaRWX0M3RVRDbhNS.jpg",
                "release_date": "1965-03-29",
                "title": "The Sound of Music",
                "video": false,
                "vote_average": 7.726,
                "vote_count": 3443,
                "character": "Louisa von Trapp",
                "credit_id": "52fe463c9251416c75071a9b",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Heather Menzies-Urich"
        ],
        "biography": "Heather Menzies Urich (December 3, 1949 – December 24, 2017) was a Canadian–American model and actress, known for her roles as Louisa von Trapp in the 1965 film The Sound of Music. Beautiful, sunny, and engaging blonde actress Heather Menzies was born on December 3, 1949 in Toronto, Canada. Her family moved to the United States when Heather was eleven. She graduated from Hollywood High School and subsequently attended the Falcon Studio's University of the Arts in Hollywood. Heather made a strong and promising film debut as Louisa von Trapp in the delightful classic musical The Sound of Music (1965). Menzies also appeared with The Sound of Music (1965) star Julie Andrews in the epic drama Hawaii (1966). After initially establishing herself as an innocent ingénue in the 1960s, Heather reinvented herself with a much sexier image in the 1970s. She did a nude pictorial for the August 1973 issue of \"Playboy.\" Heather gave an extremely sweet and appealing performance as mad scientist Strother Martin's lovely and loyal daughter in the enjoyably oddball horror feature Sssssss (1973). Menzies was likewise quite spirited and personable as a feisty skip tracer in the terrific fright film cult favorite Piranha (1978).\n\nOn television, Heather achieved her greatest fame as scantily clad fugitive Jessica in the short-lived, but still popular Logan's Run (1977) science fiction TV series. Among the numerous TV shows Menzies did guest spots on are The Farmer's Daughter (1963), Dragnet 1967 (1967), Marcus Welby, M.D. (1969), The Love Boat (1977), T.J. Hooker (1982), Bonanza (1959), S.W.A.T. (1975), and Love, American Style (1969). Heather appeared with her late actor husband Robert Urich on several occasions: She acted in three episodes of Vega$ (1978) and one episode of Spenser: For Hire (1985), plus had a small role in the offbeat science fiction mystery thriller Endangered Species (1982). Moreover, Menzies first met Urich on the set of a TV commercial they acted in together. An ovarian cancer survivor, Heather resided in Los Angeles with her three children and worked for the Urich Fund for Sarcoma Research at the University of Michigan Comprehensive Cancer Center. Menzies died from brain cancer at age 68 on December 24, 2017.",
        "birthday": "1949-12-03",
        "deathday": "2017-12-24",
        "gender": 1,
        "homepage": null,
        "id": 92691,
        "imdb_id": "nm0579991",
        "known_for_department": "Acting",
        "name": "Heather Menzies",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.3207,
        "profile_path": "/dqvVyBGvfelVSSHR6azFAUn4Xfu.jpg"
    }
}