{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oXNtdwoRsG9MIpOjJHeT4xGjwbV.jpg",
                "genre_ids": [
                    18
                ],
                "id": 458737,
                "original_language": "en",
                "original_title": "First Reformed",
                "overview": "A pastor of a small church in upstate New York starts to spiral out of control after a soul-shaking encounter with an unstable environmental activist and his pregnant wife.",
                "popularity": 4.6376,
                "poster_path": "/8HKA3Hwf8jQWy8TCYWr7C8Wft23.jpg",
                "release_date": "2018-05-18",
                "title": "First Reformed",
                "video": false,
                "vote_average": 6.986,
                "vote_count": 1389,
                "character": "Roger",
                "credit_id": "5b621f7ec3a368189402391f",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Evan Vanfossen Hansis"
        ],
        "biography": "Van Hansis (born Evan Vanfossen Hansis on September 25, 1981 in North Adams, Massachusetts) is an American actor. Hansis portrayed the rich Luke Snyder on the CBS soap opera As the World Turns from December 14, 2005 until the show's final episode September 17, 2010. The son of long running characters on the series, Luke is known for a gay romantic storyline cited as one of the first in American daytime television.\n\nHansis has had guest roles on several television series and starred in the 2011 thriller film Occupant. In December 2012, he began playing the role of Thom in the dark comedy web series EastSiders. Hansis later played Jess Gibson in the 2013 horror film Devil May Call, and starred as Dusty in the 2015 LGBT mystery film Kiss Me, Kill Me.\n\nHansis was nominated for a Daytime Emmy Award in 2007, 2008 and 2009 for his As the World Turns role, and was nominated again in 2016 for his role on EastSiders.",
        "birthday": "1981-09-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 927638,
        "imdb_id": "nm2082499",
        "known_for_department": "Acting",
        "name": "Van Hansis",
        "place_of_birth": "North Adams, Massachusetts, USA",
        "popularity": 0.1797,
        "profile_path": "/qF2gYSeOdCyaU9OKa1NDpq9wOnm.jpg"
    }
}