{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/20wSDAS6rUWhkZQ2PxPC9TRsAd1.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 11499,
                "original_language": "en",
                "original_title": "Frost/Nixon",
                "overview": "For three years after being forced from office, Nixon remained silent. But in summer 1977, the steely, cunning former commander-in-chief agreed to sit for one all-inclusive interview to confront the questions of his time in office and the Watergate scandal that ended his presidency. Nixon surprised everyone in selecting Frost as his televised confessor, intending to easily outfox the breezy British showman and secure a place in the hearts and minds of Americans. Likewise, Frost's team harboured doubts about their boss's ability to hold his own. But as the cameras rolled, a charged battle of wits resulted.",
                "popularity": 3.8613,
                "poster_path": "/z4cQ2mJxwPZUwVh97yX9oNsLLZQ.jpg",
                "release_date": "2008-10-15",
                "title": "Frost/Nixon",
                "video": false,
                "vote_average": 7.277,
                "vote_count": 1232,
                "character": "Ken Khachigian",
                "credit_id": "52fe444c9251416c7502fc83",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/AfGp6Ev3BVdEd7L99kGQzOzsqRb.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 568,
                "original_language": "en",
                "original_title": "Apollo 13",
                "overview": "The true story of technical troubles that scuttle the Apollo 13 lunar mission in 1970, risking the lives of astronaut Jim Lovell and his crew, with the failed journey turning into a thrilling saga of heroism. Drifting more than 200,000 miles from Earth, the astronauts work furiously with the ground crew to avert tragedy.",
                "popularity": 8.8273,
                "poster_path": "/tVeKscCm2fY1xDXZk8PgnZ87h9S.jpg",
                "release_date": "1995-06-30",
                "title": "Apollo 13",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 5606,
                "character": "GNC White",
                "credit_id": "56bb980fc3a36860e40003bd",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gabe Jarret",
            "Gabriel Kronsberg"
        ],
        "biography": "Gabriel Jarret (born Gabriel Kronsberg; January 1, 1970) is an American actor. He is best known for his role as the young genius Mitch Taylor in the 1985 comedy film Real Genius in which he co-starred with Val Kilmer.\n\nJarret's first film was Going Ape! in 1981. Arguably his most notable appearance was as Mitch Taylor alongside Val Kilmer's Chris Knight in the movie Real Genius. Other film roles include The Karate Kid Part III, Apollo 13, and Last Days. Jarret also made television guest appearances in such shows as 21 Jump Street, L.A. Law, Party of Five, and The West Wing.\n\nDescription above from the Wikipedia article Gabriel Jarret, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1970-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 92808,
        "imdb_id": "nm0418909",
        "known_for_department": "Acting",
        "name": "Gabriel Jarret",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.23,
        "profile_path": "/m353LQhbbxRcsECrcXkwX7uzKPg.jpg"
    }
}