{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/Ag6qhzsJd3k1NKuNrG9RmhZDMh7.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 640,
                "original_language": "en",
                "original_title": "Catch Me If You Can",
                "overview": "A true story about Frank Abagnale Jr. who, before his 19th birthday, successfully conned millions of dollars worth of checks as a Pan Am pilot, doctor, and legal prosecutor. An FBI agent makes it his mission to put him behind bars. But Frank not only eludes capture, he revels in the pursuit.",
                "popularity": 10.8642,
                "poster_path": "/ctjEj2xM32OvBXCq8zAdK3ZrsAj.jpg",
                "release_date": "2002-12-16",
                "title": "Catch Me If You Can",
                "video": false,
                "vote_average": 7.979,
                "vote_count": 16345,
                "character": "Darcy",
                "credit_id": "52fe4263c3a36847f801a67f",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/xKtWcQD2yugIKz49LvZNHdLM09T.jpg",
                "genre_ids": [
                    35,
                    18,
                    10752
                ],
                "id": 256962,
                "original_language": "en",
                "original_title": "Little Boy",
                "overview": "An eight-year-old boy is willing to do whatever it takes to end World War II so he can bring his father home. The story reveals the indescribable love a father has for his little boy and the love a son has for his father.",
                "popularity": 3.2498,
                "poster_path": "/lAU9pgq3niI6sFemcKm4FGGmrnW.jpg",
                "release_date": "2015-04-23",
                "title": "Little Boy",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 544,
                "character": "Bertha",
                "credit_id": "55fe1c51c3a36813340022db",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Candy Azarra"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nCandice \"Candy\" Azzara (born May 18, 1945) is an American character actress frequently cast in Italian or Jewish roles.\n\nAzzara was born in Brooklyn, the daughter of Josephine (née Bravo) and Samuel Azzara. She was inspired to pursue acting by the film La Strada and theatre legend Eleanora Duse. She studied with Lee Strasberg and Gene Frankel and soon began appearing off-Broadway and in regional theatres.\n\nBilled as Candy Azzara, she made her Broadway debut in Lovers and Other Strangers in 1968. Additional stage credits include Jake's Women, Cactus Flower, Any Wednesday, Barefoot in the Park, and The Moon Is Blue.\n\nAzzara was cast as Gloria in the second pilot of All in the Family when it was entitled Those Were the Days and the family name was Justice instead of Bunker.[2] She was a regular on the sitcom Calucci's Department and had recurring roles on Caroline in the City, Who's the Boss, Soap, and Rhoda. She has guested on numerous series, including Diff'rent Strokes, The Practice, Married With Children, Kojak, Barney Miller (as a manicurist, in Season 2 Episode 3), Trapper John, M.D., L.A. Law, Murder, She Wrote, ER, Married with Children (1992) and Joan of Arcadia.\n\nOn screen Azzara has appeared in In Her Shoes, Ocean's Twelve, Catch Me If You Can, Easy Money, House Calls, Unstrung Heroes, Pandemonium, Fatso, and Made for Each Other.\n\nAzzara is the aunt of actress Lana Parrilla.\n\nDescription above from the Wikipedia article Candice Azzara, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1945-05-18",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 9283,
        "imdb_id": "nm0044489",
        "known_for_department": "Acting",
        "name": "Candice Azzara",
        "place_of_birth": "Brooklyn, New York, U.S.",
        "popularity": 0.234,
        "profile_path": "/4H5oacxmRVgqc2oGU9SmjRaOr1A.jpg"
    }
}