{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3nx1jkMcWlcjmlDgEDFzW1Tykv0.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 2604,
                "original_language": "en",
                "original_title": "Born on the Fourth of July",
                "overview": "Paralyzed in the Vietnam war, Ron Kovic becomes an anti-war and pro-human rights political activist after feeling betrayed by the country he fought for.",
                "popularity": 8.4394,
                "poster_path": "/c5gSie6ZA90iBs62yNM5MV4y9R7.jpg",
                "release_date": "1989-12-20",
                "title": "Born on the Fourth of July",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1790,
                "character": "Paraplegic #2 - Miami Convention",
                "credit_id": "55e880699251413e3a002dcf",
                "order": 71
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kent Osborne has been in show business since early youth, beginning as a song and dance kid in theatre stage circuits. In his early teens he entered \"The American Academy of Theatre Arts\" as an actor/director in New York City. At sixteen, he was signed to a 7-year actor contract with \"Twentieth Century Fox Studios.\"\n\nWhile under contract he owned and operated his own Playhouse Theatre, directing, acting and producing plays. At nineteen he wrote, directed and produced his first film - \"It Could Happen to You.\" He wrote and directed the television shows \"Meet Milie\" and \"Tales of Turf and Live by a Star.\" Osborne was also instrumental in starting the Board of N.A.B.I.T. and the Independent Screen Producers Association, in which he was voted the First official President.\n\nIn his fifty-four theatrical years, Mr. Osborne has written several novels, many plays and more than 90 screenplays - 40 were sold to other Producers and companies. He has produced and directed more than 26 of his own screenplays into major motion pictures. He has written and directed over 200 commercials, documentaries, industrial and armed forces training films throughout the world. Mr. Osborne was head of production for such production companies as Lee Lacey and Associates, Skylark Productions, Ubang Productions and his own.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 928480,
        "imdb_id": "nm0651690",
        "known_for_department": "Acting",
        "name": "Ken Osborne",
        "place_of_birth": null,
        "popularity": 2.4755,
        "profile_path": null
    }
}