{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjnfM8QmrXQkWl8dUimsDGl73el.jpg",
                "genre_ids": [
                    12,
                    10749,
                    36
                ],
                "id": 10907,
                "original_language": "en",
                "original_title": "The Adventures of Robin Hood",
                "overview": "Robin Hood fights nobly for justice against the evil Sir Guy of Gisbourne while striving to win the hand of the beautiful Maid Marian.",
                "popularity": 2.6754,
                "poster_path": "/4mazyXEMkmLw5h6076yyNSm9uv0.jpg",
                "release_date": "1938-05-13",
                "title": "The Adventures of Robin Hood",
                "video": false,
                "vote_average": 7.481,
                "vote_count": 799,
                "character": "Bishop of the Black Canons",
                "credit_id": "52fe43ce9251416c7501eded",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harry Montague Love",
            "Montague Love"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMontagu Love (15 March 1880 – 17 May 1943), also known as Montague Love, was an English screen, stage and vaudeville actor.\n\nBorn Harry Montague Love in Portsmouth, Hampshire, he was the son of Harry Love (b. 1852) and Fanny Louisa Love, née Poad (b. 1856); his father was listed as accountant on the 1881 English Census. Educated in Great Britain, Love began his career as an artist and military correspondent with his first important job as a London newspaper cartoonist. Love honed basic stage talents in London, and in 1913 sailed to the Canada and crossed the border into the United States in November with a road-company production of Cyril Maude's Grumpy.\n\nUsually Love was cast in heartless villain roles. In the 1920s, he played with Rudolph Valentino in The Son of the Sheik, opposite John Barrymore in Don Juan, and appeared with Lillian Gish in 1928's The Wind. He also portrayed 'Colonel Ibbetson' in Forever (1921), the silent film version of Peter Ibbetson. Love was one of the more successful villains in silent films.\n\nOne of Love's first sound films was the part-talkie The Mysterious Island co-starring Lionel Barrymore. In 1937, he played Henry VIII in the first talking film version of Mark Twain's The Prince and the Pauper, with Errol Flynn. Love played the bigoted Bishop of the Black Canons in The Adventures of Robin Hood, starring Flynn, too. However, he also played gruff authoritarian figures, such as Monsieur Cavaignac, who, contrary to history, demands the resignation of those responsible for the Dreyfus coverup, in The Life of Emile Zola (1937), as well as Don Alejandro de la Vega, whose son appears to be a fop but is actually Zorro, in the 1940 version of The Mark of Zorro, starring Tyrone Power.\n\nIn 1941, he played a doctor in Shining Victory, which also starred James Stephenson, Geraldine Fitzgerald and Donald Crisp. In 1939's Gunga Din, it is Montagu Love who reads the final stanza of Rudyard Kipling's original poem over the body of the slain Din.\n\nLove's last film to be released, Devotion, was released three years after his death aged 63 in 1943. He was interred at Chapel of the Pines Crematory. His last acting stint was on Wings Over the Pacific (1943).",
        "birthday": "1880-03-15",
        "deathday": "1943-05-17",
        "gender": 2,
        "homepage": null,
        "id": 92907,
        "imdb_id": "nm0002311",
        "known_for_department": "Acting",
        "name": "Montagu Love",
        "place_of_birth": "Portsmouth, Hampshire, England, UK",
        "popularity": 0.1345,
        "profile_path": "/aCOahFpYdCKMOg8RO9jMsFOA5xx.jpg"
    }
}