{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self (archive footage)",
                "credit_id": "5855d3d2c3a3682dfe046eda",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nelson Piquet Souto Maior (born 17 August 1952) is a Brazilian retired racing driver and businessman who won the World Drivers' Championship three times in the years 1981, 1983 and 1987.\n\nPiquet had a brief career in tennis before losing interest in the sport and subsequently took up karting and hid his identity to prevent his father discovering his hobby. He became the Brazilian national karting champion in 1971–72 and won the Formula Vee championship in 1976. With advice from Emerson Fittipaldi, Piquet went to Europe to further success by taking the record number of wins in Formula Three in 1978, beating Jackie Stewart's all-time record.\n\nIn the same year, he made his Formula One debut with the Ensign team and drove for McLaren and Brabham. In 1979, Piquet moved to the Brabham team and finished the runner-up in 1980 before winning the championship in 1981. Piquet in 1982 was hampered by severe engine unreliability, but he saw a resurgence for 1983 and his second world championship. For 1984–85, Piquet had once again lost chances to win the championship but managed to score three wins during that period. He moved to the Williams team in 1986 and was a title contender until the final round in Australia. Piquet took his third and final championship in 1987 during a heated battle with teammate Nigel Mansell which left the pair's relationship sour. Piquet subsequently moved to Lotus for 1988–89 where he experienced his third drop in form. He eventually went to the Benetton team for 1990–91 where he managed to win three races before retiring.\n\nAfter retiring from Formula One, Piquet tried his hand at the Indianapolis 500 for two years. He also had a go at sports car racing at various points during and after his Formula One career. Piquet is currently retired and runs several businesses in Brazil. He also manages his sons Nelson Piquet Jr. and Pedro Piquet, who are also professional racing drivers.\n\nPiquet was born 17 August 1952, in Rio de Janeiro, then the capital of Brazil, the son of Estácio Gonçalves Souto Maior (1913–1974), a Brazilian physician. His father moved his family to the new capital, Brasília, in 1960 and became Minister for Health in João Goulart's government (1961–64). Piquet had two brothers, Alexis, and Geraldo, and a sister Genusa. Piquet was the youngest of the children.\n\nHis father wanted Piquet to be a professional tennis player and was given a scholarship at a school in the United States, in Atlanta. Piquet started playing tennis at the age of 11. He won tournaments in Brazil and eventually took a trip to California to test his skill against tougher American players. During his time, he had learned to speak English and greatly matured. His short tennis career saw Piquet to be prized as a good player but not thought sufficiently exciting for the sport, which led him to devote his career to motor racing.\n\nPiquet started kart racing at the age of 14, but because his father did not approve of his racing career, he used his mother's maiden name Piquet (of French origin and pronounced as \"Pee-Ké\") misspelt as Piket to hide his identity. ...\n\nSource: Article \"Nelson Piquet\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1952-08-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 929283,
        "imdb_id": "nm1465456",
        "known_for_department": "Acting",
        "name": "Nelson Piquet",
        "place_of_birth": "Rio de Janeiro, Brazil",
        "popularity": 0.1225,
        "profile_path": "/w4FREWprfck2T3T3HYADLTbQGBC.jpg"
    }
}