{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hGnJhGSeyWlerHcLNnD06sbX5wU.jpg",
                "genre_ids": [
                    18,
                    53,
                    9648
                ],
                "id": 638,
                "original_language": "en",
                "original_title": "Lost Highway",
                "overview": "A tormented jazz musician finds himself lost in an enigmatic story involving murder, surveillance, gangsters, doppelgängers, and an impossible transformation inside a prison cell.",
                "popularity": 4.8435,
                "poster_path": "/fdTtij6H0sX9AzIjUeynh5zbfm7.jpg",
                "release_date": "1997-01-15",
                "title": "Lost Highway",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 2779,
                "character": "Raquel",
                "credit_id": "52fe4262c3a36847f801a2fb",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Leslie Rae Bega"
        ],
        "biography": "Leslie Rae Bega (born April 17, 1967) is an American theater, film and television actress. Bega was born in Los Angeles to a Sephardi Jewish father and Russian Jewish mother. Her paternal grandparents came to the United States from Spain. In addition to English, Bega speaks Spanish and French fluently. After graduating as valedictorian from Lycée Français de Los Angeles, Bega attended the University of Southern California. Bega is known for her performances in Head of the Class as Maria Borges, David Lynch's Lost Highway, as a recurring cast member in CSI: Crime Scene Investigation, C-16: FBI and The Sopranos as Valentina La Paz. She is also featured as a dancer in the break dancing films Breakin and Breakin' 2: Electric Boogaloo. She played the role of Anna Lansky in 1991's Mobsters. She has appeared as a guest star in the television shows 21 Jump Street, Beverly Hills, 90210, The New Twilight Zone, and Highway To Heaven. Her theater work includes King Lear, at the Electric Theatre, The Merchant of Venice, Gypsy, Grease, The Sound of Music, and Maria in West Side Story at the Westchester Theatre.\n\n(Source: Wikipedia)",
        "birthday": "1967-04-17",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 9314,
        "imdb_id": "nm0066664",
        "known_for_department": "Acting",
        "name": "Leslie Bega",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.5302,
        "profile_path": "/jOqrwaZd2ATrDxixccB5anPELxo.jpg"
    }
}