{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vcUvothl49FIx2a8bt4IChW3k32.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 211954,
                "original_language": "es",
                "original_title": "No se aceptan devoluciones",
                "overview": "Valentin is Acapulco's resident playboy, until a former fling leaves a baby on his doorstep and him heading with her out of Mexico.",
                "popularity": 3.0784,
                "poster_path": "/4f0qaU7cWmO9kYEkr3QGdA7KNFR.jpg",
                "release_date": "2013-07-20",
                "title": "Instructions Not Included",
                "video": false,
                "vote_average": 7.752,
                "vote_count": 931,
                "character": "Judeisy",
                "credit_id": "52fe4da0c3a368484e1f3aa3",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/fi7gBF2nfIGWF9MuOhuEr6rkgBQ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 18183,
                "original_language": "es",
                "original_title": "Como agua para chocolate",
                "overview": "Tita is passionately in love with Pedro, but her controlling mother forbids her from marrying him. When Pedro marries her sister, Tita throws herself into her cooking and discovers she can transfer her emotions through the food she prepares, infecting all who eat it with her intense heartbreak.",
                "popularity": 2.3101,
                "poster_path": "/itwUdMqLmPfhtGJ44hiDxkqZhiq.jpg",
                "release_date": "1992-04-16",
                "title": "Like Water for Chocolate",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 532,
                "character": "Bisnieta",
                "credit_id": "5860402bc3a3681a720263ca",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Arcelia Ramírez Coria",
            "Arcelia Ramirez Coria",
            "Arcelia Ramirez"
        ],
        "biography": "Arcelia Ramírez (born 7 December 1967) is a Mexican actress who appeared in over 50 films and television shows since 1985. At a young age she became interested in acting. She studied acting at the Centro Universitario de Teatro (CUT), from where she was prepared for several plays produced by the same institution, including La pasión de Pentesilea, La séptima morada, La noche de Hernán Cortés, Las mujeres sabias, Freda y otras griegas and Relaciones peligrosas.  She lived in France from 2007 to 2011, a period in which she kept up her work pace, coming to Mexico to film movies as diverse as Arturo Ripstein's \"Las razones del corazón\" and Victor Avelar's \"Cómo no te voy a querer\". Meanwhile, her life in Paris was like that of a nameless woman who was beginning to raise a family.\n\nThroughout her career, which began in 1985 with the film \"El centro del laberinto\", she has been nominated for important awards, such as the Ariel, at the Cannes Festival, at the Havana Festival, at the Latin American Film Festival in Lérida, among others. She has been nominated four times for the Ariel Award, twice for Best Actress (1997, 2000) and twice for Best Supporting Actress (2001 and 2003).\n\nThe first actress attended the Cannes Film Festival 2021 for her performance in the film \"La civil\", first fiction of the Belgian-Romanian director Teodora Mihai. In the film she plays Cielo, a mother searching for her daughter kidnapped by organized crime in northern Mexico. After the screening on July 10 at the Debussy Hall, Ramirez received an eight-minute standing ovation from the audience. An unprecedented and almost unbelievable experience for Arcelia Ramírez, she explained, so much so that it marked her life and brought tears to her eyes.",
        "birthday": "1967-12-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 932160,
        "imdb_id": "nm0709204",
        "known_for_department": "Acting",
        "name": "Arcelia Ramírez",
        "place_of_birth": "Mexico City, Distrito Federal, Mexico",
        "popularity": 1.6468,
        "profile_path": "/5SA0Oj5t9qp4Ck18xj6pMKZXBsW.jpg"
    }
}