{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cWWM1TTGnOoglZKLpVERGtQ6HJ4.jpg",
                "genre_ids": [
                    10749,
                    35,
                    80
                ],
                "id": 256591,
                "original_language": "en",
                "original_title": "Focus",
                "overview": "Nicky, an accomplished con artist, gets romantically involved with his disciple Jess but later ends their relationship. Years later, she returns as a femme fatale to spoil his plans.",
                "popularity": 5.8306,
                "poster_path": "/lOzGWjceYTd0kd5HyX7Ch46O9kh.jpg",
                "release_date": "2015-02-25",
                "title": "Focus",
                "video": false,
                "vote_average": 6.874,
                "vote_count": 8042,
                "character": "Bald Guy",
                "credit_id": "5759ae11c3a3683e88003737",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/27ZkYMWynuK2qiDP6awc3MsCaOs.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 527641,
                "original_language": "en",
                "original_title": "Five Feet Apart",
                "overview": "Seventeen-year-old Stella spends most of her time in the hospital as a cystic fibrosis patient. Her life is full of routines, boundaries and self-control — all of which get put to the test when she meets Will, an impossibly charming teen who has the same illness. There's an instant flirtation, though restrictions dictate that they must maintain a safe distance between them. As their connection intensifies, so does the temptation to throw the rules out the window and embrace that attraction.",
                "popularity": 6.8548,
                "poster_path": "/kreTuJBkUjVWePRfhHZuYfhNE1T.jpg",
                "release_date": "2019-03-14",
                "title": "Five Feet Apart",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 5773,
                "character": "RRT Doctor",
                "credit_id": "5ded60eedc86470019c3aca0",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Armanda Ledue",
            "Armando L. Leduc"
        ],
        "biography": "Actor Armando Leduc is featured in the Jim Caviezel, Michael Chiklis true-life sports drama, When the Game Stands Tall. He can also be seen in the part of \"Diego,\" in the Will Smith comedy, Focus. Leduc also co-starred opposite Michael Dardant in the fraternity comedy, Last Spring Break, and has made his writing, directing and producing debut on Bourbon Whiz, a web series that will debut on the Dish Network. Leduc was born on January 15, 1980, in Nuremburg, Germany. He is part Puerto Rican, part Portuguese and grew up as an army brat. Leaving Germany at 15, he settled in Harlem, Georgia and was graduated from Harlem High. Leduc made his film debut in the movie Lords of the Street, where he played a Mexican drug lord. Since then he has fought to break his stereotype of gangbangers, drug dealers, and terrorists by birthing his production company, Sketchy Characters. Although he played sports and was a member of the band in high school, nothing clicked like acting. Auditioning for his first musical in high school, he won the part of Danny Zuko in Grease. After high school, his success with community theatre caught the attention of Augusta Model &amp; Talent. At the American Model and Talent Convention, he placed as a top ten finalist among roughly 200 other actors. As a result, he signed with The People Store, an Atlanta based talent agency. During this time, he continued expanding his theatrical experience with the Augusta Players back in Augusta, Georgia. His award for Best Supporting Actor in Annie solidified his decision to continue pursuing his career as a professional actor. In addition to his acting endeavors, Leduc has also focused his energy in other areas of the performing arts. In 2000, he began singing with the a cappella quartet, \"The Harmonics\" The group participated in national competitions and even won the award for \"Best New Quartet\" in Knoxville in 2002. He also began studying ballroom and Latin dancing in 1999 at a local studio in Augusta. As an instructor, he opened A&amp;E Dance Studio in 2003, which is still in business today. Over the years he has competed in ballroom competitions in Las Vegas, New Orleans, Puerto Rico, Gulfport and Orlando. His natural abilities and experiences singing and dancing have further heightened his performance onstage and on the screen. He currently sings in Datband in New Orleans, where he moved in 2005. Leduc's feature film credits include The Pool Boys, Green Lantern, Video Girl,Enemies Among Us, Angels Die Slowly, Girls Gone Gangsta, The Bad Lieutenant:Port of Call New Orleans, Mutants, College, New Orleans, Mon Amour, Death Toll, Jump Out Boys and Big Momma's House 2. His television series credits include The Riches, Prison Break, Clunkers, Common Law and Star-Crossed. His television movie credits include Girl, Positive, Dixie Melodie, The Librarian: The Curse of the Judas Chalice, Journey to Promethea and Flesh Wounds. - IMDb Mini Biography By: Armando Leduc",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 932104,
        "imdb_id": "nm1945289",
        "known_for_department": "Acting",
        "name": "Armando Leduc",
        "place_of_birth": null,
        "popularity": 0.0338,
        "profile_path": "/ebaRBXmbrMfFXLJzvazE5tVv3ZJ.jpg"
    }
}