{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6S4gjpkd359UuMLfrnUV1M695DF.jpg",
                "genre_ids": [
                    37,
                    18
                ],
                "id": 288,
                "original_language": "en",
                "original_title": "High Noon",
                "overview": "Will Kane, the sheriff of a small town in New Mexico, learns a notorious outlaw he put in jail has been freed, and will be arriving on the noon train. Knowing the outlaw and his gang are coming to kill him, Kane is determined to stand his ground, so he attempts to gather a posse from among the local townspeople.",
                "popularity": 4.4293,
                "poster_path": "/qETSMQ4IXBSAS409Z9OL0ppXWTW.jpg",
                "release_date": "1952-06-09",
                "title": "High Noon",
                "video": false,
                "vote_average": 7.666,
                "vote_count": 1502,
                "character": "Sam (uncredited)",
                "credit_id": "56fabf039251410d7d00068b",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/hSRb0YhB4TaeIKgZtQbFuY3l0XM.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 143,
                "original_language": "en",
                "original_title": "All Quiet on the Western Front",
                "overview": "When a group of idealistic young men join the German Army during the Great War, they are assigned to the Western Front, where their patriotism is destroyed by the harsh realities of combat.",
                "popularity": 4.1542,
                "poster_path": "/1wZUB08igw8iLUgF1r4T6aJD65b.jpg",
                "release_date": "1930-04-29",
                "title": "All Quiet on the Western Front",
                "video": false,
                "vote_average": 7.741,
                "vote_count": 862,
                "character": "1st Medic Orderly (uncredited)",
                "credit_id": "5dc0c07c95c0af00126f1349",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Len Clapham",
            "Leonard Clapham",
            "Leonard Clapman",
            "Leonard T. Clapman"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nTom London (August 24, 1889 – December 5, 1963) was an American veteran actor who played frequently in B-Westerns. According to The Guinness Book of Movie Records, London is credited with appearing in the most films in the history of Hollywood, this according to the 2001 book Film Facts, where it states that the performer who played in the most films was \"Tom London, who made his first of over 2000 appearances in The Great Train Robbery, 1903.\n\nBorn Leonard Clapham in Louisville, Kentucky, he got his start in movies as a props man in Chicago, Illinois. His debut was in 1915 in the Western Lone Larry, performing under his own name. In 1925, after having appeared in many silent films, he changed his name to Tom London, and used that name for the rest of his career. The first film in which he was billed under his new name was Winds of Chance, a World War I film, in which he played \"Sgt. Rock\". London was a trick rider and roper, and used his trick skills in scores of Westerns. In the silent film era he often played villainous roles, while in later years he often appeared as the sidekick to Western stars like Sunset Carson in several films.\n\nOne of the busiest character actors, he appeared in over 600 films. London made many guest appearances in television shows through the 1950s, such as The Range Rider, with Jock Mahoney and Dick Jones. He also played Sam, the attendant of Helen Ramirez (Katy Jurado) in High Noon. His last movie was Underworld U.S.A. in 1961, and his final roles on TV were in Lawman and The Dakotas.\n\nLondon died at his home in North Hollywood at age 81 and was interred in the Forest Lawn Memorial Park Cemetery in Glendale, California.",
        "birthday": "1889-08-23",
        "deathday": "1963-12-05",
        "gender": 2,
        "homepage": null,
        "id": 932309,
        "imdb_id": "nm0163417",
        "known_for_department": "Acting",
        "name": "Tom London",
        "place_of_birth": "Louisville, Kentucky, USA",
        "popularity": 0.8918,
        "profile_path": "/nfLW8J3AMasTu1Ahm0HftRgx9qy.jpg"
    }
}