{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/21YsCNMub5455NQCn3jh9SmRFyG.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 87827,
                "original_language": "en",
                "original_title": "Life of Pi",
                "overview": "The story of an Indian boy named Pi, a zookeeper's son who finds himself in the company of a hyena, zebra, orangutan, and a Bengal tiger after a shipwreck sets them adrift in the Pacific Ocean.",
                "popularity": 5.9366,
                "poster_path": "/iLgRu4hhSr6V1uManX6ukDriiSc.jpg",
                "release_date": "2012-11-20",
                "title": "Life of Pi",
                "video": false,
                "vote_average": 7.407,
                "vote_count": 13407,
                "character": "Pi Patel",
                "credit_id": "52fe49db9251416c910bb0c1",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "수라즈 샤르마",
            "蘇瑞吉·沙瑪"
        ],
        "biography": "Suraj Sharma is an Indian actor from New Delhi, who made his debut with the title role in the 2012 film Life of Pi.  Suraj Sharma was born in New Delhi, India. His parents are Malayalis, they hail from Kerala. Suraj is a student of philosophy at St Stephen's college in New Delhi. He has completed schooling from Sardar Patel Vidyalaya, where he was described as a popular student. Before the role, he had no acting experience, and auditioned only because he was there with his younger brother Shriharsh Sharma who requested he come along. He was one of the 3,000 actors to audition for the role of Piscine Molitor Patel (Pi). Sharma went through several rounds of auditions before winning the part. Director Ang Lee has stated that he selected Sharma primarily based on his expressive eyes and innocent appearance. According to him, Sharma had not only the emotion, but also the \"look\" of Pi. His \"medium complexion\" and \"average build\" were deemed perfect for the role.  Since filming Life of Pi, Sharma has returned to studying philosophy at St. Stephen's College, Delhi of Delhi University, and intends to continue working in filmmaking in some capacity.[6] The movie has received critical acclaim and positive reviews for Sharma's performance.  From Wikipedia, the free encyclopedia.",
        "birthday": "1993-03-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 933160,
        "imdb_id": "nm4139037",
        "known_for_department": "Acting",
        "name": "Suraj Sharma",
        "place_of_birth": "New Delhi, India",
        "popularity": 0.5315,
        "profile_path": "/uT1OLTyiDsAczXA2QtlFxWyWFTj.jpg"
    }
}