{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9OKzKuCfcMwpHVp56pjNI7J4xXR.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 923,
                "original_language": "en",
                "original_title": "Dawn of the Dead",
                "overview": "During an ever-growing epidemic of zombies that have risen from the dead, two Philadelphia SWAT team members, a traffic reporter, and his television-executive girlfriend seek refuge in a secluded shopping mall.",
                "popularity": 4.6088,
                "poster_path": "/70MY8H0bLMvXf8ED2SgVMPhDVVM.jpg",
                "release_date": "1978-09-02",
                "title": "Dawn of the Dead",
                "video": false,
                "vote_average": 7.495,
                "vote_count": 2184,
                "character": "Cowboy Hat Zombie Hit by Sledge",
                "credit_id": "601585641511aa003f528eb2",
                "order": 85
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/eOn6EtViFLxXAmPPjJR861Dx4PX.jpg",
                "genre_ids": [
                    35,
                    18,
                    53
                ],
                "id": 290,
                "original_language": "en",
                "original_title": "Barton Fink",
                "overview": "A renowned New York playwright is enticed to California to write for the movies and discovers the hellish truth of Hollywood.",
                "popularity": 3.9922,
                "poster_path": "/oDkp5iClJ9WKJGtKHz8BydodHC3.jpg",
                "release_date": "1991-08-01",
                "title": "Barton Fink",
                "video": false,
                "vote_average": 7.454,
                "vote_count": 1765,
                "credit_id": "52fe4233c3a36847f800b9af",
                "department": "Production",
                "job": "Executive Producer"
            },
            {
                "adult": false,
                "backdrop_path": "/cEsnLkTCJ4jh9Oym7nPAPGnOMm3.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 379,
                "original_language": "en",
                "original_title": "Miller's Crossing",
                "overview": "Set in 1929, a political boss and his advisor have a parting of the ways when they both fall for the same woman.",
                "popularity": 2.9485,
                "poster_path": "/ab3pnsTKp3BgcAFy0FgWBFBg9FL.jpg",
                "release_date": "1990-09-21",
                "title": "Miller's Crossing",
                "video": false,
                "vote_average": 7.458,
                "vote_count": 1740,
                "credit_id": "568008fcc3a368227b0034a8",
                "department": "Production",
                "job": "Executive Producer"
            },
            {
                "adult": false,
                "backdrop_path": "/rGPoNNk4fvgG2mvkNAxJJPlszOu.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 11368,
                "original_language": "en",
                "original_title": "Blood Simple",
                "overview": "The owner of a seedy small-town Texas bar discovers that one of his employees is having an affair with his wife. A chaotic chain of misunderstandings, lies and mischief ensues after he devises a plot to have them murdered.",
                "popularity": 5.0322,
                "poster_path": "/svU6pu4lfHn0T5BVZchVxL58HB5.jpg",
                "release_date": "1984-03-26",
                "title": "Blood Simple",
                "video": false,
                "vote_average": 7.243,
                "vote_count": 1515,
                "credit_id": "662e9d42c56d2d0129ccd96f",
                "department": "Crew",
                "job": "Presenter"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ben Barenholtz (October 5, 1935 – June 27, 2019) was a Polish-born American film producer, exhibitor, and distributor with a significant presence in the independent film scene since the late 1960s. In 1968 Barenholtz opened The Elgin Cinema in New York City which was known for its experimental midnight screenings of new filmmakers.\n\nBarenholtz was known for his eye in discovering new directors such as The Coen Brothers, David Lynch, John Sayles and Guy Maddin, and was the first to bring Cousin Cousine, and John Woo's The Killer to the American screens. He is often credited with launching and being a close collaborator of the Coen Brothers. He developed and produced a number of cult movies including Barton Fink, Miller's Crossing and Requiem for a Dream.\n\nBarenholtz appeared in the documentary The Hicks of Hollywood, had a bit role in Liquid Sky, and appeared as a zombie in Romero's classic Dawn of the Dead. He was the subject in Stuart Samuels' 2005 documentary Midnight Movies: From the Margin to the Mainstream.\n\nIn 2005 Barenholtz directed his first feature, Music Inn, a documentary about the famed jazz venue and was the producer of Jamie Greenberg's feature film Stags. In 2012, he produced Suzuya Bobo's first feature, Family Games.\n\nIn 2012 he directed and produced Wakaliwood: The Documentary, shot in the slums of Kampala, Uganda.\n\nIn 2016, he received the Berlinale Camera award from the Berlinale Film Festival to honor his contributions to the independent film scene.\n\nBarenholtz directed his first and only fiction film, Alina, starring Darya Ekamasova, which was released in the fall of 2017. At the time of his death he was developing the sequel to Alina as well as working on an autobiographical film, Aaron. He died on June 27, 2019, in Prague, Czech Republic, at the age of 83.\n\nDescription above from the Wikipedia article Ben Barenholtz, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1935-10-05",
        "deathday": "2019-06-26",
        "gender": 2,
        "homepage": null,
        "id": 933403,
        "imdb_id": "nm0054449",
        "known_for_department": "Production",
        "name": "Ben Barenholtz",
        "place_of_birth": "Kupiczów, Poland [now Kupychiv, Ukraine]",
        "popularity": 0.0552,
        "profile_path": "/mmKyU5H9ILc6nuXp8m8Ug9EqqIV.jpg"
    }
}