{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8r9RoGfwGmn1pn0G3sbvHHemSWF.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36
                ],
                "id": 277216,
                "original_language": "en",
                "original_title": "Straight Outta Compton",
                "overview": "In 1987, five young men, using brutally honest rhymes and hardcore beats, put their frustration and anger about life in the most dangerous place in America into the most powerful weapon they had: their music.  Taking us back to where it all began, Straight Outta Compton tells the true story of how these cultural rebels—armed only with their lyrics, swagger, bravado and raw talent—stood up to the authorities that meant to keep them down and formed the world’s most dangerous group, N.W.A.  And as they spoke the truth that no one had before and exposed life in the hood, their voice ignited a social revolution that is still reverberating today.",
                "popularity": 5.6597,
                "poster_path": "/1CiLJx8Xtv3TbbFj6k7BboSmKgC.jpg",
                "release_date": "2015-08-11",
                "title": "Straight Outta Compton",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 4041,
                "character": "Lench Mob / Bodyguard (uncredited)",
                "credit_id": "66920e3a88675bdb2b335b21",
                "order": 187
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in Cadiz, Ohio, Leland White comes from a generation of Railroad Workers and Coal Miners. Even though his family was doing well, as a young man growing up in Ohio, Leland had dreams and desires of being involved in the entertainment industry and becoming an actor. While on his acting journey, Leland received a degree in Radio and Broadcasting from the Radio TV and Broadcasting School in Huntington Beach, California.\n\nThroughout his acting career Leland has appeared in the following films: Janky Promoters starring Ice Cube and Mike Epps he appeared as KK, Alien Anthropologists starring as Big Hudson aka Crip Gangster, Movie Dead Cruelty appeared as Peter Bickens, Straight Outta Compton he played The Lench Mob Bodyguard, The Frankenstein Theory with Kris Lemche and Joe Egender, Tattoo Nightmares, Operation Repo, Will to Live, 1000 ways to Die, Wedding Guest in 500 Days of Summer staring Joseph Gordon-Levitt and Zooey Descanel. He has also appeared in True Horror Stories and Celebrity Crime Files.\n\nDuring his stage play career Leland has appeared as Head in the Donald B. Welch production My Brothers Keeper and Uncle Tony in Can God's Love Reach in the Dark directed by Spencer Collins.\n\nLeland completed his Training in Acting and Scene Study at Brian Reise Acting Studios, Respect for Acting with Josie Thacker and Scene Study with Michelle Adams and Kim Foster. Stunt Training in weapons and hand combat with Gary Robert.\n\nAssociate Producer Credits: Dead Cruelty Soundtrack Producer Credits: Song Mary Jane produced by Street Notes Records Stunt Credits: Dead Cruelty\n\nSelf Acting Credits: Death Row Chronicles - TV mini series 2018 documentary - appeared as bodyguard\n\nEven though Leland is a supportive father of six children and two grandchildren, he has managed to maintain an internet radio station titled O.T.R. On The Rise with the main focus on uplifting youth and supporting unsigned music artists. Leland is also the owner of Street Notes Records with the Universal Music Group distribution.\n\nLeland believes that Your Life Struggles can be Overcame and to always go after your Dreams and never give up. With the motto of doing good and getting better.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 93341,
        "imdb_id": "nm3091050",
        "known_for_department": "Acting",
        "name": "Leland White",
        "place_of_birth": null,
        "popularity": 0.0404,
        "profile_path": null
    }
}