{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g6QPI70Kzt91Q0lGyLfsVqZAwlJ.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 193756,
                "original_language": "en",
                "original_title": "Lone Survivor",
                "overview": "Four Navy SEALs on a covert mission to neutralize a high-level Taliban operative must make an impossible moral decision in the mountains of Afghanistan that leads them into an enemy ambush. As they confront unthinkable odds, the SEALs must find reserves of strength and resilience to fight to the finish.",
                "popularity": 6.8759,
                "poster_path": "/zaBIrloyhGK7iNTZMb3f9SARsl8.jpg",
                "release_date": "2013-12-24",
                "title": "Lone Survivor",
                "video": false,
                "vote_average": 7.434,
                "vote_count": 4524,
                "character": "Gulab's Young Son",
                "credit_id": "52fe4cd89251416c9110203f",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/jUaZAbdpNl33VHprUl4qEohXn8q.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 228194,
                "original_language": "en",
                "original_title": "The Hundred-Foot Journey",
                "overview": "A story centered around an Indian family who moves to France and opens a restaurant across the street from a Michelin-starred French restaurant.",
                "popularity": 2.9428,
                "poster_path": "/1vFhSr7INoulu18smHqicft05i8.jpg",
                "release_date": "2014-08-06",
                "title": "The Hundred-Foot Journey",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1478,
                "character": "Young Hassan",
                "credit_id": "538e1cd60e0a2632c6000121",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rohan Chand is an actor. At the age of 6, while playing little league baseball, he caught the eye of a prominent New York-based casting director that cast him in the role of Adam Sandler's adopted son in Jack and Jill (2011). Rohan embraced every aspect of his new career, and his enthusiasm for his work led him next to his memorable role of Issa in the critically acclaimed Showtime Series, Homeland (2011). With his keen interest in the process of movie-making, Rohan uses every opportunity to learn as much as possible about his film community as he continues to hone his acting skills in diverse and challenging roles. He has recently been seen in Peter Berg's Lone Survivor (2013) with Mark Wahlberg and can now be seen in his co-leading role in Jason Bateman's directorial debut, Bad Words (2014). Upcoming films include The Hundred Foot Journey (2014), directed by Lasse Hallström, and he is currently voicing a lead role in a DreamWorks Animated Feature (2016).\n\nIn his spare time Rohan enjoys spending time with his family and playing soccer and tennis.",
        "birthday": "2004-07-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 935701,
        "imdb_id": "nm4575116",
        "known_for_department": "Acting",
        "name": "Rohan Chand",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.2096,
        "profile_path": "/iRTuKSi45rdhM6lbM8XCyAo2OkI.jpg"
    }
}