{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zVJWPKbyv8ZPIbO6qcjE19dTgyn.jpg",
                "genre_ids": [
                    18
                ],
                "id": 25364,
                "original_language": "en",
                "original_title": "Ace in the Hole",
                "overview": "An arrogant reporter exploits a story about a man trapped in a cave to revitalize his career.",
                "popularity": 1.7994,
                "poster_path": "/gPVPzHEsJBX02HtBtIQgYnfeqNQ.jpg",
                "release_date": "1951-06-29",
                "title": "Ace in the Hole",
                "video": false,
                "vote_average": 7.866,
                "vote_count": 703,
                "character": "Leo Minosa",
                "credit_id": "52fe44c3c3a368484e0359b1",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Richard \"Pepe\" Benedict (born Riccardo Benedetto, January 8, 1920 – April 29, 1984) was an Italian-American television and film actor and director. He was born in Palermo, Italy.\n\nHe appeared in dozens of television programs and movies from the 1940s to the 1960s, most notably Ace in the Hole (1951), directed by Billy Wilder. Benedict appeared with Frank Sinatra and the Rat Pack in the 1960 movie Ocean's 11 as one of the 11 men who rob five Las Vegas casinos on the same night. He also played the commander of the Mars rescue ship in the 1958 B sci-fi movie It! The Terror from Beyond Space.\n\nBenedict's television appearances included Adventures of Superman, The Lone Ranger, Perry Mason, Zorro, Dragnet, Peter Gunn and Hawaii Five-O. His directing credits included Impasse, an adventure film starring Burt Reynolds. He died of a heart attack at Studio City, Los Angeles, on April 29, 1984, and was interred in Forest Lawn – Hollywood Hills Cemetery, in the Churchyard section. He was the father of three children, including actor Nick Benedict.",
        "birthday": "1920-01-08",
        "deathday": "1984-04-25",
        "gender": 2,
        "homepage": null,
        "id": 93623,
        "imdb_id": "nm0070807",
        "known_for_department": "Acting",
        "name": "Richard Benedict",
        "place_of_birth": "Palermo, Sicily, Italy",
        "popularity": 0.3282,
        "profile_path": "/gjU0raDFcxLrRD3HHPWE88jKvX6.jpg"
    }
}