{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sIJTdyF6JFbIz5mENPpeSlCKYyB.jpg",
                "genre_ids": [
                    14,
                    35,
                    10749
                ],
                "id": 59436,
                "original_language": "en",
                "original_title": "Midnight in Paris",
                "overview": "While on a trip to Paris with his fiancée's family, a nostalgic screenwriter finds himself mysteriously going back to the 1920s every day at midnight.",
                "popularity": 5.2502,
                "poster_path": "/4wBG5kbfagTQclETblPRRGihk0I.jpg",
                "release_date": "2011-05-11",
                "title": "Midnight in Paris",
                "video": false,
                "vote_average": 7.521,
                "vote_count": 7491,
                "character": "Museum Guide",
                "credit_id": "52fe4990c3a36847f81a0bfd",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carla Gilberta Bruni Tedeschi",
            "Carla Gilberta Bruni Sarkozy"
        ],
        "biography": "Carla Bruni-Sarkozy (born Carla Gilberta Bruni Tedeschi; 23 December 1967) is an Italian-French singer and fashion model. In 2008, she married Nicolas Sarkozy, then president of France.\n\nBruni was born in Italy and moved to France at the age of seven. She was a model from 1987 to 1997 before taking up a career in music. She wrote several songs for Julien Clerc that were featured on his 2000 album, Si j'étais elle. Bruni released her first album, Quelqu'un m'a dit, in 2003, which eventually spent 34 weeks in the top 10 of the French Albums Chart. Bruni won the Victoire Award for Female Artist of the Year at the 2004 Victoires de la Musique. The same year, Bruni released her second album, No Promises, then the following year, she released her third album, Comme si de rien n'était. In 2013, Bruni released her fourth album, Little French Songs. In 2017, Bruni released her fifth album, French Touch. She has sold 5 million albums during her career.\n\nIn 2009, she created the Carla Bruni-Sarkozy Foundation for philanthropic efforts.\n\nBruni was born in Turin, Italy. She is legally the daughter of Italian concert pianist Marisa Borini and industrialist and classical composer Alberto Bruni Tedeschi. In 2008, however, Bruni told Vanity Fair that her biological father is Maurizio Remmert, a classical guitarist who comes from a wealthy family. When Remmert met Marisa Borini at a concert in Turin, he was a 19-year-old classical guitarist, and their affair lasted six years. Her sister is actress and movie director Valeria Bruni Tedeschi. She had a brother, Virginio Bruni Tedeschi (1959 – 4 July 2006), who died from complications of HIV/AIDS. Her (legal) paternal grandparents and her maternal grandfather were Italian, while the last quarter of her ancestry is French. She is second cousin of Alessandra Martines.\n\nBruni is heiress to the fortune created by the Italian tire manufacturing company CEAT, founded in the 1920s by her legal grandfather, Virginio Bruni Tedeschi. The company was sold in the 1970s to Pirelli (the brand continues in its former subsidiary in India, founded in 1958). The family moved to France in 1975, purportedly to escape the threat of kidnapping by the Red Brigades, a Communist terrorist group active in Italy in the 1970s and 1980s. Bruni grew up in France from the age of seven, and attended the boarding school Château Mont-Choisi in Lausanne, Switzerland. She went to Paris to study art and architecture, but left school at 19 to become a model. By her biological father, Bruni has a half-sister, Consuelo Remmert. ...\n\nSource: Article \"Carla Bruni\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1967-12-23",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.carlabruni.com/",
        "id": 937039,
        "imdb_id": "nm0116257",
        "known_for_department": "Acting",
        "name": "Carla Bruni",
        "place_of_birth": "Turin, Piedmont, Italy",
        "popularity": 0.1857,
        "profile_path": "/tNnjIZ2LsETJxnfkCYOVXzfEZjK.jpg"
    }
}