{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aVefEnQsfNPUrgsuMszTDt165P0.jpg",
                "genre_ids": [
                    27,
                    10402,
                    9648
                ],
                "id": 92060,
                "original_language": "en",
                "original_title": "Michael Jackson's Thriller",
                "overview": "A night at the movies turns into a nightmare when Michael and his date are attacked by a horde of bloody-thirsty zombies. On top of the success of the Thriller album and Michael Jackson's electrifying performance at Motown 25, the short film/music video for \"Thriller\" established Jackson as an international superstar and global phenomenon. Thriller is credited for transforming music videos into a serious art form, breaking down racial barriers in popular entertainment, popularizing the making-of documentary format and creating a home video market. The success transformed Jackson into a dominant force in global pop culture. In 2009, it became the first music video inducted into the United States National Film Registry by the Library of Congress as \"culturally, historically or aesthetically significant\". \"Thriller\" was also Jackson's seventh and final U.S. Hot 100 Top 10 hit from the Thriller album. It was the first album in history to have seven U.S. Top 10s.",
                "popularity": 2.6936,
                "poster_path": "/dYHGoPMkZMVuBA4EydmDQMo1EEv.jpg",
                "release_date": "1983-11-14",
                "title": "Michael Jackson's Thriller",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 718,
                "character": "Zombie (uncredited)",
                "credit_id": "613ba354e27260002a95b2e6",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tony took the last name of Fields from his stepfather Max. Tony's  parents divorced when he was four. Although he was born in Stafford,  Kansas, he moved to Davis, California, where his career began in  gymnastics. He switched to dance training when he won scholarships to  the Pacific Conservatory of the Performing Arts (studying drama and  voice), and also at Roland Dupree Academy of Dance.\n\nHe began  touring with Debbie Reynolds in her nightclub act only 3 months after  starting at Dupree. When he came to Solid Gold, he had had only 2 years  of formal training.\n\nTony appeared in numerous music videos,  including Michael Jackson's \"Beat It\" and \"Thriller\" and was also  featured in the \"Making of Thriller\" special. He also appeared in Lionel  Richie's \"Running with the Night.\" As a Solid Gold dancer, he also  appeared on the Miss Teen USA pageant as an escort and entertainer, and  on the home exercise video \"The Solid Gold 5 Day Workout.\" Other early  TV appearances included \"Lil Abner,\" \"Bobby Vinton Rock and Rollers,\"  and \"The John Davidson Christmas Special.\"",
        "birthday": "1958-12-28",
        "deathday": "1995-02-27",
        "gender": 2,
        "homepage": null,
        "id": 93795,
        "imdb_id": "nm0276363",
        "known_for_department": "Acting",
        "name": "Tony Fields",
        "place_of_birth": "Stafford, Kansas, USA",
        "popularity": 0.1333,
        "profile_path": "/eqWmlb1RyEkBhFFgn9od9M2AaDd.jpg"
    }
}