{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4BOgSGwEEHZuDhiHUOsrXaJBqoc.jpg",
                "genre_ids": [
                    36,
                    18,
                    28
                ],
                "id": 617653,
                "original_language": "en",
                "original_title": "The Last Duel",
                "overview": "King Charles VI declares that Knight Jean de Carrouges settle his dispute with his squire, Jacques Le Gris, by challenging him to a duel.",
                "popularity": 5.1662,
                "poster_path": "/zjrJE0fpzPvX8saJXj8VNfcjBoU.jpg",
                "release_date": "2021-10-13",
                "title": "The Last Duel",
                "video": false,
                "vote_average": 7.422,
                "vote_count": 3608,
                "character": "King's Uncle",
                "credit_id": "62f106a8a1074b00920f9b7c",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/zpBl7qfBB1ir1BVNQtPlPwQ6IFd.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1165,
                "original_language": "en",
                "original_title": "The Queen",
                "overview": "The Queen is an intimate behind the scenes glimpse at the interaction between HM Elizabeth II and Prime Minister Tony Blair during their struggle, following the death of Diana, to reach a compromise between what was a private tragedy for the Royal family and the public's demand for an overt display of mourning.",
                "popularity": 2.9744,
                "poster_path": "/v08RH5Cx9EFAQMBWQuE5jHAgHYs.jpg",
                "release_date": "2006-09-15",
                "title": "The Queen",
                "video": false,
                "vote_average": 6.953,
                "vote_count": 1364,
                "character": "Blair's Aide",
                "credit_id": "5820ca3ec3a36821a1000779",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Julian Firth (born 8 January 1961) is an English actor, best known for his roles as troubled inmate Davis in the cinematic version of the film Scum and as Brother Jerome in the long-running television series Cadfael. Firth has enjoyed a consistent acting career in the theatre and has appeared in numerous television productions, including Jeeves and Wooster, The Bill, The Young Indiana Jones Chronicles and Margaret. He also appeared in the video of the 1982 hit single Pass the Dutchie by Musical Youth, in which he appears as a pompous prosecuting barrister. In 1984, he was cast alongside Rob Lowe in Oxford Blues as Lowe's Oriel College roommate and confidant, providing inside information. In 2011 he appeared in the television film The Suspicions of Mr Whicher for ITV. He also appeared in the drama The Queen in 2006, as Blair's aide. In 2017, Firth joined the cast of the HBO series Game of Thrones in Eastwatch, an episode of Season 7 as Archmaester Sandhu.\n\nFirth grew up in Bristol, attending Elmlea Primary School, Clifton College, and Bristol Grammar School.",
        "birthday": "1960-03-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 93848,
        "imdb_id": "nm0278747",
        "known_for_department": "Acting",
        "name": "Julian Firth",
        "place_of_birth": " Bristol, England United Kingdom",
        "popularity": 0.6056,
        "profile_path": "/3PrG3eOAXFRvzZm5jLHwYwCs8RT.jpg"
    }
}