{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vwcfvPzYO3Gz975yRXp6DYSSbzo.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14
                ],
                "id": 10693,
                "original_language": "en",
                "original_title": "Peter Pan",
                "overview": "Leaving the safety of their nursery behind, Wendy, Michael and John follow Peter Pan to a magical world where childhood lasts forever. But while in Neverland, the kids must face Captain Hook and foil his attempts to get rid of Peter for good.",
                "popularity": 7.4474,
                "poster_path": "/fJJOs1iyrhKfZceANxoPxPwNGF1.jpg",
                "release_date": "1953-02-05",
                "title": "Peter Pan",
                "video": false,
                "vote_average": 7.196,
                "vote_count": 5559,
                "character": "Mrs. Darling (voice)",
                "credit_id": "52fe43a49251416c7501857d",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/oa6yoeeZtjxdgzAcZtbCSW3GEE9.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 11462,
                "original_language": "en",
                "original_title": "Suspicion",
                "overview": "A sheltered young heiress elopes with a handsome playboy. Gradually, she discovers his dishonest nature.",
                "popularity": 2.2886,
                "poster_path": "/clWNlzlbyaEoIK63lcFjqBmXoQz.jpg",
                "release_date": "1941-11-14",
                "title": "Suspicion",
                "video": false,
                "vote_average": 7.134,
                "vote_count": 853,
                "character": "Ethel the Maid",
                "credit_id": "52fe44459251416c7502ec81",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/tyj0QztA0PkYo6XauifWjkx7UVi.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    12
                ],
                "id": 12092,
                "original_language": "en",
                "original_title": "Alice in Wonderland",
                "overview": "On a golden afternoon, wildly curious young Alice tumbles into the burrow and enters the merry, madcap world of Wonderland full of whimsical escapades.",
                "popularity": 7.9458,
                "poster_path": "/20cvfwfaFqNbe9Fc3VEHJuPRxmn.jpg",
                "release_date": "1951-07-28",
                "title": "Alice in Wonderland",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 6057,
                "character": "Alice's Sister (voice)",
                "credit_id": "53fd83650e0a262ddc00124a",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Heather Grace Angel"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nHeather Grace Angel (9 February 1909 – 13 December 1986) was an English actress, the younger of two sisters, born to parents Andrea and Mary Letticia.  She began her stage career at the Old Vic in 1926 and later appeared with touring companies. Her Broadway debut came in December 1937, in Love of Women, at the Golden Theatre. She also appeared in The Wookey (1941–42).\n\nAngel appeared in many British films. She made her first screen appearance in City of Song. She later had a leading role in Night in Montmartre, and followed this success with The Hound of the Baskervilles. She then decided to move to Hollywood, sailing on the Majestic to New York in December 1932 with her mother. Over the next few years, she played strong roles in such films as The Mystery of Edwin Drood, The Three Musketeers, The Informer, and The Last of the Mohicans.\n\nIn 1937, she made the first of five appearances as Phyllis Clavering in the popular Bulldog Drummond series. She was cast as Kitty Bennett in Pride and Prejudice and as maid, Ethel, in Suspicion. Angel was also the leading lady in the first screen version of Raymond Chandler's The High Window, released in 1942 as Time to Kill. She was one of the passengers of Alfred Hitchcock's Lifeboat. Her film appearances in the following years were few, but she returned to Hollywood to provide voices for the Walt Disney animated films Alice in Wonderland and Peter Pan. During 1964 and 1965, she played a continuing role in the television soap opera Peyton Place. After that role, she played Miss Faversham, a nanny and female friend of Sebastian Cabot's character of Giles French in the situation comedy Family Affair.\n\nAngel received a star, located at 6301 Hollywood Boulevard, on the Hollywood Walk of Fame for her contributions to the film industry. Angel died from cancer in Santa Barbara, California, and was buried in Santa Barbara Cemetery.\n\nDescription above from the Wikipedia article Heather Angel, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1909-02-09",
        "deathday": "1986-12-13",
        "gender": 1,
        "homepage": null,
        "id": 93897,
        "imdb_id": "nm0029456",
        "known_for_department": "Acting",
        "name": "Heather Angel",
        "place_of_birth": "Headington, Oxford, Oxfordshire, England, UK",
        "popularity": 0.2367,
        "profile_path": "/aL4rV0rDtnNjHocXITevohuj9e2.jpg"
    }
}