{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/37dC684Q6a4o83oAx8KEyNSuBV3.jpg",
                "genre_ids": [
                    53,
                    18
                ],
                "id": 390497,
                "original_language": "ko",
                "original_title": "터널",
                "overview": "A man is on his way home when the poorly constructed tunnel he is driving through collapses, leaving him trapped leaving himself for the unexpected whilst emergency services struggle to help.",
                "popularity": 3.4067,
                "poster_path": "/rLTYM8HeUo4YhgAlU888XEU8LMS.jpg",
                "release_date": "2016-08-10",
                "title": "Tunnel",
                "video": false,
                "vote_average": 7.301,
                "vote_count": 615,
                "character": "Mi-Na",
                "credit_id": "588f7348c3a36860af0090b1",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "남지현",
            "Ji-hyeon Nam",
            "Nam Ji-hyun",
            "Нам Джи-хён",
            "南志铉",
            "ナム・ジヒョン",
            "南志鉉"
        ],
        "biography": "Nam Ji-hyun (born September 17, 1995) is a South Korean actress who successfully transitioned from being one of the industry's premier child artists to an acclaimed lead, well-loved for her roles in Queen Seondeok, Shopping King Louis, Suspicious Partner, and 100 Days My Prince.\n\nNam began her career as a child actress, and is best known for her roles in East of Eden (2008), Queen Seondeok (2009), Will It Snow for Christmas? (2009), Angel Eyes (2014), and What Happens to My Family? (2014). She also appeared in the miniseries Girl Detective, Park Hae-sol, teen drama To the Beautiful You, and the films A Reason to Live and Hwayi: A Monster Boy.\n\nIn 2016, she headlined her first drama, MBC's romantic-comedy Shopaholic Louis with Seo In-guk, where she impressed viewers with her acting.\n\nIn 2017, she starred in SBS's legal drama Suspicious Partner alongside Ji Chang-wook. The show enjoyed modest viewership share, but it beat its competitor by topping the important 20-49-year-old demographic, as well as streaming, popularity, and brand reputation charts for consecutive weeks. In 2018, Nam starred alongside EXO's D.O in the historical romance drama 100 Days My Prince. The series was a commercial success, becoming the fifth highest-rated Korean drama in cable television history. In 2020, Nam starred in the fantasy mystery thriller 365: Repeat the Year as a perfectionist webtoon writer.",
        "birthday": "1995-09-17",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 939137,
        "imdb_id": "nm2305471",
        "known_for_department": "Acting",
        "name": "Nam Ji-hyun",
        "place_of_birth": "Incheon, South Korea",
        "popularity": 1.2388,
        "profile_path": "/RQhxoyupXpBYS4ePsjsfTxDYqW.jpg"
    }
}