{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 7.3665,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Police Radio Unit F-7 (voice) (uncredited)",
                "credit_id": "64db7319b77d4b113fc4ac13",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stacy S. Harris",
            "Stacey Harris"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nStacy Harris (July 26, 1918 – March 13, 1973) was a Canadian-born actor with hundreds of film and television appearances. His name is often found spelled Stacey Harris.\n\nHarris was an Army pilot whose leg was injured in a plane crash less than six months after he enlisted in 1937. That injury prevented him from re-enlisting when World War II began, but he served with the American Volunteer Group as an ambulance driver and with the French Foreign Legion as a dispatch rider. Before becoming an actor, he held a variety of jobs, including newspaper reporter, boxer, sailor, and artist.\n\nHarris played varied characters, often villains, on various programs produced by Jack Webb's Mark VII Limited, such as Dragnet, Noah's Ark, GE True, Adam-12, and Emergency!.\n\nHarris guest starred in the religion anthology series, Crossroads, and played a gangster in the 1956 time travel television episode of the anthology series Conflict entitled \"Man from 1997\" opposite James Garner and Charles Ruggles. Thereafter, he appeared as Whit Lassiter in the 1958 episode \"The Man Who Waited\" of the NBC children's western series, Buckskin. He guest starred as Colonel Nicholson in the 1959 episode \"A Night at Trapper's Landing\" of the NBC western series, Riverboat, starring Darren McGavin.\n\nHarris appeared too in three syndicated series, Whirlybirds, starring Kenneth Tobey, Sheriff of Cochise and U.S. Marshal, both with John Bromfield, and as the character Ed Miller in the episode \"Mystery of the Black Stallion\" of the western series, Frontier Doctor, starring Rex Allen. He was cast in two episodes of the David Janssen crime drama, Richard Diamond, Private Detective.\n\nHarris in 1958 portrayed Max Bowen in \"The Hemp Tree\" and in 1959 as Abel Crowder in \"Rough Track to Payday\", episodes of the CBS western series, The Texan, starring Rory Calhoun.\n\nIn 1960, Harris was cast as a drummer named Cramer in the episode \"Fair Game\" of the ABC western series, The Rebel, starring Nick Adams. Harris appeared in three episodes of CBS's Perry Mason, playing the role of murder victim Frank Curran in \"The Case of the Married Moonlighter\" (1958), Perry's client Frank Brooks in \"The Case of the Lost Last Act\" (1959), and murderer Frank Brigham in \"The Case of the Crying Comedian\" in 1961.\n\nIn 1969, Harris played the corrupt and cowardly Mayor Ackerson of the since ghost town of Helena, Texas, in the episode \"The Oldest Law\" of the syndicated television series, Death Valley Days, hosted by Robert Taylor not long before Taylor's own death. Popular character actor Jim Davis played Colonel William G. Butler (1831-1912), who takes revenge on the town after its citizens refuse to disclose the killer of Butler's son, Emmett, who died from a stray bullet from a saloon brawl. Butler arranges for the San Antonio and Aransas Pass Railway to bypass Helena; instead Karnes City, south of San Antonio, becomes the seat of government of Karnes County. Tom Lowell (born 1941) played Emmett Butler, and Tyler McVey was cast as Parson Blake in this episode.\n\nHarris died March 13, 1973, at the age of 54 in Los Angeles, California of an apparent heart attack. CLR",
        "birthday": "1918-07-26",
        "deathday": "1973-03-13",
        "gender": 2,
        "homepage": null,
        "id": 93974,
        "imdb_id": "nm0365345",
        "known_for_department": "Acting",
        "name": "Stacy Harris",
        "place_of_birth": "Big Timber, Quebec, Canada",
        "popularity": 0.0923,
        "profile_path": "/idRMOmGzdqnxEQlisSvM70rS8US.jpg"
    }
}