{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1GZVHgJUcVyytQRJ533GpMavAcL.jpg",
                "genre_ids": [
                    18
                ],
                "id": 7984,
                "original_language": "en",
                "original_title": "In the Name of the Father",
                "overview": "A small-time Belfast thief, Gerry Conlon, is wrongly convicted of an IRA bombing in London, along with his father and friends, and spends 15 years in prison fighting to prove his innocence.",
                "popularity": 2.6913,
                "poster_path": "/3NcIkKxaO2SmRVsG1v50XhtmL0f.jpg",
                "release_date": "1993-12-12",
                "title": "In the Name of the Father",
                "video": false,
                "vote_average": 7.896,
                "vote_count": 1845,
                "character": "Policewoman",
                "credit_id": "5608172bc3a3681211005bbc",
                "order": 50
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rachael Dowling made her screen debut playing Lily in John Huston's classic film adaptation of James Joyce's The Dead (1987). She went on to star in Tom Collin's Bogwoman opposite Peter Mullan and David Yates' (Harry Potter) The Tichborne Claimant. Other roles include P.J. Dillon's Rewind, Tears In The Rain opposite Sharon Stone, RTE drama The Treaty opposite Brendan Gleeson as Michael Collins , Double Act a Channel 4 series for children based on the novel by Jacqueline Wilson, Scarlett (the US TV sequel to Gone With The Wind) and Widow's Peak. She is well known to Irish television audiences as Sharon in Glenroe, a long running rural Irish drama serial.\n\nRachael was seen on stage recently (2012) in Edna O'Brien's own adaptation of The Country Girls which had a highly successful run at Dublin's Gaiety Theatre as well as on tour in Ireland.\n\nShe made her professional theatrical debut in Jim Sheridan's New York production of Brendan Behan's The Hostage (1985) and continued to work with Mr Sheridan on several of his theatre productions at The Irish Arts Centre in Manhattan. She also appeared in his films The Field and In The Name Of The Father.\n\nOther theatre work includes: A Midsummer Night's Dream, A Child's Christmas in Wales, Peg O' My Heart, She Stoops To Conquer (Great Lakes Shakespeare Festival, USA) The Hostage (Irish Arts Centre, New York and Druid Theatre Co. Galway), Forty Four Sycamore (Red Kettle Theatre Co.), Aristocrats (Mark Taper Forum LA), Torchlight And Laser Beams (Gaiety Theatre), A Slice Of Saturday Night (Andrews Lane Theatre), The Streets Of Dublin (Tivoli Theatre), Da (Olympia Theatre), Purple Dust (Abbey Theatre), Big Maggie (Abbey Theatre) School for Scandal (Gate Theatre), Pride And Prejudice (Gate Theatre) and Uncle Vanya (Mercury Theatre -London). In the mid 90's Rachael took a career break to study Film and Television Production at Hunter College in Manhattan. She then returned to Dublin City University (DCU) in Ireland and was awarded her MA in Film Studies gaining first class honours and first place in her class.\n\nShe lectured at The National College of Art and Design (NCAD) in Film History.\n\nShe has written and directed an award winning short film Stealth which was screened at several international film festivals. She has also directed for the theatre including Missing Football an award winning first play by Irish writer Peter McKenna.\n\nRachael continually works with Irish screenwriters and directors as a script editor and creative consultant.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 939841,
        "imdb_id": "nm0235868",
        "known_for_department": "Acting",
        "name": "Rachael Dowling",
        "place_of_birth": null,
        "popularity": 0.0755,
        "profile_path": null
    }
}