{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jhk6D8pim3yaByu1801kMoxXFaX.jpg",
                "genre_ids": [
                    28,
                    18,
                    12
                ],
                "id": 98,
                "original_language": "en",
                "original_title": "Gladiator",
                "overview": "After the death of Emperor Marcus Aurelius, his devious son takes power and demotes Maximus, one of Rome's most capable generals who Marcus preferred. Eventually, Maximus is forced to become a gladiator and battle to the death against other men for the amusement of paying audiences.",
                "popularity": 13.7275,
                "poster_path": "/ty8TGRuvJLPUmAR1H1nRIsgwvim.jpg",
                "release_date": "2000-05-04",
                "title": "Gladiator",
                "video": false,
                "vote_average": 8.22,
                "vote_count": 20050,
                "character": "Gaius",
                "credit_id": "52fe4217c3a36847f8003455",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/egyi9TQjLhNEQuEsK1dXovdHOHL.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 509,
                "original_language": "en",
                "original_title": "Notting Hill",
                "overview": "London bookstore owner William Thacker's quiet life turns upside down when a chance encounter with famous actress Anna Scott sparks an unlikely romance challenged by their vastly different worlds.",
                "popularity": 9.0224,
                "poster_path": "/hHRIf2XHeQMbyRb3HUx19SF5Ujw.jpg",
                "release_date": "1999-05-21",
                "title": "Notting Hill",
                "video": false,
                "vote_average": 7.265,
                "vote_count": 6422,
                "character": "PR Chief",
                "credit_id": "52fe424cc3a36847f801346d",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/y51M7Ca95sCXTCDvJaRP1uzxKbg.jpg",
                "genre_ids": [
                    10752,
                    28,
                    36
                ],
                "id": 652,
                "original_language": "en",
                "original_title": "Troy",
                "overview": "In year 1250 B.C. during the late Bronze age, two emerging nations begin to clash. Paris, the Trojan prince, convinces Helen, Queen of Sparta, to leave her husband Menelaus, and sail with him back to Troy. After Menelaus finds out that his wife was taken by the Trojans, he asks his brother Agamemnon to help him get her back. Agamemnon sees this as an opportunity for power. They set off with 1,000 ships holding 50,000 Greeks to Troy.",
                "popularity": 17.2139,
                "poster_path": "/a07wLy4ONfpsjnBqMwhlWTJTcm.jpg",
                "release_date": "2004-05-13",
                "title": "Troy",
                "video": false,
                "vote_average": 7.165,
                "vote_count": 10604,
                "character": "Nestor",
                "credit_id": "52fe4265c3a36847f801b0b7",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/qY6jnp4cNUYMz6FBG7ATtVmWttM.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 12783,
                "original_language": "en",
                "original_title": "The Duchess",
                "overview": "A chronicle of the life of 18th century aristocrat Georgiana, Duchess of Devonshire, who was reviled for her extravagant political and personal life.",
                "popularity": 3.6895,
                "poster_path": "/77ckyYrWmR12kl3qToqmDySnuwv.jpg",
                "release_date": "2008-09-05",
                "title": "The Duchess",
                "video": false,
                "vote_average": 6.995,
                "vote_count": 1726,
                "character": "General Grey",
                "credit_id": "5a2762bb0e0a264ccd0fcb0e",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Morley Shrapnel"
        ],
        "biography": "Shrapnel was born in Birmingham, Warwickshire, the son of Mary Lillian Myfanwy (née Edwards) and journalist/author Norman Shrapnel.[1] As a stage actor, he was a member of Laurence Olivier's Royal National Theatre company and the Royal Shakespeare Company and most recently appeared as Sir Oliver Surface in The School for Scandal (directed by Deborah Warner) at the Barbican Centre in 2011.  He has also appeared extensively in film and on television in roles in Elizabeth R, Z-Cars, Edward and Mrs. Simpson, 101 Dalmatians, Space: 1999, Inspector Morse, Coogan's Run, Notting Hill and Foyle's War. He presented an episode of the 1983 BBC television travel series Great Little Railways. He gave performances in three entries in the BBC Television Shakespeare plays and as Creon in the BBC's 1984 productions of the Three Theban plays of Sophocles.  In America, he has starred in supporting roles as Senator Gaius in Gladiator, Nestor in Troy and Pompey in the second episode of Ancient Rome: The Rise and Fall of an Empire. He also played the Jail Warden in the 10th Kingdom, an epic fantasy miniseries.  He has the rare achievement of appearing in two episodes of Midsomer Murders as two different characters, in Death in Chorus and Written in Blood. Shrapnel appeared in an episode of Jonathan Creek as Professor Lance Graumann in the episode The Omega Man. He appears in Chemical Wedding alongside Simon Callow, telling the tale of the resurrection of occultist Aleister Crowley.  Shrapnel also has experience in the field of BBC radio drama through such characters as Colin Dexter's Inspector Morse and William Gibson's Neuromancer.  He is the son-in-law of Deborah Kerr through his 1975 marriage to her younger daughter Francesca Ann Bartley. They have three sons, the actors Lex Shrapnel (b.1979), Tom Shrapnel (b.1981) and the writer Joe Shrapnel (b.1976). They live in Highbury, north London.",
        "birthday": "1942-04-27",
        "deathday": "2020-02-14",
        "gender": 2,
        "homepage": null,
        "id": 940,
        "imdb_id": "nm0795344",
        "known_for_department": "Acting",
        "name": "John Shrapnel",
        "place_of_birth": "Birmingham, England, UK",
        "popularity": 0.4529,
        "profile_path": "/A4Wmltbkz3sz79GcBkLeTqwfkvE.jpg"
    }
}