{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.66,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Jethro",
                "credit_id": "52fe4466c3a36847f8093b4b",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eduard Franz Schmidt",
            "ادوارد فرانتس"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nEduard Franz (born Eduard Franz Schmidt; October 31, 1902 – February 10, 1987) was an American actor of theatre, film and television. Franz portrayed King Ahab in the 1953 biblical low-budget film Sins of Jezebel, Jethro in Cecil B. DeMille's The Ten Commandments (1956), and Jehoam in Henry Koster's The Story of Ruth (1960).  By 1936, Franz was a player on the national stage, performing from coast to coast. He became a leading Broadway actor for nearly 30 years, in such plays as First Stop to Heaven and Embezzled Heaven and Conversation At Midnight. He made his film debut in a bit part, in 1947, in Killer at Large, but followed that brief appearance the next year with a memorable role in the motion picture The Scar (also titled Hollow Triumph). His fourth movie saw him acting with John Wayne in Wake of the Red Witch, in 1948. He portrayed Chief Broken Hand in White Feather. He played such intellectuals as Dr. Stern in The Thing from Another World (1951), a university professor in The Four Skulls of Jonathan Drake (1959), and Justice Louis Brandeis in The Magnificent Yankee (1950), a role he reprised in the 1965 television adaptation. He appeared in a 1957 television adaptation of A. J. Cronin's novel Beyond This Place, which was directed by Sidney Lumet.\n\nFranz performed as well in two separate remakes of Al Jolson's 1927 cinema classic The Jazz Singer, each time playing the key role of the aged and ailing synagogue cantor upset by his son's decision to pursue a secular show-business career rather than continue the family tradition and follow in his father's religious footsteps. Those remakes were the 1952 film version of the story starring Danny Thomas and the 1959 television version starring Jerry Lewis.\n\nFranz performed in a number of television series, including Gunsmoke; Have Gun - Will Travel; The Law and Mr. Jones; The Barbara Stanwyck Show and Cimarron City.  Franz was cast as psychiatric clinic director Dr. Edward Raymer in 30 episodes of the weekly ABC medical drama Breaking Point",
        "birthday": "1902-10-31",
        "deathday": "1983-02-10",
        "gender": 2,
        "homepage": null,
        "id": 94070,
        "imdb_id": "nm0291829",
        "known_for_department": "Acting",
        "name": "Eduard Franz",
        "place_of_birth": "Milwaukee, Wisconsin, USA",
        "popularity": 0.2978,
        "profile_path": "/nWe0UzZ00UlPbIlxSYeQIteRCp5.jpg"
    }
}