{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jhk6D8pim3yaByu1801kMoxXFaX.jpg",
                "genre_ids": [
                    28,
                    18,
                    12
                ],
                "id": 98,
                "original_language": "en",
                "original_title": "Gladiator",
                "overview": "After the death of Emperor Marcus Aurelius, his devious son takes power and demotes Maximus, one of Rome's most capable generals who Marcus preferred. Eventually, Maximus is forced to become a gladiator and battle to the death against other men for the amusement of paying audiences.",
                "popularity": 13.7275,
                "poster_path": "/ty8TGRuvJLPUmAR1H1nRIsgwvim.jpg",
                "release_date": "2000-05-04",
                "title": "Gladiator",
                "video": false,
                "vote_average": 8.22,
                "vote_count": 20050,
                "character": "Quintus",
                "credit_id": "52fe4217c3a36847f8003459",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/xTl1KkHSnMIYnYMukoAQUOewcrY.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 2502,
                "original_language": "en",
                "original_title": "The Bourne Supremacy",
                "overview": "A CIA operation to purchase classified Russian documents is blown by a rival agent, who then shows up in the sleepy seaside village where Bourne and Marie have been living. The pair run for their lives and Bourne, who promised retaliation should anyone from his former life attempt contact, is forced to once again take up his life as a trained assassin to survive.",
                "popularity": 9.6145,
                "poster_path": "/g09UIYfShY8uWGMGP3HkvWp8L8n.jpg",
                "release_date": "2004-07-23",
                "title": "The Bourne Supremacy",
                "video": false,
                "vote_average": 7.325,
                "vote_count": 7794,
                "character": "Martin Marshall",
                "credit_id": "52fe435bc3a36847f804e177",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/rBqdcQeM1h05YjF9rFtPWnNaDO2.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11051,
                "original_language": "en",
                "original_title": "The Last Temptation of Christ",
                "overview": "Jesus, a humble Judean carpenter beginning to see that he is the son of God, is drawn into revolutionary action against the Roman occupiers by Judas -- despite his protestations that love, not violence, is the path to salvation. The burden of being the savior of mankind torments Jesus throughout his life, leading him to doubt.",
                "popularity": 3.0063,
                "poster_path": "/7L4qwrC1mipZXJfU5oRgQWChLv1.jpg",
                "release_date": "1988-05-28",
                "title": "The Last Temptation of Christ",
                "video": false,
                "vote_average": 7.228,
                "vote_count": 1125,
                "character": "Lazarus / Crowd Member",
                "credit_id": "6432bd6f924ce60113970741",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/vQGo5VjJcHxpzIa8lMBFzpAth1w.jpg",
                "genre_ids": [
                    53,
                    9648,
                    878
                ],
                "id": 51876,
                "original_language": "en",
                "original_title": "Limitless",
                "overview": "The life of an unsuccessful writer is transformed by a top-secret 'smart drug' that allows him to use 100% of his brain and become a perfect version of himself. His enhanced abilities soon attract shadowy forces that threaten his new life.",
                "popularity": 6.1257,
                "poster_path": "/un0a2U7KLjMH77N6EhqYh7ZOlVx.jpg",
                "release_date": "2011-03-17",
                "title": "Limitless",
                "video": false,
                "vote_average": 7.193,
                "vote_count": 11013,
                "character": "Man in Tan Coat",
                "credit_id": "5304cdbc92514104cc1b6142",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/xwVkihNJYn6wR8Sip1aoIz5ax35.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 1669,
                "original_language": "en",
                "original_title": "The Hunt for Red October",
                "overview": "A new technologically-superior Soviet nuclear sub, the Red October, is heading for the U.S. coast under the command of Captain Marko Ramius. The American government thinks Ramius is planning to attack. Lone CIA analyst Jack Ryan has a different idea: he thinks Ramius is planning to defect, but he has only a few hours to find him and prove it - because the entire Russian naval and air commands are trying to find Ramius, too. The hunt is on!",
                "popularity": 6.0144,
                "poster_path": "/yVl7zidse4KiWtGMqHFtZCx4X3N.jpg",
                "release_date": "1990-03-02",
                "title": "The Hunt for Red October",
                "video": false,
                "vote_average": 7.376,
                "vote_count": 3443,
                "character": "Igor Loginov (Cook, Red October)",
                "credit_id": "5406fc1c0e0a261889000f0d",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/uLtVbjvS1O7gXL8lUOwsFOH4man.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 118340,
                "original_language": "en",
                "original_title": "Guardians of the Galaxy",
                "overview": "Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.",
                "popularity": 8.0535,
                "poster_path": "/r7vmZjiyZw9rpJMQJdXpjgiCOk9.jpg",
                "release_date": "2014-07-30",
                "title": "Guardians of the Galaxy",
                "video": false,
                "vote_average": 7.905,
                "vote_count": 28874,
                "character": "Kree Ambassador",
                "credit_id": "54a02e01c3a3682f2300aeb9",
                "order": 31
            },
            {
                "adult": false,
                "backdrop_path": "/6Z1fVDm7b05I1650DJRqAq8dIaI.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53,
                    18
                ],
                "id": 2118,
                "original_language": "en",
                "original_title": "L.A. Confidential",
                "overview": "Three detectives in the corrupt and brutal L.A. police force of the 1950s use differing methods to uncover a conspiracy behind the shotgun slayings of the patrons at an all-night diner.",
                "popularity": 7.8961,
                "poster_path": "/2PH1pqXMcYBDjodkjiMwMiPi2bH.jpg",
                "release_date": "1997-09-19",
                "title": "L.A. Confidential",
                "video": false,
                "vote_average": 7.802,
                "vote_count": 5224,
                "character": "Breuning - Dudley's Guy",
                "credit_id": "560eaa66c3a368681700c8b2",
                "order": 34
            },
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 18.3339,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 23537,
                "character": "Wayne's Lawyer",
                "credit_id": "5622804dc3a3680e1d00c2ec",
                "order": 77
            },
            {
                "adult": false,
                "backdrop_path": "/djPXXv9pPyTLGl9kMPCTyiBmIA5.jpg",
                "genre_ids": [
                    37,
                    28
                ],
                "id": 11969,
                "original_language": "en",
                "original_title": "Tombstone",
                "overview": "Legendary marshal Wyatt Earp, now a weary gunfighter, joins his brothers Morgan and Virgil to pursue their collective fortune in the thriving mining town of Tombstone. But Earp is forced to don a badge again and get help from his notorious pal Doc Holliday when a gang of renegade brigands and rustlers begins terrorizing the town.",
                "popularity": 6.9673,
                "poster_path": "/wGFCvylul8iEQhJOKfwZGGvXMzA.jpg",
                "release_date": "1993-12-25",
                "title": "Tombstone",
                "video": false,
                "vote_average": 7.589,
                "vote_count": 2284,
                "character": "Frank Stillwell",
                "credit_id": "56888fcac3a36860e90252e9",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/obyCUbpZvMTizOqYWHqkTFgfvnf.jpg",
                "genre_ids": [
                    10752,
                    10749,
                    36,
                    28
                ],
                "id": 676,
                "original_language": "en",
                "original_title": "Pearl Harbor",
                "overview": "The lifelong friendship between Rafe McCawley and Danny Walker is put to the ultimate test when the two ace fighter pilots become entangled in a love triangle with beautiful Naval nurse Evelyn Johnson. But the rivalry between the friends-turned-foes is immediately put on hold when they find themselves at the center of Japan's devastating attack on Pearl Harbor on Dec. 7, 1941.",
                "popularity": 9.0424,
                "poster_path": "/y8A0Cvp8WQmZ3bjbnsL53lY0dsC.jpg",
                "release_date": "2001-05-21",
                "title": "Pearl Harbor",
                "video": false,
                "vote_average": 6.942,
                "vote_count": 6742,
                "character": "Vice Admiral Frank J. Fletcher",
                "credit_id": "5826f3379251417b29018681",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Thomas Clifford Arana ",
            "Thomas Arana"
        ],
        "biography": "He co-starred as Quintus in Ridley Scott's Gladiator (2000), the Dreamworks-Universal movie and winner of five Oscars, including Best Picture, co-starring Russell Crowe, Joaquin Phoenix, Connie Nielsen, Richard Harris, Derek Jacobi, and Oliver Reed. Three of Tomas Arana's more recent films are: La volpe a tre zampe (2005), directed by Sandro Dionisio, a Teatri Uniti (Angelo Curti)/Cattelya Production that co-stars Miranda Otto, Angela Luce, and Nadja Uhl; Outpatient (2002), directed by Alec Carlin, with Justin Kirk and Catherine Kellner and the Jean-Claude Van Damme action film, Derailed (2002), directed by Bob Misiorowski. He was in Chimera (2001), directed by Pappi Corsicato, with Iaia Forte and Tommaso Ragno. He has appeared in more than 40 films, ranging from large budget Hollywood Studio pictures to Independent films in both the U.S. and Europe. His studio pictures include L.A. Confidential (1997) (as Bruening, a rogue cop), The Bodyguard (1992) (as Portman, Kevin Costner's antagonist and Whitney Houston's assassin), The Hunt for Red October (1990) (as Loginov, the Russian Saboteur), Tombstone (1993), and First Kid (1996).\n\nHe played Lazarus in Martin Scorsese's controversial The Last Temptation of Christ (1988). He was also featured in the Sundance-developed Wildflowers (1999), an independent film by Melissa Painter starring Clea DuVall and Daryl Hannah. Arana has played leading and supporting roles in over 30 European productions including films by directors such as Lina Wertmüller, Liliana Cavani, Carlo Verdone, Michele Soavi and with one of Japan's most successful directors: Koreyoshi Kurahara in the Toho production See You (1988). In theatre, Arana was the producer as well as a leading actor in the internationally acclaimed Theatre Company Falso Movimento, based in Naples, Italy. Under Arana and the artistic director Mario Martone (now a major Italian Film Director), Falso Movimento won many awards including Best Play of the Year, Best Set Design and the prestigious Mondello Prize. The company toured worldwide for more than nine years at major International Festivals including London, Frankfurt, New York, Los Angeles, Madrid, Barcelona, Copenhagen, Stockholm, Jerusalem, and others. Tomas Arana grew up in San Francisco and studied classical theatre at its prestigious American Conservatory Theatre, afterwards relocating to New York and acting in off-Broadway productions. He then hitchhiked throughout Europe and ended up living in Naples, Italy, where he worked in the Lucio Amelio Art Gallery, working with such artists as Warhol, Rauschenberg, Beuys, Richter, Longobardi, Clemente, Gilbert & George, etc. Andy Warhol painted his portrait, which is now part of his extensive art collection. He has both U.S. and Italian citizenship. He is married and has two sons.\n\nIMDb Mini Biography By: anonymous",
        "birthday": "1955-04-03",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.tomasarana.com/",
        "id": 941,
        "imdb_id": "nm0032962",
        "known_for_department": "Acting",
        "name": "Tomas Arana",
        "place_of_birth": "Auburn, California, USA",
        "popularity": 1.3321,
        "profile_path": "/qMuQWxUQ2sXDiN2d9EDVT5VXHo2.jpg"
    }
}