{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rW2xRFlJRbTnBJlQTSjQmjevIwb.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 857,
                "original_language": "en",
                "original_title": "Saving Private Ryan",
                "overview": "As U.S. troops storm the beaches of Normandy, three brothers lie dead on the battlefield, with a fourth trapped behind enemy lines. Ranger captain John Miller and seven men are tasked with penetrating German-held territory and bringing the boy home.",
                "popularity": 13.2784,
                "poster_path": "/uqx37cS8cpHg8U35f9U5IBlrCV3.jpg",
                "release_date": "1998-07-24",
                "title": "Saving Private Ryan",
                "video": false,
                "vote_average": 8.22,
                "vote_count": 16515,
                "character": "Goldman",
                "credit_id": "59f512e5c3a3681ff101c948",
                "order": 54
            },
            {
                "adult": false,
                "backdrop_path": "/D3eDUNEzJPBDG3TCJcR7RyRgTA.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 96721,
                "original_language": "en",
                "original_title": "Rush",
                "overview": "In the 1970s, a rivalry propels race car drivers Niki Lauda and James Hunt to fame and glory — until a horrible accident threatens to end it all.",
                "popularity": 9.7222,
                "poster_path": "/cyfncP1YKDNcGb0agE7RQr6UOYr.jpg",
                "release_date": "2013-09-02",
                "title": "Rush",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 7473,
                "character": "Giovanni",
                "credit_id": "5cbf91e90e0a266b96fba27e",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Raffaello Degruttola is a BIFA-nominated Anglo-Italian Actor-Writer-Director and founding director of Contro Vento Films. Born in London to Italian parents from Ariano Irpino, Raff was raised in North London and Queens, New York. He won a place at the Sylvia Young Theatre School as a teenager and continued his acting training at the Lee Strasberg Theatre Institute.  Raff quickly carved a niche as a versatile character actor in American films shot in Europe, working with notable directors Ron Howard ('Rush'), Micheal Apted ('Unlocked'), Richard Attenborough ('In Love And War') and Mike Nichols ('Wit'). In 2019 he appeared in a memorable cameo with Rebel Wilson in Chris Addison's 'The Hustle'. His latest roles include playing Dr. Kagan opposite Dave Batista in action-comedy 'The Killer's Game' and playing lead antagonist Ricardo in road trip comedy 'The Monk, The Mermaid and Molise' opposite Sally Phillips and Pink Floyd's Guy Pratt. TV roles include playing Jamie's agent in 'Ted Lasso'.\n\nIn 2010 Raff wrote and directed 'The Other Side of My Sleep', a 30 min short inspired by the deaths of his father and grandmother. The film opened the Boston Film Festival. He went on to direct and star in his first feature 'Flim the Movie', a biting satire of the indie film world shot in an edgy mockumentary style. 'Flim' was nominated for Best British Debut at the Moet British Independent Film Awards following its selection for Raindance.\n\nDrawn to playing complex characters with a manic edge, Raff went on to write and direct his first dramatic feature, 'Transference: A Love Story', a bipolar love story about control. The film received a special mention from the judges at SRFF 2020 and global attention for going viral on YouTube. It has now been viewed over 27M times. His latest feature, another obsessive toxic love story, 'To Love A Narcissist', starring Lyndsey Marshal alongside him, was completed in 2025.",
        "birthday": "1972-08-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.e-talenta.eu/members/profile/raffaello-degruttola",
        "id": 94137,
        "imdb_id": "nm0214860",
        "known_for_department": "Acting",
        "name": "Raffaello Degruttola",
        "place_of_birth": "Barnet, London, England",
        "popularity": 0.8349,
        "profile_path": "/21biohMlTyRfPw4ni6WExC2tFrh.jpg"
    }
}