{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Cade Calvert (uncredited)",
                "credit_id": "555ab7489251411e5b00cf8f",
                "order": 101
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dave Newell"
        ],
        "biography": "David Newell was originally an actor, who became a makeup artist after being involved in a car crash that left him with some facial disfigurement.\n\nDavid Newell was primarily known as an American character actor, whose acting career spanned from the very beginning of the sound film era through the middle of the 1950s. He made his film debut in a featured role in The Hole in the Wall, a 1929 film starring Edward G. Robinson and Claudette Colbert. Early in his career he had many featured roles, in such films as: RKO's The Runaway Bride in 1929, starring Mary Astor; 1931's Ten Cents a Dance, starring Barbara Stanwyck and directed by Lionel Barrymore; and White Heat in 1934.\n\nIn the late 1940s he also began working as a make-up artist, which he transitioned full-time to in 1955; this was due to injuries sustained during a car accident, which left him physically disfigured. He retired from the film industry in 1961, although he continued to work in television through the beginning of the 1970s, his last position being the make-up artist on the television show, Lassie.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1905-01-23",
        "deathday": "1980-01-25",
        "gender": 2,
        "homepage": null,
        "id": 942165,
        "imdb_id": "nm0627789",
        "known_for_department": "Acting",
        "name": "David Newell",
        "place_of_birth": "Carthage, Missouri, USA",
        "popularity": 0.0632,
        "profile_path": "/iWw1K3M9e8ktpxVmo17UHeDMCyL.jpg"
    }
}