{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rBL73dGfdEqTr7Xj0HytF9s9SbM.jpg",
                "genre_ids": [
                    35,
                    12
                ],
                "id": 11153,
                "original_language": "en",
                "original_title": "National Lampoon's Vacation",
                "overview": "Clark Griswold is on a quest to take his family to the Walley World theme park for a vacation, but things don't go exactly as planned.",
                "popularity": 4.0035,
                "poster_path": "/q3DvoqY06yZnRp9faH6uge7n7VP.jpg",
                "release_date": "1983-07-29",
                "title": "National Lampoon's Vacation",
                "video": false,
                "vote_average": 7.104,
                "vote_count": 1638,
                "character": "Girl In The Red Ferrari",
                "credit_id": "52fe44039251416c75025f4b",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christie Lee Brinkley (née Hudson; born February 2, 1954) is an American model, actress, illustrator, television personality, author, photographer, writer, designer, and activist.\n\nBrinkley was born Christie Lee Hudson in Monroe, Michigan, on February 2, 1954, the daughter of Marjorie (née Bowling) and Herbert Hudson.\n\nHer family moved to Canoga Park, Los Angeles, California, where her mother Marjorie later met and married television writer Donald Brinkley in Bel Air, Los Angeles. Donald adopted Christie and her brother Greg Brinkley. During this time, the family lived in Malibu and then the Brentwood neighborhoods of Los Angeles. Brinkley was educated at Paul Revere Junior High School and attended Le Lycée Français de Los Angeles from 9th to 12th grade.\n\nAfter graduation in 1972, she moved to Paris to study art.\n\nBrinkley became a successful model, appearing on an unprecedented three consecutive covers of Sports Illustrated Swimsuit Issues in 1979, 1980, and 1981. She spent 25 years as the face of CoverGirl, appeared on over 500 magazine covers, and signed contracts with major fashion and non-fashion brands.\n\nBeyond modeling, she expanded into acting, illustration, writing, and activism for human and animal rights and the environment.\n\nBrinkley has been married four times, including to musician Billy Joel between 1985 and 1994; she appeared in several of his music videos. Her fourth marriage, to architect Peter Cook, ended in a highly publicized 2008 divorce.\n\nMagazines such as Allure and Men's Health have named Brinkley one of the most attractive women of all time.",
        "birthday": "1954-02-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 942808,
        "imdb_id": "nm0001973",
        "known_for_department": "Acting",
        "name": "Christie Brinkley",
        "place_of_birth": "Monroe, Michigan, USA",
        "popularity": 0.1859,
        "profile_path": "/xwqx23ftStrkB3gA89TCumnz2ox.jpg"
    }
}