{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uYRnUnBE4kk5ocvyBckRfMAsZpJ.jpg",
                "genre_ids": [
                    12,
                    10749,
                    10752
                ],
                "id": 22584,
                "original_language": "en",
                "original_title": "To Have and Have Not",
                "overview": "A Martinique charter boat skipper gets mixed up with the underground French resistance operatives during WWII.",
                "popularity": 1.4842,
                "poster_path": "/m9RYIio23yClaO3fy5tcpYac1Gf.jpg",
                "release_date": "1945-01-20",
                "title": "To Have and Have Not",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 537,
                "character": "Fishing Customer Johnson",
                "credit_id": "52fe4446c3a368484e019ea9",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 1117,
                "character": "Newspaperman with Pipe (uncredited)",
                "credit_id": "555f2d2e9251417e4f00297a",
                "order": 181
            },
            {
                "adult": false,
                "backdrop_path": "/ruF3Lmd4A8MHbnEBE6lxPMbsHGL.jpg",
                "genre_ids": [
                    9648,
                    18
                ],
                "id": 15,
                "original_language": "en",
                "original_title": "Citizen Kane",
                "overview": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
                "popularity": 6.1449,
                "poster_path": "/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg",
                "release_date": "1941-04-17",
                "title": "Citizen Kane",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 5751,
                "character": "Reporter at Xanadu (uncredited)",
                "credit_id": "586aff97c3a3685e9c000042",
                "order": 67
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nWalter Sande (July 9, 1906 - November 22, 1971) was an American actor, notable for film roles including Paul Revere in Walt Disney's Johnny Tremain.\n\nBorn in Denver, Colorado, he was one of those stern, heavyset character actors in Hollywood no person could recognize by name. He showed an early interest in music as a youth and by his college years managed to start his own band. This led to a job as musical director for 20th Century-Fox's theater chain, which, in turn, led him to acting in films beginning in 1937. Usually providing atmospheric bits with no billing, he made an initial impression in serial cliffhangers as a third-string heavy with the popular The Green Hornet Strikes Again! and Sky Raiders.\n\nHis first top featured role, however, would come with The Iron Claw as Jack \"Flash\" Strong, a photographer who, uncharacteristically for Walter, served as a comic sidekick to our serial hero. Best of all would be his role in another serial as Red Pennington, the amusing sidekick to Don Winslow of the Navy. He repeated his role again in Don Winslow of the Coast Guard, the successful sequel.\n\nThe Pennington role would spark a long and steady career in movies, usually a step or two behind Hollywood's elite, in To Have and Have Not (prominently featured as the fisherman who tries to cheat Bogie), in Along Came Jones, The Blue Dahlia, Dark City and Bad Day at Black Rock, among hundreds of others. A regular authoritative presence in these classic sci-fi films Red Planet Mars, The War of the Worlds and Invaders from Mars. He also had a recurring featured part in the 1940s Boston Blackie film series playing Detective Matthews alongside 'Chester Morris former thief-turned-crime hero.\n\nA primary support player during the 'golden age' of TV, Walter worked on nearly every popular western and crime show available throughout the 1950s and 1960s. He had a regular series role on \"The Adventures of Tugboat Annie\" as Captain Horatio Bullwinkle, Annie's tugboat rival, and a recurring one as Lars \"Papa\" Holstrum, on \"The Farmer's Daughter\". He died of a heart attack in 1971 at age sixty-five in Chicago, Illinois.\n\nDescription above from the Wikipedia article Walter Sande, licensed under CC-BY-SA,full list of contributors on Wikipedia.  ​",
        "birthday": "1906-07-09",
        "deathday": "1971-11-22",
        "gender": 2,
        "homepage": null,
        "id": 94293,
        "imdb_id": "nm0761340",
        "known_for_department": "Acting",
        "name": "Walter Sande",
        "place_of_birth": "Denver, Colorado, USA",
        "popularity": 0.2513,
        "profile_path": "/kyVJTouV9WlfIkcfooLE6whhiyy.jpg"
    }
}