{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xDPaSuwaOizRNPitEvNiuY7i6iE.jpg",
                "genre_ids": [
                    35,
                    18,
                    80
                ],
                "id": 11562,
                "original_language": "en",
                "original_title": "Crimes and Misdemeanors",
                "overview": "A renowned ophthalmologist is desperate to cut off an adulterous relationship…which ends up in murder; and a frustrated documentary filmmaker woos an attractive television producer while making a film about her insufferably self-centered boss.",
                "popularity": 2.0462,
                "poster_path": "/6vC6MLYUICH57MmEVi1UaNaj2Qs.jpg",
                "release_date": "1989-10-13",
                "title": "Crimes and Misdemeanors",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 910,
                "character": "Brother-in-law (uncredited)",
                "credit_id": "5632c06c9251413b460063c1",
                "order": 52
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Avner Eisenberg \"Avner the Eccentric\" (born August 26, 1948) is an American vaudeville performer, clown, mime, juggler, and sleight of hand magician. John Simon described him in 1984 as \"A clown for the thinking man and the most exacting child.\"\n\nBorn in Atlanta, Georgia, Avner went to four different universities with a variety of tentative majors; he ultimately received a theater degree from the University of Washington in 1971. He then studied mime in Paris under Jacques Lecoq, interrupting those studies to spend some time as a puppeteer. Returning to the U.S., he taught at Carlo Clementi's Dell'Arte International School of Physical Theatre in California.\n\nHe performed at Renaissance fairs and on stages, before playing the title role in the 1985 film The Jewel of the Nile, a film that also featured his fellow vaudevillians The Flying Karamazov Brothers. In a review of that film, Janet Maslin singled out Avner for praise: \"Avner Eisenberg very nearly steals the film…\" Roger Ebert, on reviewing the film, also singled Eisenberg out as \"a true comic discovery\".",
        "birthday": "1948-08-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 943150,
        "imdb_id": "nm0251970",
        "known_for_department": "Acting",
        "name": "Avner Eisenberg",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.0533,
        "profile_path": "/dsOooPoONlcpPdQTbVSM4dOIpGK.jpg"
    }
}