{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5B22eed7ErxFiYAG4Ksb4eLwKNF.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 770254,
                "original_language": "en",
                "original_title": "Back to the Outback",
                "overview": "Tired of being locked in a reptile house where humans gawk at them like they are monsters, a ragtag group of Australia’s deadliest creatures plot an escape from their zoo to the Outback, a place where they’ll fit in without being judged.",
                "popularity": 4.2613,
                "poster_path": "/jbAUTO7qFN8XFG2LM3bz30vzGFJ.jpg",
                "release_date": "2021-12-03",
                "title": "Back to the Outback",
                "video": false,
                "vote_average": 7.662,
                "vote_count": 758,
                "character": "Doug (voice)",
                "credit_id": "5fc4d9122f8d0900410d37c0",
                "order": 6
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/P82NAcEsLIYgQtrtn36tYsj41m.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16
                ],
                "id": 748783,
                "original_language": "en",
                "original_title": "The Garfield Movie",
                "overview": "Garfield, the world-famous, Monday-hating, lasagna-loving indoor cat, is about to have a wild outdoor adventure! After an unexpected reunion with his long-lost father – scruffy street cat Vic – Garfield and his canine friend Odie are forced from their perfectly pampered life into joining Vic in a hilarious, high-stakes heist.",
                "popularity": 14.6439,
                "poster_path": "/xYduFGuch9OwbCOEUiamml18ZoB.jpg",
                "release_date": "2024-04-30",
                "title": "The Garfield Movie",
                "video": false,
                "vote_average": 7.037,
                "vote_count": 1325,
                "credit_id": "660ed75933a376017d845e59",
                "department": "Sound",
                "job": "Songs"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Keith Lionel Urban (born October 26, 1967) is a New Zealand-born Australian, country music singer, songwriter and guitarist whose commercial success has been mainly in the United States and Australia. Urban was born in New Zealand and began his career in Australia at an early age. In 1991, he released a self-titled debut album, and charted four singles in Australia before moving to the United States in 1992. Eventually, Urban found work as a session guitarist before starting a band known as The Ranch, which recorded one studio album on Capitol Records and charted two singles on the Billboard country charts.\n\nStill signed to Capitol, he made his solo American debut in 1999 with the album Keith Urban. Certified platinum in the U.S., it also produced his first American Number One in \"But for the Grace of God\". His breakthrough hit was the Number One \"Somebody Like You\", from his second Capitol album Golden Road (2002). This album also earned Urban his first Grammy Award win for \"You'll Think of Me\", its fourth single and the fourth Billboard Number One of his career. 2004's Be Here, his third American album, produced three more Number Ones, and became his highest-selling album, earning 4× Multi-Platinum certification. Love, Pain & the Whole Crazy Thing was released in 2006, producing the record-setting #17 country chart debut of \"Once in a Lifetime\", as well as Urban's second Grammy for the song \"Stupid Boy\", while a Greatest Hits package entitled Greatest Hits: 18 Kids followed in late 2007. This album was re-released a year later as Greatest Hits: 19 Kids with one track added: the number one \"You Look Good in My Shirt\", which he had previously recorded on Golden Road. Additional albums Defying Gravity and Get Closer were released on March 31, 2009 and November 16, 2010, respectively.\n\nUrban has released a total of nine studio albums (one of which was released only in the United Kingdom), as well as one album in The Ranch. He has charted more than fifteen singles on the U.S. country charts, including ten Number Ones. Urban plays acoustic and electric guitar, as well as ganjo, bass guitar, mandolin, piano, sitar, bouzouki and drums.",
        "birthday": "1967-10-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 94357,
        "imdb_id": "nm1236707",
        "known_for_department": "Acting",
        "name": "Keith Urban",
        "place_of_birth": "Whangarei, North Island, New Zealand",
        "popularity": 0.1412,
        "profile_path": "/6jB3gPO4yhdr24iqLjNS1Nw83SL.jpg"
    }
}