{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2Kkqmy3EpXqBDqv1vvsNXX3pwww.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 42269,
                "original_language": "it",
                "original_title": "C'eravamo tanto amati",
                "overview": "Three partisans bound by a strong friendship return home after the war, but the clash with everyday reality puts a strain on their bond.",
                "popularity": 1.7523,
                "poster_path": "/zGGWYpiKNwjpKxelPxOMqJnUgDs.jpg",
                "release_date": "1974-12-21",
                "title": "We All Loved Each Other So Much",
                "video": false,
                "vote_average": 8.3,
                "vote_count": 619,
                "character": "Elide",
                "credit_id": "52fe45f8c3a36847f80e50b5",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jo-Anna Ralli",
            "Джованна Ралли"
        ],
        "biography": "Giovanna Ralli (born 2 January 1935) is an Italian stage, film and television actress.\n\nBorn in Rome, Ralli debuted as a child actress at 7; at 13 she made her theatrical debut, entering the stage company of Peppino De Filippo. After appearing in Federico Fellini and Alberto Lattuada's Variety Lights (1950), Ralli had her first film roles of weight in mid-fifties, often in comedy films. In 1959 she had a leading role in Roberto Rossellini's General Della Rovere, that won the Golden Lion at the Venice Film Festival, while in 1960 her performance in Escape by Night, still directed by Rossellini, was awarded with the Golden Gate Award for Best Actress at the San Francisco International Film Festival. Ralli was married to Ettore Boschi.\n\nRalli later won a Nastro d'Argento award, as best actress, for La fuga (1964). In the mid-sixties she had a brief Hollywood career, starting from Blake Edwards' What Did You Do in the War, Daddy?. In 1974 she won her second Nastro d'Argento, as best supporting actress, for We All Loved Each Other So Much. Starting from early eighties, Ralli focused her activities on stage. In 1993 she received a Flaiano Prize for her career. In 2003 she was made a Grand Officer of the Italian Republic. At the 2015 Taormina Film Fest, where she received a special award for her career, Ralli announced her retirement from acting.\n\nDescription above from the Wikipedia article Giovanna Ralli, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1935-01-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 94420,
        "imdb_id": "nm0707728",
        "known_for_department": "Acting",
        "name": "Giovanna Ralli",
        "place_of_birth": "Rome, Lazio, Italy",
        "popularity": 0.3384,
        "profile_path": "/6dvHHF5JoFhQg6vD6rG8vyME4zK.jpg"
    }
}