{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wnKwGjUfxIs7fasocw7JwZ3gfQD.jpg",
                "genre_ids": [
                    10751,
                    16,
                    14
                ],
                "id": 73456,
                "original_language": "en",
                "original_title": "Barbie: Princess Charm School",
                "overview": "Barbie stars as Blair Willows, a kind-hearted girl who is chosen to attend Princess Charm School: a magical, modern place that teaches dancing, how to have tea parties, and proper princess manners. Blair loves her classes -- as well as the helpful magical sprites and her new friends, Princesses Hadley and Isla. But when royal teacher Dame Devin discovers that Blair looks a lot like the kingdom’s missing princess, she turns Blair’s world upside down to stop her from claiming the throne. Now Blair, Hadley and Delancy must find an enchanted crown to prove Blair’s true identity in this charming and magical princess story!",
                "popularity": 7.8064,
                "poster_path": "/lI2jPbssax6XX5vDqB9mTJHGzfH.jpg",
                "release_date": "2011-08-11",
                "title": "Barbie: Princess Charm School",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 839,
                "character": "Wickellia (voice)",
                "credit_id": "52fe489bc3a368484e101b2b",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/wWWXd27yF8sK9bLgAD4zxiGcYJW.jpg",
                "genre_ids": [
                    10751,
                    16
                ],
                "id": 44874,
                "original_language": "en",
                "original_title": "Barbie: A Fashion Fairytale",
                "overview": "Join Barbie in a colourful, modern-day fairytale filled with fashion, friends and fun! Barbie and her dog Sequin jet off to visit her Aunt's amazing fashion house in Paris, and much to her surprise it's about to be shut down forever. After she discovers three enchanting Flairies with sparkle-magic powers, Barbie comes up with a brilliant idea to save the business. She even inspires Alice, a shy fashion designer, and together they create a dazzling runway fashion show. Barbie shows that magic happens when you believe in yourself.",
                "popularity": 2.4678,
                "poster_path": "/bFnf8f8DXdCANQ7Y62djgubhh4P.jpg",
                "release_date": "2010-09-14",
                "title": "Barbie: A Fashion Fairytale",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 772,
                "character": "Shimmer (voice)",
                "credit_id": "5cfbbad69251411470b94180",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kelly Metger"
        ],
        "biography": "Kelly Metzger is a Canadian voice and theater actress, born in Edmonton and based in Vancouver, British Columbia. After making her debut in the title role of Anne of Green Gables, she performed on the stage with several Vancouver based theatrical companies. After this, she began a career in voice acting. Among her more noted voice acting roles are the English voice of Sayu Yagami in the anime series based on the Death Note manga, the character of Buttercup in Powerpuff Girls Z, the voice of Spitfire in My Little Pony: Friendship is Magic, the voice of Nya in the Cartoon Network series Lego Ninjago: Masters of Spinjitzu, and the voice of Sugar Sprinkles in Littlest Pet Shop. She also voiced Makena in Barbie Presents: Thumbelina.",
        "birthday": "1980-02-25",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.kellyjanemetzger.com/",
        "id": 94478,
        "imdb_id": "nm3045630",
        "known_for_department": "Acting",
        "name": "Kelly Metzger",
        "place_of_birth": "Edmonton, Alberta, Canada",
        "popularity": 0.1829,
        "profile_path": "/stE2VTi1FefZRtNTCNb0fHunuQy.jpg"
    }
}