{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wnKwGjUfxIs7fasocw7JwZ3gfQD.jpg",
                "genre_ids": [
                    10751,
                    16,
                    14
                ],
                "id": 73456,
                "original_language": "en",
                "original_title": "Barbie: Princess Charm School",
                "overview": "Barbie stars as Blair Willows, a kind-hearted girl who is chosen to attend Princess Charm School: a magical, modern place that teaches dancing, how to have tea parties, and proper princess manners. Blair loves her classes -- as well as the helpful magical sprites and her new friends, Princesses Hadley and Isla. But when royal teacher Dame Devin discovers that Blair looks a lot like the kingdom’s missing princess, she turns Blair’s world upside down to stop her from claiming the throne. Now Blair, Hadley and Delancy must find an enchanted crown to prove Blair’s true identity in this charming and magical princess story!",
                "popularity": 7.8064,
                "poster_path": "/lI2jPbssax6XX5vDqB9mTJHGzfH.jpg",
                "release_date": "2011-08-11",
                "title": "Barbie: Princess Charm School",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 839,
                "character": "Caprice (voice)",
                "credit_id": "52fe489bc3a368484e101b33",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nAnna Cummer is an actress from Vancouver, British Columbia, Canada. She spent half of her adolescence in Southeast Asia and the other half in Saskatoon, Saskatchewan, Canada. She finished high school in Hong Kong at the French International School and studied drama in England where she completed two theatrical degrees. Since returning to Canada in 2000, Anna has established herself within the artistic community of Vancouver putting her vocal talents to good use as a voice-over artist, working in film and television, and performing in theatrical productions.\n\nShe is the recipient of several nominations and Jessie Richardson Awards.\n\nDescription above from the Wikipedia article Anna Cummer, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1977-01-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 94477,
        "imdb_id": "nm1049682",
        "known_for_department": "Acting",
        "name": "Anna Cummer",
        "place_of_birth": "Singapore",
        "popularity": 0.3618,
        "profile_path": "/8LpZ95uYfhjdx0wTSGB0HMOQUTB.jpg"
    }
}