{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zGCnIADWwpjGllYv8DgT8HIuIQl.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 26022,
                "original_language": "hi",
                "original_title": "My Name Is Khan",
                "overview": "Rizwan Khan, a Muslim from the Borivali section of Mumbai, has Asperger's syndrome. He marries a Hindu single mother, Mandira, in San Francisco. After 9/11, Rizwan is detained by authorities at LAX who treat him as a terrorist because of his condition and his race.",
                "popularity": 3.5475,
                "poster_path": "/5Y36lCiNyyV71mjq6LavgiggbhT.jpg",
                "release_date": "2010-02-10",
                "title": "My Name Is Khan",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 1368,
                "character": "President Barack Obama",
                "credit_id": "52fe44ebc3a368484e03e423",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christopher B. Duncan is an American actor. He is best known for portraying Braxton P. Hartnabrig on The Jamie Foxx Show and he is also known for playing President Barack Obama on The Tonight Show with Jay Leno.  He portrayed Obama in the 2010 film My Name is Khan as well.  Duncan received his B.F.A. from the University of Colorado, Boulder. In addition to Braxton P. Hartnabrig, he also portrayed Spyro in Original Gangstas and starred in two Craig T. Nelson television shows: The District and Coach. In addition, he portrayed Clarence Wiedman on the show Veronica Mars and Mr. Matthews in Aliens in America.\n\nIn 2006, he appeared on Criminal Minds in the episode, 'The Last Word' as Agent James Sheridan who calls the BAU to St.Louis to help with a case regarding two serial killers who are in competition with each other.\n\nDescription above from the Wikipedia article Christopher B. Duncan, licensed under CC-BY-SA, full list of contributors on Wikipedia .",
        "birthday": "1964-12-04",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.christopherbduncan.com",
        "id": 94570,
        "imdb_id": "nm0241935",
        "known_for_department": "Acting",
        "name": "Christopher B. Duncan",
        "place_of_birth": "Lincoln, Nebraska, USA",
        "popularity": 0.175,
        "profile_path": "/6fC0HJ5DpqEKfvjnG1bDYyccw2R.jpg"
    }
}