{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6zIOO1NrTehQkDaNfvga4luSRQc.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1548,
                "original_language": "en",
                "original_title": "Ghost World",
                "overview": "Two quirky, cynical teenaged girls try to figure out what to do with their lives after high school graduation. After they play a prank on an eccentric, middle aged record collector, one of them befriends him, which causes a rift in the girls’ friendship.",
                "popularity": 2.2446,
                "poster_path": "/uwKqnUPE4dSM0kKuMW0vXpURh2T.jpg",
                "release_date": "2001-07-20",
                "title": "Ghost World",
                "video": false,
                "vote_average": 7.08,
                "vote_count": 1490,
                "character": "Dana's Co-Worker",
                "credit_id": "5b1a15b30e0a261f9d00fe84",
                "order": 53
            },
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3336,
                "character": "Tiny Ash #3 (uncredited)",
                "credit_id": "5f809bf0175051003692c62f",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gerald Andrew Rector",
            "Adam Wahl"
        ],
        "biography": "Jerry Rector was born in St. Louis, Missouri, but grew up in the Detroit suburbs playing most sports including water skiing, riding dirt bikes and scuba diving. After moving to Los Angeles in high school, Jerry began his professional careers as an actor and musician. Besides being an actor in Hollywood, he also has lived and worked in NYC, Vancouver and Toronto Canada where he became a dual Canadian Citizen. He also began his film-making career there as a writer, director and producer. Overseas, Jerry has worked in Hong Kong with Jean-Claude Van Damme in \"Double Impact\", and in South Korea opposite Lee Byung-Hun, (The Magnificent 7/Terminator Genisys), in \"The Man Standing Next\". Jerry is honored to have also worked opposite other greats like Patrick Stewart, Cardi B, Jack Lemmon, Walther Matthau, John Rhys-Davies, Nicolas Cage, Jennifer Jason Leigh, Jennifer Beals, Harvey Keitel, Rod Steiger, and Cheech Marin, to name a few. As a drummer, percussionist and singer, Jerry is also greatly honored to have played with music super stars like singer Chaka Khan, guitarist Robbie Kreiger (The Doors), Keyboardist Patrick Moraz (Yes), Drummer Vinnie Appice (Black Sabbath/Dio), Saxophonist Sal Marquez (Frank Zappa/Dave Grusin), Grammy Award winning guitarist Olivier Scoazec (Buckwheat Zydeco), and guitar virtuoso Del Casher (Elvis Presley), aka \"Papa Wah Wah\". Del's nickname is derived from being the inventor of the \"Wah Wah\" pedal.",
        "birthday": "1958-09-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 94651,
        "imdb_id": "nm0714561",
        "known_for_department": "Acting",
        "name": "Jerry Rector",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.2053,
        "profile_path": "/qJBLG8lGTfqXylibxx6g84MQfhi.jpg"
    }
}