{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qZYvF1M7y8Gfp4S6OBHbYfB0Lgc.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 639933,
                "original_language": "en",
                "original_title": "The Northman",
                "overview": "Prince Amleth is on the verge of becoming a man when his father is brutally murdered by his uncle, who kidnaps the boy's mother. Two decades later, Amleth is now a Viking who's on a mission to save his mother, kill his uncle and avenge his father.",
                "popularity": 8.1444,
                "poster_path": "/aSSJMnHknzKjlZ6zybwD7eyJ4Po.jpg",
                "release_date": "2022-04-07",
                "title": "The Northman",
                "video": false,
                "vote_average": 7.036,
                "vote_count": 4703,
                "character": "The Mound Dweller",
                "credit_id": "62452314c740d90047b35db6",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/8BTsTfln4jlQrLXUBquXJ0ASQy9.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 140607,
                "original_language": "en",
                "original_title": "Star Wars: The Force Awakens",
                "overview": "Thirty years after defeating the Galactic Empire, Han Solo and his allies face a new threat from the evil Kylo Ren and his army of Stormtroopers.",
                "popularity": 11.688,
                "poster_path": "/wqnLdwVXoBjKibFRR5U3y0aDUhs.jpg",
                "release_date": "2015-12-15",
                "title": "Star Wars: The Force Awakens",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 19963,
                "character": "Bollie Prindel / Roodown (uncredited)",
                "credit_id": "5865bc40c3a36852cc023f1b",
                "order": 68
            },
            {
                "adult": false,
                "backdrop_path": "/6t8ES1d12OzWyCGxBeDYLHoaDrT.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 330459,
                "original_language": "en",
                "original_title": "Rogue One: A Star Wars Story",
                "overview": "A rogue band of resistance fighters unite for a mission to steal the Death Star plans and bring a new hope to the galaxy.",
                "popularity": 6.8029,
                "poster_path": "/i0yw1mFbB7sNGHCs7EXZPzFkdA1.jpg",
                "release_date": "2016-12-14",
                "title": "Rogue One: A Star Wars Story",
                "video": false,
                "vote_average": 7.502,
                "vote_count": 15864,
                "character": "Moroff (uncredited)",
                "credit_id": "58633f28c3a36852cc0073ed",
                "order": 114
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ίαν Γουάιτ"
        ],
        "biography": "Born in Bangor, North Wales and raised in Brighton, on the South coast of England, Ian Whyte was 7'1\" tall by the time he was 17 years old. Ian always stood out from the crowd. Tall, slim and athletic, little did he know of his future career in the limelight. Ian discovered basketball in his teens, and quickly caught the attention of national team scouts who saw his physical attributes and determination as valuable assets. He quickly progressed to the junior national team ranks, but uninspired by school at the time, Ian was keen to escape at the earliest possible opportunity. He spent a year at Henry Hudson High School in New Jersey, where he again attracted the attention of basketball scouts, earning sports scholarships to Iona College in New York and Clarion University in Pennsylvania.\n\nIan returned to England in 1994 to play for the London Towers, a new franchise owned by the music promoter Barry Marshall. Still eager to find himself Ian only stayed a season with the Towers, transferring to their crosstown rivals, The London Leopards, but again, only for one season.\n\nin 1995, Europe freely opened its doors to sportsmen and women from across the continent. Ian played for teams right across Europe. In France, Belgium, Greece and Portugal, where he won the domestic treble; League, cup and playoff championships with F.C. Porto in 1997 and went to the ¼ finals of the European cup.\n\nIan returned to England soon after to play for the Newcastle Eagles, a place that would become his home until his retirement from the game in 2003. Throughout his career Ian tirelessly distinguished himself, representing his country 80 times.\n\nIn 2003 Ian received a phone call that would change the whole course of his life. By his own admission he was keen to retire from basketball on his terms rather than through injury or old age, so he responded to a casting call for the new film Alien Vs Predator. His success in gaining the role is a matter of history, but personally it was a tremendous victory for him to finally find an outlet for his emotional creativity.\n\nIan was fortunate to work alongside such luminaries as the Oscar winning special effects duo of Alec Gillis and Tom Woodruff Jr as well as Oscar winning VFX supervisor John Bruno. He also met soon to be double Oscar winning makeup effects artist Mark Coulier who encouraged him to get in touch with Nick Dudman, the creature effects supervisor for the Harry Potter franchise. Upon completion of filming on AVP Ian travelled back to England and straight into the world of Harry Potter. Not credited as an actor this time, Ian was hired to help bring to life the character of Madame Maxime played by the sublime Francis De La Tour. Ian worked full time for an entire year on the film, faithfully doubling The character who stood a glorious 8'6\" tall.",
        "birthday": "1971-09-17",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.ianwhyte.com/",
        "id": 946696,
        "imdb_id": "nm1613839",
        "known_for_department": "Acting",
        "name": "Ian Whyte",
        "place_of_birth": "Bangor, Wales, UK",
        "popularity": 0.4249,
        "profile_path": "/svlJyDgPbTHoGjbQKU4S2J6g5hi.jpg"
    }
}