{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kfofK4GzJsJZhCShqZY438c8Y4Y.jpg",
                "genre_ids": [
                    35,
                    12,
                    10751
                ],
                "id": 116149,
                "original_language": "en",
                "original_title": "Paddington",
                "overview": "A young Peruvian bear travels to London in search of a home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family, who offer him a temporary haven.",
                "popularity": 5.8864,
                "poster_path": "/wpchRGhRhvhtU083PfX2yixXtiw.jpg",
                "release_date": "2014-11-24",
                "title": "Paddington",
                "video": false,
                "vote_average": 7.114,
                "vote_count": 3984,
                "character": "Underground Ticket Inspector",
                "credit_id": "55e419c1c3a36841970036ef",
                "order": 47
            },
            {
                "adult": false,
                "backdrop_path": "/wUc83y8kXNdRK66o0HU5X8eBri4.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 627,
                "original_language": "en",
                "original_title": "Trainspotting",
                "overview": "Heroin addict Mark Renton stumbles through bad ideas and sobriety attempts with his unreliable friends --Sick Boy, Begbie, Spud and Tommy. He also has an underage girlfriend, Diane, along for the ride. After cleaning up and moving from Edinburgh to London, Mark finds he can't escape the life he left behind as Begbie and Sick Boy come knocking.",
                "popularity": 7.176,
                "poster_path": "/1jUC02qsqS2NxBMFarbIhcQtazV.jpg",
                "release_date": "1996-02-23",
                "title": "Trainspotting",
                "video": false,
                "vote_average": 7.96,
                "vote_count": 10010,
                "character": "Estate Agent",
                "credit_id": "589ce9fec3a3681151002fc1",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Edward Augustus Matthew Christopher Nestor MBE (born June 5, 1964) is a British actor, stand up comedian, television and radio presenter, who is best known for his starring roles in The Real McCoy and Desmond's, as well as playing a small role in Trainspotting. Nestor has a radio programme in which he has a running joke with his claim to be about to turn thirty years old.\n\nHe hosted, alongside Robbie Gee, the Imperial College Indian Society's annual \"East Meets West\" charity show in 2007 and 2008. The show, in both years, was one of the most successful and popular charity shows in the United Kingdom, drawing more than 1,750 people to the prestigious London Palladium in 2008.\n\nNestor appeared in the BBC's Canterbury Tales and is a former star on Casualty. He currently presents BBC Radio London's mid-morning from 10 am to 2 pm on Mondays to Thursdays. Nestor previously presented a show on BBC London on Friday evenings, from 10 pm to 2 am, that he called The Rum Shop. He also presented Drivetime for the network.\n\nIn 2016, he appeared as Freddie Hamilton in the television series by BBC, Death in Paradise, episode 5.5. Although raised in Hackney, London, Nestor is a supporter of Manchester United, and presents a podcast by Manchester United, The Manchester United Red Cast, with Robert Meakin. He was voted \"The Speech Broadcaster of the Year\" at the Sony Radio Academy Awards 2007.\n\nIn February 2007, Nestor was diagnosed as having Hodgkin's Lymphoma, and kept a blog of his treatment and reactions. He is currently in remission. In December 2017, Nestor was appointed an MBE in the Queen's New Year's Honours List for 2018 for his charity work and services to radio. As of 2020, Nestor presented the Drive Time show for BBC Radio London, moving to the mid-morning slot on the station on 13 September 2021, presenting the programme on four days each week.",
        "birthday": "1964-06-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 94740,
        "imdb_id": "nm0626566",
        "known_for_department": "Acting",
        "name": "Eddie Nestor",
        "place_of_birth": "Hackney, London, England, UK",
        "popularity": 0.6887,
        "profile_path": "/o0MmDQpO2TUvODt7R0ttixpAXpI.jpg"
    }
}