{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8NT7h1CxdXapqt6hdLhfFcoZJAU.jpg",
                "genre_ids": [
                    28,
                    35,
                    80,
                    14
                ],
                "id": 9470,
                "original_language": "cn",
                "original_title": "功夫",
                "overview": "It's the 1940s, and the notorious Axe Gang terrorizes Shanghai. Small-time criminals Sing and Bone hope to join, but they only manage to make lots of very dangerous enemies. Fortunately for them, kung fu masters and hidden strength can be found in unlikely places. Now they just have to take on the entire Axe Gang.",
                "popularity": 8.5007,
                "poster_path": "/exbyTbrvRUDKN2mcNEuVor4VFQW.jpg",
                "release_date": "2004-02-10",
                "title": "Kung Fu Hustle",
                "video": false,
                "vote_average": 7.478,
                "vote_count": 2976,
                "character": "Inspector Chan",
                "credit_id": "666c88ec7fe10aed2aa574f1",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yibai Zhang",
            "张一白",
            "Чжан И Бай",
            "Zhang Yi Bai",
            "Чжан Сяо Лин",
            "Zhang Xiao Ling",
            "张晓陵"
        ],
        "biography": "Zhang Xiaoling, better known by his stage name Zhang Yibai (simplified Chinese: 张一白; traditional Chinese: 張一白) (born 14 April 1963, in Chongqing, China) is a Chinese film director, screenwriter and producer. Zhang began his career in television and music videos before directing his debut, Spring Subway in 2002. Zhang, like many other modern Chinese directors, has focused primarily on life in modern Chinese cities. Spring Subway, for example, follows its protagonist as he wanders through Beijing's subway system, while the mystery-thriller Curiosity Killed the Cat follows its characters through the central China boomtown of Chongqing (also Zhang's hometown).\n\nHis next two films, 2007's The Longest Night in Shanghai and 2008's Lost, Indulgence have seen the director's exposure and successes extending increasingly overseas. Longest Night, starring Zhao Wei, constitutes one of the first China-Japan coproductions, while Lost was selected to premiere at New York City's Tribeca Film Festival in 2008.",
        "birthday": "1963-05-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 94744,
        "imdb_id": "nm1403892",
        "known_for_department": "Directing",
        "name": "Zhang Yibai",
        "place_of_birth": "Chongqing, China",
        "popularity": 0.2152,
        "profile_path": "/rXV2lGFiunV6Pi81j4aEnnkReIO.jpg"
    }
}