{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8zLS8p1tRyWFLRFfmgQq0j5WE6z.jpg",
                "genre_ids": [
                    12,
                    28,
                    14
                ],
                "id": 564,
                "original_language": "en",
                "original_title": "The Mummy",
                "overview": "Dashing legionnaire Rick O'Connell stumbles upon the hidden ruins of Hamunaptra while in the midst of a battle to claim the area in 1920s Egypt. It has been over three thousand years since former High Priest Imhotep suffered a fate worse than death as a punishment for a forbidden love—along with a curse that guarantees eternal doom upon the world if he is ever awoken.",
                "popularity": 12.8122,
                "poster_path": "/yhIsVvcUm7QxzLfT6HW2wLf5ajY.jpg",
                "release_date": "1999-04-16",
                "title": "The Mummy",
                "video": false,
                "vote_average": 6.95,
                "vote_count": 9503,
                "character": "Hangman",
                "credit_id": "64fd7eb866469a00e349217a",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mohammed Said Afifi",
            "Mohamed Saïd Afifi",
            "محمد سعيد عفيفي"
        ],
        "biography": "Mohammed Saïd Afifi (1933-2009) was a Moroccan actor. He contributed to the introduction of theatrical acting to television and gave the blind the rare opportunity to participate in theatrical works. Afifi was involved with some local theater troupes, most of which were a means for the cultural and artistic struggle against French colonialism since the second half of the fifties. But the beginning of his real career was with the National Youth Troupe, which he co-founded, and which was called “Al Mamoura” in 1967 and was affiliated with the Ministry of Youth and Sports.\n\nHe directed many theatrical works and acted in some of them, such as the play Hamlet. His other theatrical work includes Othello and Le Bourgeois gentilhomme. He also participated in some cinematic works, such as Mirage. The TV movie The Case is one of his last works. Afifi held the position of professor of theater at the Municipal Institute in Casablanca between 1976 and 1980, and he received many honors, the most prominent of which was receiving a medal from His Majesty King Mohammed VI.",
        "birthday": "1935-12-25",
        "deathday": "2009-09-05",
        "gender": 2,
        "homepage": null,
        "id": 947663,
        "imdb_id": "nm0012711",
        "known_for_department": "Acting",
        "name": "Mohammed Afifi",
        "place_of_birth": "El-Jadida, Morocco",
        "popularity": 0.0286,
        "profile_path": null
    }
}