{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7aW9IZjpsoTXYEARlnOvTtl6EBr.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1391,
                "original_language": "es",
                "original_title": "Y tu mamá también",
                "overview": "In Mexico, two teenage boys and an attractive older woman embark on a road trip and learn a thing or two about life, friendship, sex, and each other.",
                "popularity": 6.0127,
                "poster_path": "/aj3rqjab8jfc2fWmcS3H3c5qbur.jpg",
                "release_date": "2001-06-08",
                "title": "Y Tu Mamá También",
                "video": false,
                "vote_average": 7.416,
                "vote_count": 1634,
                "character": "Diego 'Saba' Madero",
                "credit_id": "586e9961c3a3683b6400b07a",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "(b. 1977, Mexico City), actor and musician. He began his musical career at the age of 14 focused on percussions and shortly after had his first progressive rock band, Asallam, with Fausto Palma. As an actor he had his debut in 1997 with a mini role in Jaime Humberto Hermosillo's De noche vienes, Esmeralda, and later in Y tu mamá también, Déficit, El lenguaje de los machetes, Paraíso, Los Héroes del norte (as \"el botarga\") and a long etcetera, until today he stars in Manolo Caro's La vida inmoral de la pareja ideal, in El Diablo Guardian and won an Ariel in the category of Best Actor in a Supporting Role for the film Tiempo compartido.  He has had incidental roles in practically all the popular series and films of the last decade in Mexico.  Andrés has a long trajectory of collaborations with musicians, such as the electro-pop band Songs for Eleonor, which shared the stage with beautiful bands like Mercury Rev, Ulrich Snauss, Circlesquare, Tujiko Noriko, Beach House or Architecture in Helsinki. Or as a soloist in his Almeyda roof project. The techno paid off and in 2006 led him to participate in MUTEK with Richie Hawtin and Troy Pierce.\n\nOn the other hand, Almeida has created original music for television in Amor Chilango, Soy tu fan and Los Heroes Del Norte, and in the films Deficit, La Otra Familia, No Eres Tú soy Yo, Sin Ella and Luto. As a producer he collaborated with the group Haciendo el Mal, with Paulina Lasa and Karen Ruiz in the creation of their two LPs. The first one was nominated for Best Pop Album at the IMAS 2013 awards. He also developed original music for several projects such as Abierto de Diseño, FICCO, Distrital, Cineteca Nacional and TAG.",
        "birthday": "1977-11-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 947768,
        "imdb_id": "nm1003962",
        "known_for_department": "Acting",
        "name": "Andrés Almeida",
        "place_of_birth": "Mexico City, Distrito Federal, Mexico",
        "popularity": 0.2725,
        "profile_path": "/4cTw37HIfjFrD4CcFf8IKokyYJM.jpg"
    }
}