{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f4ZgIaMpOWd6rewhCfoIIMqWquh.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 20770,
                "original_language": "en",
                "original_title": "But I'm a Cheerleader",
                "overview": "Megan is an all-American girl. A cheerleader. She has a boyfriend. But Megan doesn't like kissing her boyfriend very much. And she's pretty touchy with her cheerleader friends. Her conservative parents worry that she must be a lesbian and send her off to \"sexual redirection\" school, where she must, with other lesbians and gays learn how to be straight.",
                "popularity": 2.2693,
                "poster_path": "/dGEwlAuzTZoZjvsqgT2MRKHnGi8.jpg",
                "release_date": "2000-07-07",
                "title": "But I'm a Cheerleader",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 755,
                "character": "Cheerleader",
                "credit_id": "6679f42c38e37467fbc24797",
                "order": 72
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJenni Pulos was born in Portland, Oregon, and grew up in Scottsdale, Arizona. She played tennis competitively in high school. She attended the University of California, Los Angeles as a Theater & Film major and a Political Science minor. Pulos intended to play tennis for UCLA, but later invested her time in acting. Pulos considers herself to be an actress, voice actress, and rapper. She married another one of Lewis' assistants, Chris Elwood, and was referred to as 'Jenni Pulos Elwood' throughout the first two seasons until the two divorced. Pulos has had many minor roles in television, including Monk, Charmed, and Moesha.\n\nPulos refers to herself as Lewis' executive administrative assistant and often refers to Lewis as \"crazy\" due to his obsessive-compulsive tendencies, but also admits that many geniuses are crazy. Pulos has complained that Lewis treats his animals better than his assistants. Lewis often gives preferential treatment to Pulos and considers her his best assistant, evidenced by the fact that she has only been suspended once. Lewis says that \"she is really the only person that stands up to me,\" and he apparently respects that. Her husband Chris worked for Lewis before Pulos was hired, but she quickly rose up the ladder. Since the start of the first season, Pulos has maintained that a good portion of her job is to entertain Lewis; some of her first footage on the show is of her dancing foolishly in the driveway to make Lewis laugh.\n\nLewis and Pulos share a platonic friendship. Pulos refuses to tell Lewis where she lives because she fears he might track her down and invade her privacy, which Lewis admits he would. When Pulos withholds information about her private life, Lewis says worriedly that his \"first reaction is that she might break up with me\". According to Lewis their relationship has been strengthened.\n\nHe was concerned about her welfare during the previous months that recall Lewis' firing of Chris Elwood during episode 205, \"Tear Down\" and his later discovery that Pulos and Chris were getting a divorce. According to \"Closer Inspection,\" \"Tear Down,\" the season reunion special Lewis believed his undeniable proof of Chris' disregard of his duties would hurt not only Pulos but Lewis' relationship with her. He agonized over what decision he should make.\n\nDescription above from the Wikipedia article Jenni Pulos, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1973-01-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 94821,
        "imdb_id": "nm0700480",
        "known_for_department": "Acting",
        "name": "Jenni Pulos",
        "place_of_birth": " Portland, Oregon, USA",
        "popularity": 0.0647,
        "profile_path": "/hoC4bqd8T6YT81kL6t24qGYlAdR.jpg"
    }
}