{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jXDselREPq8TOVGM4dzBBUM7xVk.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 399579,
                "original_language": "en",
                "original_title": "Alita: Battle Angel",
                "overview": "When Alita awakens with no memory of who she is in a future world she does not recognize, she is taken in by Ido, a compassionate doctor who realizes that somewhere in this abandoned cyborg shell is the heart and soul of a young woman with an extraordinary past.",
                "popularity": 9.1217,
                "poster_path": "/xRWht48C2V8XNfzvPehyClOvDni.jpg",
                "release_date": "2019-01-31",
                "title": "Alita: Battle Angel",
                "video": false,
                "vote_average": 7.244,
                "vote_count": 9591,
                "character": "Heckler",
                "credit_id": "5c6582920e0a262fa19843a0",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paulo de Sousa"
        ],
        "biography": "Paulo de Sousa is a multicultural actor with a career spanning continents and mediums. Born in Zambia to Portuguese parents, his creative journey began at age 6 but took off in 1991 when he fully immersed himself in entertainment. He founded Splendor Modeling Agency and Pageants Zambia, became the Country Director for Miss World and Miss Universe in Zambia, and quickly established himself as a creative force with live TV appearances, co-hosting gigs, a radio show, and national stage performances.\n\nIn 2001, Paulo moved to New York City to pursue acting at the Lee Strasberg Theatre and Film Institute. His career flourished, leading to performances across the United States, Portugal, Zambia, and beyond.\n\nA highlight of his film career was his principal role in Sydney Pollack’s \"The Interpreter\", where his bilingual talents and multicultural background earned him international recognition alongside Nicole Kidman.\n\nOn stage, Paulo has delivered commanding performances in works by Shakespeare, John Steinbeck, and Nelson Rodrigues, including iconic roles like Lenny in \"Of Mice and Men.\" His versatility spans both intense dramas and comedies.\n\nAs a celebrated radio presenter on Radio Phoenix, he was known as \"The Citizen of the World,\" and his voice work remains widely recognized.\n\nSince moving to Los Angeles in 2008, Paulo has continued to build on his impressive body of work.",
        "birthday": "1969-02-26",
        "deathday": null,
        "gender": 2,
        "homepage": "http://pdesousa.com",
        "id": 949591,
        "imdb_id": "nm1503656",
        "known_for_department": "Acting",
        "name": "Paul de Sousa",
        "place_of_birth": "Zambia",
        "popularity": 0.0561,
        "profile_path": "/w9rG62OkjMBckAwvLPwBNss7k3G.jpg"
    }
}