{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i7n9u1SppzXcSO2EVgwEehzABzm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 17529,
                "original_language": "en",
                "original_title": "True Grit",
                "overview": "The murder of her father sends a teenage tomboy on a mission of 'justice', which involves avenging her father's death. She recruits a tough old marshal, 'Rooster' Cogburn because he has 'true grit', and a reputation of getting the job done.",
                "popularity": 3.5697,
                "poster_path": "/9TjGjAD2deCtIG4ebi8LhIyFK6j.jpg",
                "release_date": "1969-06-11",
                "title": "True Grit",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 818,
                "character": "McAlester (uncredited)",
                "credit_id": "63370fcecba36f009a41c230",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Clarence Maxwell"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nStuart Randall (July 24, 1909 – June 22, 1988) was an American actor of film and television who appeared on screen between 1950 and 1971.\n\nHe is best known for his recurring role as Sheriff Mort Corey in thirty-four episodes which aired between April 4, 1961, and April 20, 1963, of the western television series, Laramie. He appeared in three earlier Laramie episodes under different character names.\n\nRandall's first role was also as a sheriff in the 1950 Roy Rogers film, Bells of Coronado. He appeared in Pickup on South Street as a police commissioner. In 1954, he played a sheriff in the episode \"Belle Starr\" of the syndicated television series Stories of the Century, starring and narrated by Jim Davis.\n\nIn 1955, he portrayed Tom Garvey in \"Cattle Drive to Casper\" on the NBC anthology series, Frontier, narrated by Walter Coy. His co-stars in the episode included Jack Elam, Beverly Garland, and Ray Teal. He appeared in 1958–59 as Sheriff Art Sampson (billed in the last appearance as Art Simpson) on an earlier NBC series, Cimarron City, set in an Oklahoma boomtown. John Smith was a co-star in that series too.",
        "birthday": "1909-07-24",
        "deathday": "1988-06-22",
        "gender": 2,
        "homepage": null,
        "id": 95010,
        "imdb_id": "nm0709695",
        "known_for_department": "Acting",
        "name": "Stuart Randall",
        "place_of_birth": "Brazil, Indiana, USA",
        "popularity": 0.1594,
        "profile_path": "/31keaoFyRA0oXJtP9BMWIxA6Rvt.jpg"
    }
}