{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/26O2JCu4cyR7U3ga1GT7BhTj888.jpg",
                "genre_ids": [
                    35,
                    9648,
                    80
                ],
                "id": 1594,
                "original_language": "en",
                "original_title": "A Shot in the Dark",
                "overview": "Inspector Jacques Clouseau, smitten with the accused maid Maria Gambrelli, unwittingly turns a straightforward murder investigation into a comedic series of mishaps, testing the patience of his irritable boss Charles Dreyfus as casualties mount.",
                "popularity": 5.8364,
                "poster_path": "/pR6tNqNLYIbRRYC5TFKWVWaVvvK.jpg",
                "release_date": "1964-06-23",
                "title": "A Shot in the Dark",
                "video": false,
                "vote_average": 7.191,
                "vote_count": 588,
                "character": "Georges",
                "credit_id": "59615ed3c3a36828a10da243",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David William Frederick Lodge"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nDavid William Frederick Lodge (19 August 1921 in Rochester, Kent - 18 October 2003 in Northwood, Middlesex) was a British character actor.\n\nBefore turning to acting he worked as a circus clown. He also appeared in Gang Shows and variety before making his screen debut in The Cockleshell Heroes and going on to feature in many British films usually portraying military types, and often comedic roles. He was a close friend of Peter Sellers and appeared as part of Spike Milligan's team on his Q programmes.\n\nAmazingly, in 1958 he appeared in ten films, possibly a record.\n\nHe appeared in a 1969 episode of Randall and Hopkirk Deceased (\"Who Killed Cock Robin?\"), and continuing with his military-type roles, appeared alongside Windsor Davies as Company Sergeant-Major Sharp in an episode of It Ain't Half Hot Mum in 1976. He appeared as a policeman in the opening episode of the legal drama The Main Chance.\n\nDescription above from the Wikipedia article David Lodge (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1921-08-19",
        "deathday": "2003-10-18",
        "gender": 2,
        "homepage": null,
        "id": 95125,
        "imdb_id": "nm0517084",
        "known_for_department": "Acting",
        "name": "David Lodge",
        "place_of_birth": "Rochester, Kent, England, UK",
        "popularity": 0.2293,
        "profile_path": "/rYb40i92d3qqMu9ioYdiT2ZM42X.jpg"
    }
}