{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dfkE2LppPbJ1qUzi3tdND5iuMFp.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 10607,
                "original_language": "en",
                "original_title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "overview": "When Ashtray moves to South Central L.A. to live with his father (who appears to be the same age he is) and grandmother (who likes to talk tough and smoke reefer), he falls in with his gang-banging cousin Loc Dog, who along with the requisite pistols and Uzi carries a thermo-nuclear warhead for self-defense. Will Ashtray be able to keep living the straight life?",
                "popularity": 6.7019,
                "poster_path": "/HZQBF7JDd2e9p4rPSbSHuWHaCC.jpg",
                "release_date": "1996-01-12",
                "title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "video": false,
                "vote_average": 7.03,
                "vote_count": 1402,
                "character": "Mrs. Johnson",
                "credit_id": "5761d7259251413bb600025b",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kim N. Wayans"
        ],
        "biography": "Kim N. Wayans is an American actress, comedian, producer, writer, and director. Wayans is the sister of Keenen Ivory, Damon Sr., Marlon, Shawn, and Nadia Wayans. She is best known for her numerous roles on the Fox sketch comedy show In Living Color, and Tonia Harris on In the House.\n\nIn film she appeared in I'm Gonna Git You Sucka and Don't Be a Menace to South Central While Drinking Your Juice in the Hood (both directed by her brother Keenen) and had a starring role in the art film Talking About Sex and later co-starred in Juwanna Mann as Latisha Jansen. She starred with her siblings on the Fox variety show In Living Color and A Low Down Dirty Shame.\n\nHer other television work includes regular appearances on the sitcom In the House with LL Cool J and a recurring role on A Different World. Recently, she has worked as a story editor on her brother Damon's sitcom My Wife and Kids. In 2008, she co wrote a series of children's books with her husband Kevin Knotts, entitled Amy Hodgepodge, about a multiracial girl adjusting to life in public school after years of homeschooling.\n\nIn December 2011, she got a chance to showcase her dramatic chops with a supporting role as a mother who struggles to understand her seventeen-year-old daughter in Pariah. She was nominated (alongside co star Pernell Walker) for Best Supporting Actress at the 2012 Black Reel Awards but lost to Octavia Spencer for The Help.",
        "birthday": "1961-10-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 95189,
        "imdb_id": "nm0915462",
        "known_for_department": "Acting",
        "name": "Kim Wayans",
        "place_of_birth": "New York, New York, United States",
        "popularity": 0.3395,
        "profile_path": "/pfGpRchtq8zQ6j6Pj2J0flDjzfa.jpg"
    }
}