{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j1xaeJZOEOiVBD1rk3dg4YaAk23.jpg",
                "genre_ids": [
                    28,
                    12,
                    18,
                    10751
                ],
                "id": 1885,
                "original_language": "en",
                "original_title": "The Karate Kid",
                "overview": "New Jersey teen Daniel LaRusso moves to Los Angeles with his mother, and soon strikes up a relationship with Ali. He quickly finds himself the target of bullying by a group of thugs, led by Ali's ex-boyfriend Johnny, who study karate at the Cobra Kai dojo under ruthless sensei John Kreese. Fortunately, Daniel befriends Mr. Miyagi, an unassuming repairman who just happens to be a martial arts master himself. Miyagi takes Daniel under his wing, training him in a more compassionate form of karate for self-defense and, later, preparing him to compete against the brutal Cobra Kai.",
                "popularity": 6.3425,
                "poster_path": "/1mp4ViklKvA0WXXsNvNx0RBuiit.jpg",
                "release_date": "1984-06-22",
                "title": "The Karate Kid",
                "video": false,
                "vote_average": 7.209,
                "vote_count": 4466,
                "character": "Mrs. Mills (Ali's Mother) (uncredited)",
                "credit_id": "615f05d93e2ec8002d6fc947",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/n63e6JvKST0Gm222zolmhGb2ww6.jpg",
                "genre_ids": [
                    35,
                    10751,
                    10749
                ],
                "id": 9880,
                "original_language": "en",
                "original_title": "The Princess Diaries",
                "overview": "A socially awkward but very bright 15-year-old girl being raised by a single mom discovers that she is the princess of a small European country because of the recent death of her long-absent father, who, unknown to her, was the crown prince of Genovia. She must make a choice between continuing the life of a San Francisco teen or stepping up to the throne.",
                "popularity": 8.6346,
                "poster_path": "/qSw4lzhDGeM5MjQc86BLzJALhBs.jpg",
                "release_date": "2001-08-03",
                "title": "The Princess Diaries",
                "video": false,
                "vote_average": 6.964,
                "vote_count": 5108,
                "character": "Ball Reporter",
                "credit_id": "56b67f90c3a368481600470c",
                "order": 78
            },
            {
                "adult": false,
                "backdrop_path": "/p1PLSI5Nw2krGxD7X4ulul1tDAk.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53
                ],
                "id": 807,
                "original_language": "en",
                "original_title": "Se7en",
                "overview": "Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Somerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case.",
                "popularity": 18.2401,
                "poster_path": "/191nKfP0ehp3uIvWqgPbFmI4lv9.jpg",
                "release_date": "1995-09-22",
                "title": "Se7en",
                "video": false,
                "vote_average": 8.377,
                "vote_count": 22094,
                "character": "Woman Cop Behind Desk",
                "credit_id": "56b6822cc3a36806f1009d9f",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mary Wilcox"
        ],
        "biography": "Shannon Wilcox was widely known for her acting on the big screen. Wilcox's early roles were in comedies like \"Songwriter\" (1984) starring Willie Nelson, the Robert Redford film \"Legal Eagles\" (1986) and \"Hollywood Harry\" (1986) with Robert Forster and Kate Forster. She also appeared in the TV movie \"Thou Shalt Not Commit Adultery\" (NBC, 1978-79).  She kept working in film throughout the nineties, starring in the dramatic musical \"For the Boys\" (1991) with Bette Midler, the dramedy \"There Goes My Baby\" (1994) with Dermot Mulroney and the Dana Delany comedy adaptation \"Exit to Eden\" (1994).  Wilcox had a number of different projects under her belt in the nineties and the early 2000s, including the Morgan Freeman and Brad Pitt box office smash \"Seven\" (1995), \"Dear God\" with Greg Kinnear (1996) and the Julia Roberts and Richard Gere box office smash \"Runaway Bride\" (1999). Her credits also expanded to \"The Other Sister\" (1999) starring Juliette Lewis and the Julie Andrews and Anne Hathaway smash hit \"The Princess Diaries\" (2001). Most recently, Wilcox acted in \"Ready or Not\" (2009) with Christian Oliver. Wilcox was married to Alex Rocco.",
        "birthday": "1943-05-21",
        "deathday": "2023-09-02",
        "gender": 1,
        "homepage": null,
        "id": 95469,
        "imdb_id": "nm0928279",
        "known_for_department": "Acting",
        "name": "Shannon Wilcox",
        "place_of_birth": null,
        "popularity": 0.1593,
        "profile_path": "/4GPHCEcw02i2QN94EGfRIu04ymV.jpg"
    }
}