{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jLq0ol1f0ZKXni9R9GsPBcyPrNN.jpg",
                "genre_ids": [
                    18
                ],
                "id": 18148,
                "original_language": "ja",
                "original_title": "東京物語",
                "overview": "The elderly Shukishi and his wife, Tomi, take the long journey from their small seaside village to visit their adult children in Tokyo. Their elder son, Koichi, a doctor, and their daughter, Shige, a hairdresser, don't have much time to spend with their aged parents, and so it falls to Noriko, the widow of their younger son who was killed in the war, to keep her in-laws company.",
                "popularity": 3.9251,
                "poster_path": "/g2YbTYKpY7N2yDSk7BfXZ18I5QV.jpg",
                "release_date": "1953-11-03",
                "title": "Tokyo Story",
                "video": false,
                "vote_average": 8.169,
                "vote_count": 1142,
                "character": "Noriko Hirayama",
                "credit_id": "52fe47639251416c750978bd",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "原 節子",
            "Masae Aida",
            "ستسوکو هارا"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nSetsuko Hara (June 17, 1920 – September 5, 2015) was a Japanese actress who appeared in six of Yasujirō Ozu's films, most notably as Noriko in the \"Noriko Trilogy\": Late Spring (1949), Early Summer (1951), and Tokyo Story (1953). Her other films for Ozu were Tokyo Twilight (1957), Late Autumn (1960), and finally The End of Summer in 1961.\n\nShe was born  Masae Aida in Yokohama, Kanagawa prefecture. She came to prominence as an actress at an early age, in the 1937 German-Japanese co-production Die Tochter des Samurai (Daughter of the Samurai), known in Japan as Atarashiki Tsuchi (The New Earth), directed by Arnold Fanck and Mansaku Itami.\n\nShe also starred in films by Akira Kurosawa, Mikio Naruse, and other prominent directors.\n\nShe was called \"the Eternal Virgin\" in Japan and is a symbol of the golden era of Japanese cinema of the 1950s. She suddenly quit acting in 1963 (the same year as Ozu's death), and led a secluded life in Kamakura, refusing all interviews and photographs. Her last major role was Riku, wife of Ōishi Yoshio, in the 1962 film Chushingura. She was the inspiration for the protagonist of the 2001 movie Millennium Actress.\n\nDescription above from the Wikipedia article Setsuko Hara, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1920-06-17",
        "deathday": "2015-09-05",
        "gender": 1,
        "homepage": null,
        "id": 95504,
        "imdb_id": "nm0361697",
        "known_for_department": "Acting",
        "name": "Setsuko Hara",
        "place_of_birth": "Yokohama, Kanagawa, Japan",
        "popularity": 1.744,
        "profile_path": "/zaiy9COvjUVGV6q9x7ptuZeuTCa.jpg"
    }
}