{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3m9hY5uixci0XpUawRG0mGEUe4r.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 984,
                "original_language": "en",
                "original_title": "Dirty Harry",
                "overview": "When a madman dubbed 'Scorpio' terrorizes San Francisco, hard-nosed cop, Harry Callahan – famous for his take-no-prisoners approach to law enforcement – is tasked with hunting down the psychopath.",
                "popularity": 3.0664,
                "poster_path": "/scl2JDHzYoIEs5xyYy5ITCfyY0G.jpg",
                "release_date": "1971-12-23",
                "title": "Dirty Harry",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 2588,
                "character": "Chief",
                "credit_id": "560d6253925141478d000a1a",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harold Aronin",
            "Harry Larch",
            "جان لارچ"
        ],
        "biography": "John Larch (October 4, 1914 - October 16, 2005) was an American film and television actor.\n\nAfter his lead role in the radio serial Captain Starr of Space (1953–54), John Larch entered films in 1954. He usually appeared in westerns (How The West Was Won) and action films, including Miracle of the White Stallions as General George S. Patton Jr. (1963), Collision Course: Truman vs. MacArthur as General Omar Bradley (1976), replacing James Gregory as Mac in the Matt Helm movie The Wrecking Crew (1969) starring Dean Martin, Sharon Tate and Elke Sommer. Larch, an old friend of Clint Eastwood, appeared in Eastwood films, including Dirty Harry (1971) and Play Misty for Me (1971).\n\nHe also appeared on a number of television programs, including Naked City (three episodes), Route 66 (three episodes), The Fugitive (two episodes), The Invaders, The Restless Gun (four episodes), Gunsmoke (seven episodes), The Virginian (four episodes), Bonanza, Hawaii Five-0, Mission Impossible (two episodes), The Troubleshooters, Bus Stop, Laramie, The Law and Mr. Jones, and possibly most famously as Bill Mumy's father in The Twilight Zone episode \"It's a Good Life\" in 1961. He also appeared in two other The Twilight Zone episodes, playing a psychiatrist in \"Perchance to Dream\" and the sheriff in \"Dust\".\n\nDescription above from the Wikipedia article John Larch, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1914-10-04",
        "deathday": "2005-10-16",
        "gender": 2,
        "homepage": null,
        "id": 95564,
        "imdb_id": "nm0488024",
        "known_for_department": "Acting",
        "name": "John Larch",
        "place_of_birth": "Salem, Massachusetts, USA",
        "popularity": 0.5474,
        "profile_path": "/7vKSk4RnjeUTDgdvmeo98JBj2g2.jpg"
    }
}