{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bhEJZ6XH1B9ld97OWppdAnvWzl5.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11165,
                "original_language": "en",
                "original_title": "Tora! Tora! Tora!",
                "overview": "In the summer of 1941, the United States and Japan seem on the brink of war after constant embargos and failed diplomacy come to no end. \"Tora! Tora! Tora!\", named after the code words used by the lead Japanese pilot to indicate they had surprised the Americans, covers the days leading up to the attack on Pearl Harbor, which plunged America into the Second World War.",
                "popularity": 2.9005,
                "poster_path": "/c311sN931DixuZRer0JGYCwpx9N.jpg",
                "release_date": "1970-01-26",
                "title": "Tora! Tora! Tora!",
                "video": false,
                "vote_average": 7.149,
                "vote_count": 566,
                "character": "Vice Adm. William S. Pye (uncredited)",
                "credit_id": "61e8f6e49c24fc001c9a2d5a",
                "order": 79
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Walter Reed Smith"
        ],
        "biography": "Walter Reed (born Walter Reed Smith), was an American stage, film and television actor.  Reed was born in 1916 in Fort Ward, Washington. Following a stint as a Broadway actor, Reed broke into films in 1941. He appeared in several features for RKO Radio Pictures, including the last two Mexican Spitfire comedies (in which Reed replaced Buddy Rogers as the Spitfire's husband). Perhaps his most memorable role was as the spineless wagon driver husband of Gail Russell in the western Seven Men from Now. Reed also appeared in the very first Superman theatrical feature film Superman and the Mole Men in 1951.\n\nIn 1951, Reed made two film serials for Republic Pictures; Reed strongly resembled former Republic leading man Ralph Byrd, enabling Republic to insert old action scenes of Byrd into the new Reed footage. Republic wanted to sign Reed for additional serials but Reed declined, preferring not to be typed as a serial star.\n\nAfter appearing in 90 films and numerous television programs, such as John Payne's The Restless Gun, Reed changed careers and became a real estate investor and broker in Santa Cruz, California in the late 1960s.",
        "birthday": "1916-02-10",
        "deathday": "2001-08-20",
        "gender": 2,
        "homepage": null,
        "id": 95563,
        "imdb_id": "nm0715748",
        "known_for_department": "Acting",
        "name": "Walter Reed",
        "place_of_birth": "Fort Ward, Washington, USA",
        "popularity": 0.9991,
        "profile_path": "/e6smBlNUgVXIR3QGHI6yTndHQRo.jpg"
    }
}