{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 17.5242,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 23539,
                "character": "Waiter in Florence Café",
                "credit_id": "5623d3a8c3a3680e1600d8e2",
                "order": 86
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia. Jake Canuso (Carmine Canuso) was born in Switzerland to Italian descendants. In his late teens he trained as a professional dancer in London.\n\nCanuso has worked with Elton John, Annie Lennox, featured in Take That's \"Sure\" video and was a backing dancer for the Spice Girls SpiceWorld 1998 tour, where he befriended Louie Spence and Emma Bunton. He is best known for his role in the ITV series Benidorm as the barman Mateo. Canuso can speak six languages fluently including English, Spanish and Italian. Description above from the Wikipedia article Jake Canuso, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1970-01-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 95577,
        "imdb_id": "nm1569609",
        "known_for_department": "Acting",
        "name": "Jake Canuso",
        "place_of_birth": "Zurich, Switzerland",
        "popularity": 0.1102,
        "profile_path": "/vzOkr261d23tdtMhXJp6cC2gkfu.jpg"
    }
}