{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 1117,
                "character": "Porter (uncredited)",
                "credit_id": "52fe4384c3a36847f805a04b",
                "order": 55
            },
            {
                "adult": false,
                "backdrop_path": "/a3eYLIK5eYSHAJTtOy9PdciVjxx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 28580,
                "original_language": "en",
                "original_title": "The Lost Weekend",
                "overview": "Don Birnam, a long-time alcoholic, has been sober for ten days and appears to be over the worst... but his craving has just become more insidious. Evading a country weekend planned by his brother and girlfriend, he begins a four-day bender that just might be his last - one way or another.",
                "popularity": 2.7953,
                "poster_path": "/8ggIOoCzt8xT2ePl8DdlRtXgcOh.jpg",
                "release_date": "1945-11-29",
                "title": "The Lost Weekend",
                "video": false,
                "vote_average": 7.628,
                "vote_count": 629,
                "character": "Washroom Attendant at Harry & Joe's (uncredited)",
                "credit_id": "55e734479251416c1f000342",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "'Snowflake'",
            "Snowflake",
            "Snow Flake",
            "Fred S. Toones",
            "Fred Toones",
            "'Snowflake' Toones",
            "Snowflake Toones"
        ],
        "biography": "Fred \"Snowflake\" Toones was a character actor who appeared in over 200 films between 1928 and 1951. He often worked under contract for Republic Pictures, appearing in about 40 of its films.\n\nHe played a bootblack or shoeshine man in at least six of his movies, and Toones actually ran the shoeshine stand at Republic Studios.\n\nHe first appeared as a porter in 1932 in The Hurricane Express and was usually typecast as a porter - appearing in over 50 films in such a role. He also played a variety of other service-oriented or domestic worker roles such as stable grooms, janitors, elevator operators, valets, cooks, bellhops, doormen, butlers, and bartenders. Like other actors of the time, i.e. Anna May Wong and Franklin Pangborn, Toones is a prime example of racial and social stereotyping in the Hollywood film industry.\n\nHis standard characterization was that of a middle-aged \"colored\" man with a high-pitched voice and childlike mannerisms.\n\n\"Snowflake\" was the stage name Toones was best known by, and he used this name as his credit as early as his third film, 1931's Shanghaied Love. Likewise, in Shanghaied Love and over 35 other films, \"Snowflake\" was also Toones' character name.\n\nHe acted in films such as Mississippi (1935), Hawk of the Wilderness (1938), and Daredevils of the Red Circle (1939) with Bruce Bennett and in many \"B\" westerns such as The Lawless Nineties (1936) with John Wayne. He also appeared in dozens of two-reelers such as Columbia's Woman Haters (1934) with the Three Stooges, and had a bit role in Laurel and Hardy's classic feature Way Out West (1937). Toones is also a familiar face in four Preston Sturges comedies: Twentieth Century (1934), Remember the Night (1940), Christmas in July (1940), and The Palm Beach Story (1942).\n\nHe died on 13 February 1962 in Los Angeles, California, USA.",
        "birthday": "1906-01-05",
        "deathday": "1962-02-13",
        "gender": 2,
        "homepage": null,
        "id": 955809,
        "imdb_id": "nm0867560",
        "known_for_department": "Acting",
        "name": "Fred 'Snowflake' Toones",
        "place_of_birth": "North Carolina, USA",
        "popularity": 2.0122,
        "profile_path": "/ln1te8Hh26rrbP8chktKEFLT6ol.jpg"
    }
}