{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8BTsTfln4jlQrLXUBquXJ0ASQy9.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 140607,
                "original_language": "en",
                "original_title": "Star Wars: The Force Awakens",
                "overview": "Thirty years after defeating the Galactic Empire, Han Solo and his allies face a new threat from the evil Kylo Ren and his army of Stormtroopers.",
                "popularity": 10.3096,
                "poster_path": "/wqnLdwVXoBjKibFRR5U3y0aDUhs.jpg",
                "release_date": "2015-12-15",
                "title": "Star Wars: The Force Awakens",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 19970,
                "character": "FN-9330",
                "credit_id": "582ae1349251417b1d040c82",
                "order": 40
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/rUAZnGMgISkZYJU8o7kuSNj3mPl.jpg",
                "genre_ids": [
                    28,
                    35,
                    10749
                ],
                "id": 22538,
                "original_language": "en",
                "original_title": "Scott Pilgrim vs. the World",
                "overview": "As bass guitarist for a garage-rock band, Scott Pilgrim has never had trouble getting a girlfriend; usually, the problem is getting rid of them. But when Ramona Flowers skates into his heart, he finds she has the most troublesome baggage of all: an army of ex-boyfriends who will stop at nothing to eliminate him from her list of suitors.",
                "popularity": 8.3435,
                "poster_path": "/g5IoYeudx9XBEfwNL0fHvSckLBz.jpg",
                "release_date": "2010-08-12",
                "title": "Scott Pilgrim vs. the World",
                "video": false,
                "vote_average": 7.489,
                "vote_count": 8210,
                "credit_id": "64e00b0237109700ac44e586",
                "department": "Sound",
                "job": "Original Music Composer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nigel Timothy Godrich "
        ],
        "biography": "Nigel Timothy Godrich (born 28 February 1971) is an English record producer, recording engineer and musician. He has worked with acts including Radiohead, Travis, Beck, Air, Paul McCartney, U2, R.E.M., Pavement, Roger Waters, Arcade Fire and Idles.\n\nEarly in his career, Godrich worked as the house engineer at RAK Studios, London, under the producer John Leckie. He first worked with Radiohead while engineering their second album, The Bends (1995), at RAK. Radiohead hired him to produce OK Computer (1997), which was a major success and brought him attention from major artists. He has produced all of Radiohead's albums since, along with several other projects with the Radiohead members Thom Yorke and Jonny Greenwood. Godrich won the Grammy Award for Best Engineered Non-Classical Album for the 2003 Radiohead album Hail to the Thief.\n\nGodrich is a member of the bands Atoms for Peace (with Yorke) and Ultraísta. In 2006, he launched the music webseries From the Basement. With Beck, Godrich composed the score for the 2010 film Scott Pilgrim vs. the World.\n\nDescription above from the Wikipedia article Nigel Godrich, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1971-02-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 957038,
        "imdb_id": "nm1021531",
        "known_for_department": "Acting",
        "name": "Nigel Godrich",
        "place_of_birth": "Westminster, London, England",
        "popularity": 0.928,
        "profile_path": "/1vmCVU9C7rqTegIgNeI7ZwyAwGN.jpg"
    }
}