{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.9792,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5415,
                "character": "Babet",
                "credit_id": "52fe486c9251416c9108c16d",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/4BOgSGwEEHZuDhiHUOsrXaJBqoc.jpg",
                "genre_ids": [
                    36,
                    18,
                    28
                ],
                "id": 617653,
                "original_language": "en",
                "original_title": "The Last Duel",
                "overview": "King Charles VI declares that Knight Jean de Carrouges settle his dispute with his squire, Jacques Le Gris, by challenging him to a duel.",
                "popularity": 6.1744,
                "poster_path": "/zjrJE0fpzPvX8saJXj8VNfcjBoU.jpg",
                "release_date": "2021-10-13",
                "title": "The Last Duel",
                "video": false,
                "vote_average": 7.422,
                "vote_count": 3604,
                "character": "Henri",
                "credit_id": "62f10644af9590007d9250ce",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/enNubozHn9pXi0ycTVYUWfpHZm.jpg",
                "genre_ids": [
                    18,
                    28,
                    80,
                    53
                ],
                "id": 155,
                "original_language": "en",
                "original_title": "The Dark Knight",
                "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
                "popularity": 45.0503,
                "poster_path": "/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
                "release_date": "2008-07-16",
                "title": "The Dark Knight",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 34382,
                "character": "Corrections Officer",
                "credit_id": "560c2ef0925141501900025e",
                "order": 88
            },
            {
                "adult": false,
                "backdrop_path": "/a2Aj5ksEo2HOUH3FbGyZCtaJM4C.jpg",
                "genre_ids": [
                    18,
                    36,
                    80
                ],
                "id": 3131,
                "original_language": "en",
                "original_title": "Gangs of New York",
                "overview": "In early 1860s New York, Irish immigrant Amsterdam Vallon is released from prison and returns to the Five Points, seeking revenge against his father's killer, William Cutting, a powerful anti-immigrant gang leader. He knows that revenge can only be attained by infiltrating Cutting's inner circle. Vallon's journey becomes a fight for personal survival and to find a place for the Irish people.",
                "popularity": 5.1428,
                "poster_path": "/lemqKtcCuAano5aqrzxYiKC8kkn.jpg",
                "release_date": "2002-12-14",
                "title": "Gangs of New York",
                "video": false,
                "vote_average": 7.316,
                "vote_count": 6866,
                "character": "Slaughter Housers Leader",
                "credit_id": "5abfc028c3a36844480310ca",
                "order": 89
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Married to the actress Victoria Donovan. He turned professional in 1996 when, with no formal training, landed a role in the critically acclaimed, West End revival of \"Jesus Christ Superstar\" in London. He understudied and played Valjean in the legendary London musical.\n\nPlayed Quasimodo in Notre Dame de Paris at The Dominion Theatre.\n\nHas performed in two different productions of Macbeth, at The Globe and in Edward Hall's version with Sean Bean and Samantha Bond. He toured America with The RSC in The Canterbury Tales, later touring the US in the multi-award winning \"Black Watch\", directed by John Tiffany, appearing as The Officer,.\n\nTelevision credits include series regular: Captain Dragonetti in David S. Goyer's Da Vinci's Demons. (3 seasons) Elfrick in World Without End directed by Michael Caton Jones.\n\nRoles in Endeavour, Misfits, Ripper Street, Five Daughters, Dalziel and Pascoe, The Knock, Eastenders, Casuality, Holby City, The Bill, Family Affairs, and his proudest moment in 4 episodes in the iconic Grange Hill.\n\nDie Another Day, Gangs Of New York, Les Miserables and The Dark Night are some of the blockbuster movies in which he has appeared.\n\nHas featured in a number of Independent feature films of critical acclaim, including as Chae Strachan in Sunset Song, directed by the iconic Terence Davies, and Tommy's Honour, which won best film at The Scottish BAFTA's in 2017, directed by Jason Connery.\n\nOther features include : I am Soldier, Pressure, Who Needs Enemies, The Wee Man, The Last Photograph, Hummingbird, Winter Ridge.\n\nIn 2018 he can be seen in The Terror on AMC and appears as Brian McClay in the Movie Calibre starring Jack Lowden.\n\nHe is represented by Sophie Austin at United Agents and managed by Lena Roklin in the US.",
        "birthday": "1966-01-15",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.unitedagents.co.uk/ian-pirie",
        "id": 95716,
        "imdb_id": "nm1128414",
        "known_for_department": "Acting",
        "name": "Ian Pirie",
        "place_of_birth": "Aberdeen, Aberdeenshire, Scotland, UK",
        "popularity": 0.2089,
        "profile_path": "/63VIC2jPUgrhSLvwAcbn3NeCFF5.jpg"
    }
}