{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xWT5F1DNxciNLEMXRl49iq8zvN7.jpg",
                "genre_ids": [
                    14,
                    16,
                    10751
                ],
                "id": 9479,
                "original_language": "en",
                "original_title": "The Nightmare Before Christmas",
                "overview": "Tired of scaring humans every October 31 with the same old bag of tricks, Jack Skellington, the spindly king of Halloween Town, kidnaps Santa Claus and plans to deliver shrunken heads and other ghoulish gifts to children on Christmas morning. But as Christmas approaches, Jack's rag-doll girlfriend, Sally, tries to foil his misguided plans.",
                "popularity": 13.022,
                "poster_path": "/oQffRNjK8e19rF7xVYEN8ew0j7b.jpg",
                "release_date": "1993-10-09",
                "title": "The Nightmare Before Christmas",
                "video": false,
                "vote_average": 7.834,
                "vote_count": 9891,
                "character": "Oogie Boogie (voice)",
                "credit_id": "578118bd92514173fe00105a",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kenneth Page"
        ],
        "biography": "Born in St. Louis, Missouri, Page began in the chorus before making his Broadway debut in The Wiz playing The Cowardly Lion. He made a large number of stage appearances but also performed as a cabaret singer with an act entitled Page by Page.\n\nPage also appeared on screen making his television debut in 1984 and film debut in 1988's Torch Song Trilogy. He appeared as the voice of Oogie Boogie in The Nightmare Before Christmas and related video games, in Dreamgirls as Max Webster and in such television programmes as Sable and Adventures in Wonderland.\n\nPage appeared in a number of roles on stage, originating the part of Ken in Ain't Misbehavin' and appearing as Old Deuteronomy in Cats on both Broadway and in the filmed production. He also originated the part of Father in Children of Eden, played The Cowardly Lion in several productions of The Wizard of Oz and appeared in Disney musicals Beauty and the Beast and The Little Mermaid.\n\nPage also sang in his animated voice roles, performing the duet \"Let's Make Music Together\" in All Dogs Go to Heaven and \"The Oogie Boogie Song\" in The Nightmare Before Christmas.",
        "birthday": "1954-01-20",
        "deathday": "2024-09-30",
        "gender": 2,
        "homepage": null,
        "id": 95758,
        "imdb_id": "nm0656238",
        "known_for_department": "Acting",
        "name": "Ken Page",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.1166,
        "profile_path": "/pF2kpxQ9ycQyw3LvhmE5oJ4XQf1.jpg"
    }
}