{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y7pnEmBotaowRY0o8V33r4JuRNS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 26617,
                "original_language": "en",
                "original_title": "Five Easy Pieces",
                "overview": "A drop-out from upper-class America picks up work along the way on oil-rigs when his life isn't spent in a squalid succession of bars, motels, and other points of interest.",
                "popularity": 2.0137,
                "poster_path": "/xGLkuMWigSPLBvWiENSMlVq56iE.jpg",
                "release_date": "1970-09-12",
                "title": "Five Easy Pieces",
                "video": false,
                "vote_average": 7.123,
                "vote_count": 551,
                "character": "Waitress",
                "credit_id": "52fe450ec3a368484e04607b",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/8yE0aOQoZSSl2CuuPvjxdHuQl4P.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 10514,
                "original_language": "en",
                "original_title": "The Andromeda Strain",
                "overview": "When virtually all of the residents of Piedmont, New Mexico, are found dead after the return to Earth of a space satellite, the head of the US Air Force's Project Scoop declares an emergency. A group of eminent scientists led by Dr. Jeremy Stone scramble to a secure laboratory and try to first isolate the life form while determining why two people from Piedmont - an old alcoholic and a six-month-old baby - survived. The scientists methodically study the alien life form unaware that it has already mutated and presents a far greater danger in the lab, which is equipped with a nuclear self-destruct device designed to prevent the escape of dangerous biological agents.",
                "popularity": 4.67,
                "poster_path": "/4FBSFz8wLpxd4o6hnvKOJJ8WSIz.jpg",
                "release_date": "1971-03-12",
                "title": "The Andromeda Strain",
                "video": false,
                "vote_average": 7.054,
                "vote_count": 736,
                "character": "Woman (uncredited)",
                "credit_id": "68cdaa960d67e77283748ea6",
                "order": 68
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lorna Patricia Casey"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nLorna Thayer (10 March 1919 - June 4, 2005) was an American character actress.\n\nThayer was born in Boston, the daughter of silent screen actress Louise Gibney. She appeared often in theatre and on television. In 1955 she played in The Beast with a Million Eyes with Paul Birch. She played minor roles in the films The Lusty Men, Texas City and Frankie and Johnny.\n\nIt was her role in the iconic 1970 film Five Easy Pieces as the waitress who refuses to allow Jack Nicholson's character to order a side of wheat toast that she is most likely to be remembered for and identified with. The scene has come to be known as the \"chicken salad scene\".\n\nShe died at the Motion Picture and Television Fund Retirement Home in Woodland Hills, California aged 86, after battling Alzheimer's disease for five years.\n\nDescription above from the Wikipedia article Lorna Thayer, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1919-03-10",
        "deathday": "2005-06-04",
        "gender": 1,
        "homepage": null,
        "id": 95787,
        "imdb_id": "nm0857213",
        "known_for_department": "Acting",
        "name": "Lorna Thayer",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.221,
        "profile_path": "/4Kv2rPmvSjMm8kog3pFcDhN2qjY.jpg"
    }
}