{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGDXh6QU6CRqHVXfoYOBwqEnBVO.jpg",
                "genre_ids": [
                    28,
                    36,
                    10752
                ],
                "id": 10590,
                "original_language": "en",
                "original_title": "We Were Soldiers",
                "overview": "The story of the first major battle of the American phase of the Vietnam War and the soldiers on both sides that fought it.",
                "popularity": 3.0746,
                "poster_path": "/d5uupBAORxnFNbkNQ2G0Bi2cpY8.jpg",
                "release_date": "2002-03-01",
                "title": "We Were Soldiers",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 2147,
                "character": "Mr. Nik",
                "credit_id": "55d212e8c3a3685875007747",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Vien Hong is a Chinese-Vietnamese American actor and former martial artist based in Los Angeles best known for his role in \"Glory Daze\" and \"This is Us\". Born in Vietnam, Vien and his family resettled in Southern California as refugees. Before he even graduated high school, Vien began his career when he booked a small part in \"Gleaming the Cube\" starring Christian Slater. From there, he decided to further pursue acting where he received a BFA and graduated magna cum laude at NYU.\n\nHe would be best known for his role in \"Glory Daze\" as the college dropout Slosh, an onscreen friend of Ben Affleck's character. From there, he would land many co-stars and guest stars from \"ER,\" \"Sabrina the Teenage Witch,\" \"The Shield,\" and more. He also studied martial arts in his youth, specializing specifically in Wushu and Wing Chun.\n\nIn 2005, Vien took a 15 year hiatus from acting, but eventually made his acting comeback on season five of \"This is Us\" where he recurred as Hai Lang, a man with mysterious connect with Randall Pearson.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 95852,
        "imdb_id": "nm0393268",
        "known_for_department": "Acting",
        "name": "Vien Hong",
        "place_of_birth": null,
        "popularity": 0.0742,
        "profile_path": "/Al208S5NlMKPGHyuaZfoH6HTlxY.jpg"
    }
}