{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8ln5VUVk7gnNGIb2VNgw8nICDVt.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751
                ],
                "id": 35,
                "original_language": "en",
                "original_title": "The Simpsons Movie",
                "overview": "After Homer accidentally pollutes the town's water supply, Springfield is encased in a gigantic dome by the EPA and the Simpsons are declared fugitives.",
                "popularity": 7.3429,
                "poster_path": "/s3b8TZWwmkYc2KoJ5zk77qB6PzY.jpg",
                "release_date": "2007-07-25",
                "title": "The Simpsons Movie",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 8279,
                "character": "Billie Joe Armstrong (voice)",
                "credit_id": "52fe4211c3a36847f800160f",
                "order": 14
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/yDHYTfA3R0jFYba16jBB1ef8oIt.jpg",
                "genre_ids": [
                    28,
                    35,
                    878
                ],
                "id": 533535,
                "original_language": "en",
                "original_title": "Deadpool & Wolverine",
                "overview": "A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine.",
                "popularity": 33.6195,
                "poster_path": "/8cdWjvZQUExUUTzyp4t6EDMubfO.jpg",
                "release_date": "2024-07-24",
                "title": "Deadpool & Wolverine",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 7745,
                "credit_id": "68356fbcab37727a162b7a54",
                "department": "Sound",
                "job": "Songs"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Green Day"
        ],
        "biography": "Billie Joe Armstrong (born February 17, 1972) is an American singer, songwriter, musician, record producer, and actor. Armstrong serves as the lead vocalist, primary songwriter, and lead guitarist of the punk rock band Green Day, co-founded with Mike Dirnt. He is also a guitarist and vocalist for the punk rock band Pinhead Gunpowder, and provides lead vocals for Green Day's side projects Foxboro Hot Tubs, The Network, The Longshot and The Coverups.\n\nRaised in Rodeo, California, Armstrong developed an interest in music at a young age, and recorded his first song at the age of five. He met Mike Dirnt while attending elementary school, and the two instantly bonded over their mutual interest in music, forming the band Sweet Children when the two were 14 years old. The band changed its name to Green Day, and would later achieve commercial success. Armstrong has also pursued musical projects outside of Green Day's work, including numerous collaborations with other musicians.\n\nIn 1997, to coincide with the release of Nimrod, Armstrong founded Adeline Records in Oakland to help support other bands releasing music, and signed bands such as The Frustrators, AFI and Dillinger Four. The record company later came under the management of Pat Magnarella and finally shut down in August 2017.\n\nDescription above from the Wikipedia article Billie Joe Armstrong, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1972-02-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 95866,
        "imdb_id": "nm0035626",
        "known_for_department": "Acting",
        "name": "Billie Joe Armstrong",
        "place_of_birth": "Oakland, California, USA",
        "popularity": 0.4237,
        "profile_path": "/upYUoLOi7xypknbNQmYVbLCekM4.jpg"
    }
}