{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fMQGVBk0ZyzxMQOBGkUazCkvMMR.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 38408,
                "original_language": "en",
                "original_title": "Life As We Know It",
                "overview": "After a disastrous first date for caterer Holly and network sports director Messer, all they have in common is a dislike for each other and their love for their goddaughter Sophie. But when they suddenly become all Sophie has in this world, Holly and Messer must set their differences aside. Juggling careers and social calendars, they'll have to find common ground while living under the same roof.",
                "popularity": 2.8541,
                "poster_path": "/zLzS2aOqKsS0QvEaY6SfBw4VBqh.jpg",
                "release_date": "2010-10-02",
                "title": "Life As We Know It",
                "video": false,
                "vote_average": 6.905,
                "vote_count": 3195,
                "character": "Scott",
                "credit_id": "5883830b925141045d00ab79",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Andy Daly",
            "Dalton Wilcox",
            "Andrew Daly",
            "アンドリュー・デイリー",
            "أندرو دالي"
        ],
        "biography": "Andy Daly, born on April 15, 1971, is an American actor, comedian, and writer celebrated for his versatile comedic talents and sharp wit. His journey into comedy began with improvisational theatre, honing his skills and developing a knack for creating memorable characters.\n\nDaly gained prominence through various comedic roles in television and film. He showcased his talent for improvisation and character-driven comedy in shows like \"Mad TV\" and \"Reno 911!\" where his ability to portray a wide range of eccentric personalities became evident.\n\nOne of his most notable projects includes the Comedy Central series \"Review,\" where he portrayed the character Forrest MacNeil, a critic who reviews life experiences, leading to hilariously absurd situations. Daly's impeccable comedic timing and commitment to his characters earned him critical acclaim and a devoted fan following.\n\nAndy Daly's contributions to podcasts like \"Comedy Bang! Bang!\" have been a whirlwind of comedic brilliance. As a frequent guest on the podcast, his appearances have been a masterclass in improvisation and character creation. Daly's ability to seamlessly slip into a myriad of absurd and hilarious personas has left listeners in stitches.\n\nAndy Daly's career is a testament to his comedic versatility and talent for creating memorable characters that leave a lasting impact. His dedication to the craft of comedy has solidified his position as a respected and admired figure in the comedy world.",
        "birthday": "1971-04-15",
        "deathday": null,
        "gender": 2,
        "homepage": "https://andydaly.com/",
        "id": 95875,
        "imdb_id": "nm0198408",
        "known_for_department": "Acting",
        "name": "Andy Daly",
        "place_of_birth": "Mount Kisco, New York, USA",
        "popularity": 0.4441,
        "profile_path": "/mBbtTnfcxkFXH3RPomSO4VCyxYS.jpg"
    }
}