{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uYRnUnBE4kk5ocvyBckRfMAsZpJ.jpg",
                "genre_ids": [
                    12,
                    10749,
                    10752
                ],
                "id": 22584,
                "original_language": "en",
                "original_title": "To Have and Have Not",
                "overview": "A Martinique charter boat skipper gets mixed up with the underground French resistance operatives during WWII.",
                "popularity": 1.3147,
                "poster_path": "/m9RYIio23yClaO3fy5tcpYac1Gf.jpg",
                "release_date": "1945-01-20",
                "title": "To Have and Have Not",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 537,
                "character": "Mme. Hellene de Bursac",
                "credit_id": "52fe4446c3a368484e019e95",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jaqueline  Moran"
        ],
        "biography": "Dolores Moran (January 27, 1924 – February 5, 1982) was an American film actress and model.\n\nMoran's brief career as a film actress began in 1942 with some uncredited roles in such films as Yankee Doodle Dandy. By 1943 she had become a popular pin-up girl and appeared on the cover of such magazines as Yank. She was given supporting roles in films such as Old Acquaintance (1943) with Bette Davis and Warner Bros. attempted to increase interest in her, promoting her along with Lauren Bacall as a new screen personality when they co-starred with Humphrey Bogart in To Have and Have Not (1944). The film made a star of Bacall, but Moran languished and her subsequent films did little to further her career, this probably had something to do with Howard Hawk's decision to marginalise Moran in order to boost the screen presence of Bacall, excising some of Moran's scenes.\n\nThe Horn Blows at Midnight gave her a leading role with Jack Benny and Alexis Smith but her film appearances after this were sporadic, and she suffered ill health that reduced her ability to work. Her film career ended in 1954 with a featured role in the John Payne and Lizabeth Scott western film Silver Lode.\n\nShe was married to the film producer Benedict E. Bogeaus in Salome, Arizona, in 1946. Their son, Brett Benedict, born August 30, 1948, in Hollywood, later became a successful businessman. They divorced in 1962, he died of a heart attack in 1968. Moran had an affair with director Howard Hawks while filming To Have and Have Not, which Hawks undertook mainly as revenge for his rejection by Bacall in favour of Bogart.\n\nIn 1982, Dolores Moran died of cancer. She was survived by her son, sister, and mother.\n\nDescription above from the Wikipedia article Dolores Moran, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1924-01-27",
        "deathday": "1982-02-05",
        "gender": 1,
        "homepage": null,
        "id": 95965,
        "imdb_id": "nm0602834",
        "known_for_department": "Acting",
        "name": "Dolores Moran",
        "place_of_birth": "Stockton, California, USA",
        "popularity": 0.1904,
        "profile_path": "/gSV1N48yD5oT2aDWzw3gigo1raj.jpg"
    }
}