{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zs1I3ZFUDEWa5rFyph7OrMH1aJ9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 632617,
                "original_language": "en",
                "original_title": "C'mon C'mon",
                "overview": "Johnny and his young nephew forge a tenuous but transformational relationship when they embark on a cross-country trip to see life away from Los Angeles.",
                "popularity": 2.4029,
                "poster_path": "/1oOyJsdcJnnE7cl9bZdUQvBjKNH.jpg",
                "release_date": "2021-11-19",
                "title": "C'mon C'mon",
                "video": false,
                "vote_average": 7.21,
                "vote_count": 726,
                "character": "Wah Vocals (voice)",
                "credit_id": "66a65bd8680969176407cb3f",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Feist"
        ],
        "biography": "Leslie Feist (born February 13, 1976), known mononymously as Feist, is a Canadian and American indie pop singer-songwriter and guitarist, performing both as a solo artist and as a member of the indie rock group Broken Social Scene.\n\nFeist launched her solo music career in 1999 with the release of Monarch. Her subsequent studio albums, Let It Die, released in 2004, and The Reminder, released in 2007, were critically acclaimed and commercially successful, selling over 2.5 million copies. The Reminder earned Feist four Grammy nominations, including a nomination for Best New Artist. She has received 11 Juno Awards, including two Artist of the Year. Her fourth studio album, Metals, was released in 2011. In 2012, Feist collaborated on a split EP with metal group Mastodon, releasing an interactive music video in the process.\n\nShe has released six studio albums as of 2023, Feist received three Juno awards at the 2012 ceremony: Artist of the Year, Adult Alternative Album of the Year for Metals, and Music DVD of the Year for her documentary Look at What the Light Did Now., additionally she was nominated for four Grammy Awards including Best Pop Vocal Album for The Reminder and Best New Artist.\n\nLeslie Feist was born on February 13, 1976, in Amherst, Nova Scotia, Canada. Her parents are both artists. Her father, Harold Feist, was an American-Canadian abstract expressionist painter who taught fine arts at Mount Allison University in Sackville, New Brunswick. Her mother, Lyn Feist, was a student of ceramics from Saskatchewan. After their first child, Ben, was born, the family moved to Sackville.\n\nFeist is also the niece of guitarist Dan Achen, who played in the 1990s rock band Junkhouse and had also produced for numerous artists (Achen died in 2010 due to a heart attack).\n\nFeist's parents divorced soon after she was born and Ben, Feist and their mother moved to Regina, Saskatchewan, where they lived with her grandparents. They later moved to Calgary, Alberta, where she attended Bishop Carroll High School as well as Alternative High School. She aspired to be a writer, and spent much of her youth singing in choirs. At the age of 12, Feist performed as one of 1,000 dancers in the opening ceremonies of the Calgary Winter Olympics, which she cites as inspiration for the video \"1234.\"\n\nAs her father is American, Feist has dual Canadian-U.S. citizenship, joking later that she was given U.S. citizenship as part of a deal with Apple.\n\nIn 1991, at age 15, Feist got her start in music when she founded and was the lead vocalist for a Calgary punk band called Placebo (not to be confused with the English band Placebo). She and her bandmates won a local Battle of the Bands competition and were awarded the opening slot at the festival Infest 1993, featuring the Ramones. At this concert she met Brendan Canning, whose band hHead performed immediately before hers, and with whom she joined in Broken Social Scene ten years later. ...\n\nSource: Article \"Feist (singer)\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1976-02-13",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.listentofeist.com/",
        "id": 96074,
        "imdb_id": "nm1967893",
        "known_for_department": "Acting",
        "name": "Leslie Feist",
        "place_of_birth": "Amherst, Nova Scotia, Canada",
        "popularity": 0.1069,
        "profile_path": "/7bjydVpVok3OigLeJzJn9dTI4d0.jpg"
    }
}