{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ihIVjdiuvtVuFUaCqfNJwajIs3i.jpg",
                "genre_ids": [
                    14,
                    10402
                ],
                "id": 13192,
                "original_language": "en",
                "original_title": "Moonwalker",
                "overview": "Moonwalker is a 1988 American experimental anthology musical film starring Michael Jackson. Rather than featuring one continuous narrative, the film expresses the influence of fandom and innocence through a collection of short films about Jackson, some of which are long-form music videos from Jackson's 1987 album Bad. The film is named after his famous dance, \"the moonwalk\", which he originally learned as \"the backslide\" but perfected the dance into something no one had seen before. The movie's introduction is a type of music video for Jackson's \"Man in the Mirror\" but is not the official video for the song. The film then expresses a montage of Michael's career, which leads into a parody of his Bad video titled \"Badder\", followed by sections \"Speed Demon\" and \"Leave Me Alone\". What follows is the biggest section where Michael plays a hero with magical powers and saves three children from Mr. Big. This section is \"Smooth Criminal\" which leads into a performance of \"Come Together\".",
                "popularity": 3.4878,
                "poster_path": "/3GwTPQkAcgDeAirRpEuJG8HDdRz.jpg",
                "release_date": "1988-10-29",
                "title": "Moonwalker",
                "video": false,
                "vote_average": 6.977,
                "vote_count": 587,
                "character": "Sean",
                "credit_id": "52fe454c9251416c75051c73",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/740KCabjLKjsrxvEakmmJtDtAGY.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 26963,
                "original_language": "en",
                "original_title": "The Secret of Kells",
                "overview": "Adventure awaits 12 year old Brendan who must fight Vikings and a serpent god to find a crystal and complete the legendary Book of Kells. In order to finish Brother Aiden's book, Brendan must overcome his deepest fears on a secret quest that will take him beyond the abbey walls and into the enchanted forest where dangerous mythical creatures hide. Will Brendan succeed in his quest?",
                "popularity": 4.0211,
                "poster_path": "/vBymyj7QsXiW4TICD2JC5pAuBHO.jpg",
                "release_date": "2009-02-09",
                "title": "The Secret of Kells",
                "video": false,
                "vote_average": 7.412,
                "vote_count": 740,
                "character": "Additional Voices and Walla (voice)",
                "credit_id": "5ab6aad0925141396400eebe",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sean Taro Ono Lennon",
            "Sean Lennon"
        ],
        "biography": "Sean Taro Ono Lennon (born October 9, 1975) is a British-American musician, songwriter, producer and multi-instrumentalist. He is the son of John Lennon and Yoko Ono, and half-brother to Julian Lennon.",
        "birthday": "1975-10-09",
        "deathday": null,
        "gender": 2,
        "homepage": "https://seanonolennon.com/",
        "id": 96085,
        "imdb_id": "nm0005141",
        "known_for_department": "Acting",
        "name": "Sean Ono Lennon",
        "place_of_birth": "New York, New York, USA",
        "popularity": 0.1889,
        "profile_path": "/aFwPBczQKc1mgMvq38q9Br8rRhP.jpg"
    }
}