{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/40Rl5nZRxXQ4kHV4Lhghj5iQZZN.jpg",
                "genre_ids": [
                    53,
                    10749,
                    9648
                ],
                "id": 303,
                "original_language": "en",
                "original_title": "Notorious",
                "overview": "In order to help bring Nazis to justice, U.S. government agent T.R. Devlin recruits Alicia Huberman, the American daughter of a convicted German war criminal, as a spy. As they begin to fall for one another, Alicia is instructed to win the affections of Alexander Sebastian, a Nazi hiding out in Brazil. When Sebastian becomes serious about his relationship with Alicia, the stakes get higher, and Devlin must watch her slip further undercover.",
                "popularity": 3.9227,
                "poster_path": "/4RERYb1NIQrJHYY5e8nUlYM7t2z.jpg",
                "release_date": "1946-08-21",
                "title": "Notorious",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 1664,
                "character": "Mr. Hopkins",
                "credit_id": "52fe4235c3a36847f800c295",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Wallace Edgar Brown"
        ],
        "biography": "From Wikipedia\n\nWally Brown (October 9, 1904 – November 13, 1961) was an actor, comedian, and long-time partner of Alan Carney Wally was born in Malden, Massachusetts and served as a vaudevillian. In 1942, he began his film career in Hollywood at RKO Radio Pictures with the film Petticoat Larceny. When RKO decided to emulate the comedy team Abbott and Costello he was paired with Alan Carney, creating \"Brown &amp; Carney.\" They premiered with the military comedies Adventures of a Rookie and its sequel Rookies in Burma. Out of their eight films together, one of their most notable films was Zombies on Broadway co-starring Bela Lugosi, a semi-sequel to Val Lewton's I Walked With a Zombie. Their contracts were terminated in 1946, after which they pursued solo careers. In the 1940s–50s, both appeared in various roles for Leslie Goodwins films. They reunited in 1961 in The Absent-Minded Professor. Wally's last years were filled with guest appearances in television, his last one in My Three Sons. He made several guest appearances on Perry Mason, including the role of murderer Harry Mitchell in the 1958 episode, \"The Case of the Gilded Lily.\" Wally Brown had also been a regular cast member in television shows like I Married Joan, Cimarron City, and Daniel Boone. Along with Alan Carney, he was going to be given a role in It's a Mad, Mad, Mad, Mad World but died not long before filming began. He also served as a regular on The Abbott and Costello Show on radio.",
        "birthday": "1904-10-08",
        "deathday": "1961-11-13",
        "gender": 2,
        "homepage": null,
        "id": 96142,
        "imdb_id": "nm0114878",
        "known_for_department": "Acting",
        "name": "Wally Brown",
        "place_of_birth": "Malden, Massachusetts, USA",
        "popularity": 0.1436,
        "profile_path": "/tJQZuKv2uHCW1feI3r1iBh9sxst.jpg"
    }
}