{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/A63giQFJP4ABqNk4sLzegVeqVdl.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 14574,
                "original_language": "en",
                "original_title": "The Boy in the Striped Pyjamas",
                "overview": "When his family moves from their home in Berlin to a strange new house in Poland, young Bruno befriends Shmuel, a boy who lives on the other side of the fence where everyone seems to be wearing striped pajamas. Unaware of Shmuel's fate as a Jewish prisoner or the role his own Nazi father plays in his imprisonment, Bruno embarks on a dangerous journey inside the camp's walls.",
                "popularity": 7.1324,
                "poster_path": "/sLwYSEVVV3r047cjrpRAbGgNsfL.jpg",
                "release_date": "2008-05-07",
                "title": "The Boy in the Striped Pyjamas",
                "video": false,
                "vote_average": 7.824,
                "vote_count": 7405,
                "character": "Maria",
                "credit_id": "52fe46029251416c7506a071",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/7HOT2ECWeSjZkllpBKa2WfIcwO9.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 419743,
                "original_language": "en",
                "original_title": "Disobedience",
                "overview": "New York photographer Ronit flies to London after learning about the death of her estranged father. Ronit is returning to the same Orthodox Jewish community that shunned her decades earlier for her childhood attraction to Esti, a female friend. Their fortuitous and happy reunion soon reignites their burning passion as the two women explore the boundaries of faith and sexuality.",
                "popularity": 3.9686,
                "poster_path": "/skPT4ffWhlmmDOMNEdxOiP6Emfz.jpg",
                "release_date": "2018-04-24",
                "title": "Disobedience",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1245,
                "character": "Miss Scheinberg",
                "credit_id": "58a12c5b92514107480007af",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/x2FqFdUxRekbNdow3vZdtDqL96z.jpg",
                "genre_ids": [
                    35,
                    18,
                    36
                ],
                "id": 402897,
                "original_language": "en",
                "original_title": "The Death of Stalin",
                "overview": "When dictator Joseph Stalin dies, his parasitic cronies square off in a frantic power struggle to become the next Soviet leader. As they bumble, brawl and back-stab their way to the top, the question remains — just who is running the government?",
                "popularity": 3.7216,
                "poster_path": "/AqH7q89NxGRDAyRWKqsL3OBtYfV.jpg",
                "release_date": "2017-10-20",
                "title": "The Death of Stalin",
                "video": false,
                "vote_average": 7.011,
                "vote_count": 2007,
                "character": "Lidiya Timashuk",
                "credit_id": "591f60039251414990038307",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "카라 호갠"
        ],
        "biography": "Cara Horgan (born 5 October 1984) is a British actress who has appeared on stage, on television, and in films.\n\nHorgan has appeared in several television productions including Peep Show, Traitors, The Rotter's Club, Genius: Picasso and Jane Eyre.\n\nShe has appeared in films including The Boy in the Striped Pyjamas, The Wedding Video, Armando Iannucci's The Death of Stalin and Disobedience alongside Rachel McAdams and Rachel Weisz.\n\nShe appeared in music videos for Years & Years' single \"Desire\" and the Chemical Brothers' song \"I'll See You There\".\n\nIn 2008, Horgan appeared in Hedda, a modern updated version of Hedda Gabler, directed by Carrie Cracknell in which she played the lead character to favourable reviews; reviewer Charles Spencer in The Daily Telegraph wrote that she was \"especially fine as a glamorous, bob-haired Hedda, ... using sex... like a shrimping net\".\n\nIn 2009 she appeared in a revival of Ferdinand Bruckner's Krankheit der Jugend (\"Pains of Youth\"), directed by Katie Mitchell, at the National Theatre. In 2010, she appeared in Caryl Churchill's Far Away at Bristol Old Vic, directed by Simon Godwin.\n\nIn 2011, she performed in The School for Scandal directed by Deborah Warner and written by Richard Brinsley Sheridan.\n\nFrom 2013 to 2015 she joined Sean Holmes ten-member Secret Theatre company at the Lyric Hammersmith, which experimented with improvisational techniques towards drama. For some performances, a cast member's name was chosen from a hat by an audience member to be the show's protagonist; then, he or she would be \"given a series of increasingly impossible acts to accomplish\" which could involve such activities as complex dance routines, wrestling, singing and improvisation, according to one account. She performed with the ensemble for two years to positive reviews. In an extended interview in Exeunt Magazine, she described her work at Secret Theatre as giving her \"freedom to play\".\n\nIn 2015, she appeared in The Mother at the Ustinov Studio in Bath. In 2017 she appeared in Cellmates at The Hampstead Theatre directed by Edward Hall. Paul Taylor in The Independent wrote \"Cara Horgan is delectable in a double as the Russian maid who duets with Bourke in his hammy renditions of “Danny Boy” for his captors and as the wife in a CND couple who have an inconvenient marital meltdown while helping Blake on his first night outside\"",
        "birthday": "1984-10-05",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.advoice.co.uk/clients/cara-horgan/",
        "id": 961840,
        "imdb_id": "nm1728514",
        "known_for_department": "Acting",
        "name": "Cara Horgan",
        "place_of_birth": "South East London, England, UK",
        "popularity": 0.3712,
        "profile_path": "/8J9maL3Zux9Ns9Nzf5ATHiJ0iQ3.jpg"
    }
}