{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lYfHa1AtkUMtplrKx7SRLHpwonW.jpg",
                "genre_ids": [
                    12,
                    14,
                    27
                ],
                "id": 244,
                "original_language": "en",
                "original_title": "King Kong",
                "overview": "Adventurous filmmaker Carl Denham sets out to produce a motion picture unlike anything the world has seen before. Alongside his leading lady Ann Darrow and his first mate Jack Driscoll, they arrive on an island and discover a legendary creature said to be neither beast nor man. Denham captures the monster to be displayed on Broadway as King Kong, the eighth wonder of the world.",
                "popularity": 3.0442,
                "poster_path": "/lHlnxKL5GbgRibyRFI7n1Ey850i.jpg",
                "release_date": "1933-03-15",
                "title": "King Kong",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1544,
                "character": "Theatre Usher (uncredited)",
                "credit_id": "576e8b7e925141245c0024ff",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Willie",
            "William Herman Katt"
        ],
        "biography": "William Herman Katt (born Herman August Wilhelm Katt; May 15, 1915 – September 21, 1992), known as Bill Williams, was an American television and film actor. He is best known for his starring role in the early television series The Adventures of Kit Carson, which aired in syndication from 1951 to 1955.  Williams was born in Brooklyn, New York to German immigrant parents. He attended the Pratt Institute, and became a professional swimmer, performing in underwater shows. He landed a walk-on role as a theater usher in King Kong (1933). He enlisted in the United States Army during World War II, but was discharged before the end and became an actor. His credited debut was in The Blue Room in 1944, using the professional name Bill Williams. His first starring role was opposite Susan Hayward in Deadline at Dawn (1946).\n\nWilliams appeared in ten films before he landed the lead role in television's The Adventures of Kit Carson, which ran for 105 episodes. When the series ended, Williams' star power faded. It was revived in 1957 when he co-starred with Betty White on television in Date with the Angels. Williams portrayed Federal agent Martin Flaherty in The Scarface Mob (1959), the pilot for ABC's The Untouchables. However, when the series was accepted, the role went to Jerry Paris. Williams turned down the lead in Sea Hunt in 1958, believing that an underwater show would not work on television. Lloyd Bridges accepted the part and turned it into a hit. Williams did star as a former Navy frogman in Assignment: Underwater, which ran for just one season. He played a variety of roles on Perry Mason, in which his wife Barbara Hale co-starred as Raymond Burr's secretary Della Street. In a 1962 episode, \"The Case of the Crippled Cougar,\" he played defendant Mike Preston. In 1963, he was murder victim Floyd Grant in \"The Case of the Bluffing Blast.\" In 1965 Williams played murderer Charles Shaw in \"The Case of the Murderous Mermaid,\" and was murderer Burt Payne in \"The Case of the 12th Wildcat\". Williams appeared with his son in a final season episode of Ironside, bringing him together again with Raymond Burr. He also made numerous guest appearances on television and worked in low-budget science fiction films until his retirement.",
        "birthday": "1915-05-21",
        "deathday": "1992-09-21",
        "gender": 2,
        "homepage": null,
        "id": 96243,
        "imdb_id": "nm0930103",
        "known_for_department": "Acting",
        "name": "Bill Williams",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.4196,
        "profile_path": "/yUzvbKsQoobsB1KfoWXf5aA4ntc.jpg"
    }
}