{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7BawlYbO8j434ovY0xTHpaNNE0Y.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 11257,
                "original_language": "en",
                "original_title": "A Room with a View",
                "overview": "When Lucy Honeychurch and chaperon Charlotte Bartlett find themselves in Florence with rooms without views, fellow guests Mr Emerson and son George step in to remedy the situation. Meeting the Emersons could change Lucy's life forever but, once back in England, how will her experiences in Tuscany affect her marriage plans?",
                "popularity": 2.3824,
                "poster_path": "/5xRAqywVo6tNUNQbAESGVP930la.jpg",
                "release_date": "1986-03-07",
                "title": "A Room with a View",
                "video": false,
                "vote_average": 6.941,
                "vote_count": 800,
                "character": "Mrs. Honeychurch",
                "credit_id": "52fe441b9251416c7502908d",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nRosemary Leach (18 December 1935 – 21 October 2017) was a British stage, television and film actress and singer.\n\nShe was born at Much Wenlock, Shropshire. Her parents were teachers related to Edmund Leach. She attended grammar school and RADA. After appearing in repertory theatres and the Old Vic she became well known to UK TV viewers between 1965-69 for playing Susan Wheldon, the mistress of building tycoon John Wilder (Patrick Wymark) in the TV boardroom drama The Power Game.\n\nSubsequently she became a familiar face on British television. In 1973, she played Aldonza/Dulcinea in the BBC production of Don Quixote (retitled The Adventures of Don Quixote), starring Rex Harrison and Frank Finlay. In 1981 she played Emilia opposite Bob Hoskins's Iago in the BBC Shakespeare's production of Othello. In 1982 she played Aunt Fenny in The Jewel in the Crown.\n\nRosemary played a leading role as smitten Joan Plumleigh-Bruce in the six part ITV 1987 production of The Charmer (TV series) which starred Nigel Havers.\n\nIn 1987, she was nominated for BAFTA's Best Supporting Actress for A Room with a View (1985). In 1992, Leach starred in An Ungentlemanly Act, a BBC television film about the first days of the invasion of the Falkland Islands in 1982, portraying the real-life Lady Mavis Hunt, wife of the islands' then-governor, Sir Rex Hunt.\n\nLeach plays the part of Anna in BBC Radio 4's No Commitments, and Susan Harper's mother in My Family. She made a guest appearance as 'Bessie' on Waterloo Road (the TV series), in Series 3 Spring Term. Since 1994, she has made occasional appearances in The Archers as Ellen Rogers, the ex-pat aunt of Nigel Pargetter.\n\nIn 2001 Leach played a leading role as a charming murderess in Destroying Angel, an episode of Midsomer Murders.\n\nRecently she has played Queen Elizabeth II three times: in the 2002 television movie Prince William; in a 2006 updated edition of The Afternoon Play, entitled Tea with Betty; and in 2009's Margaret.\n\nDescription above from the Wikipedia article Rosemary Leach, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1935-12-18",
        "deathday": "2017-10-21",
        "gender": 1,
        "homepage": null,
        "id": 96408,
        "imdb_id": "nm0494863",
        "known_for_department": "Acting",
        "name": "Rosemary Leach",
        "place_of_birth": "Much Wenlock, Shropshire, England, UK",
        "popularity": 0.2248,
        "profile_path": "/yqDbLLo4DTgUTdBxJXBDvflXz1v.jpg"
    }
}