{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fOzPQKNcMzraCh2YGeJVx4zEKtF.jpg",
                "genre_ids": [
                    10402,
                    10749,
                    18
                ],
                "id": 382399,
                "original_language": "en",
                "original_title": "High Strung",
                "overview": "When a hip hop violinist busking in the New York subway encounters a classical dancer on scholarship at the Manhattan Conservatory of the Arts, sparks fly. With the help of a hip hop dance crew they must find a common ground while preparing for a competition that could change their lives forever.",
                "popularity": 4.4033,
                "poster_path": "/xfj4Vomg8h3I1hBHj4GfpduUfkv.jpg",
                "release_date": "2016-04-08",
                "title": "High Strung",
                "video": false,
                "vote_average": 7.05,
                "vote_count": 921,
                "character": "Poptart",
                "credit_id": "5717b695c3a3687bc7001325",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/uVlUu174iiKhsUGqnOSy46eIIMU.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 402431,
                "original_language": "en",
                "original_title": "Wicked",
                "overview": "In the land of Oz, ostracized and misunderstood green-skinned Elphaba is forced to share a room with the popular aristocrat Glinda at Shiz University, and the two's unlikely friendship is tested as they begin to fulfill their respective destinies as Glinda the Good and the Wicked Witch of the West.",
                "popularity": 16.6767,
                "poster_path": "/2E1x1qcHqGZcYuYi4PzVZjzg8IV.jpg",
                "release_date": "2024-11-20",
                "title": "Wicked",
                "video": false,
                "vote_average": 6.932,
                "vote_count": 2407,
                "character": "Dancer",
                "credit_id": "6775929ddd179c5b35926e8b",
                "order": 113
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/uVlUu174iiKhsUGqnOSy46eIIMU.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 402431,
                "original_language": "en",
                "original_title": "Wicked",
                "overview": "In the land of Oz, ostracized and misunderstood green-skinned Elphaba is forced to share a room with the popular aristocrat Glinda at Shiz University, and the two's unlikely friendship is tested as they begin to fulfill their respective destinies as Glinda the Good and the Wicked Witch of the West.",
                "popularity": 16.6767,
                "poster_path": "/2E1x1qcHqGZcYuYi4PzVZjzg8IV.jpg",
                "release_date": "2024-11-20",
                "title": "Wicked",
                "video": false,
                "vote_average": 6.932,
                "vote_count": 2407,
                "credit_id": "6775a92209b80f9bb31287b5",
                "department": "Crew",
                "job": "Associate Choreographer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Comfort Ogheneruro Fedoke"
        ],
        "biography": "Nigerian American Comfort Fedoke is a multi-talented, choreographer, actor, singer, and Emmy award winning dancer. Known for competing on So You Think You Can Dance Season 4, and was invited back for several years as an All-Star , choreographer, and mentor.\n\nOn stage, Comfort has worked and performed live with talented artists such as H.E.R, John Legend, Florence and the Machine, Harry Styles, Kanye West, LL Cool J, Chaka Khan, Taylor Swift, Rihanna, Wale, Jason Derulo, JLo, Travis Scott, Drake, Gwen Stefani, Lizzo, Missy Elliott, etc.\n\nHer work doesn't end on the dance floor, she also worked alongside legendary Sway Calloway for Red Bull TV as a commentator and host. Comfort continues to be a host and voice for numerous events for Red Bull TV and radio, as well as judge on a hit Nigerian TV show called Maltina Dance All.\n\nCommercially Comfort has done numerous amounts of work. She was a solo feature in Nike's 30-year celebration of Air Max - promoting the new VaporMax shoe, Michael Jackson's Pepsi generation Super Bowl commercial, along with having world wide campaigns with Apple.\n\nShe has acted and choreographed in a number of films, TV, and Stage shows, such as Footloose, Step Up 5 All In , The Mindy project, The Funny Dance show on E, Blindspotting, High Strung, That 90's show, The Big Leap, and The Santa Clauses. You can also now catch Comfort on Disney + as \"DrosselMeyer\" on the holiday family film \"Hip Hop Nutcracker\".\n\nComfort currently resides in London, where she is completing her work as an associate choreographer on the new film \"Wicked\", directed by John Chu; and associate choreographer for London's # 1 West end show \" Cabaret\".\n\nIt's been recently announced that Comfort will be a new judge on So You Think You Can Dance season 18, premiering March 4th 2024 on Fox.",
        "birthday": "1988-05-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 964776,
        "imdb_id": "nm3033702",
        "known_for_department": "Acting",
        "name": "Comfort Fedoke",
        "place_of_birth": "Fort Worth, Texas, USA",
        "popularity": 0.0453,
        "profile_path": "/fpeMw7Xv62Z3OpPS4i25KXVvPqo.jpg"
    }
}