{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/feO6v1UMaCDFsshStLpAv2FwARz.jpg",
                "genre_ids": [
                    18,
                    10749,
                    53
                ],
                "id": 130150,
                "original_language": "en",
                "original_title": "Labor Day",
                "overview": "Two strangers are drawn together under incredible circumstances. What starts as an unforeseen encounter over a long holiday weekend soon becomes a second chance love story.",
                "popularity": 4.8437,
                "poster_path": "/iQdbCtk1Q3TdZRBKSLU1Vh870l7.jpg",
                "release_date": "2013-12-27",
                "title": "Labor Day",
                "video": false,
                "vote_average": 7.016,
                "vote_count": 1244,
                "character": "Eleanor",
                "credit_id": "58689bed9251414e7d0084f0",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brighid began her acting career at 3 years old when she saw \"Seussical the Musical\". After the show, she was asked if she would like to meet the Cat in the Hat. She thought about it and replied, \"No, I want to be the Cat in the Hat. How do you get up there?\" After a couple of years on the local Albuquerque theatre circuit, Brighid landed an international modeling job with LaCoste. From there, she began picking up small parts in films that were shooting in NM. Finally, in 2007 she made her way out to LA. On a flight home to Albuquerque to film \"The Burrowers\", she met a couple of directors, Mark Neveldine and Brian Taylor. She landed the supporting role of Delia in their film, \"Gamer\", which starred Gerard Butler.She has since been working away in LA doing small Indies, student films, and theatre, as well as appearances on television and an occasional feature film. A couple of national commercials and a music video or two have also come her way.\n\nShe won a maverick award for her role in \"Sugar Rush\", a USC film. She has also been nominated for festival awards for her work in \"After the Shearing\" (a UCLA Grad film for AARP). She won Best Actress for the short A.B.S at the Women's Independent Film Festival. She was nominated for a Young Artist Award for her part in \"Criminal Minds.\" Deborah Dozier Potter, a former member of the Kennedy Center's President's Advisory Council for the Arts and the daughter of Joan Fontaine and niece of Olivia de Havilland, called Brighid's performance in the NM produced film \"Hearts of Desire\" extraordinary, remarking that she believed Brighid was destined for greatness. The LA Times said her performance in Woyzeck for the Gangbusters Theatre Company had disarming command. In 2011, Brighid wrote and directed her own short film, A.B.S. A.B.S is on the festival circuit where it has already won awards of distinction, including best short film, in several festivals. She has also picked up awards for directing and cinematography for A.B.S. Her dream is to get her production company, Phish Tank Philms, up and running and to turn A.B.S into a web series. (Bio taken from brighidfleming.com)",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.brighidfleming.com",
        "id": 965550,
        "imdb_id": "nm2459787",
        "known_for_department": "Acting",
        "name": "Brighid Fleming",
        "place_of_birth": null,
        "popularity": 0.1004,
        "profile_path": "/Ai1FmaaENHD69d6cfqUw6Y4LEwM.jpg"
    }
}