{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1WRwy3EDc2LVtwauzIMMGVJLEI5.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9787,
                "original_language": "en",
                "original_title": "Lords of Dogtown",
                "overview": "The radical true story behind three teenage surfers from Venice Beach, California, who took skateboarding to the extreme and changed the world of sports forever. Stacy Peralta, Tony Alva and Jay Adams are the Z-Boys, a bunch of nobodies until they create a new style of skateboarding that becomes a worldwide phenomenon. But when their hobby becomes a business, the success shreds their friendship.",
                "popularity": 13.1033,
                "poster_path": "/k2NiPfydLSwmk28C6qpvpJPuqtq.jpg",
                "release_date": "2005-06-03",
                "title": "Lords of Dogtown",
                "video": false,
                "vote_average": 7.102,
                "vote_count": 773,
                "character": "Topper Burks",
                "credit_id": "610de39eae3843005eaa9f25",
                "order": 40
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/tyBkBHKDrJyVUeCs550kMr61jnq.jpg",
                "genre_ids": [
                    10749,
                    27
                ],
                "id": 6114,
                "original_language": "en",
                "original_title": "Bram Stoker's Dracula",
                "overview": "In 19th century England, Count Dracula travels to London and meets Mina Harker, a young woman who appears as the reincarnation of his lost love.",
                "popularity": 5.9215,
                "poster_path": "/n39glC4GkBeCbwdenES8ZBodim8.jpg",
                "release_date": "1992-11-13",
                "title": "Bram Stoker's Dracula",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 5446,
                "credit_id": "61cb687fefe37c004377577a",
                "department": "Crew",
                "job": "Stand In"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "JJ Knoxville",
            "Johnny Jackass",
            "Philip John Clapp",
            "PJ Clapp",
            "Phillip John",
            "조니 녹스빌",
            " 約翰尼·諾剋斯維爾",
            "強尼‧諾克斯威爾",
            "جانی ناکسویل"
        ],
        "biography": "Johnny Knoxville, born Philip John Clapp Jr. on March 11, 1971, is an American actor, comedian, stunt performer, and television producer. He rose to fame as the co-creator and star of the hit MTV series \"Jackass,\" which featured a group of individuals performing dangerous and outrageous stunts and pranks.\n\nKnoxville was born and raised in Knoxville, Tennessee, where he developed a taste for mischief and adventure from an early age. After completing high school, he briefly attended the American Academy of Dramatic Arts in California before dropping out to pursue a career in acting and writing.\n\nIn 2000, Knoxville and his friends launched the \"Jackass\" television series, which became a cultural phenomenon and catapulted him to international fame. The show's success led to several spin-off films, including \"Jackass: The Movie\" (2002), \"Jackass Number Two\" (2006), and \"Jackass 3D\" (2010). These movies showcased Knoxville's willingness to push the boundaries of physical comedy and engage in outrageous, often painful, stunts.\n\nBeyond \"Jackass,\" Johnny Knoxville has appeared in a variety of film and television projects. He has displayed his comedic talents in movies such as \"Men in Black II\" (2002), \"The Dukes of Hazzard\" (2005), and \"Skiptrace\" (2016). He has also taken on more dramatic roles, including in films like \"Grand Theft Parsons\" (2003) and \"Elvis & Nixon\" (2016).\n\nKnoxville's distinctive charm and fearlessness have endeared him to audiences worldwide. His willingness to put his body on the line for entertainment, combined with his quick wit and natural comedic timing, has made him a beloved figure in the entertainment industry.\n\nIn addition to his acting career, Johnny Knoxville has produced various television shows, including \"Nitro Circus\" and \"The Wild and Wonderful Whites of West Virginia.\" He has also ventured into writing, publishing his autobiography, \"The Jackass Whisperer,\" in 2018.",
        "birthday": "1971-03-11",
        "deathday": null,
        "gender": 2,
        "homepage": "http://johnnyknoxville.com",
        "id": 9656,
        "imdb_id": "nm0424216",
        "known_for_department": "Acting",
        "name": "Johnny Knoxville",
        "place_of_birth": "Knoxville, Tennessee, USA",
        "popularity": 1.113,
        "profile_path": "/7XDKsHsLC4uNYaGsuWG1tQXWRnu.jpg"
    }
}