{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hVvW015x8cD2X0KthGovw27EpF2.jpg",
                "genre_ids": [
                    10402,
                    10749,
                    35
                ],
                "id": 2769,
                "original_language": "en",
                "original_title": "An American in Paris",
                "overview": "Jerry Mulligan is an exuberant American expatriate in Paris trying to make a reputation as a painter. His friend Adam is a struggling concert pianist who's a long time associate of a famous French singer, Henri Baurel. A lonely society woman, Milo Roberts, takes Jerry under her wing and supports him, but is interested in more than his art.",
                "popularity": 3.5492,
                "poster_path": "/lyDXkvG53ldz6Cf7dbjJl7TaoP5.jpg",
                "release_date": "1951-09-26",
                "title": "An American in Paris",
                "video": false,
                "vote_average": 7.026,
                "vote_count": 606,
                "character": "Saxophonist in Cafe (uncredited)",
                "credit_id": "63a5deedc048a900d7f36084",
                "order": 19
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/hVvW015x8cD2X0KthGovw27EpF2.jpg",
                "genre_ids": [
                    10402,
                    10749,
                    35
                ],
                "id": 2769,
                "original_language": "en",
                "original_title": "An American in Paris",
                "overview": "Jerry Mulligan is an exuberant American expatriate in Paris trying to make a reputation as a painter. His friend Adam is a struggling concert pianist who's a long time associate of a famous French singer, Henri Baurel. A lonely society woman, Milo Roberts, takes Jerry under her wing and supports him, but is interested in more than his art.",
                "popularity": 3.5492,
                "poster_path": "/lyDXkvG53ldz6Cf7dbjJl7TaoP5.jpg",
                "release_date": "1951-09-26",
                "title": "An American in Paris",
                "video": false,
                "vote_average": 7.026,
                "vote_count": 606,
                "credit_id": "666349326a46310fb7762b9e",
                "department": "Sound",
                "job": "Orchestrator"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bennett Lester Carter"
        ],
        "biography": "Bennett Lester Carter (August 8, 1907 – July 12, 2003) was an American jazz saxophonist, clarinetist, trumpeter, composer, arranger, and bandleader. With Johnny Hodges, he was a pioneer on the alto saxophone. From the beginning of his career in the 1920s, he worked as an arranger including written charts for Fletcher Henderson's big band that shaped the swing style. He had an unusually long career that lasted into the 1990s. During the 1980s and 1990s, he was nominated for eight Grammy Awards, which included receiving a Lifetime Achievement Award.\n\nCarter was born in New York City in 1907. He was given piano lessons by his mother and others in the neighborhood. He played trumpet and experimented briefly with C-melody saxophone before settling on alto saxophone. In the 1920s, he performed with June Clark, Billy Paige, and Earl Hines, then toured as a member of the Wilberforce Collegians led by Horace Henderson. He appeared on record for the first time in 1927 as a member of the Paradise Ten led by Charlie Johnson. He returned to the Collegians and became their bandleader through 1929, including a performance at the Savoy Ballroom in New York City.\n\nIn his early 1920s, Carter worked as arranger for Fletcher Henderson after that position was vacated by Don Redman. He had no formal education in arranging, learning by trial and error, getting on his knees and looking at the existing charts, \"writing the lead trumpet first and the lead saxophone first—which, of course, is the hard way. It was quite some time that I did that before I knew what a score was.\"\n\nHe left Henderson to take Redman's former job as leader of McKinney's Cotton Pickers in Detroit. In 1932, he formed a band in New York City that included Chu Berry, Sid Catlett, Cozy Cole, Bill Coleman, Ben Webster, Dicky Wells, and Teddy Wilson. Carter's arrangements were complex. Among the most significant were \"Keep a Song in Your Soul\", written for Henderson in 1930, and \"Lonesome Nights\" and \"Symphony in Riffs\" from 1933, both of which show Carter's writing for saxophones.\n\nBy the early 1930s, Carter and Johnny Hodges were considered the leading alto saxophonists. Carter also became a leading trumpet soloist, having rediscovered the instrument. He recorded extensively on trumpet in the 1930s. Carter's short-lived Orchestra played the Harlem Club in New York but only recorded a handful of records for Columbia, OKeh and Vocalion. The OKeh sides were issued under the name The Chocolate Dandies.\n\nIn 1933, Carter participated in sessions with British composer/musician Spike Hughes, who visited New York City to organize recordings with prominent African American musicians. These 14 sides plus four by Carter's big band, titled at the time Spike Hughes and His Negro Orchestra, were initially only issued in England. The musicians were from Carter's band and included Red Allen, Dicky Wells, Wayman Carver, Coleman Hawkins, J. C. Higginbotham, and Chu Berry. ...\n\nSource: Article \"Benny Carter\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1907-08-08",
        "deathday": "2003-07-12",
        "gender": 2,
        "homepage": null,
        "id": 96709,
        "imdb_id": "nm0141481",
        "known_for_department": "Sound",
        "name": "Benny Carter",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.4596,
        "profile_path": "/uPRBjJilpk7v1JfZCHL9ihoXUdq.jpg"
    }
}