{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Woman at Station (uncredited)",
                "credit_id": "555f25ea9251417e51002859",
                "order": 106
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Adrian Booth",
            "Lorna Grey",
            "Virginia Pound"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nLorna Gray (July 26, 1917 – April 30, 2017) was an American film actress known for her comic roles, and later as a villainess. She is best known for her roles in Columbia Pictures comedy shorts and Republic Pictures serials. She was known as Adrian Booth since 1945.  Although she had a film test at Universal Studios and a brief contract with Paramount Pictures, she made her first big film for Columbia Pictures.\n\nAs a Columbia contract player she appeared in the studio's shorts and serials, including Flying G-Men (starring Robert Paige), Pest from the West (starring Buster Keaton), and You Nazty Spy! (starring The Three Stooges). When her Columbia contract lapsed, she found work at Monogram Pictures, where she worked with action star Frankie Darro.\n\nGray also starred opposite John Wayne in Red River Range (1938) and appeared in the title role in O, My Darling Clementine (1943), a country music film starring Roy Acuff as a singing sheriff.\n\nIn her Paramount films, such as Hold 'Em Navy, she was credited as Virginia Pound, but she was given the name Lorna Gray by Columbia and she used it from 1938 until 1945, when she left Columbia and moved to Republic Pictures. She appeared as Lorna Gray in Republic's Federal Operator 99, but subsequently adopted the name Adrian Booth.\n\nAt Republic, she often received co-star billing in Westerns, the only woman other than Dale Evans to be billed so highly at that studio. She also starred in Republic's serial about the comic book superhero Captain America.  Description above from the Wikipedia article Lorna Gray, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1917-07-26",
        "deathday": "2017-04-30",
        "gender": 1,
        "homepage": null,
        "id": 96719,
        "imdb_id": "nm0336790",
        "known_for_department": "Acting",
        "name": "Lorna Gray",
        "place_of_birth": "Grand Rapids, Michigan USA",
        "popularity": 0.1362,
        "profile_path": "/cdWxxF7weiJuccv7hv4Miw2zEH9.jpg"
    }
}