{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eMgflonfRY89Zj4LZykJKPpG4wg.jpg",
                "genre_ids": [
                    18
                ],
                "id": 596,
                "original_language": "en",
                "original_title": "The Grapes of Wrath",
                "overview": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncle’s farm, and joins them the next day as they head for California and a new life... Hopefully.",
                "popularity": 5.0306,
                "poster_path": "/eUcxMVBIA0Jg8l1RGUqycrc3eIQ.jpg",
                "release_date": "1940-03-15",
                "title": "The Grapes of Wrath",
                "video": false,
                "vote_average": 7.815,
                "vote_count": 1043,
                "character": "Cop (uncredited)",
                "credit_id": "55e503d292514137a20008ac",
                "order": 81
            },
            {
                "adult": false,
                "backdrop_path": "/1rSF7UoY6aU8i7yJOLovZv8AYwX.jpg",
                "genre_ids": [
                    53
                ],
                "id": 31997,
                "original_language": "en",
                "original_title": "Saboteur",
                "overview": "Aircraft factory worker Barry Kane flees across the United States after he is wrongly accused of starting the fire that killed his best friend.",
                "popularity": 3.4948,
                "poster_path": "/iDKOOTymUZg0WAWPcbdP6nPZEFF.jpg",
                "release_date": "1942-04-24",
                "title": "Saboteur",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 518,
                "character": "Plant Cafeteria Worker (uncredited)",
                "credit_id": "664fa7ba7d97c9231a9b08cb",
                "order": 65
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rex Lloyd Lease"
        ],
        "biography": "From Wikipedia\n\nRex Lloyd Lease (February 11, 1903 – January 3, 1966) was an American actor. He appeared in over 300 films, mainly in westerns.\n\nLease arrived in Hollywood in 1924. He found bit and supporting parts at Film Booking Office (FBO), Rayart, more, and was given the opportunity to play a few leads. His first film was A Woman Who Sinned (1924).\n\nRex's earliest westerns were a pair of Tim McCoy silents at MGM, one of which was The Law of the Range (1928) which had a very young Joan Crawford as the heroine and Rex as the \"Solitaire Kid\". Tim and Lease became friends, and over the next dozen or so years he appeared in seven more McCoy westerns.\n\nHe had a featured role in director Frank Capra's The Younger Generation (1929), a tale of a Jewish family that move to a more upscale neighborhood.\n\nHe successfully made the transition to talkies, and starred in melodramas, action flicks, old dark house mysteries, and comedies as well as a couple of western serials and about a dozen low-budget sagebrush yarns and outdoor adventures.\n\nIn between lead roles, Lease did featured parts in some B westerns. He was Hoot Gibson's brother in Cavalcade of the West (1936); Rex played the \"Pecos Kid\" in McCoy's Lightnin' Bill Carson (1936); and he worked in a couple of Tom Tylers, Ridin' On (1936) and Fast Bullets (1936). Rex's finale as a star had him teaming up with Rin-Tin-Tin Jr. in The Silver Trail (1937).\n\nThough no longer afforded star billing, he continued in smaller roles into the 1950s in films and on TV.",
        "birthday": "1903-02-11",
        "deathday": "1966-01-03",
        "gender": 2,
        "homepage": null,
        "id": 96713,
        "imdb_id": "nm0495285",
        "known_for_department": "Acting",
        "name": "Rex Lease",
        "place_of_birth": "Central City [now part of Huntington], West Virginia, USA",
        "popularity": 0.0582,
        "profile_path": "/bzbAoS9GVC8s8hIum8Ccd58zYcm.jpg"
    }
}