{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jXDselREPq8TOVGM4dzBBUM7xVk.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 399579,
                "original_language": "en",
                "original_title": "Alita: Battle Angel",
                "overview": "When Alita awakens with no memory of who she is in a future world she does not recognize, she is taken in by Ido, a compassionate doctor who realizes that somewhere in this abandoned cyborg shell is the heart and soul of a young woman with an extraordinary past.",
                "popularity": 9.1217,
                "poster_path": "/xRWht48C2V8XNfzvPehyClOvDni.jpg",
                "release_date": "2019-01-31",
                "title": "Alita: Battle Angel",
                "video": false,
                "vote_average": 7.244,
                "vote_count": 9591,
                "character": "Zapan's Cronie #1",
                "credit_id": "5b5b295dc3a368670a00fd80",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Vincent Blair"
        ],
        "biography": "Born in El Paso, TX and related to the great Edgar Allan Poe, Billy knew what he wanted to do at the ripe age of 5 after experiencing Sesame Street and KISS. He comes from a musical background. His great grandfather led his big band during the early 1900's in Mexico performing for some of history's greatest figures such as Pancho Villa. He also had uncles and cousins, all which played in big bands and symphonies.\n\nFor all of Billy's life, he was dedicated to music and still proceeds to endeavor this lifestyle. Being in numerous bands, he would experience touring the nation, playing in clubs, theaters, arenas and amphitheaters; fulfilling the dream and opening for some of the biggest names of rock.\n\nBy the mid 90's, Billy decided to pursue in acting. He would develop his skills in theater at Richland College in Richardson, TX and would resume with taking private lessons from the greatest acting coaches in Texas. Building his resume with small, local indie films. Landing in a national commercial, then booking roles in bigger films like Jonah Hex starring Josh Brolin. He is known for some of his great work in films like The Last Stand starring Arnold Schwarzenegger and Robert Rodriguez's Machete, Machete Kills and Sin City: A Dame To Kill For.  - IMDb Mini Biography",
        "birthday": "1986-05-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 968889,
        "imdb_id": "nm3046228",
        "known_for_department": "Acting",
        "name": "Billy Blair",
        "place_of_birth": "El Paso, Texas, USA",
        "popularity": 0.3263,
        "profile_path": "/xEa5EA6K8b5jqfb0G4iW8UJGH2p.jpg"
    }
}