{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fMQGVBk0ZyzxMQOBGkUazCkvMMR.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 38408,
                "original_language": "en",
                "original_title": "Life As We Know It",
                "overview": "After a disastrous first date for caterer Holly and network sports director Messer, all they have in common is a dislike for each other and their love for their goddaughter Sophie. But when they suddenly become all Sophie has in this world, Holly and Messer must set their differences aside. Juggling careers and social calendars, they'll have to find common ground while living under the same roof.",
                "popularity": 2.8541,
                "poster_path": "/zLzS2aOqKsS0QvEaY6SfBw4VBqh.jpg",
                "release_date": "2010-10-02",
                "title": "Life As We Know It",
                "video": false,
                "vote_average": 6.905,
                "vote_count": 3195,
                "character": "Sophie",
                "credit_id": "52fe46b69251416c9105d399",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lexi Clagett"
        ],
        "biography": "From IMDb By Erin Clagett;\n\nLexi is the daughter of Tom &amp; Erin Clagett of Frederick, MD. Defying the odds, she has grown from a tiny preemie into a curious, energetic toddler whose special relationship with her sisters other is a joy to watch. Because she was cared for by so many in her first year, including nurses, extended family, big sister Hannah, friends and volunteers, Lexi loves people and adventure. Spending 11 weeks in Atlanta filming Life As We Know It was definitely an adventure for Lexi and she loved every minute of it. So many new friends - actors, producers, costumers, production assistants, drivers and many others - showered her with affection and attention. She loved going to the set and it showed in her comfort in front of the cameras. Josh Duhamel spent time playing with the Lexi and her sisters everyday. According to him they became his new best friends and they adored him! Katherine Heigl was also a favorite. A new mother at the time herself, she wrote that she was thrilled to be her first movie mother. Her Atlanta adventure filming Life As We Know It was a once in a lifetime opportunity. Experienced actress at the age of 18 months, one can only wonder what the future holds for this precious little lady.",
        "birthday": "2008-05-31",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.clagetttriplets.com/",
        "id": 970332,
        "imdb_id": "nm3693309",
        "known_for_department": "Acting",
        "name": "Alexis Clagett",
        "place_of_birth": "Frederick, Maryland, USA",
        "popularity": 0.0071,
        "profile_path": null
    }
}