{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rSnMQ82mFlpBLRt2UvohO6sgemd.jpg",
                "genre_ids": [
                    35,
                    18,
                    10751
                ],
                "id": 11881,
                "original_language": "en",
                "original_title": "Miracle on 34th Street",
                "overview": "Kris Kringle, seemingly the embodiment of Santa Claus, is asked to portray the jolly old fellow at Macy's following his performance in the Thanksgiving Day parade. His portrayal is so complete that many begin to question if he truly is Santa Claus, while others question his sanity.",
                "popularity": 1.6625,
                "poster_path": "/qyAc9X9XHloIqy3oJbbZ44Cw0Hm.jpg",
                "release_date": "1947-06-04",
                "title": "Miracle on 34th Street",
                "video": false,
                "vote_average": 7.377,
                "vote_count": 788,
                "character": "Cleo (uncredited)",
                "credit_id": "52fe449a9251416c7503a833",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/9qGWOflC5WNhaKk2UPYu55SjjNj.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 678,
                "original_language": "en",
                "original_title": "Out of the Past",
                "overview": "The peaceful life of a gas station owner is disrupted when a man from his past arrives in town and forces him to return to the dark world he had tried to escape.",
                "popularity": 2.2826,
                "poster_path": "/lnUK6Cg5ARM0qaq0B5SG20VAM0h.jpg",
                "release_date": "1947-11-25",
                "title": "Out of the Past",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 618,
                "character": "Eunice Leonard (uncredited)",
                "credit_id": "56bbb00d92514144de000754",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/loE8zQAj5GROl4BAYNcUTWFJKAx.jpg",
                "genre_ids": [
                    9648,
                    80,
                    53
                ],
                "id": 3766,
                "original_language": "en",
                "original_title": "The Lady from Shanghai",
                "overview": "A romantic drifter gets caught between a corrupt tycoon and his voluptuous wife.",
                "popularity": 3.7195,
                "poster_path": "/whqdqWavNMSoeXTx1X3DauO1LG6.jpg",
                "release_date": "1947-12-24",
                "title": "The Lady from Shanghai",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 692,
                "character": "Courtroom Spectator (uncredited)",
                "credit_id": "56f339a8c3a3682fdb000a62",
                "order": 26
            },
            {
                "adult": false,
                "backdrop_path": "/dAE4x4BgauvsRkErmLg1L05LNAV.jpg",
                "genre_ids": [
                    9648,
                    27,
                    10749
                ],
                "id": 25508,
                "original_language": "en",
                "original_title": "Cat People",
                "overview": "A Serbian émigré in Manhattan believes that, because of an ancient curse, any physical intimacy with the man she loves will turn her into a feline predator.",
                "popularity": 1.7208,
                "poster_path": "/zSNTDd5Q6No5BmY39Zp5BVgl8XE.jpg",
                "release_date": "1942-12-05",
                "title": "Cat People",
                "video": false,
                "vote_average": 6.921,
                "vote_count": 624,
                "character": "Minnie (uncredited)",
                "credit_id": "59de08b0c3a368620008d3ec",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Teresa Harris",
            "Theresa Robinson",
            "The Beautiful Maid"
        ],
        "biography": "Theresa Harris (December 31, 1906 [some sources indicate 1909] – October 8, 1985) was an American film and television actress, singer and dancer.\n\nIn 1929 Harris traveled to Hollywood, where she embarked on an acting career. She made her film debut in Thunderbolt, singing the song \"Daddy Won't You Please Come Home\". As she entered the 1930s she found herself playing maids to fictitious Southern belles, socialites and female molls. These parts were sometimes uncredited. She also floated around studios doing bit parts, usually at Warner Bros. or MGM. Aside from maids, she specialized in playing blues singers, waitresses, tribal women, prostitutes, and hatcheck girls.\n\nHarris had a featured role as a friend of Jean Harlow in MGM's Hold Your Man (1932). In 1933 she appeared as Chico in the Warner Bros. pre-Code production of Baby Face, starring Barbara Stanwyck. That same year Harris starred in a substantial role opposite Ginger Rogers in Professional Sweetheart. As Rogers' character's maid, Harris' character subs for Rogers' character as a singer on the radio. Despite the fact that Harris' character was a major point for the story's plot development, she was uncredited for the role.\n\nThroughout the 1930s, Harris played many uncredited parts in films such as Horse Feathers (1932), Gold Diggers of 1933 (1933), Mary Stevens, M.D. (1933) and Morning Glory (1933). She also played Bette Davis's maid Zette in the film Jezebel (1938). In 1937 she appeared in the race film Bargain With Bullets opposite Ralph Cooper for Million Dollar Productions. While doing promotion for the film, Harris spoke about her frustration over the difficulty African American actors faced in the film industry, stating, \"I never had the chance to rise about the role of maid in Hollywood movies. My color was against me anyway you looked at it. The fact that I was not \"hot\" stamped me either as uppity or relegated me to the eternal role of stooge or servant....My ambition is to be an actress. Hollywood had no parts for me.\"\n\nHarris continued to lobby for better parts but found few opportunities within Hollywood. In the 1939 movie Tell No Tales she was credited for her part as Ruby, the wife of a murdered man. Harris played an emotional scene with Melvin Douglas at the funeral. She appears in a small but vivid role as Kathie Moffat's ex-maid Eunice Leonard in Jacques Tourneur 1947 Out of the Past.\n\nIn addition to films, Harris performed in many radio programs. She was often paired with Eddie Rochester Anderson, who portrayed her on-screen boyfriend. She also appeared in several prominent roles for RKO Pictures as she was a favorite of RKO producer Val Lewton who routinely cast African American actors in non-stereotypical roles. In 1942 Lewton cast Harris as a sarcastic waitress in Cat People, followed by roles in I Walked with a Zombie (1943), Phantom Lady (1944), and Strange Illusion (1945).\n\nDuring the 1950s Harris appeared several times on television shows. She made her last film appearance in an uncredited role in The Gift of Love in 1958.\n\nHarris later married a doctor and retired from acting, living comfortably after having carefully invested the money she made during her career in the movies.\n\nOn October 8, 1985, Harris (then known as Theresa Robinson) died in Inglewood, California.\n\nFrom Wikipedia, the free encyclopedia.",
        "birthday": "1906-12-31",
        "deathday": "1985-10-08",
        "gender": 1,
        "homepage": null,
        "id": 97042,
        "imdb_id": "nm0365382",
        "known_for_department": "Acting",
        "name": "Theresa Harris",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.0888,
        "profile_path": "/AgDlBQrEiwpSS4TMSN674yQB4n.jpg"
    }
}