{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/11V6JMreBokxvTZTsxmSQsibaRb.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 13809,
                "original_language": "en",
                "original_title": "RocknRolla",
                "overview": "When a Russian mobster sets up a real estate scam that generates millions of pounds, various members of London's criminal underworld pursue their share of the fortune. Various shady characters, including Mr One-Two, Stella the accountant, and Johnny Quid, a druggie rock-star, try to claim their slice.",
                "popularity": 2.4143,
                "poster_path": "/i7eyngqjdvKB7NvrWtCjjTNNq8N.jpg",
                "release_date": "2008-09-04",
                "title": "RocknRolla",
                "video": false,
                "vote_average": 6.95,
                "vote_count": 3096,
                "character": "Malcolm",
                "credit_id": "600abc900cd446003fdbd096",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "David Leon (born 1980) is an English actor perhaps best known for portraying the character Othello in photographer Rankin's directorial debut \"Lives of the Saints\", Guy Ritchie's film \"Rock'N'Rolla\" and British television series Cutting It, set in a Manchester hair-dressing salon.\n\nIn 2007 Leon Played Billy the Kid in the acclaimed biopic for the BBC and starred in the Channel 4 drama Clapham Junction directed by Adrian Shergold.\n\nIn 2006, he had a main role in the film 'These Foolish Things', which also starred Terence Stamp, Lauren Bacall and Anjelica Huston. The film's lead actress was Zoe Tapper, who guest-starred in an episode of Cutting It. In 2007, David played Billy The Kid in the BBC's mini series 'The Wild West'. He is also known for his role as Nathan in Boy Eats Girl, a zombie film. In 2010 he played Jesus in Mark Haddon's play Polar Bears at the Donmar Warehouse. He currently resides in London. In 2011 he played DS Joe Ashworth in the ITV detective show Vera along side Brenda Blethyn.",
        "birthday": "1980-07-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 97050,
        "imdb_id": "nm1952567",
        "known_for_department": "Acting",
        "name": "David Leon",
        "place_of_birth": "Newcastle-on-Tyne, Tyneside, England, UK",
        "popularity": 0.3261,
        "profile_path": "/tt0VMGTGUMsxz1bj7Y0EbID84ua.jpg"
    }
}