{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3Z2OhNVU0FhxGZJIq6Gn32UNoKu.jpg",
                "genre_ids": [
                    18,
                    10749,
                    878
                ],
                "id": 662,
                "original_language": "fr",
                "original_title": "La Jetée",
                "overview": "A man confronts his past during an experiment that attempts to find a solution to the problems of a post-apocalyptic world caused by a world war.",
                "popularity": 2.5717,
                "poster_path": "/elGidsRHXkk8UyrtLbcMhaptDyp.jpg",
                "release_date": "1962-02-16",
                "title": "La Jetée",
                "video": false,
                "vote_average": 7.873,
                "vote_count": 945,
                "character": "",
                "credit_id": "5776da68925141069e000573",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bill Klein"
        ],
        "biography": "William Klein (April 19, 1926 – September 10, 2022) was a photographer and filmmaker noted to for his ironic approach to both media and his extensive use of unusual photographic techniques in the context of photojournalism and fashion photography.\n\nTrained as a painter, Klein studied under Fernand Léger and found early success with exhibitions of his work. However, he soon moved on to photography and achieved widespread fame as a fashion photographer for Vogue and for his photo essays on various cities. Despite having no training as a photographer, Klein won the Prix Nadar in 1957 for New York, a book of photographs taken during a brief return to his hometown in 1954. Klein's work was considered revolutionary for its \"ambivalent and ironic approach to the world of fashion\", its \"uncompromising rejection of the then prevailing rules of photography\" and for his extensive use of wide-angle and telephoto lenses, natural lighting and motion blur. Klein tends to be cited in photography books along with Robert Frank as among the fathers of street photography, one of those mixed compliments that classifies a man who is hard to classify. The world of fashion would become the subject for Klein's first feature film, Who Are You, Polly Maggoo?, which, like his other two fiction features, Mr. Freedom and Le Couple Témoin, is a satire.\n\nKlein directed numerous short and feature-length documentaries and produced over 250 television commercials.\n\nThough American by birth, Klein lived and worked in France since his late teens. His work has sometimes been openly critical of American society and foreign policy; the film critic Jonathan Rosenbaum once wrote that Klein's 1968 satire Mr. Freedom was \"conceivably the most anti-American movie ever made\".\n\nDescription above from the Wikipedia article William Klein, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1926-04-19",
        "deathday": "2022-09-10",
        "gender": 2,
        "homepage": "http://www.polkagalerie.com/fr/william-klein-biographie.htm",
        "id": 97083,
        "imdb_id": "nm0459017",
        "known_for_department": "Directing",
        "name": "William Klein",
        "place_of_birth": "New York City, USA",
        "popularity": 0.1245,
        "profile_path": "/5SLqYqn6i0KjLXWkl3tvPurMv0R.jpg"
    }
}