{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/e3xcYVsoR5dfVM0kq1l0BTkSgzJ.jpg",
                "genre_ids": [
                    53,
                    28
                ],
                "id": 192141,
                "original_language": "en",
                "original_title": "No Escape",
                "overview": "In their new overseas home, an American family soon finds themselves caught in the middle of a coup, and they frantically look for a safe escape in an environment where foreigners are being immediately executed.",
                "popularity": 4.3447,
                "poster_path": "/jIXZEvL4dmgkjyhD5JUDeOaASKB.jpg",
                "release_date": "2015-08-26",
                "title": "No Escape",
                "video": false,
                "vote_average": 6.947,
                "vote_count": 2615,
                "character": "Hotel Guest #1",
                "credit_id": "543202930e0a26583400330f",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Byron Gibson entered the film industry in 2008 when Jean-Claude Van Damme cast him as a gangster, marking the start of a career that has taken him across the globe. Since then, Byron has appeared in over 70 productions spanning feature films, TV series, and international co-productions.\n\nHe became widely recognized for his unforgettable performance in Nicolas Winding Refn’s Only God Forgives, starring opposite Ryan Gosling. His disturbing torture sequence at the Cannes Film Festival caused a stir when a large portion of the audience walked out, cementing his reputation for fearless and uncompromising roles.\n\nAlthough often cast as the antagonist, Byron has worked alongside some of the most respected names in the business, proving his versatility across genres and characters. His career has seen him collaborating with both heroes and villains, bringing his unique brand of method acting to each project. Known for his commitment to authenticity, he frequently performs his own action sequences.\n\nIn the UK, Byron is also part of the popular Rise of the Footsoldier franchise, further establishing himself as a recognizable face in British crime cinema. His work continues to cross borders, showcasing his talent in both mainstream and independent productions.\n\nWith his ability to embody complex, conflicted, and dangerous characters, Byron Gibson has built a reputation as an actor unafraid to push limits, earning respect from peers and audiences alike.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.byrongibsonproductions.com",
        "id": 971590,
        "imdb_id": "nm3137542",
        "known_for_department": "Acting",
        "name": "Byron Gibson",
        "place_of_birth": "London",
        "popularity": 0.2762,
        "profile_path": "/7UAnn1flkkcFtSCUnHj7TATueJ5.jpg"
    }
}