{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 4488,
                "character": "Hospital Attendant",
                "credit_id": "57d0524592514173b20013e1",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/6prkTmEEsB3f9hhKBzUePLe27b2.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 399404,
                "original_language": "en",
                "original_title": "Darkest Hour",
                "overview": "In May 1940, the fate of World War II hangs on Winston Churchill, who must decide whether to negotiate with Adolf Hitler or fight on knowing that it could mean the end of the British Empire.",
                "popularity": 6.765,
                "poster_path": "/xa6G3aKlysQeVg9wOb0dRcIGlWu.jpg",
                "release_date": "2017-11-22",
                "title": "Darkest Hour",
                "video": false,
                "vote_average": 7.351,
                "vote_count": 5297,
                "character": "Lord Kingsley Wood",
                "credit_id": "58e3c36cc3a368732601fa26",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brian Pettifer (born January 1, 1953) is a South African actor who has appeared in many television shows, and also on stage and in film. He is the younger brother of folk musician Linda Thompson.\n\nHe intended to become a photographer, but pursued a career as an actor. He appeared as a child in the BBC's This Man Craig and Dr Finlay's Casebook, and Madame Bovary (with his friend Alex Norton) which gave him an avid interest in acting on television.\n\nHis first film role was in Lindsay Anderson's film if.... (1968). He also appeared in Anderson's O Lucky Man! (1973) and Britannia Hospital (1982) playing the same character in all three Anderson films, that of Biles. His other film credits include roles in Amadeus (1984), A Christmas Carol (1984), Gulag (1985), Heavenly Pursuits (1986), Little Dorrit (1987), The Great Escape II: The Untold Story (1988), Loch Ness (1996), The House of Mirth (2000), Dr Jekyll and Mr Hyde (2002), The Rocket Post (2004), Vanity Fair (2004) and Lassie (2005).\n\nPettifer was a regular in Rab C. Nesbitt mainly propping up a bar, but was also known as aircraftman Bruce Leckie in Get Some In!, where he was constantly the butt of jokes directed at him by Corporal Marsh. He also played cousin Hughie in the long running Liverpool based 70s sitcom The Liver Birds.\n\nHe also played Alfred Meyer in the BBC/HBO film Conspiracy and the part of Dr. Cameron in the Radio 4 series entitled Adventures of a Black Bag, after appearing in several episodes of Dr. Finlay's Casebook.\n\nHe appeared in Hamish Macbeth, as well as guest starring in Still Game. In 2005, he also appeared in the first episode of the BBC drama Bleak House. In 2011 and 2013, he played Father Richards in The Field of Blood. He had the role of Poupart in the BBC One series The Musketeers.\n\nIn 2012, Brian Pettifer appeared as Archie Milgrow in the episode Old School Ties in the series New Tricks.\n\nHe has worked extensively in the theatre: writing, directing and acting. He has been in a production of The Fairy-Queen at Glyndebourne, which went to Paris and New York in 2010.\n\nIn 2015, Pettifer appeared in the crime comedy The Legend of Barney Thomson along with his Hamish Macbeth co-star Robert Carlyle.\n\nIn 2019, he appeared in an episode of Holby City playing patient Laurie Stocks.",
        "birthday": "1953-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 97165,
        "imdb_id": "nm0678648",
        "known_for_department": "Acting",
        "name": "Brian Pettifer",
        "place_of_birth": "Durban, Natal, South Africa",
        "popularity": 0.1733,
        "profile_path": "/swfTMwupWIBc1JixOydX812kQOE.jpg"
    }
}