{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2clBxxclZJ4OK1xzhmCCXHEfy3r.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 759,
                "original_language": "en",
                "original_title": "Gentlemen Prefer Blondes",
                "overview": "Lorelei Lee is a beautiful showgirl engaged to be married to the wealthy Gus Esmond, much to the disapproval of Gus' rich father, Esmond Sr., who thinks that Lorelei is just after his money. When Lorelei goes on a cruise accompanied only by her best friend, Dorothy Shaw, Esmond Sr. hires Ernie Malone, a private detective, to follow her and report any questionable behavior that would disqualify her from the marriage.",
                "popularity": 2.362,
                "poster_path": "/fDozhst5HVJJcd3BM8ZOsKniO7Q.jpg",
                "release_date": "1953-07-14",
                "title": "Gentlemen Prefer Blondes",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1011,
                "character": "Grotier (uncredited)",
                "credit_id": "52fe4272c3a36847f801f4fd",
                "order": 82
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Henri Letondal was a French-Canadian music critic, administrator, cellist, playwright and actor. He was a man of wide interests and wrote many sketches and revues, including, on occasion, the music.  In his youth he studied the cello with Gustave Labelle. Around 1920 he became a critic of concerts and variety shows for \"La Patrie\" (Montreal) and served 1926-29 as that paper's Paris correspondent. He also wrote about music for \"Le Petit Journal\" and was music critic around 1935 for \"Le Canada\". For CKAC radio in Montreal he was artistic director 1929-38 of 'L'Heure provinciale,' which was sponsored by the Quebec government to promote the province's musicians and composers. He also was director general of the film company France-Film.\n\nIt has been estimated that Letondal wrote some 160 radio plays and sketches 1937-1948, producing them himself and occasionally writing the music.  In 1946 he embarked on an intensive Hollywood film career, appearing in 35 Hollywood films and one Canadian,  before he he died in Hollywood in 1955.",
        "birthday": "1901-06-29",
        "deathday": "1955-02-15",
        "gender": 2,
        "homepage": null,
        "id": 97284,
        "imdb_id": "nm0504728",
        "known_for_department": "Acting",
        "name": "Henri Letondal",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.0958,
        "profile_path": "/3jZI92pNok2u5DBblgk0EpGWtL2.jpg"
    }
}