{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ufUAOM5aVizNf8d5YLoutqrrlhq.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 336843,
                "original_language": "en",
                "original_title": "Maze Runner: The Death Cure",
                "overview": "Thomas leads his group of escaped Gladers on their final and most dangerous mission yet. To save their friends, they must break into the legendary Last City, a WCKD-controlled labyrinth that may turn out to be the deadliest maze of all. Anyone who makes it out alive will get answers to the questions the Gladers have been asking since they first arrived in the maze.",
                "popularity": 8.9337,
                "poster_path": "/drbERzlA4cuRWhsTXfFOY4mRR4f.jpg",
                "release_date": "2018-01-10",
                "title": "Maze Runner: The Death Cure",
                "video": false,
                "vote_average": 7.096,
                "vote_count": 8095,
                "character": "Brenda",
                "credit_id": "555bc8d7925141587800192a",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/jXDselREPq8TOVGM4dzBBUM7xVk.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 399579,
                "original_language": "en",
                "original_title": "Alita: Battle Angel",
                "overview": "When Alita awakens with no memory of who she is in a future world she does not recognize, she is taken in by Ido, a compassionate doctor who realizes that somewhere in this abandoned cyborg shell is the heart and soul of a young woman with an extraordinary past.",
                "popularity": 8.2075,
                "poster_path": "/xRWht48C2V8XNfzvPehyClOvDni.jpg",
                "release_date": "2019-01-31",
                "title": "Alita: Battle Angel",
                "video": false,
                "vote_average": 7.245,
                "vote_count": 9588,
                "character": "Alita",
                "credit_id": "57484f43c3a3683cd8000d87",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/1PRWW60yQparK1I8Soyy9Evf7Dv.jpg",
                "genre_ids": [
                    16,
                    35,
                    18,
                    10751
                ],
                "id": 869626,
                "original_language": "en",
                "original_title": "Marcel the Shell with Shoes On",
                "overview": "Marcel is an adorable one-inch-tall shell who ekes out a colorful existence with his grandmother Connie and their pet lint, Alan. Once part of a sprawling community of shells, they now live alone as the sole survivors of a mysterious tragedy. When a documentarian discovers them amongst the clutter of his Airbnb, his resulting short film brings Marcel millions of passionate fans, as well as unprecedented dangers and a new hope at finding his long-lost family.",
                "popularity": 2.3466,
                "poster_path": "/jaYmP4Ct8YLnxWAW2oYkUjeXtzm.jpg",
                "release_date": "2022-06-24",
                "title": "Marcel the Shell with Shoes On",
                "video": false,
                "vote_average": 7.667,
                "vote_count": 639,
                "character": "Larissa",
                "credit_id": "6133efd91fb94f008833c981",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rosa Bianca Salazar",
            "Ρόζα Μπιάνκα Σάλαζαρ",
            "Ροζα Μπιανκα Σαλαζαρ",
            "Ροζα Σαλαζαρ",
            "Bianca Rosa Salazar",
            "رزا سالازار"
        ],
        "biography": "Rosa Salazar (/ˈsæləzɑːr/; born July 16, 1985) is an American actress. She had roles in the NBC series Parenthood (2011–2012) and the FXanthology series American Horror Story: Murder House (2011). She made her breakthrough as the title character of the film Alita: Battle Angel (2019) and is known for starring in the series Brand New Cherry Flavour (2021), which she also co-produced.\n\nSalazar appeared in The Divergent Series: Insurgent (2015), Maze Runner: The Scorch Trials (2015), and Maze Runner: The Death Cure (2018) and also appeared in the Netflix films The Kindergarten Teacher (2018) and Bird Box (2018). She stars in the Amazon series Undone (2019–2022).\n\nSalazar was born on July 16, 1985, in Washington, D.C., to Luis and Marilynne Salazar. Her father is Peruvian, and her mother is French-Canadian. She grew up in Washington, D.C., and nearby Greenbelt, Maryland. She attended Greenbelt Middle School and Eleanor Roosevelt High School in Greenbelt, where she was active in the theatre program. She attended Prince George's Community College, where she studied drama, then continued drama studies at Upright Citizens Brigade, where she practiced method acting, improvisation, and performance.\n\nSalazar enjoyed entertaining others from the age of fifteen and became serious about becoming an actress after moving to New York City as a young adult. There she appeared in several CollegeHumor sketches. Shortly after relocating to Los Angeles in 2009, she made her film debut playing the character Crystal in Jamesy Boy, written and directed by Trevor White. She then landed recurring roles on two hit TV series: American Horror Story: Murder House and Parenthood. In 2015, she co-starred in various sequels: The Divergent Series: Insurgent as Lynn, and Maze Runner: The Scorch Trials as Brenda.\n\nIn 2016, Salazar directed and starred in the short film Good Crazy, a story of a social crusader. It was nominated for a Short Film Grand Jury Prize at the Sundance Film Festival.\n\nIn 2018, she reprised her role as Brenda in Maze Runner: The Death Cure.\n\nIn 2019, she made her major studio lead debut with the film Alita: Battle Angel, an adaptation of the manga Gunnm directed by Robert Rodriguez. It brought Salazar numerous awards, including \"Best Visual Effects or Animated Performance\" from the Hollywood Critics Association and \"Best Voice or Motion Capture Performance\" from the Association of Latin Entertainment Critics. That year, it was announced that Salazar would have a main role on the Netflix horror drama miniseries Brand New Cherry Flavor. It was released on August 13, 2021.\n\nIn 2023, Salazar was invited to become a member of the Academy of Motion Picture Arts and Sciences.\n\nDescription above from the Wikipedia article Rosa Salazar, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1985-07-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 973667,
        "imdb_id": "nm4023073",
        "known_for_department": "Acting",
        "name": "Rosa Salazar",
        "place_of_birth": "Washington, D.C., USA",
        "popularity": 1.2969,
        "profile_path": "/f8MITeVNUrP9mMiXcPnCEZTIW56.jpg"
    }
}