{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eMgflonfRY89Zj4LZykJKPpG4wg.jpg",
                "genre_ids": [
                    18
                ],
                "id": 596,
                "original_language": "en",
                "original_title": "The Grapes of Wrath",
                "overview": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncle’s farm, and joins them the next day as they head for California and a new life... Hopefully.",
                "popularity": 5.0306,
                "poster_path": "/eUcxMVBIA0Jg8l1RGUqycrc3eIQ.jpg",
                "release_date": "1940-03-15",
                "title": "The Grapes of Wrath",
                "video": false,
                "vote_average": 7.815,
                "vote_count": 1043,
                "character": "Gas Station Attendant in Bakersfield (uncredited)",
                "credit_id": "55e50424925141379a000939",
                "order": 82
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Benjamin Joseph Hall",
            "Bennie Hall",
            "Master Hall"
        ],
        "biography": "Benjamin Joseph Hall (March 18, 1899 – May 20, 1985) was an American actor who started performing as a boy and worked for three and a half decades, mainly in small parts.\n\nBorn in Brooklyn, New York as the eldest child of American stevedore George E. Hall and his English wife Constance L. Fletcher, Ben Hall began making appearances in films when he was little more than ten years old. After a handful of movies, his family moved to Weehawken, New Jersey, and in 1918 Ben took work as a bank clerk in Manhattan. But by 1920, Ben and his mother had moved to Los Angeles (where they were joined later by his younger brother George Jr.).\n\nHall worked as a property man for the studios for a time, but eventually began to get small roles and was eking out a living as an actor again by 1926. He became a minor but fairly frequently-used member of the John Ford Stock Company, and did eight films for John Ford between 1929 and 1946. Most memorable among these bit roles was probably that of the barber who slicks down and perfumes Wyatt Earp's hair in My Darling Clementine (1946).\n\nHall left acting in 1949, though he lived for another 36 years. He died in North Hollywood, California in 1985.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1899-03-18",
        "deathday": "1985-05-20",
        "gender": 2,
        "homepage": null,
        "id": 97398,
        "imdb_id": "nm0355334",
        "known_for_department": "Acting",
        "name": "Ben Hall",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.0526,
        "profile_path": null
    }
}