{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2Jr2OBzoLLOYqQWnyN4eicZv0sL.jpg",
                "genre_ids": [
                    12,
                    10751
                ],
                "id": 606856,
                "original_language": "en",
                "original_title": "Togo",
                "overview": "The untold true story set in the winter of 1925 that takes you across the treacherous terrain of the Alaskan tundra for an exhilarating and uplifting adventure that will test the strength, courage and determination of one man, Leonhard Seppala, and his lead sled dog, Togo.",
                "popularity": 6.535,
                "poster_path": "/wX0QD36a80hxulcizz7tyahYOF8.jpg",
                "release_date": "2019-12-20",
                "title": "Togo",
                "video": false,
                "vote_average": 8.142,
                "vote_count": 2130,
                "character": "Dr. Curtis Welch",
                "credit_id": "5e2e0147a589020017656bd7",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ریچارد دورمر"
        ],
        "biography": "Richard Dormer is a Northern Irish actor, playwright and screenwriter.  He was born in Lisburn, Northern Ireland. After to being accepted to the Royal College of Art Richard accepted a scholarship at the RADA school of acting in London. After living and working in London, he returned to Northern Ireland. He lives in Belfast and is married to director Rachel O'Riordan.  Dormer is perhaps best known for his performance as Northern Irish Snooker star, Alex Higgins in Hurricane, which he wrote and starred in. The production received praise from critics and even from Higgins himself and saw Richard win The Stage award for best actor in 2003. He is currently the bookie's third favourite to play Higgins in the scheduled film of his life behind Cillian Murphy and Jonathan Rhys Meyers. In 2004 Richard won the Irish Times Best Actor Award for his performance in Frank McGuinness's Observe the Sons of Ulster Marching Towards the Somme and in 2005 completed a season with Sir Peter Hall at the Theatre Royal and performed Bath in the George Bernard Shaw play, You Can Never Tell, William Shakespeare's,Much Ado About Nothing, Noël Coward's play, Private Lives, and in a production of Samuel Beckett's Waiting for Godot.  Since, Dormer has written a number of plays including The Half and Gentleman's Tea Drinking Society which were produced through Belfast's Ransom theatre company. He has also provided the voices for over twenty BBC Radio 4 plays, documentaries and advertising campaigns.  Following a run of film castings playing secondary characters, he was cast as the lead in the 2012 Good Vibrations which tells the story of Northern Ireland personality and punk rock visionary Terri Hooley. The film premièred at the 2012 Cannes Film Festival and was awarded 'best film' at the Galway film awards. 2012 also saw Dormer taking over the role of Lord Beric Dondarrion, known as the \"Lightning Lord\", the leader of the \"Brotherhood Without Banners\" for Season 3 of HBO series Game of Thrones.",
        "birthday": "1969-11-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 97416,
        "imdb_id": "nm0233807",
        "known_for_department": "Acting",
        "name": "Richard Dormer",
        "place_of_birth": "Portadown, County Armagh, Northern Ireland, UK ",
        "popularity": 0.688,
        "profile_path": "/6zPTBESTihoWHwqj7KK1BuQ1dLY.jpg"
    }
}