{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2Ae0iV2HR3Raoras8G40MjBtJnn.jpg",
                "genre_ids": [
                    18,
                    14,
                    10749
                ],
                "id": 648,
                "original_language": "fr",
                "original_title": "La Belle et la Bête",
                "overview": "The story of a gentle-hearted beast in love with a simple and beautiful girl. She is drawn to the repellent but strangely fascinating Beast, who tests her fidelity by giving her a key, telling her that if she doesn't return it to him by a specific time, he will die of grief. She is unable to return the key on time, but it is revealed that the Beast is the genuinely handsome one. A simple tale of tragic love that turns into a surreal vision of death, desire, and beauty.",
                "popularity": 1.7974,
                "poster_path": "/iYSe3yrkma0e1B0wWPXgr8w5sDN.jpg",
                "release_date": "1946-10-29",
                "title": "Beauty and the Beast",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 635,
                "character": "Belle",
                "credit_id": "52fe4264c3a36847f801ad3d",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Josette Noële Andrée Claire Dagory"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJosette Day (July 31, 1914 - June 27, 1978) was a French film actress.\n\nBorn in Paris, she began her career as an actress in 1919 at the age of five. Day was married in 1941 to famous French studio head Marcel Pagnol, who she met in January 1939.\n\nIn 1946, she played her best-known role, alongside Jean Marais, as Belle in director Jean Cocteau's famous take on the classic French fairytale Beauty and the Beast.\n\nDespite playing numerous parts in famous French films, Day ended her career as an actress in 1950 when she was only 36 years old.\n\nDescription above from the Wikipedia article Josette Day, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1914-07-31",
        "deathday": "1978-06-27",
        "gender": 1,
        "homepage": null,
        "id": 9742,
        "imdb_id": "nm0196816",
        "known_for_department": "Acting",
        "name": "Josette Day",
        "place_of_birth": "Paris, France",
        "popularity": 0.504,
        "profile_path": "/3dGCIsvJkfv2EHdU9wLuBWTngBd.jpg"
    }
}