{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yGtoR1fi3e2xU7N91cb2DKJjtyL.jpg",
                "genre_ids": [
                    99
                ],
                "id": 39452,
                "original_language": "en",
                "original_title": "Exit Through the Gift Shop",
                "overview": "Banksy is a graffiti artist with a global reputation whose work can be seen on walls from post-hurricane New Orleans to the separation barrier on the Palestinian West Bank. Fiercely guarding his anonymity to avoid prosecution, Banksy has so far resisted all attempts to be captured on film. Exit Through the Gift Shop tells the incredible true story of how an eccentric French shop keeper turned documentary maker attempted to locate and befriend Banksy, only to have the artist turn the camera back on its owner.",
                "popularity": 0.8431,
                "poster_path": "/ruM5ehUQlHC1Kx3SF18d6klfrAx.jpg",
                "release_date": "2010-03-05",
                "title": "Exit Through the Gift Shop",
                "video": false,
                "vote_average": 7.543,
                "vote_count": 910,
                "character": "Self",
                "credit_id": "52fe471a9251416c9106a199",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nFrank Shepard Fairey (born February 15, 1970) is an American contemporary artist, graphic designer, and illustrator who emerged from the skateboarding scene. He first became known for his \"André the Giant Has a Posse\" (…OBEY…) sticker campaign, in which he appropriated images from the comedic supermarket tabloid Weekly World News. His work became more widely known in the 2008 U.S. presidential election, specifically his Barack Obama \"Hope\" poster. The Institute of Contemporary Art, Boston calls him one of today's best known and most influential street artists. His work is included in the collections at The Smithsonian, the Los Angeles County Museum of Art, the Museum of Modern Art in New York, the Museum of Contemporary Art San Diego, the National Portrait Gallery in Washington, and the Victoria and Albert Museum in London.\n\nDescription above from the Wikipedia article Shepard Fairey, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1970-02-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 97515,
        "imdb_id": "nm1735854",
        "known_for_department": "Acting",
        "name": "Shepard Fairey",
        "place_of_birth": "Charleston, South Carolina",
        "popularity": 0.6806,
        "profile_path": "/6SFXfEe3mA5O1tJacgQ21WBVzbK.jpg"
    }
}