{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xQRh7hSPdtEE0aUmuY8EdifrXPK.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 12545,
                "original_language": "en",
                "original_title": "Jesus Christ Superstar",
                "overview": "As played out by a theatre troupe, the last days of Jesus Christ are depicted from the perspective of Judas Iscariot, his betrayer. As Jesus' following increases, Judas begins to worry that Jesus is falling for his own hype, forgetting the principles of his teachings and growing too close to the prostitute Mary Magdalene.",
                "popularity": 3.2474,
                "poster_path": "/p5LGgKCVGGVZKTkwKzpBDIesydj.jpg",
                "release_date": "1973-08-15",
                "title": "Jesus Christ Superstar",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 580,
                "character": "Caiaphas",
                "credit_id": "52fe44f89251416c75047427",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert 'Bob' Bingham",
            "Robert Bingham",
            "Bob Binghma"
        ],
        "biography": "Robert 'Bob' Bingham born 29 October 1946 in Seattle, Washington U.S. is an actor and singer. Bingham is most remembered for playing the role of Caiaphas in Andrew Lloyd Webber and Tim Rice's rock opera Jesus Christ Superstar. Bingham's first professional appearance was in a production of Hair in his native Seattle. Bingham created the role of Caiaphas in the original concert tour of Jesus Christ Superstar and went on to perform the role in the original Broadway production, which ran from 1971–1973, as well as a Paris version. Along with Barry Dennen and Yvonne Elliman, Bingham reprised his Broadway role in the 1973 film. He retired from show business soon afterwards and worked in a managerial position in a zipper factory. Today he lives in Brewster, New York with his wife and two children aged 8 and 6.",
        "birthday": "1946-10-29",
        "deathday": "2025-02-08",
        "gender": 2,
        "homepage": null,
        "id": 975584,
        "imdb_id": "nm0082922",
        "known_for_department": "Acting",
        "name": "Bob Bingham",
        "place_of_birth": "Seattle - Washington - USA",
        "popularity": 0.0404,
        "profile_path": "/1cHHcgbhS9mVfKnuhrfjl1DWeJq.jpg"
    }
}