{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jhM3wgWUrrOkz9r4xwV5cV5RhI4.jpg",
                "genre_ids": [
                    878
                ],
                "id": 17654,
                "original_language": "en",
                "original_title": "District 9",
                "overview": "Thirty years ago, aliens arrive on Earth. Not to conquer or give aid, but to find refuge from their dying planet. Separated from humans in a South African area called District 9, the aliens are managed by Multi-National United, which is unconcerned with the aliens' welfare but will do anything to master their advanced technology. When a company field agent contracts a mysterious virus that begins to alter his DNA, there is only one place he can hide: District 9.",
                "popularity": 8.0237,
                "poster_path": "/tuGlQkqLxnodDSk6mp5c2wvxUEd.jpg",
                "release_date": "2009-08-05",
                "title": "District 9",
                "video": false,
                "vote_average": 7.454,
                "vote_count": 9902,
                "character": "Sarah Livingstone - Sociologist",
                "credit_id": "52fe473c9251416c750923a1",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nathalie Bollt",
            "Nathalie Gimur",
            "Nat Bollt"
        ],
        "biography": "Nathalie Boltt (born 19 July 1973) is a South African actress known for Riverdale and District 9. Her initial break into acting was in her birth country, South Africa, as Joey Ortlepp on the SABC 3 drama Isidingo from 2001 to 2004.\n\nInternationally, she portrayed Penelope Blossom on The CW's teen drama series Riverdale from 2017 to 2023. She has been seen in the films District 9, Demonic, and the 2005 television remake of The Poseidon Adventure. She also voices the character of DottyWot in the New Zealand children's series The WotWots.\n\nDescription above from the Wikipedia article Nathalie Boltt, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1973-07-19",
        "deathday": null,
        "gender": 1,
        "homepage": "http://nathalieboltt.com/wp/",
        "id": 97599,
        "imdb_id": "nm1410076",
        "known_for_department": "Acting",
        "name": "Nathalie Boltt",
        "place_of_birth": "Johannesburg, South Africa",
        "popularity": 0.485,
        "profile_path": "/mYvZlMSwvv6WDfJHfV6bYm4ddES.jpg"
    }
}