{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4Zc7ja5d4eGTT0rpx1pOCVLiRgW.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 649,
                "original_language": "fr",
                "original_title": "Belle de jour",
                "overview": "Beautiful young housewife Séverine Serizy cannot reconcile her masochistic fantasies with her everyday life alongside dutiful husband Pierre. When her lovestruck friend Henri mentions a secretive high-class brothel run by Madame Anais, Séverine begins to work there during the day under the name Belle de Jour. But when one of her clients grows possessive, she must try to go back to her normal life.",
                "popularity": 3.2616,
                "poster_path": "/iUAFECovwPA0cVV9bo4uNGLJSGL.jpg",
                "release_date": "1967-05-24",
                "title": "Belle de Jour",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 962,
                "character": "Madame Anais",
                "credit_id": "52fe4264c3a36847f801ae15",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Женевьева Паж",
            "Geneviève Bonjean",
            "Genevieve Page"
        ],
        "biography": "Geneviève Bonjean (13 December 1927 – 14 February 2025), known professionally as Geneviève Page, was a French actress with a film career spanning fifty years and also numerous English-speaking film productions. She was the daughter of French art collector Jacques Paul Bonjean (1899–1990).\n\nPage was born in Paris on 13 December 1927, to a family of aesthetes, like her father Jacques Bonjean, who collected art from 17th century France, and her mother Germaine (born Lipman) Bonjean. Her mother's family was Jewish, and had founded LIP. At the age of six, her godfather Christian Dior played the piano with Page's mother, and talked to Page about talking to adults. She recalls, \"He had no money at the time, and drew hats for big houses. He had lunch every other day at home and played the piano, with my mother in my room, with four hands. I took refuge in the bathroom to learn my lessons.\" At the age of twelve, Page read some works by Voltaire, and to her mother's surprise, her father replied \"If she can't read Voltaire, she can't read anyone.\" Despite this, she was a very talented young girl, playing Musset at Théâtre National Populaire and entering the Conservatory.\n\nHer film début was in Pas de pitié pour les femmes (1951), followed by Fanfan la Tulipe (1952), in which she played Madame de Pompadour alongside Gérard Philipe and Gina Lollobrigida. Later, she appeared in Italian, French, British, and American films. She co-starred with Robert Mitchum and Ingrid Thulin in Foreign Intrigue (1956), Dirk Bogarde and Capucine in Song Without End (1960), Charlton Heston and Sophia Loren in El Cid (1961), and was seen in Grand Prix (1966) with James Garner, and Belle de Jour (1967), with Catherine Deneuve and directed by Luis Buñuel. She appeared with Deneuve again when she played Countess Larisch in Mayerling (1968), also co-starring with Ava Gardner and James Mason.\n\nBilly Wilder cast her as the mysterious widow in The Private Life of Sherlock Holmes (1970) because the character she played used her sex appeal to manipulate Holmes. She appeared in Robert Altman's Beyond Therapy (1987) and continued to act until 2003.\n\nShe acted in 1943 in Le Soulier de Satin and in Oh! Les Beaux Jours, both of which were directed by Jean-Louis Barrault Madeleine Renaud Co. Her theatre career continued in the 1980s and 1990s, with Les larmes amères de Petra von Kant (The Bitter Tears of Petra von Kant) (1980), La nuit des rois (Twelfth Night, William Shakespeare), La femme sur le lit (The Woman on the Bed, Franco Brusati) 1994, and Delicate Balance (1998).\n\nPage was educated at École du Louvre and Conservatoire national des arts et métiers. Page was married to Jean-Claude Bujard from 1959 until his death on 29 August 2011; the couple had two children. In an interview from 2013, she said she was having stewardship problems in her house and that she was \"not used to talking anymore\".\n\nPage died in Paris on 14 February 2025, at the age of 97.\n\nDescription above from the Wikipedia article Geneviève Page, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1927-12-13",
        "deathday": "2025-02-14",
        "gender": 1,
        "homepage": null,
        "id": 9763,
        "imdb_id": "nm0656180",
        "known_for_department": "Acting",
        "name": "Geneviève Page",
        "place_of_birth": "Paris, France",
        "popularity": 0.2754,
        "profile_path": "/ic56FPmVhYkhGCfQMlPXOmxJSR4.jpg"
    }
}