{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6N2aaG46UYcgef7Vg8aUKp59poe.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 650,
                "original_language": "en",
                "original_title": "Boyz n the Hood",
                "overview": "In the middle of the Los Angeles ghetto, drugs, robberies and shootings dominate everyday life. During these times, Furious tries to raise his son Tre to be a decent person. Tre's friends, on the other hand, have little regard for the law and drag the entire neighborhood into a street war...",
                "popularity": 11.6826,
                "poster_path": "/v4ox4aSCNT5vyLXl4Q71JiWwCXW.jpg",
                "release_date": "1991-07-12",
                "title": "Boyz n the Hood",
                "video": false,
                "vote_average": 7.63,
                "vote_count": 2113,
                "character": "Ricky Baker",
                "credit_id": "52fe4264c3a36847f801aec1",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "موریس چستنات",
            "Morris Lamont Chestnut"
        ],
        "biography": "Morris Lamont Chestnut is an American film and television actor. He is known for his roles as teenage father Ricky Baker in the 1991 film Boyz n the Hood, groom-to-be Lance Sullivan in the 1999 film The Best Man, as NBA star Tracy Reynolds in the 2002 film Like Mike, and as the Visitor Ryan Nichols in the TV series V (2009).\n\nHis first professional acting role was as Jadon in Freddy's Nightmares: A Nightmare on Elm Street: The Series in the episode \"A Family Affair\" (season 2, episode 19) which aired on February 18, 1990.\n\nHis first feature film role was as Ricky Baker in Boyz n the Hood (1991). He followed with roles in various TV movies. Chestnut also played a role on Patti LaBelle's short-lived sitcom Out All Night. His career continued to rise steadily with co-starring roles in standard big-budget studio films like Under Siege 2 (1995) and G.I. Jane (1997). In 1998, he won the annual Madden Bowl video game competition.\n\nIn 1999, he starred in The Best Man with Taye Diggs and Nia Long in which he played a professional football player on the eve of his wedding. He reprised his role in Best Man Holiday. For both of his performances, he earned NAACP Image Award nominations. He then starred in The Brothers (2001), another film centering on the themes of fidelity and success among urban professionals.  He has worked with Steven Seagal three times in Under Siege 2: Dark Territory, Half Past Dead and Prince of Pistols.\n\nHe starred In Two Can Play That Game (2001), Breakin' All the Rules (2004), and Ladder 49 (2004). He again played a football player in The Game Plan (2007). He produced and starred in the film Not Easily Broken (2009). He starred as Ryan Nichols in the TV series reboot of V (2009). He then appeared in the films Think Like a Man (2012), and, in 2013, the films Identity Thief, Kick-Ass 2, and The Call.\n\nIn 2013, he joined the cast of HBO's Nurse Jackie, playing war veteran Dr. Ike Prentiss. The following year, he won the NAACP Image Award for Outstanding Supporting Actor in a Comedy Series. In 2015, Morris Chestnut played Derrick Dog Prince in the movie Heist; and People magazine named him as one of the \"Sexiest Men Alive\" in 2015. He then starred in the films The Perfect Guy (2016) and When the Bough Breaks (2017).\n\nHe played the lead role of pathologist Dr. Beaumont Rosewood Jr. in the series Rosewood, receiving another NAACP image Award nomination. He had recurring roles in the TV series Legends, The Enemy Within, and Our Kind of People. He had a starring guest role on the medical drama The Resident.",
        "birthday": "1969-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.morrischestnut.com/",
        "id": 9779,
        "imdb_id": "nm0004820",
        "known_for_department": "Acting",
        "name": "Morris Chestnut",
        "place_of_birth": "Cerritos, California, USA",
        "popularity": 1.1406,
        "profile_path": "/lbWJ1mIgAamsREnbKLoj1GdH0sr.jpg"
    }
}