{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6N2aaG46UYcgef7Vg8aUKp59poe.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 650,
                "original_language": "en",
                "original_title": "Boyz n the Hood",
                "overview": "In the middle of the Los Angeles ghetto, drugs, robberies and shootings dominate everyday life. During these times, Furious tries to raise his son Tre to be a decent person. Tre's friends, on the other hand, have little regard for the law and drag the entire neighborhood into a street war...",
                "popularity": 10.7655,
                "poster_path": "/v4ox4aSCNT5vyLXl4Q71JiWwCXW.jpg",
                "release_date": "1991-07-12",
                "title": "Boyz n the Hood",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 2112,
                "character": "Brandi",
                "credit_id": "52fe4264c3a36847f801aec9",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/2D08E4pqE95FM8yOJ3gOy5zWaW0.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10634,
                "original_language": "en",
                "original_title": "Friday",
                "overview": "Craig and Smokey are two guys in Los Angeles hanging out on their porch on a Friday afternoon, smoking and drinking, looking for something to do.",
                "popularity": 5.7996,
                "poster_path": "/g57KcE8tbpp3RK3DlIhPkfA6DE2.jpg",
                "release_date": "1995-04-26",
                "title": "Friday",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1909,
                "character": "Debbie",
                "credit_id": "52fe43999251416c75016acb",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/u6aGN71Hx39iX8Uv4ILRRKHmAXc.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 447362,
                "original_language": "en",
                "original_title": "Life in a Year",
                "overview": "A 17 year old finds out that his girlfriend is dying, so he sets out to give her an entire life, in the last year she has left.",
                "popularity": 7.036,
                "poster_path": "/bP7u19opmHXYeTCUwGjlLldmUMc.jpg",
                "release_date": "2020-11-27",
                "title": "Life in a Year",
                "video": false,
                "vote_average": 8.244,
                "vote_count": 1931,
                "character": "Catherine",
                "credit_id": "58f0914cc3a3686b4d00daea",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/3ciAiEBD4yxZYoXMxEnZF6Q0u58.jpg",
                "genre_ids": [
                    18
                ],
                "id": 627725,
                "original_language": "en",
                "original_title": "The Banker",
                "overview": "In the 1960s, two entrepreneurs hatch an ingenious business plan to fight for housing integration—and equal access to the American Dream.",
                "popularity": 3.6663,
                "poster_path": "/biXzsw22U6vSd0XktmZwAOc4uik.jpg",
                "release_date": "2020-03-06",
                "title": "The Banker",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1024,
                "character": "Eunice Garrett",
                "credit_id": "5d6be6c165686e000f88b1ce",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/tVH1qEFyKiCpP6kNDFyXKW2Tiif.jpg",
                "genre_ids": [
                    18,
                    9648,
                    53
                ],
                "id": 768362,
                "original_language": "en",
                "original_title": "Missing",
                "overview": "When her mother disappears while on vacation in Colombia with her new boyfriend, June’s search for answers is hindered by international red tape. Stuck thousands of miles away in Los Angeles, June creatively uses all the latest technology at her fingertips to try and find her before it’s too late. But as she digs deeper, her digital sleuthing raises more questions than answers... and when June unravels secrets about her mom, she discovers that she never really knew her at all.",
                "popularity": 3.7843,
                "poster_path": "/wEOUYSU5Uf8J7152PT6jdb5233Y.jpg",
                "release_date": "2023-01-19",
                "title": "Missing",
                "video": false,
                "vote_average": 7.418,
                "vote_count": 1159,
                "character": "Grace",
                "credit_id": "606df61bad59b50058bc05fd",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/q8NOU6y1E5m72n7Rpi4Vcrmk3Vh.jpg",
                "genre_ids": [
                    10749,
                    18,
                    35
                ],
                "id": 805327,
                "original_language": "en",
                "original_title": "Look Both Ways",
                "overview": "On the night of her college graduation, Natalie's life splits into parallel realities after she takes a pregnancy test. What will life and love bring?",
                "popularity": 3.3226,
                "poster_path": "/jq8IGJgg16mJ95a5OPyS7eGJaam.jpg",
                "release_date": "2022-08-16",
                "title": "Look Both Ways",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 690,
                "character": "Lucy Galloway",
                "credit_id": "6107fba6f706de007e980479",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ნია ლონგი",
            "Ніа Лонг",
            "Nitara Carlynn Long"
        ],
        "biography": "Nia Long (born October 30, 1970) is an American actress and occasional music video director. She is best known for her roles in the television series The Fresh Prince of Bel-Air and Third Watch, and the films Soul Food, Love Jones, The Best Man, Big Momma's House, and Are We There Yet?     Long was born in Brooklyn, New York, U.S. Her family is of Afro-Trinidadian descent. Her name, Nia, is one of the seven days of Kwanzaa, which means purpose in Swahili. Long's parents divorced when she was two years old, and she and her mother moved to Iowa City, Iowa. They subsequently moved to a South Los Angeles neighborhood when Long was seven. Long's father currently resides in Trenton, New Jersey. Long's half-sister is comedienne Sommore, one of the stars of The Queens of Comedy.  She attended the Roman Catholic school St. Mary's Academy and studied ballet, tap, jazz, gymnastics, guitar, and acting. She graduated from WestchesterHigh School in 1989. Long's acting coach was Betty Bridges, better known as the mother of Diff'rent Strokes star Todd Bridges. Her earliest role was in the Disney television movie, The B.R.A.T Patrol alongside Sean Astin, Tim Thomerson and Brian Keith. Her first notable role on television was a three-year contract role as Kathryn \"Kat\" Speakes on the soap opera Guiding Light. Long portrayed Kat from 1991 to 1994, then f rom 1994 - 1995, she played Will Smith's girlfriend and fiancée Beulah \"Lisa\" Wilkes on The Fresh Prince of Bel Air. In 2003, she joined the cast of the drama Third Watch, where she played NYPD Officer Sasha Monroe, continuing until the series finale in 2005. In 2005 and 2006, Long appeared on Everwood, and appeared on Boston Legal during its 2006-2007 season. Long also starred in Big Shots from 2007-2008 alongside Michael Vartan and Dylan McDermott. She also made a guest appearance on the successful sitcom Living Single during its first season. Long appeared in supporting roles in a number of movies including, Boyz n the Hood, Friday, and Made in America. She played a leading role, or a member of the primary ensemble, in several films, including Soul Food, Love Jones, Boiler Room, Big Momma's House, Are We There Yet?, and The Best Man. Ice Cube has starred with her in four films, while (fellow Westchester High alum) Regina King has starred with her in two. Long was voted one of the 50 most beautiful people in the World in 2000 by People. She won a NAACP Image Award for Outstanding Actress in a Drama Series in 2004 for her performance on Third Watch.     In addition to her film credits, she directed Yolanda Adams's music video for \"This Too Shall Pass\" and co-directed and appeared in Ashanti's music video, \"Baby\". She also appears in the video for Kanye West's, \"Touch The Sky\". Long and her former long-time boyfriend and fellow actor Massai Z. Dorsey have a son, Massai Zhivago Dorsey II, born on November 26, 2000.",
        "birthday": "1970-10-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 9781,
        "imdb_id": "nm0000505",
        "known_for_department": "Acting",
        "name": "Nia Long",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.7094,
        "profile_path": "/yPLmhF9kKbCtsDhUnaV6g2GHWIc.jpg"
    }
}