{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6N2aaG46UYcgef7Vg8aUKp59poe.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 650,
                "original_language": "en",
                "original_title": "Boyz n the Hood",
                "overview": "In the middle of the Los Angeles ghetto, drugs, robberies and shootings dominate everyday life. During these times, Furious tries to raise his son Tre to be a decent person. Tre's friends, on the other hand, have little regard for the law and drag the entire neighborhood into a street war...",
                "popularity": 11.6826,
                "poster_path": "/v4ox4aSCNT5vyLXl4Q71JiWwCXW.jpg",
                "release_date": "1991-07-12",
                "title": "Boyz n the Hood",
                "video": false,
                "vote_average": 7.63,
                "vote_count": 2113,
                "character": "Mrs. Baker",
                "credit_id": "52fe4264c3a36847f801aecd",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nTyra Ferrell (born March 29, 1962) is an American actress.\n\nFerrell was born in Houston, Texas. She moved from Houston to New York after high school and began her career on stage including roles on Lena Horne: The Lady and Her Music (1981) and Ain't Misbehavin on Broadway. She made her screen debut in a small role in the 1981 comedy film So Fine, and later appeared in Lady Beware, School Daze, The Mighty Quinn, and The Exorcist III. On television, she guest-starred in Hill Street Blues, The Twilight Zone, and Quantum Leap, and had recurring roles on Square One Television, The Bronx Zoo, and Thirtysomething. In 1990, Ferrell was regular cast member on the short-lived CBS sitcom City starring Valerie Harper.\n\nIn 1991, Ferrell played supporting roles in the films Boyz n the Hood and Jungle Fever. In the same year, she was listed as one of twelve \"Promising New Actors of 1991\" in John A. Willis' Screen World. The following year, she starred alongside Wesley Snipes in the comedy film White Men Can't Jump, and later had supporting roles in Equinox, Poetic Justice and The Perfect Score. Ferrell also played the leading role alongside Mare Winningham in the 1993 Lifetime Television movie Better Off Dead. In 1994, she had the recurring role as Dr. Sarah Langworthy during the first season of the NBC medical drama ER, and from 1996 to 1997 she co-starred alongside Corbin Bernsen on the syndicated science fiction series The Cape.\n\nIn 2000, Ferrell co-starred alongside Khandi Alexander in the HBO miniseries The Corner. She later guest-starred on Soul Food, The Shield and Law & Order: Special Victims Unit. In 2004, she was nominated for an NAACP Image Award for Outstanding Actress in a Television Movie, Mini-Series or Dramatic Special for her role in the ABC television film NTSB: The Crash of Flight 323. She returned to acting ten years later with the leading role in Tasha Smith's directorial debut, Boxed In. In 2015, Ferrell was cast in a recurring role on the second season of Fox's prime-time soap opera Empire.",
        "birthday": "1962-03-29",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 9782,
        "imdb_id": "nm0274508",
        "known_for_department": "Acting",
        "name": "Tyra Ferrell",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.1662,
        "profile_path": "/pcki5nhHD9V7gFocHGt2rgSW5T3.jpg"
    }
}