{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mW6XzxelLY8T2oW2NjciG9LpZT5.jpg",
                "genre_ids": [
                    12,
                    53,
                    878
                ],
                "id": 2756,
                "original_language": "en",
                "original_title": "The Abyss",
                "overview": "A civilian oil rig crew is recruited to conduct a search and rescue effort when a nuclear submarine mysteriously sinks. One diver soon finds himself on a spectacular odyssey 25,000 feet below the ocean's surface where he confronts a mysterious force that has the power to change the world or destroy it.",
                "popularity": 8.484,
                "poster_path": "/2dCit3XAtv9KWCJvRKdPkJ0FAkH.jpg",
                "release_date": "1989-08-09",
                "title": "The Abyss",
                "video": false,
                "vote_average": 7.346,
                "vote_count": 3205,
                "character": "DeMarco",
                "credit_id": "52fe436ac3a36847f8052935",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/r4nx6BZY4PfLPrThytBtAuwN8uV.jpg",
                "genre_ids": [
                    27
                ],
                "id": 13550,
                "original_language": "en",
                "original_title": "The Changeling",
                "overview": "After a tragic event happens, composer John Russell moves to Seattle to try to overcome it and build a new and peaceful life in a lonely big house that has been uninhabited for many years. But, soon after, the obscure history of such an old mansion and his own past begin to haunt him.",
                "popularity": 4.401,
                "poster_path": "/z4nTYj3JZ5jWAhDgrmEhW2GRAzb.jpg",
                "release_date": "1980-03-28",
                "title": "The Changeling",
                "video": false,
                "vote_average": 6.985,
                "vote_count": 676,
                "character": "Security Guard",
                "credit_id": "52fe45799251416c75057c01",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kenneth Campbell"
        ],
        "biography": "J. Kenneth Campbell's acting career has taken him from Broadway to feature films and television. His many films include Bulworth, Ulee's Gold, Guess Who?, Mars Attacks and The Abyss. He recently completed filming director Kevin Willmott's upcoming feature The Only Good Indian, in which Campbell plays a lead role, alongside Wes Studi (Avatar, Last of the Mohicans). On television, Campbell has appeared in Commander in Chief, Frasier, Charmed, Melrose Place, Ally McBeal, Picket Fences, Matlock, L.A. Law and many other series. Campbell was born in Flushing, New York, in 1947 the second of seven children. He was raised on Long Island and graduated from Cheshire Academy in Connecticut. It was at The University of Arizona where he discovered his calling. Forsaking the \"security\" of a college degree, he entered \"The Neighborhood Playhouse School of the Theater\" to study acting with Sanford Miesner. Non-academic acting students in 1967 became automatically eligible for the Selective Service and in the middle of his second year at the Playhouse, Campbell was drafted into the U.S. Army. He retaliated, by joining the Marines. He was wounded in action, and after months of recuperation, he returned to The Playhouse and finished the program. Campbell has worked, on stage, in film and on television ever since.",
        "birthday": "1947-07-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 97944,
        "imdb_id": "nm0132517",
        "known_for_department": "Acting",
        "name": "J. Kenneth Campbell",
        "place_of_birth": "Flushing, New York, USA",
        "popularity": 0.1104,
        "profile_path": "/kSMHA2TMWWJc1GGpdud8abVZbGA.jpg"
    }
}