{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fYI8WX2DquAHMqwh5mOMxc6RU5j.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 416477,
                "original_language": "en",
                "original_title": "The Big Sick",
                "overview": "Pakistan-born comedian Kumail Nanjiani and grad student Emily Gardner fall in love but struggle as their cultures clash. When Emily contracts a mysterious illness, Kumail finds himself forced to face her feisty parents, his family's expectations, and his true feelings.",
                "popularity": 5.5292,
                "poster_path": "/9fJTT8pBxxQsFILJHTtHhdYFr77.jpg",
                "release_date": "2017-03-30",
                "title": "The Big Sick",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 2517,
                "character": "Fast Food Cashier",
                "credit_id": "590a5b569251414f8d007e9c",
                "order": 31
            },
            {
                "adult": false,
                "backdrop_path": "/x3mFfOKOzIi1ROSgy9bgyYq7zDH.jpg",
                "genre_ids": [
                    18
                ],
                "id": 342737,
                "original_language": "en",
                "original_title": "20th Century Women",
                "overview": "In 1979 Santa Barbara, California, Dorothea Fields is a determined single mother in her mid-50s who is raising her adolescent son, Jamie, at a moment brimming with cultural change and rebellion. Dorothea enlists the help of two younger women – Abbie, a free-spirited punk artist living as a boarder in the Fields' home and Julie, a savvy and provocative teenage neighbour – to help with Jamie's upbringing.",
                "popularity": 2.1458,
                "poster_path": "/mso2rEr9i0MilRIOao5HaWFipS9.jpg",
                "release_date": "2016-12-28",
                "title": "20th Century Women",
                "video": false,
                "vote_average": 7.325,
                "vote_count": 1186,
                "character": "Bartender",
                "credit_id": "590a5c2bc3a36843340074dc",
                "order": 67
            },
            {
                "adult": false,
                "backdrop_path": "/rOJb0yQOCny0bPjg8bCLw8DyAD7.jpg",
                "genre_ids": [
                    35,
                    12,
                    878
                ],
                "id": 550988,
                "original_language": "en",
                "original_title": "Free Guy",
                "overview": "A bank teller discovers he is actually a background player in an open-world video game, and decides to become the hero of his own story. Now, in a world where there are no limits, he is determined to be the guy who saves his world his way before it's too late.",
                "popularity": 11.4114,
                "poster_path": "/6PFJrMvoQwBxQITLYHj09VeJ37q.jpg",
                "release_date": "2021-08-11",
                "title": "Free Guy",
                "video": false,
                "vote_average": 7.471,
                "vote_count": 9267,
                "character": "Keith, the 22-Year-Old Gamer",
                "credit_id": "5eb5a36b2fdec60027eb919f",
                "order": 28
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/2eznGndOi8s9CGReAvcQ8PEULwm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 5176,
                "original_language": "en",
                "original_title": "3:10 to Yuma",
                "overview": "In Arizona in the late 1800s, infamous outlaw Ben Wade and his vicious gang of thieves and murderers have plagued the Southern Railroad. When Wade is captured, Civil War veteran Dan Evans, struggling to survive on his drought-plagued ranch, volunteers to deliver him alive to the \"3:10 to Yuma\", a train that will take the killer to trial.",
                "popularity": 3.8907,
                "poster_path": "/voMB69AsLnPNmtfbrBl0lbeFKDH.jpg",
                "release_date": "2007-09-06",
                "title": "3:10 to Yuma",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 3796,
                "credit_id": "66159a9b15a4a1014af7e430",
                "department": "Production",
                "job": "Production Assistant"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Matty Cardarople",
            "Waldo Cardarople",
            "Matt Cardarople",
            "Matthew 'Waldo' Cardarople",
            "Matthew Benefiel",
            "متیو کاردارپل"
        ],
        "biography": "Matthew Richard Cardarople (born February 9, 1983) is an American actor and comedian. He has appeared in the ABC television series Selfie, the 2015 film Jurassic World, the 2016 TV series Stranger Things, and as the \"Henchperson of Indeterminate Gender\" in the TV series Lemony Snicket's A Series of Unfortunate Events. In 2021, he played Keith in the film Free Guy. His supporting roles include appearances in Michael Showalter's 2017 romantic comedy The Big Sick, and Sterlin Harjo and Taika Waititi's TV series Reservation Dogs, set in an Indigenous community in Oklahoma.\n\nCardarople was born in Exeter, New Hampshire. His parents divorced when he was young. He is a graduate of New York Film Academy, after which he worked as a personal assistant for Luke Wilson.\n\nCardarople studied acting at The Beverly Hills Playhouse. He studied with Lesly Kahn. His career began with features in the films Blonde Ambition and Drillbit Taylor. He was discovered by Luke and Owen Wilson.\n\nHe starred as a recurring guest on ABC’s Selfie. He appeared regularly in Netflix's adaptation of A Series of Unfortunate Events, which premiered in 2017.\n\nHe has also appeared in the movies Jurassic World and Dumb and Dumber To. His credits include roles in the indie comedy The 4th, The Big Sick, the Steven Soderbergh-directed film Logan Lucky and other films such as Itsy Bitsy and I am Woman.\n\nOn Television, Cardarople has appeared on shows such as NCIS: LA, New Girl, NCIS: Naval Criminal Investigative Service, Angie Tribeca, Scrubs, Ray Donovan, You're The Worst, Comedy Bang! Bang!, Selfie and Chasing Life.\n\nCardarople played Count Olaf's \"Henchperson of Indeterminate Gender” in A Series of Unfortunate Events on Netflix.",
        "birthday": "1983-02-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 979412,
        "imdb_id": "nm1781213",
        "known_for_department": "Acting",
        "name": "Matthew Cardarople",
        "place_of_birth": "Exeter, New Hampshire, USA",
        "popularity": 0.8053,
        "profile_path": "/xhKO4iMPnwQS1GeDiY8vOyLFa8x.jpg"
    }
}