{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oCC3rSccbJV9bxMDRedtqI6pnla.jpg",
                "genre_ids": [
                    35
                ],
                "id": 11030,
                "original_language": "en",
                "original_title": "Zelig",
                "overview": "Fictional documentary about the life of human chameleon Leonard Zelig, a man who becomes a celebrity in the 1920s due to his ability to look and act like whoever is around him. Clever editing places Zelig in real newsreel footage of Woodrow Wilson, Babe Ruth, and others.",
                "popularity": 3.1142,
                "poster_path": "/bfs67JaV4B5xVBvtXd3O4R7nk9G.jpg",
                "release_date": "1983-07-15",
                "title": "Zelig",
                "video": false,
                "vote_average": 7.425,
                "vote_count": 887,
                "character": "German Girl (uncredited)",
                "credit_id": "52fe43e79251416c75022835",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Betsey Johnson",
            "Elizabeth Cayton"
        ],
        "biography": "Born in Hungary, Elizabeth's family relocated to the U.S. in the late 60s. As a young adult, Elizabeth studied acting and was a model represented by the Bonnie Kay Agency prior to making her dream of becoming a film actress a reality. She landed small roles in a few A pictures (like Woody Allen's Zelig and Arthur Hiller's The Lonely Guy) before graduating to leads in B films. Her first top-billed role came by chance when she was passing a casting agent's office, was spotted and then hired to play the lead role in Slave Girls from Beyond Infinity (1987). Appearances in numerous horror films in the 80s into the early 90s (she was victim to both the Santa Claus killer in Silent Night, Deadly Night Part II and Jason in Friday the 13th, Part VII: The New Blood) earned her the reputation as being a Scream Queen, though her comedic talents were also put to good use in numerous films, including playing a bubbly but none-too-bright go-go girl in the video and cable favorite Assault of the Killer Bimbos (1988).",
        "birthday": "1960-07-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 98078,
        "imdb_id": "nm0435250",
        "known_for_department": "Acting",
        "name": "Elizabeth Kaitan",
        "place_of_birth": "Hungary",
        "popularity": 0.4504,
        "profile_path": "/qggF9gRVSrCWh49qXpPe98WP47v.jpg"
    }
}