{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hpzbQDjl2yzf6MwrYOrbDJCmojc.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 227,
                "original_language": "en",
                "original_title": "The Outsiders",
                "overview": "When two poor Greasers, Johnny and Ponyboy, are assaulted by a vicious gang, the Socs, and Johnny kills one of the attackers, tension begins to mount between the two rival gangs, setting off a turbulent chain of events.",
                "popularity": 5.4538,
                "poster_path": "/pl8Tf36TAOb2i561yPbQ9xl4P4D.jpg",
                "release_date": "1983-03-25",
                "title": "The Outsiders",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1452,
                "character": "Store Clerk",
                "credit_id": "52fe4229c3a36847f8008c17",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/g2SvOk7ZEgV1VyOfJB2CwFyqgmF.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 232,
                "original_language": "en",
                "original_title": "Rumble Fish",
                "overview": "Rusty James, an absent-minded street thug, struggles to live up to his legendary older brother's reputation and longs for the days when gang warfare was going on.",
                "popularity": 2.0952,
                "poster_path": "/nwIUWs7cexC8Wk9c6ey8nFltAZd.jpg",
                "release_date": "1983-10-09",
                "title": "Rumble Fish",
                "video": false,
                "vote_average": 6.985,
                "vote_count": 716,
                "character": "Patterson the Cop",
                "credit_id": "52fe422ac3a36847f8008f93",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/ctzKCslTsMRsOJNvAm1Mw8ytiHY.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    18,
                    37
                ],
                "id": 9359,
                "original_language": "en",
                "original_title": "Maverick",
                "overview": "Bret Maverick is a gambler who would rather con someone than fight them, and needs an additional $3k in order to enter a winner-takes-all poker game beginning in a few days. He joins forces with a woman with a marvelous Southern accent, and the two try and enter the game.",
                "popularity": 4.4836,
                "poster_path": "/mTVbGGi5PIexmxVzeyFd2RYKwfM.jpg",
                "release_date": "1994-05-20",
                "title": "Maverick",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1661,
                "character": "Riverboat Poker Player",
                "credit_id": "52fe44edc3a36847f80b24bb",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/2oQ9hnAYsoZH61PnjSkuX4Uvd2d.jpg",
                "genre_ids": [
                    10749,
                    18,
                    53
                ],
                "id": 3767,
                "original_language": "en",
                "original_title": "Gilda",
                "overview": "A gambler discovers an old flame while in Argentina, but she's married to his new boss.",
                "popularity": 3.3808,
                "poster_path": "/46eKPjoWEyNBAQKDoXEcDFBcaUw.jpg",
                "release_date": "1946-04-25",
                "title": "Gilda",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 609,
                "character": "Man (uncredited)",
                "credit_id": "638753d30398ab00c8399246",
                "order": 80
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William E. Smith",
            "Bill Smith",
            "Big Bill Smith",
            "William Smith II",
            "William Emmett Smith Jr.",
            "William Emmett Smith"
        ],
        "biography": "William Smith was an American film and television actor who appeared in more than 300 feature films and television productions, best known for playing Anthony Falconetti on the TV mini series \"Rich Man, Poor Man\". He held a BA from Syracuse and an MA in Russian Studies from UCLA.\n\nBorn in Columbia, Missouri, Smith began his acting career at the age of eight in 1942; he entered films as a child actor in such films as The Ghost of Frankenstein, The Song of Bernadette and Meet Me in St. Louis.\n\nHe was a regular on the 1961 ABC television series The Asphalt Jungle, portraying police Sergeant Danny Keller. One of his earliest leading roles was as Joe Riley, a Texas Ranger on the NBC western series Laredo. In 1967, Smith guest starred as Jude Bonner on James Arness's long-lived western Gunsmoke.\n\nSmith was cast as John Richard Parker, brother of Cynthia Ann Parker, both taken hostage in Texas by the Comanche, in the 1969 episode \"The Understanding\" of the syndicated television series Death Valley Days, which was hosted by Robert Taylor. In the story line, Parker contracts the plague, is left for dead by his fellow Comanche warriors, and is rescued by his future Mexican wife, Yolanda (Emily Banks).\n\nHe played outlaw turned temporary sheriff Hendry Brown in the 1969 episode \"The Restless Man\". In that story line, Brown takes the job of sheriff to tame a lawless town, begins to court a young woman (again played by Emily Banks), but soon returns to his deadly outlaw ways in search of bigger thrills.\n\nOn Gunsmoke, Smith appeared in a 1972 episode, \"Hostage!\"; his character beats and rapes Amanda Blake's character Miss Kitty Russell and shoots her twice in the back. Smith has been described as the \"greatest bad-guy character actor of our time\".",
        "birthday": "1933-03-24",
        "deathday": "2021-07-05",
        "gender": 2,
        "homepage": null,
        "id": 98102,
        "imdb_id": "nm0810342",
        "known_for_department": "Acting",
        "name": "William Smith",
        "place_of_birth": "Columbia, Missouri, USA",
        "popularity": 1.4145,
        "profile_path": "/iyIc5xoLPzcy73nQWIZH2nlTarg.jpg"
    }
}