{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dcyPj11c00lOhMESAVWtJKzlHt4.jpg",
                "genre_ids": [
                    18
                ],
                "id": 250538,
                "original_language": "en",
                "original_title": "The Good Lie",
                "overview": "A young refugee of the Sudanese Civil War who wins a lottery for relocation to the United States with three other lost boys. Encountering the modern world for the first time, they develop an unlikely friendship with a brash American woman assigned to help them, but the young man struggles to adjust to this new life and his feelings of guilt about the brother he left behind.",
                "popularity": 2.1286,
                "poster_path": "/yAhoeIwwtPxJ7uf9HLIMHIqWFnL.jpg",
                "release_date": "2014-09-10",
                "title": "The Good Lie",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 543,
                "character": "Jeremiah",
                "credit_id": "54ec973d9251417965001d32",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ger Duany was born in Akobo, South Sudan. He is the fifth child of ten born to mother Nyathak Muon Weng, and father Thabac Duany Wunbiel. He was forcefully recruited as a child soldier during the Second Sudanese Civil War. However, Duany successfully fled to Ethiopia for second a time, at age 14, then to Kenya and finally sought refuge in The United States when he was only sixteen, hence becoming one of the Lost Boys of Sudan. Duany made his debut as an actor in the 2004 philosophical comedy film \"I Heart Huckabees,\" in which he played a refugee called Stephen Nimieri. Duany was picked for the role because the film's producer and director David O. Russell wanted someone who had endured the real life experience of being a refugee. In 2010, Duany made an uncredited appearance in another Russell film, \"The Fighter,\" starring Mark Wahlberg and Christian Bale. He later had a much important role in the 2011 drama \"Restless City.\" In 2010, he produced and starred in the documentary \"Ger: To Be Separate,\" about his search for his family, after 18 years apart, his long journey from a war child to a refugee to a Hollywood actor and an international model, his return to South Sudan, voting for the first time and celebrating the country's newly acquired independence on July 9, 2011.  - IMDb Mini Biography",
        "birthday": "1978-11-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 981717,
        "imdb_id": "nm1563346",
        "known_for_department": "Acting",
        "name": "Ger Duany",
        "place_of_birth": "Akobo - South Sudan",
        "popularity": 0.1997,
        "profile_path": "/4mDAsZqzyWEywvmADeAZh4hGQ1F.jpg"
    }
}