{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nlPCdZlHtRNcF6C9hzUH4ebmV1w.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749,
                    10402
                ],
                "id": 313369,
                "original_language": "en",
                "original_title": "La La Land",
                "overview": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
                "popularity": 11.254,
                "poster_path": "/uDO8zWDhfWwoFdKS4fzkUJt0Rf0.jpg",
                "release_date": "2016-12-01",
                "title": "La La Land",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 17501,
                "character": "Movie Theatre Cashier",
                "credit_id": "6820e56773b35a07107e7975",
                "order": 183
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bernice Utal"
        ],
        "biography": "Bunny Levine has had a passion for entertaining from her earliest memory. At the age of two, she subjected all her relatives to her rendition of the song \"When I Grow Too Old to Dream\" at every possible opportunity. Playing with her sister and friends in pre-school days, her favorite game was a simulation of the performances of the current Hollywood stars, replete with screams and fainting, in the mode of the times. Her greatest regret was that she, unlike her contemporary Shirley Temple, had not been discovered in dance class. By third grade she wrote, directed and starred in the epic, \"Debbie's Diary.\" A year or so later, with increased maturity, she limited her contributions to no more than two of the three elements. All through elementary school and high school, she played either the lead or a character role in school and local productions. Transferring colleges on her marriage after sophomore year made her rethink the wisdom of a short, young, character woman gaining fame and fortune in the field, so she switched majors from Theater Arts, but continued to act, and to work on the college radio station. Already pregnant upon graduation, she put her acting aspirations on the back burner for 25 years, working primarily as a school librarian, to help her underpaid college professor husband raise their three children. Storytelling and book talks helped fill her performing aspirations. Foolishly, she would not participate in community theater, thinking of herself as too much of a professional. Upon early retirement, she began taking acting classes, going on auditions, and gradually immersing herself totally in the fabulous, mad world of acting. Soon she was a member of all the unions and began booking commercials, roles on soaps and episodics, as well as films. Upon her beloved husband, Bernie's, death, she moved from the New York area to the LA market, and continued studying, booking, and striving. Among her credits are Law & Order (1990), The Jimmy Show (2001), Everybody Loves Raymond (1996), _Gilmore Girls_, the soon-to-be-released Charles Busch film, and Las Vegas (2003). She considers herself the most energetic and agile septuagenarian in the field and the oldest living student (her philosophy being that you can never stop learning and exercising the acting muscle).",
        "birthday": "1928-12-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 98186,
        "imdb_id": "nm0505774",
        "known_for_department": "Acting",
        "name": "Bunny Levine",
        "place_of_birth": "East Orange, New Jersey, USA",
        "popularity": 0.1025,
        "profile_path": "/biefLM3edLXSYssImB6BfZEmZF9.jpg"
    }
}