{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6n53UI4mX9QMfe2S0Pgt8mGebY1.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 194,
                "original_language": "fr",
                "original_title": "Le Fabuleux Destin d'Amélie Poulain",
                "overview": "At a tiny Parisian café, the adorable yet painfully shy Amélie accidentally discovers a gift for helping others. Soon Amelie is spending her days as a matchmaker, guardian angel, and all-around do-gooder. But when she bumps into a handsome stranger, will she find the courage to become the star of her very own love story?",
                "popularity": 9.2209,
                "poster_path": "/nSxDa3M9aMvGVLoItzWTepQ5h5d.jpg",
                "release_date": "2001-04-25",
                "title": "Amélie",
                "video": false,
                "vote_average": 7.913,
                "vote_count": 11932,
                "character": "Nymphomaniac (uncredited)",
                "credit_id": "56042e8392514122c00052bc",
                "order": 69
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marcia Nicole Barandshay",
            "Marcia Nicole Noack",
            "Nicole Marica Noah",
            "Cyanide Savior",
            "Manoush Barandaj",
            "Manoush Barandyai"
        ],
        "biography": "Manoush is an actress and singer.\n\nManoush was born 1972 or 1973 as Manoush Barandaj or Manoush Barandyai in Saintes-Maries-de-la-Mer as the third child of a mother of French Manouche Sinti and Ashkali origin and a German-American father. She was raised in Haarlem, North Holland, Cologne, (Germany) and Biel, Switzerland. At the age of 18, Manoush began modelling, but her career stopped short at age 20 after a car accident left scars on her stomach and legs. She immigrated to the United States in the summer of 2006 and returned to Europe approx. in 2015.\n\nManoush pursued film in 1997. In 2000, she was offered the role of the \"nymphomaniac\" in Jean-Pierre Jeunet's Amélie, which opened many doors in the film and TV industry for Manoush, as well as establishing her as a \"bad girl\". Manoush often gets credit as an action and horror actress or as a professional in roles which can be intense and difficult to play. In 2004 she played fighter Carda in Angel of Death 2, closely followed by Timo Rose's The Legend of Moonlight Mountain (2005), Marian Dora's Cannibal (2006), Timo Rose's Barricade (2007), and Andrey Iskanov's Philosophy of a Knife (2008). Manoush won Best Supporting Actress in 2011 at the PollyGrind Film Festival in Las Vegas for her role as Olga in The Super.\n\nShe started out as a cyberpunk singer. Besides her acting and writing career, she worked as a singer in the band Cyanide Savior alongside her husband, Chris Vazquez. In 2016 and 2017 she recorded two tracks with 1980s UK band Bronski Beat and US producer Man Parrish.\n\nSource: Article \"Manoush\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 98195,
        "imdb_id": "nm1720082",
        "known_for_department": "Acting",
        "name": "Manoush",
        "place_of_birth": "Saintes-Maries-de-la-Mer, Bouches-du-Rhône, France",
        "popularity": 0.102,
        "profile_path": "/uSlWqpM1fHJVhmC68kRXZB0MyKk.jpg"
    }
}