{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGOw65ZmfgGfistCjuNsazjs6j9.jpg",
                "genre_ids": [
                    37,
                    18,
                    12
                ],
                "id": 281957,
                "original_language": "en",
                "original_title": "The Revenant",
                "overview": "In the 1820s, a frontiersman, Hugh Glass, sets out on a path of vengeance against those who left him for dead after a bear mauling.",
                "popularity": 9.7586,
                "poster_path": "/ji3ecJphATlVgWNY0B0RVXZizdf.jpg",
                "release_date": "2015-12-25",
                "title": "The Revenant",
                "video": false,
                "vote_average": 7.536,
                "vote_count": 18675,
                "character": "French Trapper",
                "credit_id": "56d7016e9251413402016a89",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Vincent Leclerc is a Canadian actor from Trois-Rivières, Quebec. He is most noted for his performance in the 2018 film The Fall of the American Empire (La chute de l'empire américain), for which he received a Prix Iris nomination for Best Supporting Actor at the 21st Quebec Cinema Awards in 2019, and his starring role as Séraphin Poudrier in the television series Les Pays d'en haut, for which he won the Gémeaux Award for Best Actor in a Short Run Drama Series in 2016.\n\nHe was also a Canadian Screen Award nominee for Best Performance in a Program or Series Produced for Digital Media at the 4th Canadian Screen Awards in 2016 for the web series Coming Out.\n\nHe has also appeared in the films Piché: The Landing of a Man (Piché, entre ciel et terre), The Storm Within (Rouge sang), White House Down, The Little Queen (La Petite Reine), Gurov and Anna and Days of Happiness (Les Jours heureux), and the television series Mauvais karma, Being Human, 19-2 (French), 19-2 (English), This Life, Bellevue, Bad Blood, District 31 and Way Over Me (Sortez-moi de moi).",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://agencerbl.com/talents/vincent-leclerc/",
        "id": 982065,
        "imdb_id": "nm1296188",
        "known_for_department": "Acting",
        "name": "Vincent Leclerc",
        "place_of_birth": "Trois-Rivières, Québec, Canada",
        "popularity": 0.2082,
        "profile_path": "/sCNPUiSUQs1kfurlDXm8qgjQ8Mj.jpg"
    }
}