{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bvXUe1KBYOAl3Eh2jT6c1sQwmTf.jpg",
                "genre_ids": [
                    35
                ],
                "id": 11356,
                "original_language": "en",
                "original_title": "The Odd Couple",
                "overview": "In New York, Felix, a neurotic news writer who just broke up with his wife, is urged by his chaotic friend Oscar, a sports journalist, to move in with him, but their lifestyles are as different as night and day are, so Felix's ideas about housekeeping soon begin to irritate Oscar.",
                "popularity": 3.2731,
                "poster_path": "/d3dKPpzEi7WfgmoMnMwWyQnd2ja.jpg",
                "release_date": "1968-05-16",
                "title": "The Odd Couple",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 608,
                "character": "Go-go Dancer (uncredited)",
                "credit_id": "5daabe953d355700166da380",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Heaven St. John",
            "Angelique"
        ],
        "biography": "Angelique Pettyjohn (March 11, 1943 – February 14, 1992) was an American actress and burlesque queen. Pettyjohn was born Dorothy Lee Perrins in Los Angeles, California, and raised in Salt Lake City, Utah. Her first credited film appearances were in 1967 under the name Angelique. They include The Touch of Her Flesh and The Love Rebellion. Her big break came that same year in the Elvis Presley film, Clambake. Pettyjohn was one of the go-go dancers in the opening scene of the comedy The Odd Couple (1968), starring Jack Lemmon and Walter Matthau, and she also tested for the role of Nova in Planet of the Apes the same year (Linda Harrison got the part). She appeared as the drill thrall Shahna in the Star Trek episode, \"The Gamesters of Triskelion.\" In 1969 she starred in the cult horror film The Mad Doctor of Blood Island, appeared as Cherry in the biker film Hell's Belles, played a saloon girl in the Glenn Ford Western Heaven with a Gun, and starred in Childish Things, co-directed by John Derek. Her 1970s films included Tell Me That You Love Me, Junie Moon (1970) starring Liza Minnelli, the sci-fi exploitation film The Curious Female (1970), and the low-budget crime drama The G.I. Executioner (1971) where she played a topless dancer.",
        "birthday": "1943-03-11",
        "deathday": "1992-02-14",
        "gender": 1,
        "homepage": null,
        "id": 98241,
        "imdb_id": "nm0678821",
        "known_for_department": "Acting",
        "name": "Angelique Pettyjohn",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 8.845,
        "profile_path": "/jWUycuJJwbQceR5IIzGoC2CPZIB.jpg"
    }
}