{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lgBZlJ1LHQel5nneNQMoesmvc7l.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 1271,
                "original_language": "en",
                "original_title": "300",
                "overview": "Based on Frank Miller's graphic novel, \"300\" is very loosely based the 480 B.C. Battle of Thermopylae, where the King of Sparta led his army against the advancing Persians; the battle is said to have inspired all of Greece to band together against the Persians, and helped usher in the world's first democracy.",
                "popularity": 9.6619,
                "poster_path": "/h7Lcio0c9ohxPhSZg42eTlKIVVY.jpg",
                "release_date": "2007-03-07",
                "title": "300",
                "video": false,
                "vote_average": 7.19,
                "vote_count": 14208,
                "character": "Captain",
                "credit_id": "52fe42ecc3a36847f802d281",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/y51M7Ca95sCXTCDvJaRP1uzxKbg.jpg",
                "genre_ids": [
                    10752,
                    28,
                    36
                ],
                "id": 652,
                "original_language": "en",
                "original_title": "Troy",
                "overview": "In year 1250 B.C. during the late Bronze age, two emerging nations begin to clash. Paris, the Trojan prince, convinces Helen, Queen of Sparta, to leave her husband Menelaus, and sail with him back to Troy. After Menelaus finds out that his wife was taken by the Trojans, he asks his brother Agamemnon to help him get her back. Agamemnon sees this as an opportunity for power. They set off with 1,000 ships holding 50,000 Greeks to Troy.",
                "popularity": 16.4153,
                "poster_path": "/a07wLy4ONfpsjnBqMwhlWTJTcm.jpg",
                "release_date": "2004-05-13",
                "title": "Troy",
                "video": false,
                "vote_average": 7.165,
                "vote_count": 10612,
                "character": "Eudorus",
                "credit_id": "52fe4265c3a36847f801b0af",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/leukkAoRu9rsa3s8oaLm8C10EWw.jpg",
                "genre_ids": [
                    28,
                    80
                ],
                "id": 10027,
                "original_language": "en",
                "original_title": "Unleashed",
                "overview": "Raised as a slave, Danny is used to fighting for his survival. In fact, his \"master,\" Bart, thinks of him as a pet and goes as far as leashing him with a collar so they can make money in fight clubs, where Danny is the main contender. When Bart's crew is in a car accident, Danny escapes and meets a blind, kindhearted piano tuner who takes him in and uses music to free the fighter's long-buried heart.",
                "popularity": 5.6636,
                "poster_path": "/gghvmS3UxtOw1UHIgYjpeZNxHil.jpg",
                "release_date": "2005-02-02",
                "title": "Unleashed",
                "video": false,
                "vote_average": 6.938,
                "vote_count": 2075,
                "character": "Raffles",
                "credit_id": "52fe430b9251416c75001569",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "文生·雷根",
            "وینسنت ریگان"
        ],
        "biography": "Vincent Regan (born May 16, 1965) is a British film and television actor.Regan has over 15 stage roles to his credit, most recently as Achilles in Troilus and Cressida at the Edinburgh International Festival. In association with The Royal Shakespeare Company, the festival presented director Peter Stein's strongly cast and visually striking production. He is famous for Ancient Greece-based films 300, in which he played the Captain, Troy, where he played Eudorus, Achilles' second in command, and Clash of the Titans, in which he played King Cepheus. Regan is also a screenwriter and director, developing projects for his own film company. His script, Come Like Shadows, is an accessible but classic interpretation of Macbeth headlining Sean Bean and Tilda Swinton, will be directed by John Maybury. He also appeared briefly as a sexually confused character in British series The Street.\n\nDescription above from the Wikipedia article Vincent Regan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1965-05-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 9831,
        "imdb_id": "nm0716490",
        "known_for_department": "Acting",
        "name": "Vincent Regan",
        "place_of_birth": "Swansea, Wales",
        "popularity": 1.0041,
        "profile_path": "/7VHu79GciN5QlQTmWdBS86eE2mu.jpg"
    }
}