{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u06SympEEMb7pLhR9W3tvydHT9L.jpg",
                "genre_ids": [
                    27,
                    14
                ],
                "id": 653,
                "original_language": "de",
                "original_title": "Nosferatu, eine Symphonie des Grauens",
                "overview": "The mysterious Count Orlok summons Thomas Hutter to his remote Transylvanian castle in the mountains. The eerie Orlok seeks to buy a house near Hutter and his wife, Ellen. After Orlok reveals his vampire nature, Hutter struggles to escape the castle, knowing that Ellen is in grave danger. Meanwhile Orlok's servant, Knock, prepares for his master to arrive at his new home.",
                "popularity": 4.6315,
                "poster_path": "/zv7J85D8CC9qYagAEhPM63CIG6j.jpg",
                "release_date": "1922-02-16",
                "title": "Nosferatu",
                "video": false,
                "vote_average": 7.672,
                "vote_count": 2302,
                "character": "Knock",
                "credit_id": "52fe4265c3a36847f801b13f",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Aleksandr Granakh ",
            "Александр Гранах",
            "Schaje Granoch"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nAlexander Granach (April 18, 1890 – March 14, 1945) was a popular German actor in the 1920s and 1930s who immigrated to the United States in 1938.\n\nGranach was born Jessaja Gronach in Werbowitz (Wierzbowce/Werbiwci) (Horodenka district, Austrian Galicia then, now Verbivtsi, Ivano-Frankivsk Oblast, Ukraine), to Jewish parents and rose to theatrical prominence at the Volksbühne in Berlin. Granach entered films in 1922; among the most widely exhibited of his silent efforts was the vampire classic Nosferatu (1922), in which the actor was cast as Knock, the lunatic counterpart to Renfield, effectively a substitute name for Dracula. He co-starred in such major early German talkies as Kameradschaft (1931).\n\nThe Jewish Granach fled to the Soviet Union when Hitler came to power. When the Soviet Union also proved inhospitable, he settled in Hollywood, where he made his first American film appearance as Kopalski in Ernst Lubitsch's Ninotchka (1939) for Metro-Goldwyn-Mayer. Granach proved indispensable to film makers during the war years, effectively portraying both dedicated Nazis (he was Julius Streicher in The Hitler Gang, 1944) and loyal anti-fascists. Perhaps his best role was as Gestapo Inspector Alois Gruber in Fritz Lang's Hangmen Also Die! (1943). His last film appearance was in MGM's The Seventh Cross (1944), in which almost the entire supporting cast was prominent European refugees.",
        "birthday": "1890-04-18",
        "deathday": "1945-03-14",
        "gender": 2,
        "homepage": null,
        "id": 9842,
        "imdb_id": "nm0334603",
        "known_for_department": "Acting",
        "name": "Alexander Granach",
        "place_of_birth": "Werbowitz, Galicia, Austria-Hungary [now Verbivtsi, Kolomyia Raion, Ivano-Frankivsk Oblast, Ukraine]",
        "popularity": 0.1037,
        "profile_path": "/6oeYojEL9uLSJezeChUNFiRJohs.jpg"
    }
}