{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u06SympEEMb7pLhR9W3tvydHT9L.jpg",
                "genre_ids": [
                    27,
                    14
                ],
                "id": 653,
                "original_language": "de",
                "original_title": "Nosferatu, eine Symphonie des Grauens",
                "overview": "The mysterious Count Orlok summons Thomas Hutter to his remote Transylvanian castle in the mountains. The eerie Orlok seeks to buy a house near Hutter and his wife, Ellen. After Orlok reveals his vampire nature, Hutter struggles to escape the castle, knowing that Ellen is in grave danger. Meanwhile Orlok's servant, Knock, prepares for his master to arrive at his new home.",
                "popularity": 4.6315,
                "poster_path": "/zv7J85D8CC9qYagAEhPM63CIG6j.jpg",
                "release_date": "1922-02-16",
                "title": "Nosferatu",
                "video": false,
                "vote_average": 7.672,
                "vote_count": 2302,
                "character": "Professor Bulwer",
                "credit_id": "52fe4265c3a36847f801b14b",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Isidor Gesang"
        ],
        "biography": "John Gottowt (born Isidor Gesang; 15 June 1881 – 29 August 1942) was an Austrian actor, stage director and film director for theatres and silent movies.\n\nGottowt was born in Lemberg, Austria-Hungary (present-day Lviv, Ukraine) into a Jewish family. After his education in Vienna, he joined the Deutsches Theater in Berlin in 1905, working for Max Reinhardt as an actor and director. Gottowt was mainly active in different theatres in Berlin as a character actor and director.\n\nHis first silent film appearance was in Paul Wegener’s Der Student von Prag (\"The Student of Prague\") (1913). In 1920 he appeared in Robert Wiene's Genuine and took the main role in the early science fiction film Algol. In 1921 he played Professor Bulwer (Abraham van Helsing) in the classic silent film Nosferatu directed by F.W. Murnau.\n\nGottowt made also several films with his brother-in-law Henrik Galeen but, as a Jew, was banned in 1933 from working as a professional actor. After a few years in Denmark he moved to Kraków in Poland. He was murdered in 1942 by an SS officer while in hiding in Wieliczka, disguised as a Roman Catholic priest.",
        "birthday": "1881-06-15",
        "deathday": "1942-08-29",
        "gender": 2,
        "homepage": null,
        "id": 9845,
        "imdb_id": "nm0332024",
        "known_for_department": "Acting",
        "name": "John Gottowt",
        "place_of_birth": "Lemberg, Galicia, Austria-Hungary [now Lviv, Ukraine]",
        "popularity": 0.4873,
        "profile_path": "/eFdamjvO75jaUxO29gPesnfBtsP.jpg"
    }
}