{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oaRdRdqahtSvHK6VkOphVwGtPRN.jpg",
                "genre_ids": [
                    18
                ],
                "id": 221,
                "original_language": "en",
                "original_title": "Rebel Without a Cause",
                "overview": "After moving to a new town, troublemaking teen Jim Stark is supposed to have a clean slate, although being the new kid in town brings its own problems. While searching for some stability, Stark forms a bond with a disturbed classmate, Plato, and falls for local girl Judy. However, Judy is the girlfriend of neighborhood tough, Buzz. When Buzz violently confronts Jim and challenges him to a drag race, the new kid's real troubles begin.",
                "popularity": 4.9524,
                "poster_path": "/yHStsC8rRRfIjqRN38BQsLh6S7k.jpg",
                "release_date": "1955-10-27",
                "title": "Rebel Without a Cause",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1681,
                "character": "Police Lieutenant (uncredited)",
                "credit_id": "52fe4228c3a36847f80087db",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/h1vBJ0uN4QCbBb5WVKxmtfTrHoY.jpg",
                "genre_ids": [
                    37
                ],
                "id": 11697,
                "original_language": "en",
                "original_title": "The Man Who Shot Liberty Valance",
                "overview": "Questions arise when Senator Stoddard attends the funeral of a local man named Tom Doniphon in a small Western town. Flashing back, we learn Doniphon saved Stoddard, then a lawyer, when he was roughed up by a crew of outlaws terrorizing the town, led by Liberty Valance. As the territory's safety hung in the balance, Doniphon and Stoddard, two of the only people standing up to him, proved to be very important, but different, foes to Valance.",
                "popularity": 2.5324,
                "poster_path": "/4C1R0LEivLjbv3swAzJfzh0tzXl.jpg",
                "release_date": "1962-04-13",
                "title": "The Man Who Shot Liberty Valance",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 1216,
                "character": "Mayor Winder",
                "credit_id": "57000452c3a3686e92002e5e",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul Birch (born January 13, 1912, Atmore, Alabama – died May 24, 1969, St. George's, Grenada) was an American actor of stage and film.\n\nBirch was born Paul Smith in Atmore, Alabama. He was a veteran of 39 movies, 50 stage dramas and a number of television shows including the Hallmark Hall of Fame (1951). In the late 1950s he starred, along with William Campbell, in the syndicated Canadian series Cannonball (1958), a half-hour drama/adventure show about truckers. He was the original \"Marlboro Man\" in TV commercials and played both Union General Ulysses S. Grant and Confederate General Robert E. Lee in several historical plays.\n\nHe started out as the first of the original members of the Pasadena Playhouse and his stage work included The Caine Mutiny. He also had a recurring role as Captain Carpenter, the boss of Lt. Phillip Gerard in The Fugitive starring David Janssen. He starred in some low-budget science-fiction films in the 1950s, including The Beast with a Million Eyes (1955), Day the World Ended (1955), Not of This Earth (1957) and the cult classic Queen of Outer Space (1958). Birch also had small roles in It's a Mad, Mad, Mad, Mad World (1963), and Dead Heat on a Merry-Go-Round (1967).\n\nDescription above from the Wikipedia article Paul Birch, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1912-01-13",
        "deathday": "1969-05-24",
        "gender": 2,
        "homepage": null,
        "id": 98450,
        "imdb_id": "nm0083280",
        "known_for_department": "Acting",
        "name": "Paul Birch",
        "place_of_birth": "Atmore, Alabama, USA",
        "popularity": 0.3061,
        "profile_path": "/elUNlCDIIXhXFc1LZbYr5cV3V2T.jpg"
    }
}