{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x1eYwWTT8KbT8MvZBioxJ4ctZ35.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1000492,
                "original_language": "fr",
                "original_title": "Je verrai toujours vos visages",
                "overview": "Since 2014, France's restorative justice programmes have offered a safe space for supervised dialogue between offenders and victims. Grégoire, Nawelle, and Sabine, victims of heists and violent robberies, agree to join one of these discussion groups alongside offenders Nassim, Issa, and Thomas, all convicted of violent robberies. Meanwhile Chloé, a victim of childhood sexual abuse, prepares for dialogue with her own agressor after learning he has moved back into town.",
                "popularity": 1.8139,
                "poster_path": "/zIgyDGsmIyMAf0ppg7QKTuIM1He.jpg",
                "release_date": "2023-03-29",
                "title": "All Your Faces",
                "video": false,
                "vote_average": 7.965,
                "vote_count": 636,
                "character": "Fanny",
                "credit_id": "6374b7f9d7dcd200cd364967",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/580aO5umsOX5FAFmD6ObYvVuk6p.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 579245,
                "original_language": "fr",
                "original_title": "Hors Normes",
                "overview": "For twenty years, Bruno and Malik have lived in a different world—the world of autistic children and teens. In charge of two separate nonprofit organizations (The Hatch & The Shelter), they train young people from underprivileged areas to be caregivers for extreme cases that have been refused by all other institutions. It’s an exceptional partnership, outside of traditional settings, for some quite extraordinary characters.",
                "popularity": 2.0622,
                "poster_path": "/lcg4GhZCgntHSZRVFYQ1oShdpFw.jpg",
                "release_date": "2019-10-23",
                "title": "The Specials",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 952,
                "character": "IGAS Inspector",
                "credit_id": "5e49b74b9b861600116271fb",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Suliane Brahim (born 1 April 1978) is a French actress. With a background in theatre, she has also performed in film and on television, most recently in a lead role in the series Zone Blanche (Black Spot).\n\nBrahim was born the eldest of three children in Chartres, France, to a father of Moroccan descent and a Breton mother. She was raised in Bourges. She studied the Swahili language at the Institut national des langues et civilisations orientales, planning on a humanitarian career, as well as theatre at École nationale supérieure des arts et techniques du théâtre.\n\nIn 1996, Brahim performed in her first play and continued into the next decade, becoming a boarder and, later, member of Comédie-Française. Her performances onstage include Peer Gynt, Dom Juan, Lucrezia Borgia and Romeo and Juliet.\n\nSince 2013, Brahim has been in several films and television shows, leading to her being cast as Major Laurène Weiss in the France 2 thriller Zone Blanche in 2017 and Virginie in The Swarm (French: La Nuée) in 2020. She is also a recipient of the Prix Suzanne Bianchetti, given to the most promising young French actress.\n\nSource: Article \"Suliane Brahim\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1978-04-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 984598,
        "imdb_id": "nm1593609",
        "known_for_department": "Acting",
        "name": "Suliane Brahim",
        "place_of_birth": "Chartres, Eure-et-Loir, France",
        "popularity": 0.2606,
        "profile_path": "/mHaiU8xFkd0UfNhQyYz0yr8hDol.jpg"
    }
}