{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/38yjZWYBI0xxNqoBKiGyA4UZjk.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 6075,
                "original_language": "en",
                "original_title": "Carlito's Way",
                "overview": "Free after years in prison, Carlito Brigante intends to give up his criminal ways, but it's not long before the ex-con is sucked back into the New York City underworld. Reconnecting with his dancer girlfriend, Carlito gets entangled in the shady dealings of his friend Dave Kleinfeld, who also serves as his lawyer. An encounter with shifty gangster Benny Blanco sets the duo on a dangerous path.",
                "popularity": 5.3983,
                "poster_path": "/g6D7mjQtndu768cusGmoEQY9fTB.jpg",
                "release_date": "1993-11-10",
                "title": "Carlito's Way",
                "video": false,
                "vote_average": 7.83,
                "vote_count": 3307,
                "character": "Bartender",
                "credit_id": "55df45c3c3a368346a0001bc",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Orlando Rafael Urdaneta (Maracaibo, October 24, 1950) is a Venezuelan actor, presenter, playwright, visual artist, and comedian. He began his acting career as a child, debuting on the \"Bambilandia\" program on Venevision, and was later cast in theater productions, telenovelas, and films. He also stood out as a host of game shows and radio and television programs, working as a comedian. In 1979, he married actress Chelo Rodríguez.\n\nHe has received the National Film Award in recognition of his career. His work has earned him several awards, such as the Municipal Theater Award in 1997. The following year, he was honored by La Casa del Artista, and in 1998 and 1999, he received the National Association of Cinematographic Artists (ANAC) award for his participation in the Venezuelan films Pandemonium and 100 años de perdón.",
        "birthday": "1946-10-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 985134,
        "imdb_id": "nm0881809",
        "known_for_department": "Acting",
        "name": "Orlando Urdaneta",
        "place_of_birth": "Maracaibo, Venezuela",
        "popularity": 0.14,
        "profile_path": "/zre1ADIgACzmXRAdVGM7gGakNWj.jpg"
    }
}