{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pxkQAIhC7LXN5s5B23lnvCMgva5.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 654,
                "original_language": "en",
                "original_title": "On the Waterfront",
                "overview": "A prizefighter-turned-longshoreman with a conscience goes up against labor leaders to expose corruption, extortion, and murder among the union ranks.",
                "popularity": 5.1767,
                "poster_path": "/fKjLZy9W8VxMOp5OoyWojmLVCQw.jpg",
                "release_date": "1954-06-22",
                "title": "On the Waterfront",
                "video": false,
                "vote_average": 7.882,
                "vote_count": 1669,
                "character": "Glover",
                "credit_id": "52fe4265c3a36847f801b1f7",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leif Erikson",
            "Glenn Erickson",
            "Glen Erickson",
            "Glenn Erikson",
            "William Wycliffe Anderson"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nLeif Erickson (born William Wycliffe Anderson) was an American stage, film, and television actor.\n\nErickson was born in Alameda, California, near San Francisco. He worked as a soloist in a band as vocalist and trombone player, performed in Max Reinhardt's productions, and then gained a small amount of stage experience in a comedy vaudeville act. Initially billed by Paramount Pictures as Glenn Erickson, he began his screen career as a leading man in Westerns.\n\nErickson enlisted in the United States Navy during World War II. Rising to the rank of Chief Petty Officer in the Naval Aviation Photographic Unit, he served as a military photographer, shooting film in combat zones, and as an instructor. He was shot down twice in the Pacific as well as receiving two Purple Hearts. Erickson was in the unit that filmed and photographed the Japanese surrender aboard the USS Missouri in Tokyo Bay on September 2, 1945. Over four years service, he shot more than 200,000 feet of film for the Navy.\n\nErickson's first films were two 1933 band films with Betty Grable before starting a string of Buster Crabbe Western films based on Zane Grey novels. He would go on to appears in films such as The Snake Pit, Sorry, Wrong Number, Abbott and Costello Meet Captain Kidd, Invaders from Mars, On the Waterfront, A Gathering of Eagles, Roustabout, The Carpetbaggers and Mirage.\n\nOne of his more notable roles was as Deborah Kerr's macho husband in the stage and film versions of Tea and Sympathy. He appeared with Greta Garbo, as her brother in Conquest (1937). He played the role of Pete, the vindictive boat engineer, in the 1951 remake of the famed musical Show Boat. His final appearance in a feature film was in Twilight's Last Gleaming (1977).\n\nErickson appeared frequently on television; he was cast as Dr. Hillyer in \"Consider Her Ways\" (1964) and as Paul White in \"The Monkey's Paw—A Retelling\" (1965) on CBS's The Alfred Hitchcock Hour. However, he is probably best known for The High Chaparral, which aired on NBC from 1967 until 1971. He portrayed a rancher, Big John Cannon, determined to establish a cattle empire in the Arizona Territory while keeping peace with the Apache. Erickson guest-starred in several television series, including Rawhide, Bonanza, Gunsmoke, Marcus Welby, M.D., Medical Center, Cannon, The Rifleman, The Rockford Files, and the 1977 series Hunter. His final role was in an episode of Fantasy Island in 1984.\n\nErickson was married to actress Frances Farmer from 1936 until 1942. The same day that his divorce from Farmer was finalized, June 12, 1942, he married actress Margaret Hayes. They divorced a month later. He married Ann Diamond in 1945. They had two children, William Leif Erickson (born 1946 - died 1971 in a car accident) and Susan Irene Erickson (born 1950).\n\nErickson died of cancer in Pensacola, Florida, on January 29, 1986, aged 74 CLR",
        "birthday": "1911-10-27",
        "deathday": "1986-01-29",
        "gender": 2,
        "homepage": null,
        "id": 9865,
        "imdb_id": "nm0002063",
        "known_for_department": "Acting",
        "name": "Leif Erickson",
        "place_of_birth": "Alameda, California, USA",
        "popularity": 0.4132,
        "profile_path": "/nu85lcj5KYc1CZkvmsciw2SGM1V.jpg"
    }
}