{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 3366,
                "character": "Laughing Dancer",
                "credit_id": "566da91d92514150010063f5",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pia Scott",
            "Sarah M. Scott "
        ],
        "biography": "Sarah Scott is an actress and intimacy coordinator. She was born in Lincoln, Nebraska and grew up in North Texas. Scott graduated from New York University in 2002 with a degree in Culture & Communications and a minor in Ballet. Early years were spent acting in fringe theatres around New York City, an internship with New Line Cinema, and completing the Shakespearean Studies program at the Royal Academy of Dramatic Art in London before moving to Los Angeles to pursue acting professionally. Scott first appeared on television in a featured part on Fox's Arrested Development (2003). She quickly became popular in the commercial and dance worlds, booking iconic ads like the dancing iPod silhouettes and getting cast to play showgirls, hip-hop divas and groupies on programs including CSI: NY (2004), True Blood (2008), Nip/Tuck (2003), Castle (2009), Bones (2005), Masters of Sex (2013), and The Orville (2017). Scott's most notable performance to date is her haunting portrayal of Courtney Love in Soaked in Bleach (2015). The explosive docu/drama examines the death of rocker Kurt Cobain that was ruled a suicide in 1994. Soaked in Bleach was the third most popular documentary on IMDb in 2015.\n\nIn 2018 Scott became an active member of the entertainment community helping to raise awareness about sexual harassment and began to work with her labor union, SAG-AFTRA, on making contractual changes to better protect it's members. In 2019 Scott became certified as intimacy coordinator through the Intimacy Professionals Association and since then her work has taken off in the emerging field.",
        "birthday": "1983-09-28",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.intimacyprofessionalsassociation.com/sarahscott-bio",
        "id": 98664,
        "imdb_id": "nm1552940",
        "known_for_department": "Acting",
        "name": "Sarah Scott",
        "place_of_birth": "Lincoln - Nebraska - USA",
        "popularity": 0.1858,
        "profile_path": "/y31s1T72B6LNTwArkhed4i9l5RT.jpg"
    }
}