{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pxkQAIhC7LXN5s5B23lnvCMgva5.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 654,
                "original_language": "en",
                "original_title": "On the Waterfront",
                "overview": "A prizefighter-turned-longshoreman with a conscience goes up against labor leaders to expose corruption, extortion, and murder among the union ranks.",
                "popularity": 5.1767,
                "poster_path": "/fKjLZy9W8VxMOp5OoyWojmLVCQw.jpg",
                "release_date": "1954-06-22",
                "title": "On the Waterfront",
                "video": false,
                "vote_average": 7.882,
                "vote_count": 1669,
                "character": "Big Mac",
                "credit_id": "52fe4265c3a36847f801b1fb",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/i7n9u1SppzXcSO2EVgwEehzABzm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 17529,
                "original_language": "en",
                "original_title": "True Grit",
                "overview": "The murder of her father sends a teenage tomboy on a mission of 'justice', which involves avenging her father's death. She recruits a tough old marshal, 'Rooster' Cogburn because he has 'true grit', and a reputation of getting the job done.",
                "popularity": 4.1273,
                "poster_path": "/9TjGjAD2deCtIG4ebi8LhIyFK6j.jpg",
                "release_date": "1969-06-11",
                "title": "True Grit",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 818,
                "character": "Judge Parker",
                "credit_id": "52fe472f9251416c75090855",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James A. Westerfield"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJames A. Westerfield (22 March 1913 – 20 September 1971) was an American actor of stage, film, and television.\n\nBorn in Nashville, Tennessee, to candy-maker Brasher Omier Westerfield and his wife Dora Elizabeth Bailey, he was raised in Detroit, Michigan. (A news story in the June 12, 1949, issue of The Brooklyn Daily Eagle calls the information in the preceding sentence into question. It describes Westerfield as \"the son of a famous producer-director\" and says that he was \"a youngster in Denver, Col.\")\n\nHe became interested in theatre as a young man and in the 1930s joined Gilmor Brown's famed Pasadena Community Playhouse, appearing in dozens of plays. He played in numerous films following his debut in 1940, then went to New York City and appeared on Broadway, winning two New York Drama Critics' Circle Awards for his supporting roles in The Madwoman of Chaillot and Detective Story. He then returned to Hollywood and made more than 40 more films. Westerfield maintained an interest in the theatre. He directed more than 50 musicals in a summer-musical tent he owned in Danbury, Connecticut, and was the original stage director and producer for the Greek Theatre in Los Angeles. He directed three seasons of \"Theatre Under the Stars\" in Vancouver, British Columbia, and appeared in musical roles with the Detroit Civic Light Opera, the Los Angeles Civic Light Opera, and the San Francisco Civic Light Opera.\n\nOn film, Westerfield had roles in The Magnificent Ambersons (1942), On The Waterfront (1954), Lucy Gallant (1955), the 1957 Budd Boetticher-directed Western Decision at Sundown starring Randolph Scott, Cowboy (1958), a repeating role in The Absent-Minded Professor (1961) and its sequel Son of Flubber (1963), Birdman of Alcatraz (1962), Man's Favorite Sport (1964), The Sons of Katie Elder (1965), Hang 'Em High (1968) and True Grit (1969).\n\nWesterfield had many roles on television, including seven episodes as John Murrel from 1963 to 1964 on ABC's The Travels of Jaimie McPheeters, starring child actor Kurt Russell in the title role. He made two guest appearances on Perry Mason, including the role of Sheriff Bert Elmore in the 1957 episode, \"The Case of the Angry Mourner.\" He also appeared in an episode of The Lone Ranger in 1954 entitled \"Texas Draw.\"\n\nWesterfield's other appearances were on such series as The Rifleman, The Californians, Richard Diamond, Private Detective, The Alaskans, The Rebel, Straightaway, Going My Way, The Asphalt Jungle, Hazel, The Andy Griffith Show, Daniel Boone, The Beverly Hillbillies, and Gunsmoke. He played the circus leader, Dr. Marvello, in an episode of Lost in Space \"Space Circus\" (1966).\n\nWesterfield as a young man was a roommate of fellow Pasadena Playhouse actor George Reeves. The two remained close friends until Reeves's death in 1959.\n\nWesterfield was married to Alice G. Fay (an actress under the name Fay Tracey), who, along with his mother, survived him. Westerfield died from a heart attack in Woodlands Hills, California, at the age of fifty-eight.",
        "birthday": "1913-03-22",
        "deathday": "1971-09-20",
        "gender": 2,
        "homepage": null,
        "id": 9866,
        "imdb_id": "nm0922599",
        "known_for_department": "Acting",
        "name": "James Westerfield",
        "place_of_birth": "Nashville, Tennessee, USA",
        "popularity": 0.5741,
        "profile_path": "/r4YlHYDrJiGUhd61kkkiv3WNEmc.jpg"
    }
}