{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jXDselREPq8TOVGM4dzBBUM7xVk.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 399579,
                "original_language": "en",
                "original_title": "Alita: Battle Angel",
                "overview": "When Alita awakens with no memory of who she is in a future world she does not recognize, she is taken in by Ido, a compassionate doctor who realizes that somewhere in this abandoned cyborg shell is the heart and soul of a young woman with an extraordinary past.",
                "popularity": 9.1217,
                "poster_path": "/xRWht48C2V8XNfzvPehyClOvDni.jpg",
                "release_date": "2019-01-31",
                "title": "Alita: Battle Angel",
                "video": false,
                "vote_average": 7.244,
                "vote_count": 9591,
                "character": "Iron City Resident (uncredited)",
                "credit_id": "682dcd28da43493afddb35e4",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Evan Christopher King",
            "DJ Freakjuice",
            "Freakjuice",
            "Evan C. King"
        ],
        "biography": "Evan King is an American actor and comedian from Houston, TX. Evan grew up with a love for entertaining his family and friends. In 1988, Evan enrolled in acting classes at APM Studios under the director/coach Gary Chason . Evan spent the 1990s and 2000s doing plays. perfecting the craft of method acting and creating original characters like the DJ emotionally stuck in the '90s \"DJ Freakjuice\". Since 2002, he has performed in various theaters, comedy clubs, and coffee houses in Texas, New York, and California, including Houston's Laff Stop.\n\nEvan King is best known for playing naive driver \"Jack\" in the award-winning Nollywood comedy hit American Driver (2017), streaming on Amazon Prime. The film won Best Comedy at the People's Film Festival in 2017. In 2019, Evan was awarded best comic actor for the film at the US-China International Arts Festival. Evan has been acting in film, TV, and commercials for 20 years. In 2013, he appeared as Russian groundskeeper \"Vlad\", in the golf web comedy series Fore! (2013), which he promoted in character with the cast on CBS' Great Day Houston (2005). In 2015, he costarred as an Australian talent manager, \"Agent Nobich\", in the comedy Temp to Fire (2015), streaming on Amazon Prime. In 2016, he appeared as an '80s wannabe rap artist, \"Cory\", in the comedy Copycat (2016) on Tubi. Evan had a supporting role as \"Lenny,\" a Golden Girls fan, in the LGBTQ romantic drama Brotherly Love (2017), which played in L.A. cinemas as well as Amazon Prime. Evan has also performed in numerous live comedy and theater shows in Texas, New York, and California, such as releasing a mini stand-up special Evan King: On the Rebound (2007) in 2007. In 2018 and 2019, he opened for musicians Paul Wall and Lil' Flip in concerts as his '90s character, \"DJ Freakjuice\".\n\nIn November 2023, Evan will premiere his new comedy music video DJ Freakjuice: Your Baby's Daddy (2023), as well as launch a podcast DJ Freakjuice: '90s4Life (2016) in December 2023. That same year Evan reunited with American Driver (2017) Costar, Jim Iyke to costar in Jim's Nollywood action comedy Rent a Room (2023), set to stream online in 2025.",
        "birthday": "1982-10-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 98724,
        "imdb_id": "nm2027650",
        "known_for_department": "Acting",
        "name": "Evan King",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.0754,
        "profile_path": "/bgwRJnZTQYbSoU0UO8DJkAX9Oam.jpg"
    }
}