{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8uNjWHsSW3TSOWDU4EY76H5MzAG.jpg",
                "genre_ids": [
                    28,
                    53,
                    12
                ],
                "id": 657,
                "original_language": "en",
                "original_title": "From Russia with Love",
                "overview": "Agent 007 is back in the second installment of the James Bond series, this time battling a secret crime organization known as SPECTRE. Russians Rosa Klebb and Kronsteen are out to snatch a decoding device known as the Lektor, using the ravishing Tatiana to lure Bond into helping them. Bond willingly travels to meet Tatiana in Istanbul, where he must rely on his wits to escape with his life in a series of deadly encounters with the enemy.",
                "popularity": 4.7986,
                "poster_path": "/zx4V17FP8oclNvOpTgs2iCCtiYk.jpg",
                "release_date": "1963-10-10",
                "title": "From Russia with Love",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3154,
                "character": "Tatiana 'Tanja' Romanova",
                "credit_id": "52fe4265c3a36847f801b317",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nDaniela Bianchi (born 31 January 1942) is an Italian actress, whose best known part was Tatiana Romanova in the 1963 James Bond movie From Russia with Love.\n\nBorn in Rome, she was the 1st runner-up in the 1960 Miss Universe contest, where she was also voted Miss Photogenic by the press. Her film career began in 1958. In From Russia with Love her voice was dubbed by Barbara Jefford.\n\nShe made a number of French and Italian movies after From Russia with Love, the last being Scacco Internazionale in 1968. One of her later films was Operation Kid Brother (also known as OK Connery and Operation Double 007), which was a James Bond spoof filmed in English (though Bianchi was again dubbed) and starring Sean Connery's brother, Neil Connery. In 1970, she retired from acting to marry a Genoan shipping magnate, with whom she has a son.\n\nDescription above from the Wikipedia article Daniela Bianchi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1942-01-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 9896,
        "imdb_id": "nm0000938",
        "known_for_department": "Acting",
        "name": "Daniela Bianchi",
        "place_of_birth": "Rome, Lazio, Italy",
        "popularity": 0.6049,
        "profile_path": "/6pdO17mFaxwWEvarNhmHEuL1HZs.jpg"
    }
}