{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8uNjWHsSW3TSOWDU4EY76H5MzAG.jpg",
                "genre_ids": [
                    28,
                    53,
                    12
                ],
                "id": 657,
                "original_language": "en",
                "original_title": "From Russia with Love",
                "overview": "Agent 007 is back in the second installment of the James Bond series, this time battling a secret crime organization known as SPECTRE. Russians Rosa Klebb and Kronsteen are out to snatch a decoding device known as the Lektor, using the ravishing Tatiana to lure Bond into helping them. Bond willingly travels to meet Tatiana in Istanbul, where he must rely on his wits to escape with his life in a series of deadly encounters with the enemy.",
                "popularity": 4.7986,
                "poster_path": "/zx4V17FP8oclNvOpTgs2iCCtiYk.jpg",
                "release_date": "1963-10-10",
                "title": "From Russia with Love",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3154,
                "character": "Vida",
                "credit_id": "52fe4265c3a36847f801b33b",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alizia Gur",
            "Alizia Gross"
        ],
        "biography": "Aliza Gur was born Aliza Gross in Ramat Gan, Israel, in 1944. She was Miss Israel of 1960 in the Miss Universe pageant, placing in the top 15. Her parents had fled Germany during the rise to power of Nazi leader Adolf Hitler and they eventually settled in Israel, where she and her brother were born.  She emigrated to the US in her 20s and settled in California, where she began her film and television career. Her television credits include guest appearances on Get Smart(1965) and The Wild Wild West (1965), among other shows. Her film credits include From Russia with Love (1963), Kill a Dragon (1967) and the cult vampire film Beast of Morocco(1968) (she was also, at 12 years of age, an extra in The Ten Commandments (1956). Her parents came to the United States and settled in Cleveland, Ohio, for a time. They passed away in the mid-'70s.",
        "birthday": "1944-04-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 9902,
        "imdb_id": "nm0348518",
        "known_for_department": "Acting",
        "name": "Aliza Gur",
        "place_of_birth": null,
        "popularity": 0.355,
        "profile_path": "/3HvjmvUO5rBmin1YLyAEkD7Kn3C.jpg"
    }
}