{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mO5rgg8mr4fUIMrZykwP2MjPVmZ.jpg",
                "genre_ids": [
                    10402,
                    35,
                    27
                ],
                "id": 27327,
                "original_language": "en",
                "original_title": "Phantom of the Paradise",
                "overview": "Singer-songwriter Winslow Leach seeks revenge on the nefarious music producer Swan, who steals both Winslow's music and his favorite singer for the grand opening of Swan's new rock palace, the Paradise.",
                "popularity": 4.7856,
                "poster_path": "/qDOtGWeSQNwB3dG7Amt1K0JW0az.jpg",
                "release_date": "1974-10-31",
                "title": "Phantom of the Paradise",
                "video": false,
                "vote_average": 7.484,
                "vote_count": 704,
                "character": "Groupie",
                "credit_id": "52fe4542c3a368484e04fdb9",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tiffany Jones",
            "Janice Jordan",
            "Janis Lynn",
            "Janis Eve Lynn",
            "Janus Blyth"
        ],
        "biography": "Lovely, dynamic, and personable brunette beauty Janus Blythe made her extremely strong and commanding presence felt in a choice bunch of high-quality 1970s horror pictures and exploitation features. The appealingly spunky and attractive Janus began her acting career in the mid-'70s with small roles as a room mate in the splendidly sleazy psycho opus The Centerfold Girls (1974) and a groupie in Brian De Palma's marvelously delirious Phantom of the Paradise (1974). Blythe achieved her greatest cult popularity with her terrific portrayal of Ruby, the fed-up and semi-civilized rebellious teenage daughter of the dangerous desert cannibal clan who defects from her highly dysfunctional brood and sides with a family of opposing normal outsiders in Wes Craven's outstanding fright film classic The Hills Have Eyes (1977). Blythe was originally offered the part of Lynn, but demanded that she try out for Ruby instead. Veteran B-movie actor and good friend Michael Pataki informed Blythe about the auditions for 'The Hills Have Eyes'. Janus reprised the role of Ruby in the atrocious belated sequel, The Hills Have Eyes Part II (1984). Other memorable parts include a small town tramp in Tobe Hooper's excellent Eaten Alive (1976), and a hapless lass who has a harrowing close call with the titular murderous ghoul in the hugely enjoyable The Incredible Melting Man (1977). Her last acting credit to date was the early '90s action item Soldier's Fortune (1991). Janus was interviewed in the nifty documentary Invasion of the Scream Queens (1992). More recently, the still-gorgeous and vivacious Blythe happily reminisced about her most famous role in the immensely informative and entertaining retrospective DVD documentary Looking Back at 'the Hills Have Eyes' (2003). Outside of acting, Janus Blythe hosts her own talk show on Los Angeles public access cable television.\n\n- IMDb Mini Biography By: woodyanders",
        "birthday": "1951-01-29",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 99062,
        "imdb_id": "nm0090041",
        "known_for_department": "Acting",
        "name": "Janus Blythe",
        "place_of_birth": null,
        "popularity": 0.1565,
        "profile_path": "/7ybqDKJhfV0gIfGKgpZ0o19LBvL.jpg"
    }
}