{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cXQH2u7wUIX1eoIdEj51kHXoWhX.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 100,
                "original_language": "en",
                "original_title": "Lock, Stock and Two Smoking Barrels",
                "overview": "A card shark and his unwillingly-enlisted friends need to make a lot of cash quick after losing a sketchy poker match. To do this they decide to pull a heist on a small-time gang who happen to be operating out of the flat next door.",
                "popularity": 3.0514,
                "poster_path": "/6pJB2t3MbQUy9m5pFIBHXLqnqNd.jpg",
                "release_date": "1998-08-28",
                "title": "Lock, Stock and Two Smoking Barrels",
                "video": false,
                "vote_average": 8.108,
                "vote_count": 6866,
                "character": "Paul",
                "credit_id": "52fe4217c3a36847f8003637",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Huggy Leaver (born Hugh Leaver), sometimes credited as Huggy Lever, is a British actor and former vocalist of The Plastix, an early UK Punk band. He subsequently became lead singer of the Hastings Mod Revival Band Teenbeats from 1979-1982.\n\nHe has appeared in Trial & Retribution, Birds of a Feather, A Touch of Frost and Black Books. He also played Paul in Lock, Stock and Two Smoking Barrels and Mario in the 2000 film Going Off Big Time and appeared as a cab driver in The League of Extraordinary Gentlemen and the pawn shop owner in Fast & Furious 6.\n\nMore recently, he played the recurrent role of Clint in EastEnders and Delivery Man 2 in Never Let Me Go.\n\nHe has a love of motorcycles and has customized some in the streetfighter style, as created by designer/artist Andy Sparrow, in his strip Bloodrunners in the 1980s. One such streetfighter was featured in the 1995 movie Mad dogs and Englishmen and ridden by C. Thomas Howell's despatch rider character.",
        "birthday": "1957-06-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 992,
        "imdb_id": "nm0495363",
        "known_for_department": "Acting",
        "name": "Huggy Leaver",
        "place_of_birth": "Hastings, Sussex, England",
        "popularity": 0.0682,
        "profile_path": null
    }
}