{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7g5v2zXedkwiFqDlWqcoRUUQYD6.jpg",
                "genre_ids": [
                    18,
                    28,
                    35
                ],
                "id": 11712,
                "original_language": "ja",
                "original_title": "椿三十郎",
                "overview": "Toshiro Mifune swaggers and snarls to brilliant comic effect in Kurosawa's tightly paced, beautifully composed \"Sanjuro.\" In this companion piece and sequel to \"Yojimbo,\" jaded samurai Sanjuro helps an idealistic group of young warriors weed out their clan's evil influences, and in the process turns their image of a proper samurai on its ear.",
                "popularity": 3.2847,
                "poster_path": "/zW47oIH3bc3ggmmmzTvKqM4Fqjk.jpg",
                "release_date": "1962-01-01",
                "title": "Sanjuro",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 661,
                "character": "Samurai",
                "credit_id": "52fe447f9251416c75036d4d",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "田中邦卫"
        ],
        "biography": "Kunie Tanaka (田中 邦衛 Tanaka Kunie, November 23, 1932 - March 24, 2021) was a Japanese actor. He had his first notable role in 1960 as a thug in Akira Kurosawa's The Bad Sleep Well, and worked with the director again on Sanjuro. Tanaka is well known for his roles in Kinji Fukasaku's yakuza films, namely the Battles Without Honor and Humanity series. He also appeared in Masaki Kobayashi's Kwaidan.\n\nHe has been nominated for five Japanese Academy Awards, winning the Best Supporting Actor statuette for Gakko in 1993. He appeared as the lecherous Shinjiro Ishiyama, nicknamed Aodaishō, the antagonist of the hero, played by Yūzō Kayama, in all of the Wakadaishō series of films. The character Kizaru, from Eiichiro Oda's manga series One Piece, is modeled after Tanaka.",
        "birthday": "1932-11-23",
        "deathday": "2021-03-24",
        "gender": 2,
        "homepage": null,
        "id": 99247,
        "imdb_id": "nm0848993",
        "known_for_department": "Acting",
        "name": "Kunie Tanaka",
        "place_of_birth": "Toki, Gifu Prefecture, Japan",
        "popularity": 1.2267,
        "profile_path": "/5tAfFgLIaY9Jrq2R87tS7C0O2oW.jpg"
    }
}