{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2cBCFvMDLZowXKvMaCGot5dmHUz.jpg",
                "genre_ids": [
                    99,
                    80,
                    36
                ],
                "id": 22074,
                "original_language": "en",
                "original_title": "Capitalism: A Love Story",
                "overview": "Michael Moore comes home to the issue he's been examining throughout his career: the disastrous impact of corporate dominance on the everyday lives of Americans (and by default, the rest of the world).",
                "popularity": 2.9629,
                "poster_path": "/zJBkIPakBXdu3cEgGqKCPHUNXVE.jpg",
                "release_date": "2009-09-06",
                "title": "Capitalism: A Love Story",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 545,
                "character": "Self (archive footage)",
                "credit_id": "5e611301459ad6001352f54f",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ioseb Besarionis dze Jughashvili",
            "Joseph Vissarionovich Stalin",
            "Iósif Vissariónovich Dzhugashvili",
            "Iossif Vissarionovitch Djougachvili",
            "Josef Wissarionowitsch Stalin",
            "Иосиф Виссарионович Сталин",
            "Iosif Vissarionovič Stalin",
            "Iosseb Bessarionis dse Dschughaschwili",
            "იოსებ ბესარიონის ძე ჯუღაშვილი",
            "Иосиф Виссарионович Джугашвили",
            "Iossif Wissarionowitsch Dschugaschwili",
            "Iosif Vissarionovič Džugašvili",
            "სტალინი",
            "იოსებ ჯუღაშვილი"
        ],
        "biography": "Iosif Vissarionovich Stalin (real name Dzhugashvili) was born in Gori, Tiflis province, Russian Empire - a Soviet political, statesman, military and party figure, a Russian revolutionary. Actual leader of the USSR. General Secretary of the Central Committee of the CPSU (1922-1953). Marshal of the Soviet Union (1943), Generalissimo of the Soviet Union (1945). People's Commissar of Defense of the USSR (since July 19, 1941), Chairman of the Council of People's Commissars of the USSR and Chairman of the USSR State Defense Committee. He also held the following positions: From April 3, 1922 to February 10, 1934 - Secretary General, then - Secretary of the Central Committee of the All-Union Communist Party of Bolsheviks (from 1952 - CPSU), from December 19, 1930, after Vyacheslav Molotov took the post of Chairman of the Council of People's Commissars of the USSR instead of Alexey Rykov. In 1912, at the suggestion of V.I. Lenin was included in the Central Committee of the RSDLP. At the same time, Joseph Dzhugashvili finally chose the pseudonym \"Stalin\" for himself. During the October Revolution, the Second All-Russian Congress was elected a member of the All-Russian Central Executive Committee and the Council of People's Commissars. In 1922, at the Plenum of the Central Committee of the RCP (b), he was elected a member of the Orgburo and the Politburo of the Central Committee of the RCP (b), as well as the General Secretary of the Central Committee of the RCP (b) (when Lenin was Chairman of the Council of People's Commissars of the USSR). In 1930, after the weakening and death of Lenin, Stalin finally emerged victorious from the internal party struggle, becoming the leader of the state. Stalin was the actual founder of the totalitarian dictatorship in the USSR. In 1928-1929 he was the initiator of the transition from the course of the New Economic Policy (NEP) to the course of industrialization, collectivization and building a planned economy, and intensified the policy of the cultural revolution in the USSR.",
        "birthday": "1878-12-18",
        "deathday": "1953-03-05",
        "gender": 2,
        "homepage": null,
        "id": 994271,
        "imdb_id": "nm0821672",
        "known_for_department": "Acting",
        "name": "Joseph Stalin",
        "place_of_birth": "Gori, Caucasus, Russian Empire [now Georgia]",
        "popularity": 1.2438,
        "profile_path": "/e1BfBnc5qN1YxbBh1Y9TY8mMca2.jpg"
    }
}