{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nCl5KzxUs4rVVlAdixDf4r5AbbZ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 887,
                "original_language": "en",
                "original_title": "The Best Years of Our Lives",
                "overview": "It's the hope that sustains the spirit of every GI: the dream of the day when he will finally return home. For three WWII veterans, the day has arrived. But for each man, the dream is about to become a nightmare.",
                "popularity": 5.3127,
                "poster_path": "/gd5EoAU4MM57sW3vlWxJ0NMM8cV.jpg",
                "release_date": "1946-12-25",
                "title": "The Best Years of Our Lives",
                "video": false,
                "vote_average": 7.79,
                "vote_count": 694,
                "character": "Miss Barbour (uncredited)",
                "credit_id": "64e2832d371097011c54bbf5",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mary Dawne Arden"
        ],
        "biography": "Mary Dawne Arden (July 30, 1933 – December 13, 2014) was an American actress who worked in both Hollywood and Italy.\n\nArden was born in St. Louis, Missouri, but moved to New York City at the age of 12 to attend an art school.\n\nArden had a successful modeling career in Europe and appeared in numerous Italian movies during the 1960s. This actress is not to be confused with Mary Arden, who worked in Hollywood in the 1930s and 1940s but worked professionally as Mary Arden.\n\nMary Arden's best-known role is that of model Peggy Peyton in Mario Bava's Blood and Black Lace. Aside from acting in the film, Arden was also responsible for writing its English dialogue, as she seemed to the original translated screenplay to be too stilted.[1] She also made an uncredited cameo appearance in Juliet of the Spirits as an on-screen TV personality. In the 1960s, she also worked in the United States as a member of the June Taylor Dancers, on the televised Jackie Gleason show.\n\nWhile in Italy, she also appeared in photo novels including a well-known series of the period, entitled Kriminal. After living and working in Italy for eight years, she returned to the United States in 1979, and performed in only a couple of more roles, before retiring completely from the cinema.\n\nShe spent nine years in Latin America where she held marketing and managing positions for Helena Rubinstein Cosmetics. When she returned to NYC, she began her own marketing and body language consulting practice, Arden Associates.\n\nArden was also on the faculty of New York University, in the Department of Culture and Communication, where she taught business communication.\n\nArden married A.A. Hansi in Rome in 1965.\n\nArden died in Calvary Hospital in Brooklyn, New York, on December 13, 2014, at the age of 81.",
        "birthday": "1933-07-30",
        "deathday": "2014-12-13",
        "gender": 1,
        "homepage": null,
        "id": 99507,
        "imdb_id": "nm0034001",
        "known_for_department": "Acting",
        "name": "Mary Arden",
        "place_of_birth": "Saint Louis, Missouri, USA",
        "popularity": 0.0687,
        "profile_path": "/vWCQgM1Aw0JMvXxpcZjgDkHN91U.jpg"
    }
}