{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/feO6v1UMaCDFsshStLpAv2FwARz.jpg",
                "genre_ids": [
                    18,
                    10749,
                    53
                ],
                "id": 130150,
                "original_language": "en",
                "original_title": "Labor Day",
                "overview": "Two strangers are drawn together under incredible circumstances. What starts as an unforeseen encounter over a long holiday weekend soon becomes a second chance love story.",
                "popularity": 5.1936,
                "poster_path": "/iQdbCtk1Q3TdZRBKSLU1Vh870l7.jpg",
                "release_date": "2013-12-27",
                "title": "Labor Day",
                "video": false,
                "vote_average": 7.016,
                "vote_count": 1244,
                "character": "Young Frank",
                "credit_id": "52fe4b51c3a368484e183145",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/7nFfW8RM50PANBIdfI9Ut3FdoSB.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 310593,
                "original_language": "it",
                "original_title": "Youth",
                "overview": "Two lifelong friends bond whilst vacationing in a luxury Swiss Alps lodge as they ponder retirement. While Fred has no plans to resume his musical career despite the urging of his loving daughter Lena, Mick is intent on finishing the screenplay for what may be his last important film for his muse Brenda. And where will inspiration lead their younger friend Jimmy, an actor grasping to make sense of his next performance?",
                "popularity": 2.7917,
                "poster_path": "/ceRN51oeadmccAvqvDxpnnNRcLU.jpg",
                "release_date": "2015-05-20",
                "title": "Youth",
                "video": false,
                "vote_average": 6.899,
                "vote_count": 2129,
                "character": "Screenwriter in Love",
                "credit_id": "562cf308c3a3681b4d008de0",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "تام لیپینسکی"
        ],
        "biography": "Tom Lipinski is an actor and documentary producer best known for his role as Trevor in the hit television show Suits. He is also the recipient of an Edward R. Murrow Award for his work producing Gone South, an investigative journalism podcast about crime in the deep south.\n\nBorn and raised in Massachusetts, Tom attended Concord Public High school where he was an All-American athlete and later went to Brown University where he majored in history. In New York, he started his career as an actor working in experimental theater for Obie Award winning Theater of a Two-Headed Calf. Other theater credits include leading roles in plays by A.R. Gurney and Christopher Shinn.\n\nFor film and television, he has worked with acclaimed directors like Steven Soderbergh in The Knick, Jason Reitman in Labor Day and Paolo Sorrentino in Youth. In addition to his recurring role as Trevor in the hit USA/Netflix show Suits, Tom has also recurred across multiple series including Billions and the recent television adaptation of Bong Joon Ho's Snowpiercer.\n\nAs a producer, Tom co-created the Edward R Murrow Award winning podcast Gone South. Over three seasons, the show has investigated the unsolved murder of a prominent Assistant District Attorney in New Orleans, a loose-knit group of traveling criminals known as the Dixie Mafia, and the serial killing of four sex workers in the border town of Laredo, Texas.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 995198,
        "imdb_id": "nm2906174",
        "known_for_department": "Acting",
        "name": "Tom Lipinski",
        "place_of_birth": null,
        "popularity": 0.5238,
        "profile_path": "/kxqjDoNgGGTIEUUcH2K9cBe0KoD.jpg"
    }
}