{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dxXhdYuQyuMPX0lCEo6LhCv69Xq.jpg",
                "genre_ids": [
                    18
                ],
                "id": 13416,
                "original_language": "en",
                "original_title": "Friday Night Lights",
                "overview": "A small, turbulent town in Texas obsesses over their high school football team to an unhealthy degree. When the star tailback, Boobie Miles, is seriously injured during the first game of the season, all hope is lost, and the town's dormant social problems begin to flare up. It is left to the inspiring abilities of new coach Gary Gaines to instill in the other team members -- and, by proxy, the town itself -- a sense of self-respect and honor.",
                "popularity": 3.1459,
                "poster_path": "/8HIqpOgqShRc3TAleabnYispDl1.jpg",
                "release_date": "2004-10-08",
                "title": "Friday Night Lights",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 594,
                "character": "Odessa Doctor",
                "credit_id": "62ebd960223a8b005d7e3115",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tommy G. Kendrick has worked with film and television directors including Peter Berg, Karen Gaviota, John Lee Hancock, Ellen Kuras, Richard Linklater, David Lynch, Tim McCanlies, Michael E. Satrazemis, Michael Waxman, Scott Winant and others over the course of his career.\n\nA SAG and AFTRA member (now SAG-AFTRA) since 1978, Tommy G. Kendrick is also a founding member of the SAG-AFTRA Austin Actor's Conservatory.\n\nTommy is a native Texan who started his acting career at Dallas Theater Center. Among many other productions, Tommy was an original cast member of Preston Jones' 'The Oldest Living Graduate', 'LuAnn Hampton Laverty Oberlander' and 'The Last Meeting of the Knights of the White Magnolia' which came to be known as The Texas Trilogy.\n\nTommy began his on camera career focusing on commercials and corporate/educational content. He spent a number of years in Los Angeles where he successfully pursued a career in commercials before returning to live and work in his native Texas.\n\nFor the past two decades, Tommy G. Kendrick has focused on film and television work and is based out of Austin, Texas.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 995329,
        "imdb_id": "nm0447729",
        "known_for_department": "Acting",
        "name": "Tommy G. Kendrick",
        "place_of_birth": null,
        "popularity": 0.0544,
        "profile_path": "/aQ23Ym132PJGGJjnov1dsj7xxt7.jpg"
    }
}