{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aBPok9tHcYb9mcHPsLnPIXdkQc2.jpg",
                "genre_ids": [
                    28,
                    80
                ],
                "id": 9462,
                "original_language": "cn",
                "original_title": "猛龍過江",
                "overview": "Tang Lung arrives in Rome to help his cousins in the restaurant business. They are being pressured to sell their property to the syndicate, who will stop at nothing to get what they want. When Tang arrives he poses a new threat to the syndicate, and they are unable to defeat him. The syndicate boss hires the best Japanese and European martial artists to fight Tang, but he easily finishes them off.",
                "popularity": 5.298,
                "poster_path": "/m7AIITQ624sfldI4SsX4htXPH1f.jpg",
                "release_date": "1972-12-30",
                "title": "The Way of the Dragon",
                "video": false,
                "vote_average": 7.367,
                "vote_count": 1202,
                "character": "Italian Beauty",
                "credit_id": "52fe44fac3a36847f80b57cb",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Malisa Lang",
            "Melisa Lang",
            "Marisa Longo",
            "Mary Louisa Longo",
            "Maria Luisa Longo",
            "Malisa Long",
            "Melissa Long",
            "Melissa Lang"
        ],
        "biography": "Malisa Longo (born 13 July 1950) is an Italian actress, model and writer.\n\nBorn Maria Luisa Longo in Venice, at young age Longo moved to Rome where she started a career as a model; she entered the Miss Italia beauty contest, winning the Miss Cinema and the Miss Lazio titles. After having appeared in a number of commercials, Longo made her acting debut in 1968, in the Antonio Margheriti's giallo film The Young, the Evil, and the Savage. She then appeared in a number of films, sometimes in main roles, and was especially active in the Nazisploitation and commedia sexy all'italiana genres.\n\nShe is perhaps most famous worldwide for her cameo early in Bruce Lee's film Way of the Dragon.\n\nLongo retired from acting in 1997. In 2000 she debuted as a writer with the novel Così come sono, and her works include poetries (Il cantico del corpo) and essays (Aggiungi un seggio a tavola).\n\nLongo was married to film producer Riccardo Billi and resides in Chicago, Illinois.\n\nDescription above from the Wikipedia article Malisa Longo, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1950-07-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 99536,
        "imdb_id": "nm0519427",
        "known_for_department": "Acting",
        "name": "Malisa Longo",
        "place_of_birth": "Venice, Veneto, Italy",
        "popularity": 0.5928,
        "profile_path": "/gTxjWPBlcSFHOWYvk2io2soRxMa.jpg"
    }
}