{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ebcXKfXz3ly9TXh5Anef8LYhfEn.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 87825,
                "original_language": "en",
                "original_title": "Trouble with the Curve",
                "overview": "Slowed by age and failing eyesight, crack baseball scout Gus Lobel takes his grown daughter along as he checks out the final prospect of his career. Along the way, the two renew their bond, and she catches the eye of a young player-turned-scout.",
                "popularity": 4.4992,
                "poster_path": "/zLZQVmxOj5kICbS5Pq7rB1cbPvP.jpg",
                "release_date": "2012-09-21",
                "title": "Trouble with the Curve",
                "video": false,
                "vote_average": 6.995,
                "vote_count": 1643,
                "character": "Neil",
                "credit_id": "630f4905cb8028007d8b745a",
                "order": 46
            },
            {
                "adult": false,
                "backdrop_path": "/dcyPj11c00lOhMESAVWtJKzlHt4.jpg",
                "genre_ids": [
                    18
                ],
                "id": 250538,
                "original_language": "en",
                "original_title": "The Good Lie",
                "overview": "A young refugee of the Sudanese Civil War who wins a lottery for relocation to the United States with three other lost boys. Encountering the modern world for the first time, they develop an unlikely friendship with a brash American woman assigned to help them, but the young man struggles to adjust to this new life and his feelings of guilt about the brother he left behind.",
                "popularity": 2.1286,
                "poster_path": "/yAhoeIwwtPxJ7uf9HLIMHIqWFnL.jpg",
                "release_date": "2014-09-10",
                "title": "The Good Lie",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 543,
                "character": "INS Clerk",
                "credit_id": "54ed8a5dc3a3680b80003b03",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Clifton is an Atlanta based actor who, in addition to his on-screen appearances, has performed on stage in New York and at numerous top regional and local theatres. He formerly served on the Artistic staff of the Alliance Theatre and also held the position of Casting Director at Actor's Express, where he is an Associate Artist, teaching artist and National New Play Network Artist Ambassador. Clifton is the Associate Producer/Casting Director at Atlanta's Theatrical Outfit. His auditioning and industry workshops have been featured at American College Theatre Festival, Southeastern Theatre Conference and Georgia Thespian Conference. He is a proud member of Actors' Equity Association and holds a BA in Drama from the University of Georgia and an MFA in Performing Arts from the Savannah College of Art and Design. Clifton is from Iron City, a small town in southwest-GA.  - IMDb Mini Biography By: Clifton Guterman",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 995454,
        "imdb_id": "nm3623484",
        "known_for_department": "Acting",
        "name": "Clifton Guterman",
        "place_of_birth": "Iron City - Georgia - USA",
        "popularity": 0.0168,
        "profile_path": null
    }
}