{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/55A2d6rWj0SYb52xKzx6DweiuEM.jpg",
                "genre_ids": [
                    35,
                    18,
                    80
                ],
                "id": 74306,
                "original_language": "en",
                "original_title": "God Bless America",
                "overview": "Fed up with the cruelty and stupidity of American culture, an unlikely duo goes on a killing spree, killing reality TV stars, bigots and others they find repugnant.",
                "popularity": 2.081,
                "poster_path": "/t8g7rIcFquJqsqwIISZ1L5zou1j.jpg",
                "release_date": "2012-05-11",
                "title": "God Bless America",
                "video": false,
                "vote_average": 6.974,
                "vote_count": 1002,
                "character": "Shady Gun Dealer",
                "credit_id": "65008a2fe0ca7f00cbea954c",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Frank Castle",
            "Mike Tristan",
            "Michael Tristano",
            "迈克·特里斯塔诺"
        ],
        "biography": "Although he himself denies it, Mike Tristano is a nearly legendary figure in the world of independent cinema and \"B\" movies. His body of work as an armorer, on-set weapons handler and special makeup effects artist is truly amazing, and some of the low-budget films he has written and directed have become underground cult classics. He is the only \"true\" non-union supplier of movie weaponry and armorer services, historical and military props, special makeup FX and weapons-related effects. Always believing that independent and low-budget filmmakers should have access to the same quality of weapons and special makeup effects for their films as the major studios, he always made his services affordable and still maintained top quality in his work for them. His incredible and ongoing number of credits, and his sterling reputation, are undeniable testimony to that fact.\n\nHe spent several years bouncing around the world as a \"hired gun,\" working with various military intelligence agencies, and as a weapons advisor, K&R negotiator, and Executive Security Consultant, before going into the film business full time.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 99601,
        "imdb_id": "nm0873158",
        "known_for_department": "Crew",
        "name": "Mike Tristano",
        "place_of_birth": null,
        "popularity": 0.1338,
        "profile_path": null
    }
}