{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self (archive footage)",
                "credit_id": "5fc989ff23168c0041b9b074",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Adriane Galisteu, born on April 18, 1973, in São Paulo, Brazil, is a Brazilian television presenter, actress, and model. She rose to fame in the 1990s, gaining widespread media attention as the girlfriend of Formula 1 driver Ayrton Senna before his tragic death in 1994. This relationship brought her into the public eye, where she became known as a cultural figure in Brazil.\n\nFollowing her time in the spotlight, Galisteu built a successful career in television and media. She has hosted numerous TV shows across Brazilian networks, covering a range of formats from talk shows to reality television. Known for her charisma and versatility, she has also appeared in various theater productions and authored books, including O Caminho das Borboletas, where she shares personal experiences about her relationship with Senna.\n\nWith a career spanning decades, Galisteu remains a prominent media personality in Brazil, celebrated for her talent, resilience, and enduring presence in the entertainment industry.",
        "birthday": "1973-04-18",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.adrianegalisteu.com.br/",
        "id": 996215,
        "imdb_id": "nm0302235",
        "known_for_department": "Acting",
        "name": "Adriane Galisteu",
        "place_of_birth": "São Paulo, São Paulo, Brazil",
        "popularity": 0.3001,
        "profile_path": "/m3p6SZBg9sqe7sXt5FEEQSaOZLz.jpg"
    }
}