{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cUqXHZtnptgvyAE1hN47Wsf3ami.jpg",
                "genre_ids": [
                    35
                ],
                "id": 57214,
                "original_language": "en",
                "original_title": "Project X",
                "overview": "Three high school seniors throw a party to make a name for themselves. As the night progresses, things spiral out of control as word of the party spreads.",
                "popularity": 7.1734,
                "poster_path": "/lUPDGT3lyRrq8SvWuNWG2DP64bR.jpg",
                "release_date": "2012-03-01",
                "title": "Project X",
                "video": false,
                "vote_average": 6.887,
                "vote_count": 6565,
                "character": "JB's Girl",
                "credit_id": "52fe4929c3a36847f818c1d3",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " \tNichole Sakura O'Connor",
            "Nichole Bloom"
        ],
        "biography": "Nichole Sakura (formerly credited as Nichole Bloom) is a Japanese-American actress best known for her roles as Cheyenne Thompson in the NBC sitcom Superstore (2015–2021), Amanda in Shameless (2014-2016), and as Emily Davis in the horror video game Until Dawn developed by Supermassive Games.\n\nSakura was born to a Japanese mother and an American father with Irish ancestry. She was raised in San Francisco and usually spent her summers as a child visiting relatives in Japan. She went to Santa Susana High School in Simi Valley and later attended the University of Southern California, from which she graduated after three years as a Theater major. After college Sakura briefly attended classes at The Groundlings Theatre but was cut from the program, which she considered \"devastating.\"\n\nShe had the recurring role of Amanda on Shameless from 2014 to 2016.\n\nIn 2015, Sakura starred in the music video for one of Phantoms’ two singles, “Broken Halo,” from their EP of the same name. Later that year, she was added to the main cast of the NBC sitcom Superstore as Cheyenne, a 17-year-old store employee who is pregnant at the start of the series. The series followed a group of employees working at Cloud 9, a fictional big-box chain store in St. Louis, Missouri.\n\nShe had voice roles in numerous animated film and television series, including Suzume, OK K.O.! Let's Be Heroes, Kiff, and Central Park. In 2023, she had a recurring role as a ghost named Jessica on CBS' sitcom Ghosts. In November that year, Sakura starred alongside troupe Please Don’t Destroy in the comedy film Please Don't Destroy: The Treasure of Foggy Mountain, directed by Paul Briganti and written by the former.\n\nDescription above from the Wikipedia article Nichole Sakura, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1989-12-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 996697,
        "imdb_id": "nm3783235",
        "known_for_department": "Acting",
        "name": "Nichole Sakura",
        "place_of_birth": "Santa Clara County, California, USA",
        "popularity": 1.4107,
        "profile_path": "/j7QUSfmbUNR89imZs3ZOt4tW2uH.jpg"
    }
}