{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6WRrGYalXXveItfpnipYdayFkQB.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 1422,
                "original_language": "en",
                "original_title": "The Departed",
                "overview": "To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewise. While an undercover cop curries favor with the mob kingpin, a career criminal rises through the police ranks. But both sides soon discover there's a mole among them.",
                "popularity": 13.4795,
                "poster_path": "/nT97ifVT2J1yMQmeq20Qblg61T.jpg",
                "release_date": "2006-10-04",
                "title": "The Departed",
                "video": false,
                "vote_average": 8.159,
                "vote_count": 15527,
                "character": "Adult Film Actress (uncredited)",
                "credit_id": "5f025f32d70594003709aa2b",
                "order": 101
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Rebecca Luve",
            "Rebeca Love",
            "Ребекка Лав"
        ],
        "biography": "Rebecca Love is a Porn Actress from United States. She was born in Richmond, Virginia on March 30, 1977. Rebecca grew up in the Adirondacks in a small redneck town. However, when Rebecca graduated she moved to Florida for higher learning. Rebecca went to college for Performing Arts. During schooling, Rebecca was an exotic dancer which progressed into an Adult Film Actress, Magazine Model then into a Feature Entertainer. Rebecca has been in the Adult Industry since 1995. She furthered her career and had the opportunity to be in Erotica Films on HBO, Showtime and Cinemax. Now, Rebecca is producing a successful podcast with \"Adult Film Star Network\" which she runs and Stand-Up Comedy while still taking improv classes in Las Vegas to improv her acting skills.\n\nRebecca has green eyes and brown hair. She is 157 cm tall and weighs 52 kg. Her measurements are 36DD-28-36.\n\nRebecca Love is also known as Rebecca Luv and Rebeca Love.",
        "birthday": "1977-03-30",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.rebeccalove.com/",
        "id": 99688,
        "imdb_id": "nm1157339",
        "known_for_department": "Acting",
        "name": "Rebecca Love",
        "place_of_birth": "Richmond, Virginia, USA",
        "popularity": 2.909,
        "profile_path": "/vuW2UPh980GQSGcxxLZLdAoURwM.jpg"
    }
}