{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oa6yoeeZtjxdgzAcZtbCSW3GEE9.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 11462,
                "original_language": "en",
                "original_title": "Suspicion",
                "overview": "A sheltered young heiress elopes with a handsome playboy. Gradually, she discovers his dishonest nature.",
                "popularity": 2.6894,
                "poster_path": "/clWNlzlbyaEoIK63lcFjqBmXoQz.jpg",
                "release_date": "1941-11-14",
                "title": "Suspicion",
                "video": false,
                "vote_average": 7.134,
                "vote_count": 853,
                "character": "Mrs. Fitzpatrick (uncredited)",
                "credit_id": "5dce99318a84d20014692f5a",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jocelyn Howarth",
            "Enid Joyce Howarth"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nConstance Worth (also known as Jocelyn Howarth) (19 August 1911 – 18 October 1963) was an Australian actress who became a Hollywood star in the late 1930s.  As Jocelyn Howarth, she experienced success in Ken Hall's films The Squatter's Daughter (1933) and The Silence of Dean Maitland (1934). Cinesound put her under an 18-month contract and paid for her to tour Australia as their rising star.\n\nKen Hall claimed Howarth's first screen test showed \"light and shade, good diction, no accent and (that) she undoubtedly could act with no sign of the self-consciousness which almost always characterised the amateur.\" In late 1933, Smith's Weekly raved enthusiastically about the young actress; \"Young Joy Howarth who leapt into publicity when she became the Squatter's Daughter a few months ago, is just the big hit nowadays....\"\n\nIn April 1936, she sailed for the United States and Hollywood. After six months of unsuccessful effort, including a near-fatal incident with a gas stove in her flat, she signed a contract with RKO Pictures, taking the leading female roles as Constance Worth, in China Passage and Windjammer. The change of name was related to her first role with established Hollywood actor Vinton Hayworth. After Windjammer, RKO offered her no more films. Her next role was in Willis Kent's 1938 exploitation quickie, The Wages of Sin, playing a young woman lured into prostitution. For the next 12 years, she appeared in a mix of leading, supporting, and uncredited roles in B films. In mid-1939, she returned to act on stage in Australia, but went back to the U.S. before the end of the year. In 1941, she appeared in an uncredited minor role in Alfred Hitchcock's Suspicion, and in the same year, a leading role in the gangster B film Borrowed Hero. Her last film was a minor role in the 1949 Johnny Mack Brown Western Western Renegades. Throughout her career and as late as 1961, publicity in Australia repeatedly suggested she was on the verge of signing a major studio contract again. This did not happen.",
        "birthday": "1912-08-19",
        "deathday": "1963-10-18",
        "gender": 1,
        "homepage": null,
        "id": 99751,
        "imdb_id": "nm0941666",
        "known_for_department": "Acting",
        "name": "Constance Worth",
        "place_of_birth": " Sydney, Australia",
        "popularity": 0.074,
        "profile_path": "/2A5QSB7O7IeRaLTjoVwUA7YNtzf.jpg"
    }
}