{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cDtefl7KGnKrDziEUXetMnztvqr.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1573,
                "original_language": "en",
                "original_title": "Die Hard 2",
                "overview": "One year after his heroics in Los Angeles, John McClane is an off-duty cop who is the wrong guy in the wrong place at the wrong time. On a snowy Christmas Eve, as he waits for his wife's plane to land at Washington Dulles International Airport, terrorists take over the air traffic control system in a plot to free a South American army general and drug smuggler being flown into the US to face drug charges. It's now up to McClane to take on the terrorists, while coping with an inept airport police chief, an uncooperative anti-terrorist squad, and the life of his wife and everyone else trapped in planes circling overhead.",
                "popularity": 7.9164,
                "poster_path": "/lDFO7D4MdbhjOwaPwe18QG69Rt0.jpg",
                "release_date": "1990-07-03",
                "title": "Die Hard 2",
                "video": false,
                "vote_average": 6.958,
                "vote_count": 6090,
                "character": "Engineer",
                "credit_id": "5a2f39080e0a264cc116844b",
                "order": 61
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Saachi"
        ],
        "biography": "A Humphrey Bogart lookalike, Robert Sacchi essentially made a living in film and television by emulating the screen great. His most famous role is that of Sam Marlow in the 1980 film The Man With Bogart's Face, but he made his film debut opposite Anita Ekberg in the 1972 film The French Sex Murder as a Bogart-styled Parisian detective, and appeared as The Bogeyman that same year opposite Michael Caine in Pulp. Away from being a Bogart lookalike/character, Sacchi also had small roles away  in the films Across 110th Street and Die Hard 2.",
        "birthday": "1932-03-27",
        "deathday": "2021-06-29",
        "gender": 2,
        "homepage": null,
        "id": 99789,
        "imdb_id": "nm0755017",
        "known_for_department": "Acting",
        "name": "Robert Sacchi",
        "place_of_birth": "The Bronx, New York, U.S",
        "popularity": 0.1265,
        "profile_path": "/iJgk3DyruFARLblzIOZxHHdBkWX.jpg"
    }
}