{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gTO4GgaQDn5msqOvX6LeTj6H7CR.jpg",
                "genre_ids": [
                    80,
                    18,
                    28
                ],
                "id": 13939,
                "original_language": "en",
                "original_title": "Death Wish",
                "overview": "After his wife is murdered by street punks, a pacifistic New York City architect becomes a one-man vigilante squad, prowling the streets for would-be muggers after dark.",
                "popularity": 3.0795,
                "poster_path": "/rNksI6UiuTgLtBy69WvKT1PrG0R.jpg",
                "release_date": "1974-07-24",
                "title": "Death Wish",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 893,
                "character": "Guard at Hotel Lobby (uncredited)",
                "credit_id": "63892ee6fd7aa400c3610dbb",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Albert Lewis"
        ],
        "biography": "An American character actor best known for his role as Count Dracula lookalike \"Grandpa\", opposite Fred Gwynne's and Yvonne De Carlo's characters on the CBS television series The Munsters from 1964 to 1966 and its subsequent film versions. Later in life, he was also a restaurant owner, political candidate, and radio broadcaster.  His acting career begins the well-documented portion of his life. He worked in burlesque and vaudeville theaters, then on Broadway in the dramas The Night Circus (1958) and One More River (1960) and as the character Moe Shtarker in the musical comedy Do Re Mi (1962).\n\nHis earliest television work includes appearances on the Beverly Garland crime drama Decoy and The Phil Silvers Show. From 1959–63, he appeared in four episodes of Naked City. Lewis' first well-known television role was as Officer Leo Schnauser on the NBC sitcom Car 54, Where Are You? from 1961–63, also starring Fred Gwynne (Lewis reprised the role in the 1994 movie of the same name). In the series, Lewis first played Al Spencer the Auto Body Man in two early first-season episodes before landing the more familiar role of Officer Schnauser. But he is best remembered as \"Grandpa\" on The Munsters, which ran on CBS from 1964–66.\n\nIn 1967, Lewis played the part of Zalto the wizard in the Lost in Space episode, Rocket to Earth. His first role in a movie was as Machine Gun Manny in Pretty Boy Floyd (1960). He had small roles in The World of Henry Orient (1964), They Shoot Horses, Don't They? (1969), They Might Be Giants (1971). He appeared as Hanging Judge Harrison in Used Cars (1980) and had a minor role in Married to the Mob (1988). His last film role was in Night Terror (2002).\n\nLewis was a recurring guest on The Howard Stern Show. In 1987, during a \"Howard Stern Freedom Rally\" against the Federal Communications Commission (FCC) that was broadcast live, Lewis repeatedly shouted \"F*** the FCC!\" until Stern was able to take the microphone away from him. Stern and the station were not punished for Lewis' comments.\n\nUnlike some actors, Lewis did not mind being typecast. He enjoyed acting out his \"Grandpa\" character—in the original costume—and got a surprising amount of mileage from such a short-lived role. \"Why not?\" he said. \"It pays the bills.\"\n\nIn 1991, he appeared as Grandpa Munster in an episode of Hi Honey, I'm Home on ABC. In 1991, he appeared in a low-budget New Zealand family movie called Grampire (My Grandpa Is a Vampire in the U.S. version), wearing much the same costume as he did in The Munsters. From 1987–89, Lewis hosted Super Scary Saturday on TBS in his Grandpa Munster outfit. This would later be parodied in Gremlins 2: The New Batch with the character of \"Grandpa Fred\" (Robert Prosky).\n\n[Biography from Wikipedia]",
        "birthday": "1923-04-30",
        "deathday": "2006-02-03",
        "gender": 2,
        "homepage": null,
        "id": 99825,
        "imdb_id": "nm0506891",
        "known_for_department": "Acting",
        "name": "Al Lewis",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.4234,
        "profile_path": "/gZhCDtWYOZz8EF0wOIZM2HZTONe.jpg"
    }
}