{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bDsXa3PV3biQ8ZK1tQyK4vlkvCc.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821,
                "original_language": "en",
                "original_title": "Judgment at Nuremberg",
                "overview": "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.",
                "popularity": 5.8267,
                "poster_path": "/b6vYatvui1EXeFYfpDX4rcbueuP.jpg",
                "release_date": "1961-12-18",
                "title": "Judgment at Nuremberg",
                "video": false,
                "vote_average": 8.025,
                "vote_count": 864,
                "character": "Mrs. Ives (uncredited)",
                "credit_id": "55fd9a0fc3a368132a001353",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sheila Manors",
            " Sheila LeGay",
            "Sheila Manners",
            "Sheila Mannors"
        ],
        "biography": "From Wikipedia\n\nSheila Bromley,  (October 31,  1911 – July 23, 2003) was an American television and film actress. She is best known for her roles in B-movies, mostly Westerns of the era.\n\nBorn in San Francisco, California, she began her career in the 1930s under contract with Monogram Pictures. She was first billed as Sheila LeGay starring in 1930 westerns alongside Tom Tyler. She frequently co-starred with Ken Maynard, Hoot Gibson, Johnny Mack Brown, Bill Cody, and Dick Foran. She starred alongside Bill Cody in Land of Wanted Men (1932), John Wayne in Westward Ho (1935), Lawless Range  (1935) and Idol of the Crowds (1937). In 1944 Bromley appeared in the touring production of Good Night Ladies. On television she guest-starred in episodes of Rawhide, I Love Lucy, and Perry Mason.\n\nDuring World War II she worked often for the USO, continuing that service until the war ended in 1945. There she met her husband Jairus Bellamy.\n\nShe is credited with seventy-five films in her career, of which seventeen were westerns, for which she is best known. Bromley retired from films and lived in the Greater Los Angeles Area until her death in 2003, aged 91.",
        "birthday": "1911-10-31",
        "deathday": "2003-07-23",
        "gender": 1,
        "homepage": null,
        "id": 99827,
        "imdb_id": "nm0111355",
        "known_for_department": "Acting",
        "name": "Sheila Bromley",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.3006,
        "profile_path": "/jTikc3JRMYwG8pl9x5OlpLmi6Bl.jpg"
    }
}