{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jAfSBbm3ouddCLNRfRWRJ2PwmA2.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 11296,
                "original_language": "en",
                "original_title": "Birdy",
                "overview": "Two young men are seriously affected by the Vietnam War. One of them has always been obsessed with birds - but now believes he really is a bird, and has been sent to a mental hospital. Can his friend help him pull through?",
                "popularity": 1.985,
                "poster_path": "/weIn0Huxx4SQU8PB5ZggzA4PLIE.jpg",
                "release_date": "1984-12-14",
                "title": "Birdy",
                "video": false,
                "vote_average": 7.135,
                "vote_count": 540,
                "character": "Waiting Room Lady",
                "credit_id": "5a36b675c3a3680b9d1c3a03",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Heavyset character actress Priscilla Diane Alden was born on June 27,  1939 in San Francisco, California. Alden moved with her family to Santa  Barbara, where she attended high school and graduated from UC Santa  Barbara. After receiving a master's degree in English literature from  the University of Montana, Priscilla returned to the Bay Area to enroll  in the School of Drama at San Francisco State College. Alden acted  throughout the 1970's, 80's, and 90's in an eclectic array of stage  productions in such venues as the Magic Theatre, Theatre Rhinoceros, and  the One Act Theatre Company. Moreover, in 1982 Priscilla won the Bay  Area Theatre Critics Award for her performance as Lady Bracknell in a  stage production of \"Earnest in Love\" at the Lamplighters theatre and  appeared at times as a spear carrier in operas. Alden achieved her  greatest enduring cult cinema popularity with her unforgettable  portrayal of obese and unhinged compulsive eater serial killer Ethal  Janowski in Criminally Insane (1975). She was likewise memorable as the equally deranged and dangerous Edith Mortley in Death Nurse (1987). Priscilla died at age 68 from complications of diabetes on August 24, 2007 in her home in San Francisco, California.",
        "birthday": "1939-06-27",
        "deathday": "2007-08-24",
        "gender": 1,
        "homepage": null,
        "id": 998895,
        "imdb_id": "nm0017493",
        "known_for_department": "Acting",
        "name": "Priscilla Alden",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.0239,
        "profile_path": "/wskNmFglIHsc8usd3pA3Sq52tP7.jpg"
    }
}