{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/q6OGlZ1KMEb14AC8KbPCxyNOal6.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 77338,
                "original_language": "fr",
                "original_title": "Intouchables",
                "overview": "A true story of two men who should never have met – a quadriplegic aristocrat who was injured in a paragliding accident and a young man from the projects.",
                "popularity": 11.8848,
                "poster_path": "/1QU7HKgsQbGpzsJbJK4pAVQV9F5.jpg",
                "release_date": "2011-11-02",
                "title": "The Intouchables",
                "video": false,
                "vote_average": 8.271,
                "vote_count": 17845,
                "character": "Galeriste",
                "credit_id": "57584cabc3a3687b0100055e",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Emilie Caen"
        ],
        "biography": "Émilie Caen is a French actress. She is known for playing the role of Ségolène in Serial (Bad) Weddings.\n\nThanks to her mother, who regularly took her to the theater, Emilie decided to become an actress. After graduating from high school, she enrolled at the Perimony drama school in 1997, where she trained for three years. In the years that followed, she continued her training at the Pygmalion studio, then joined an Actor's Studio workshop.\n\nAt the same time, Emilie Caen began her career on stage: Sur la grande route, Bal-Trap, L'illusion comique. Later, she made her television debut with small roles in Spécial Camera Café, Commissaire Cordier and Sections de recherches.\n\nThe French film family opened its doors to her a little later, in 2007, with a role in the Franco-Canadian romance Jusqu'à toi alongside Mélanie Laurent. She then played the gallery owner in the lucrative Intouchables, France's biggest hit of 2011.\n\nThe actress continued her career in other comedies produced in France, landing small roles in Michaël Youn's Vive la France and La Clinique de l'amour by her friend Artus de Penguern, who called on her again when he shot the Benjamin video for singer Florent Marchet.\n\nIn 2012, she landed the lead role in a duet with Michèle Bernier in the TF1 series Injustice, in which she plays her assistant.\n\nIn 2013, viewers discovered the actress in a brand-new role: Nadine Pitou, the elementary school teacher in the TF1 series Pep's. The series was a great success (record audience of 8.6 million).\n\nIn 2014, she starred in the comedy Qu'est-ce qu'on a fait au Bon Dieu? She plays Ségolène, one of the daughters of the Verneuil family, a depressive painter who marries a Chinese man, much to the chagrin of her parents, played by Chantal Lauby and Christian Clavier.\n\nIn 2015, she also appeared in the mini-series Le Mystère du lac broadcast on TF1.\n\nIn 2016, she played the lead role in an episode of Joséphine, ange gardien: Enfants, mode d'emploi. Now a star of the small and big screen, she joined the cast of the event mini-series Le Mystère du Lac on TF1 and the series Un Village français. In early 2017, her return was confirmed in Qu'est-ce qu'on a fait au bon dieu?\n\nIn June 2018, the actress has a role in the series Qu'est ce qu'on attend pour être heureux?.\n\nFrom December 6, the series Papa ou maman launches with Émilie Caen in the lead role of the mom, alongside Florent Peyre as the dad.\n\nOn January 30, 2019, she reprises her role as Ségolène Verneuil, the central role in the film Qu'est-ce qu'on an encore fait au Bon Dieu?, the sequel to the 2014 hit Qu'est-ce qu'on a fait au Bon Dieu?. In this feature film, Ségolène wants to fly to China with her husband and children, where her art would be better understood thanks to a potential buyer discovered on the internet. To promote the film, the actress gave a number of interviews, including as a guest on Canal+'s La boîte à questions and France 5's C à Vous.\n\nSource: Article \"Émilie Caen\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 999406,
        "imdb_id": "nm2173724",
        "known_for_department": "Acting",
        "name": "Émilie Caen",
        "place_of_birth": "France",
        "popularity": 0.1317,
        "profile_path": "/inBbVbSWtYd0I3VjQR9wsrrCGmA.jpg"
    }
}